{"title":"Pedro Costa - O Sangue AKA Blood (1989)","uid":8062114,"size":1467809123,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0033653161bfa651b7a5a268e6397beeff295082&amp;dn=Pedro+Costa+-+O+Sangue+AKA+Blood+%281989%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"amenic","files":4,"time":1359110553,"description":"O Sangue\n95 min\nDrama | Mystery\n\nDirector: Pedro Costa\nWriter: Pedro Costa\n\nStoryline\n\nVicente, seventeen, lives with brother Nino, ten-years-old, and his ailing father in a derelict house on the outskirts of the capital. They don't seem to remember their mother, and are very much attached to their father, despite his temper, and his frequent absences from home. One day, the father leaves for good, and Vicente and Nino swear to cover it up. It's their secret. Clara, the primary school assistant, is fascinatingly beautiful, and secretive, and (may be) she knows it aswel. There are other secrets, though: the origin of the money that appears at Vicente's house; the relationship between Vicente's well-to-do uncle and his girlfriend; the relationship between the four people who once played the cards together, and now can't stand each other. \n\nFew filmmakers can boast a body of work as audacious, beautiful or challenging as that of Pedro Costa, and Blood is one of the most extraordinary debuts of the past twenty years. \n\nFilmed in startling monochrome and demonstrating a love and knowledge of classical Hollywood and European art cinema, Blood is a lushly stylized romantic fable. It explores the plight of two brothers coming to terms with the death of their father and the legacy of violence and debt he has left behind. Languid and unsettling, beautiful and intimate, with echoes of Tourneur, Bresson, Ray and Straub-Huillet, Blood is both elusive and utterly mesmerising. -- Second Run\n\nFF-Release Link:  &lt;a href=&quot;\nhttps://board.freakyflicks.es/showthread.php?tid=1520&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://board.freakyflicks.es/showthread.php?tid=1520&lt;/a&gt;\n\n*****************************FREAKYFLICKS*****************************\n\nFreakyFlicks is a free and open community dedicated to preserving and\nsharing cinematic art in the digital era. Our goal is to disseminate\nsuch works of art to the widest audience possible through the channels\nprovided by P2P technology.\nThe FreakyFlicks collection is limited to those films that have played\nan exceptional role in the history of cinema and its progression in\nbecoming a great art. Films that are usually described as classic,\ncult, arthouse and avant-garde.\nIf you have films that fit this description feel free to share them\nand participate in our community. All you need do is include this tag\nin your upload and join us at the forum to announce your release.      &lt;a href=&quot;\nhttps://board.freakyflicks.es&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://board.freakyflicks.es&lt;/a&gt;\n\n*****************************FREAKYFLICKS***************************** \t\t\t","torrent":{"xt":"urn:btih:0033653161bfa651b7a5a268e6397beeff295082","amp;dn":"Pedro+Costa+-+O+Sangue+AKA+Blood+%281989%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0033653161bfa651b7a5a268e6397beeff295082","infoHashBuffer":{"type":"Buffer","data":[0,51,101,49,97,191,166,81,183,165,162,104,230,57,123,238,255,41,80,130]},"announce":[],"urlList":[]}}