{"title":"Joshua Graham - Darkroom [Epub &amp; Mobi] { KT }","uid":10718203,"size":2046908,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:010a0185fa0aceca0138fc7041e898fe4a402090&amp;dn=Joshua+Graham+-+Darkroom+%5BEpub+%26amp%3B+Mobi%5D+%7B+KT+%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"krystine","files":-1,"time":1407440237,"description":"Darkroom by Joshua Graham\n\n\n\nAfter scattering her mother's ashes in Vietnam, photojournalist Xandra Carrick comes home to New York to rebuild her life and career. When she experiences supernatural visions that reveal atrocities perpetrated by American soldiers during the Vietnam War, she finds herself entangled in a forty-year-old conspiracy that could bring the nation into political turmoil. Launching headlong into a quest to learn the truth from her father, Peter Carrick, a Pulitzer Prize Laureate who served as an embedded photographer during the war, Xandra confronts him about a dark secret he has kept--one that has devastated their family.\nHer investigations lead her to her departed mother's journal, which tell of love, spiritual awakening, and surviving the fall of Saigon.\n\nPursued across the continent, Xandra comes face-to-face with powerful forces that will stop at nothing to prevent her from revealing the truth. But not before government agencies arrest her for murder, domestic terrorism and an assassination attempt on the newly elected president of the United States.\n\nDarkroom is a riveting tale of suspense that tears the covers off the human struggle for truth in a world imprisoned by lies.\n\nGenre: Romance | Mystery","torrent":{"xt":"urn:btih:010a0185fa0aceca0138fc7041e898fe4a402090","amp;dn":"Joshua+Graham+-+Darkroom+%5BEpub+%26amp%3B+Mobi%5D+%7B+KT+%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"010a0185fa0aceca0138fc7041e898fe4a402090","infoHashBuffer":{"type":"Buffer","data":[1,10,1,133,250,10,206,202,1,56,252,112,65,232,152,254,74,64,32,144]},"announce":[],"urlList":[]}}