{"title":"Morgan Rice - Geliefd. NL Ebook. DMT ","uid":11799663,"size":598226,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0118c82d808b65def1cbdfc37ce44e044aaf5931&amp;dn=Morgan+Rice+-+Geliefd.+NL+Ebook.+DMT+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"BiWild","files":4,"time":1428338686,"description":"Morgan Rice - Geliefd. NL Ebook. DMT \n\nAfbeelding\n\nAuteur: Morgan Rice\nPagina's: 175\nTaal: Dutch/Nederlands\nUitgever: Morgan Rice\nJaar van uitgifte: 2015\nGenre: Fantasie\n\nSamenvatting\n\nDe Vampierverslagen Deel 2\nCaitlin en Caleb beginnen aan hun zoektocht naar het ene voorwerp dat de komende oorlog van vampiers en mensen kan tegenhouden: \nhet verloren zwaard. Als een object uit vampiersverhalen, wordt er sterk getwijfeld over of dat voorwerp zelfs maar bestaat.Om ook maar \nenige hoop te hebben om het te vinden, moeten ze Caitlins afstamming herleiden. Is zij echt De Ene? Hun zoektocht begint met het vinden \nvan Caitlins vader. Wie was hij? Waarom liet hij haar in de steek? Terwijl de zoektocht vordert, worden zij geschokt door wat ze uitvinden \nover wie ze echt is.Maar zij zijn niet de enigen die zoeken naar het legendarische zwaard. Het Zwarttijverbond wil het ook, en ze komen \nCaitlin en Caleb op het spoor. Erger nog, Caitlins broertje Sam blijft geobsedeerd met het vinden van zijn vader. Maar Sam merkt al snel \ndat hij er tot over zijn oren in zit, en dat hij midden in een vampiersoorlog terecht is gekomen. Zal hij hun zoektocht in gevaar brengen?\nDe reis van Caitlin en Caleb neemt hen mee naar een scala aan historische plaatsen van de Hudson-vallei tot Salem tot het hart van het \nhistorische Boston de plaats waar heksen eens werden opgehangen op de heuvel van Boston Common. Waarom zijn deze plaatsen zo \nbelangrijk voor het vampiersras? En wat hebben ze te maken met Caitlins afstamming, en met wie zij wordt? Maar misschien halen ze het \nniet eens. De liefde tussen Caitlin en Caleb bloeit op. En hun verboden liefde zou zomaar alles kunnen vernietigen dat ze willen bereiken.\n\nMet dank aan de originele poster !! \n\nDeze review wordt u aangeboden door\n\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:0118c82d808b65def1cbdfc37ce44e044aaf5931","amp;dn":"Morgan+Rice+-+Geliefd.+NL+Ebook.+DMT+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0118c82d808b65def1cbdfc37ce44e044aaf5931","infoHashBuffer":{"type":"Buffer","data":[1,24,200,45,128,139,101,222,241,203,223,195,124,228,78,4,74,175,89,49]},"announce":[],"urlList":[]}}