{"title":"THUNDERBOLTS (1997-2013) Complete with DARK AVENGERS volume 2","uid":8276762,"size":3291397502,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:019a8f279c9694a8788f8e224a268b20727eb8cf&amp;dn=THUNDERBOLTS+%281997-2013%29+Complete+with+DARK+AVENGERS+volume+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":4,"uploader":"STFmaryville","files":-1,"time":1363732278,"description":"This fills a request for BringThatBooty. I gathered most of these from 2 older compilations here on TPB, and then collected a lot of comics to finish it. I think I've managed to get every issue of Thunderbolts, &quot;Fightbolts&quot; (damn you, Arcudi!), Avengers/Thunderbolts, New Thunderbolts, Thunderbolts (the 2nd time - I choose not to call it volume 2), Dark Avengers volume 2, and &quot;Marvel NOW&quot; Thunderbolts (volume 2 or 3, I say 2).\n\nThe last two, of course, are currently ongoing. Unless they cancelled Dark Avengers while I was typing this.\n\nI've thrown in every miniseries and spinoff I could find, and I'm not going to list them all. This torrent has the Annuals, #-1, #0 from Wizard, the Avengers volume 3 crossovers, and even a couple of uncensored art pages!\n\nAll credit goes to the original scanners -- including Zone-Empire, GreenGiant-DCP, Megan-Empire -- and original uploaders.\n\nThis was a labor of love. I was one of the people lucky enough to buy -- as they came out -- the team's first appearance in Incredible Hulk, the Tales of the Marvel Universe special, and then T-bolts #1. I was floored. I expected something good from Busiek &amp; Bagley, but wow.\n\nLooking at the entire run, I can honestly say this is one of the books from Marvel's last 20 years that has re-invented itself over and over, yet has only once or twice been bad (damn you, Arcudi!)\n\nBusiek &amp; Bagley, Nicieza &amp; Zircher, Nicieza &amp; Grummett, Ellis &amp; Deodato, Parker &amp; Walker, and now Way &amp; Dillon... and each of those &quot;eras&quot; for the title have been good in different ways!\n\nI am not going to describe what this title was/is about, because maybe someone out there will get that same jolt (pun intended) that I got back in the 1990s... justice, like lightning!\n\n... please seed and share!","torrent":{"xt":"urn:btih:019a8f279c9694a8788f8e224a268b20727eb8cf","amp;dn":"THUNDERBOLTS+%281997-2013%29+Complete+with+DARK+AVENGERS+volume+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"019a8f279c9694a8788f8e224a268b20727eb8cf","infoHashBuffer":{"type":"Buffer","data":[1,154,143,39,156,150,148,168,120,143,142,34,74,38,139,32,114,126,184,207]},"announce":[],"urlList":[]}}