{"title":"Of Ants and Men: The Unexpected Side Effects of Complexity 2014","uid":10362883,"size":3576091,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01b1eb0a061811606a6180bccb68a0d1aa62ee41&amp;dn=Of+Ants+and+Men%3A+The+Unexpected+Side+Effects+of+Complexity+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1402832667,"description":"Of Ants and Men: The Unexpected Side Effects of Complexity in Society\n\nWhy do things go wrong? Why, despite all the planning and care in the world, do things go from bad to worse? This book argues that it is because we are like the ants. Just as ants create an anthill without being aware of it, unintended side effects of human activity create all manner of social trends and crises. The book traces the way these trends emerge and the role they play in some of the major issues of our time. One of the greatest challenges today is the complexity of our social and economic systems. Every action has side effects that people often ignore or fail to see. The book examines the ways in which limitations in our thinking and behaviour lead to unintended side effects. It looks at the role played by complex networks of interactions. Finally, it looks at the way side effects of new technologies, especially computers and communication, have created an Information Revolution, the full repercussions of which are yet to be seen. In our race to create new technologies and sustain indefinite economic growth, we are at best dimly aware of the ways in which we are transforming society and threatening our environment.\n\n2014 pdf","torrent":{"xt":"urn:btih:01b1eb0a061811606a6180bccb68a0d1aa62ee41","amp;dn":"Of+Ants+and+Men%3A+The+Unexpected+Side+Effects+of+Complexity+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01b1eb0a061811606a6180bccb68a0d1aa62ee41","infoHashBuffer":{"type":"Buffer","data":[1,177,235,10,6,24,17,96,106,97,128,188,203,104,160,209,170,98,238,65]},"announce":[],"urlList":[]}}