{"title":"Fallout 3 and Fallout New Vegas - Wasteland Cloth Collection","uid":7377903,"size":3172117596,"categoryP":"porn","categoryS":"games","magnet":"?xt=urn:btih:01d03eb9dbe65c0241f25744ccf8af7609c37340&amp;dn=Fallout+3+and+Fallout+New+Vegas+-+Wasteland+Cloth+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"snarfies2","files":-1,"time":1340414479,"description":"SEE http://www.loverslab.com/showthread.php?tid=8030 FOR SCREENSHOTS AND MORE DETAILS\n\n----------\n\nThis is Alex3474's updated wasteland cloth collection shared with his permission. In addition to the original collection it has complete body ports for Type 3 BB &amp; Alice bodies as well as the original Cali body, plus a lot of random stuff he included. A few ports for other body types, Lots of new items, oblivion ports, a good amount of fallout stuff by other authors; some that he tweaked, some i am not sure. There was a lot of stuff in here i had never seen before.\n\nIt is a pretty large amount of files. All credit to Alex for his work and the other respective authors for theirs. My contribution is only some geck &amp; nvedit work I did at his request and the meshes with bounce added (only for the original cloth collection). Cali, Alice &amp; BB Bodies done (200+ meshes each body type). I don't plan on doing the others.\n\nYou will most likely already have some of the Fallout items already in your respective game folders, and so a part of these files may be repeat for you. I originally had these files seperated but a lot of people had issues with the setup, so it's all back together again. PM me with any questions and happy downloading.\n\np.s. Before anyone asks, There is one Clothing type that I am unable to add bounce to (JLoutfit). The mesh explodes in blender and I am too much of an ameteur to fix it.","torrent":{"xt":"urn:btih:01d03eb9dbe65c0241f25744ccf8af7609c37340","amp;dn":"Fallout+3+and+Fallout+New+Vegas+-+Wasteland+Cloth+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01d03eb9dbe65c0241f25744ccf8af7609c37340","infoHashBuffer":{"type":"Buffer","data":[1,208,62,185,219,230,92,2,65,242,87,68,204,248,175,118,9,195,115,64]},"announce":[],"urlList":[]}}