{"title":"The Compleat Psychic","uid":12067614,"size":21022319,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01fe291437a6863454d7f4e83b7fd626e9db8994&amp;dn=The+Compleat+Psychic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":null,"files":3,"time":1435423349,"description":"The Compleat Psychic is a self-help book about the meaning of life, the destiny of the human race, and how to lose the weight and keep it off. How can I presume to write about such exalted subjects? That's easy. I'm psychic. So are you. So is everyone. Just because you have never tried to intuitively interpret a situation or peek into the future doesn't mean that you cannot do it. Don't forget that when you start practicing something over and over, you get better at it, and this is what will happen when you start working with your psychic abilities.\n\nMy book is a training manual in practical psychic techniques which actually work. Have you ever wished you could pick up on what are usually non-perceptible energies? Or find a way to tell if someone is lying to you? Or stop using guesswork when you make decisions about raising children, running a business, preserving your equity, or creating a successful relationship? This book will help you do all this and more: you will be able to go through your days feeling harmony and grace instead of the crap you're probably dealing with at the moment. There is a free and universal cure-all energy which anyone can utilize, and when you start working with it, I guarantee it will transform your existence in ways you never thought possible.\n\nBut there is much more to The Compleat Psychic than self-help. It is also an analysis of everything that's wrong with our addled American culture--and how to fix it. There really is an alternative way to solve some of the most intractable social and political problems we've got, and that universal cure-all energy can help here as well. The last chapter of the book is a description of what's coming to planet earth in the next 125 years. Millennials in particular should find this section worthwhile since it will show them how they can escape the godawful mess which the Baby Boomers have created for them.\n\nI prefer to give this book away free, not because it is a junk book, but because I hate money. I already have too much money, and what I need is less money. I also believe that all information should be free and available to single human being on planet earth without restriction. Have fun and enjoy","torrent":{"xt":"urn:btih:01fe291437a6863454d7f4e83b7fd626e9db8994","amp;dn":"The+Compleat+Psychic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01fe291437a6863454d7f4e83b7fd626e9db8994","infoHashBuffer":{"type":"Buffer","data":[1,254,41,20,55,166,134,52,84,215,244,232,59,127,214,38,233,219,137,148]},"announce":[],"urlList":[]}}