{"title":"Ferris Netter Patient Advisor 2nd Ed [PDF][tahir99] VRG.pdf","uid":10591105,"size":372729580,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0226ed354eff8da10715d53fcff8f9dde1f07ff5&amp;dn=Ferris+Netter+Patient+Advisor+2nd+Ed+%5BPDF%5D%5Btahir99%5D+VRG.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"tahir99","files":-1,"time":1405798376,"description":"Ferri's Netter Patient Advisor, 2e (Netter Clinical Science)\n\nby Fred F. Ferri MD FACP (Author)\n\nTRUE PDF, BOOKMARKED and INDEXED\n\nimage\n\nISBN-13: 978-1416060383 ISBN-10: 1416060383 Edition: 2nd\n\nBeautifully illustrated, the new edition of Ferri's Netter Patient Advisor, by Fred F. Ferri, MD, FACP, helps patients to understand what their illness is and to comply with recommended treatment. Designed with the end user in mind, it features over 725 printable, succinct, and highly visual patient education handouts (500 of which are in the printed book) that provide all the information patients need, in a quick and memorable manner. More than 175 new handouts address timely topics such as Bed Bugs, Childhood Nutrition, and Pneumoconiosis. Clear explanations by renowned author Dr. Fred Ferri, combined with more than 2,000 Netter and Netter-style illustrations, provide an easy understanding of each health condition and what patients can do to facilitate their own care. A companion website featuring annual regular lets you customize and print out patient instructions for all topics - including 500 in Spanish. It's the perfect way to help your patients become informed and active partners in their healthcare management.\n\nInvolve your patients in the treatment and management of their health. More than 2,000 Netter and Netter-style illustrations combined with clear, concise explanations from Dr. Fred F. Ferri help patients understand their illness and what they can do to facilitate treatment.\n\nEnsure the best patient encounters and outcomes with downloadable, customizable English and Spanish patient education guides on www.netterreference.com covering 775 topics.\n\nEducate your patients about timely topics such as Bed Bugs, Childhood Nutrition, Pneumoconiosis, and more. 175 new topics are new to this edition.","torrent":{"xt":"urn:btih:0226ed354eff8da10715d53fcff8f9dde1f07ff5","amp;dn":"Ferris+Netter+Patient+Advisor+2nd+Ed+%5BPDF%5D%5Btahir99%5D+VRG.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0226ed354eff8da10715d53fcff8f9dde1f07ff5","infoHashBuffer":{"type":"Buffer","data":[2,38,237,53,78,255,141,161,7,21,213,63,207,248,249,221,225,240,127,245]},"announce":[],"urlList":[]}}