{"title":"El Simbolo Perdido - Dan Brown","uid":6091616,"size":4136358,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:024f5a7bdf1f3c97b732f0394a94a916b2392761&amp;dn=El+Simbolo+Perdido+-+Dan+Brown&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"chusca","files":3,"time":1294588860,"description":"Ã‚Â¿Existe un secreto tan poderoso que, de salir a la luz, sea capaz de cambiar el mundo?.\nWashington. El experto en simbologÃƒÂ­a Robert Langdon es convocado inesperadamente por Peter Solomon, masÃƒÂ³n, filÃƒÂ¡ntropo y su antiguo mentor, para dar una conferencia en el Capitolio. Pero el secuestro de Peter y el hallazgo de una mano tatuada con cinco enigmÃƒÂ¡ticos sÃƒÂ­mbolos cambian drÃƒÂ¡sticamente el curso de los acontecimientos. Atrapado entre las exigencias de una mente perturbada y la investigaciÃƒÂ³n oficial, Langdon se ve inmerso en un mundo clandestino de secretos masÃƒÂ³nicos, historia oculta y escenarios nunca antes vistos, que parecen arrastrarlo hacia una sencilla pero inconcebible verdad. Con la ayuda de Katherine Solomon, hermana de Peter y experta en ciencias noÃƒÂ©ticas, Robert Langdon tiene doce horas para salvar a su amigo y, al mismo tiempo, evitar que uno de los secretos mejor guardados de nuestra historia caiga en las manos equivocadas... El cÃƒÂ³digo Da Vinci fue un fenÃƒÂ³meno mundial que convirtiÃƒÂ³ a Dan Brown en el maestro absoluto del thriller. En esta nueva obra, Robert Langdon regresa para retar a los lectores con una historia inteligente y de ritmo vertiginoso que ofrece sorpresas en cada pÃƒÂ¡gina. El sÃƒÂ­mbolo perdido es lo que los fans de Dan Brown estaban esperando: su novela mÃƒÂ¡s emocionante.\n\n","torrent":{"xt":"urn:btih:024f5a7bdf1f3c97b732f0394a94a916b2392761","amp;dn":"El+Simbolo+Perdido+-+Dan+Brown","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"024f5a7bdf1f3c97b732f0394a94a916b2392761","infoHashBuffer":{"type":"Buffer","data":[2,79,90,123,223,31,60,151,183,50,240,57,74,148,169,22,178,57,39,97]},"announce":[],"urlList":[]}}