{"title":"Porcupine Tree - In Absentia  flac    2014","uid":10978151,"size":626517461,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:027b884430a52316a80424baa1decbd0d094c91d&amp;dn=Porcupine+Tree+-+In+Absentia++flac++++2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"analogkid6103","files":22,"time":1409844009,"description":"Porcupine Tree are a progressive rock band formed by Steven Wilson in 1987 in Hemel Hempstead, UK. Their music is difficult to categorize, being associated with both psychedelic rock and progressive rock, yet having been influenced by trance, krautrock and ambient due to Steven Wilson and Richard Barbieri's penchant for the Kosmische Musik scene of the early '70s, led by bands such as Tangerine Dream, Neu! and Can. Since the early 2000s, their music has been leaning towards progressive metal.\n\nThe band are noted for their multimedia approach, with their live performances including screens displaying a different film projection to each song. This visual element was introduced during the tour for the In Absentia album, when the band started to work with Danish photographer and filmmaker Lasse Hoile. This involvement created a distinctive image for the band.\n\nDespite being signed to both Roadrunner and Atlantic labels, the band has their own record label, Transmission, which they use to launch some independent releases and special editions of their albums. Their 2007 album Fear of a Blank Planet was nominated for a Grammy Award for Best Surround Sound Album.\n\nThe music of Porcupine Tree is often described as melancholic by many people, even though it is not necessarily linked to Steven Wilson's personality. He states music is a way for him to channel all his negative feelings, and `an exorcism of those elements within`, finding it &quot;easier to write songs about the negative side of the world than it is about the happy side of the world.&quot; In the Warszawa live radio broadcast album, before performing &quot;Stop Swimming&quot;, Wilson can be heard saying &quot;the saddest music is often the most beautiful.&quot;Tracklisting\n\n01. Porcupine Tree - Blackest Eyes (04:24)\n02. Porcupine Tree - Trains (05:56)\n03. Porcupine Tree - Lips Of Ashes (04:39)\n04. Porcupine Tree - The Sound Of Muzak (04:59)\n05. Porcupine Tree - Gravity Eyelids (07:57)\n06. Porcupine Tree - Wedding Nails (06:34)\n07. Porcupine Tree - Prodigal (05:33)\n08. Porcupine Tree - .3 (05:26)\n09. Porcupine Tree - The Creator Has A Mastertape (05:22)\n10. Porcupine Tree - Heartattack In A Layby (04:16)\n11. Porcupine Tree - Strip The Soul (07:22)\n12. Porcupine Tree - Collapse The Light Into Earth (05:53)\n\nLossless, (avg. compression: 71 %)\nStereo / 44100 HZ / 16 Bit....................enjoy and seed ","torrent":{"xt":"urn:btih:027b884430a52316a80424baa1decbd0d094c91d","amp;dn":"Porcupine+Tree+-+In+Absentia++flac++++2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"027b884430a52316a80424baa1decbd0d094c91d","infoHashBuffer":{"type":"Buffer","data":[2,123,136,68,48,165,35,22,168,4,36,186,161,222,203,208,208,148,201,29]},"announce":[],"urlList":[]}}