{"title":"Minecraft Hack Client","uid":5867078,"size":5919515,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0282f9a6717dfa4a7ab3fa85ebde216f89309e3b&amp;dn=Minecraft+Hack+Client&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"hsnow1","files":27,"time":1286249647,"description":"We have a new version of our Minecraft client wrapper with speed, flying and noclip hacks.\nVersion 1.5.9 works with Minecraft 0.30\nABOUT\nThis WoM edition external Minecraft client wrapper allows you to perform special actions that aren't normally available in the web based client and doesn't require a browser to be loaded while you play.\nNOTE:\nAS PER THE MINECRAFT DISTRIBUTION POLICY: This package does not contain the original client code &quot;minecraft.jar&quot; which is copyright and the intellectual property of Mojang Specifications. We do not have the right to package this file and distribute it to you, so you will need to download this component from the official minecraft website and place it into the lib folder of the extracted custom client wrapper package yourself. It's URL is: https://s3.amazonaws.com/MinecraftDownload/classic/minecraft.jar\nINSTRUCTIONS\nTo start up the game, simply download our client wrapper package below, extract it, put the official minecraft.jar (which you downloaded from the official site as per the above notice) into the lib folder and then execute run.bat. The external client application will prompt you for your login details and then allow you to select from the available servers, or enter your own server link to connect.\nUSAGE\nWhen the client application completes loading you will be able to access the following special functions: Keys W A S D - movement keys as normal. Z - press to toggle on/off fly mode. X - noclip mode while held down. Q E - up and down when in fly mode. Shift - Turn on 5x speed while held down. Ctrl - Turn on 2x speed while held down. Noclip mode Hold down the X key while moving/flying to go through solid objects or outside the normal map boundaries. If you release the button while inside solid block or outside the map, you will get stuck. Simply hold down again to continue moving.\nTROUBLESHOOTING\nNote there's a troubleshooting comment directly below this post. Read it and follow it's instructions. If you still have problems after reading it, do not comment them in this thread as it will get long and unwieldy. Instead, start a new thread in the Support forum. Just to be clear: Any help/support requests in this forum will be ignored! Praise, critiques, suggestions etc are more than welcome here however. \n\n\nTroubleshooting\n\nMost problems that people have are due to one or more of the following reasons:\nWindows troubleshooting\nIf\n\nYou see an error message like:\n\nCould not find the main class: Main.  Program will exit.\n========================================\nWarning: lib\\minecraft.jar not found.\nDid you read instructions / download it?\n========================================\n\nThen\n\nYou didn't read the instructions, and download then install the minecraft.jar file.\nTo fix\n\nGo back to the instructions, download minecraft.jar as instructed and place it in the correct directory.\nIf\n\nYou see an error like:\n\nERROR: 32-bit Java 6 not found!\nPlease download and install from java.com\n\nThen\n\nYou do not have the correct version of java installed, or it cannot be found automatically.\nTo fix\n\nThis needs 32 bit Java 6. You need to download and install it from: http://java.sun.com/javase/downloads\nLook for the file labeled: &quot;Java SE Runtime Environment (JRE)&quot;, click the download button.\nSelect &quot;Platform: Windows&quot; from the next download page that appears (note: Do not select 64 bit or Itanium versions, these will not run the wrapper)\nDownload it, install it.\n\nIf after installing the correct version, or if it is installed but cannot be found automatically due to it being in a non-standard location, open the run.bat in a text editor and change the line that reads:\n\nset JAVA6=&quot;auto&quot;\n\nto read\n\nset JAVA6=&quot;C:\\MyPath\\bin\\java.exe&quot;\n\n(change &quot;C:\\MyPath&quot; to your actual java installation's path)\nMac OSX Troubleshooting\nIf\n\nYou see an error like:\n\n-bash: ./minecraft-osx.sh: Permission denied\n\nThen\n\nThe minecraft-osx.sh file does not have execute permission.\nTo fix\n\nRun the following command:\n\nchmod +x minecraft-osx.sh\n\nIf\n\nYou see an error like:\n\n./minecraft-osx.sh: line 12: /System/Library/Frameworks/JavaVM.framework/Versions/1.6/Home/bin/java: No such file or directory\n\nThen\n\nYour mac doesn't have the Java 6 interpreter installed.\nTo fix\n\nYou need at least OS 10.5 with the Java 6 packs applied (if you apply system updates, you should have this, otherwise look for the Java 6 downloads from the Apple site.\nIf\n\nYou see an error like:\n\nException in thread &quot;main&quot; java.lang.NoClassDefFoundError: com/mojang/minecraft/MinecraftApplet\n\nThen\n\nYou didn't read the instructions, and download then install the minecraft.jar file.\nTo fix\n\nGo back to the instructions, download minecraft.jar as instructed and place it in the correct directory.\nLinux Troubleshooting\nRunning under linux\n\nYou will need to modify the minecraft-osx.sh file to point to your local java interpreter.\nFocus / mouse clicking issues\n\nThere can be some weird interactions between the windows managers and the java windows that make java think it has lost focus whenever you click. Very rarely this may not happen on some combinations of linux+distro+x11+wm, but for most linux users, this will be a problem. In this case you may want to take a look at the Don't lose focus hack, which may solve this problem for you.\n/dev/input/event ownership problems\n\nIf you see an error like:\n\nFailed to open device (/dev/input/event0): Failed to open device /dev/input/event0 (13)\n\nThis means that the current user doesn't have permission to access the direct input devices.\n\nsudo chmod go=u /dev/input/event*","torrent":{"xt":"urn:btih:0282f9a6717dfa4a7ab3fa85ebde216f89309e3b","amp;dn":"Minecraft+Hack+Client","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0282f9a6717dfa4a7ab3fa85ebde216f89309e3b","infoHashBuffer":{"type":"Buffer","data":[2,130,249,166,113,125,250,74,122,179,250,133,235,222,33,111,137,48,158,59]},"announce":[],"urlList":[]}}