{"title":"Perspective - William F. Powell","uid":8508111,"size":22982041,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02be13611c93fb666515953557fc08ce77fdefeb&amp;dn=Perspective+-+William+F.+Powell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"sanay","files":1,"time":1369443008,"description":"Serious Instruction for Serious Artists\nThat's what the Artist's Library series is all about! The books in this series will help you expand your creativity, overcome technical obstacles, and explore new media. Each 64-page paperback focuses on the materials and methods of a specific medium and provides step-by-step demonstrations, helpful tips, and plenty of encouragement.\n\nThe quality of instruction in this series is unsurpassed. Each book is written and illustrated by a professional artist who specializes in the particular medium and is uniquely qualified to guide the reader to a new level of expertise.\n\nAbout the Author\nWilliam F. Powell is an internationally recognized artist and one of America's foremost colorists. A native of Huntington, West Virginia, Bill studied at the Art Student's Career School in New York; Harrow Technical College in Harrow, England; and the Louvre Free School of Art in Paris, France. His experience as an art instructor includes oil, watercolor, acrylic, colored pencil, and pastel-with subjects ranging from landscapes to portraits and wildlife. Additionally, Bill conducts painting workshops and produces instructional videos that employ unique methods of in-depth presentation and demonstration. Bill holds awards for his technical art, which has been used for major projects, such as space programs and environmental studies. He lives in Temecula, CA.\n\nPaperback: 64 pages\nPublisher: Walter Foster; 1 edition (January 1, 1989)\nLanguage: English\nISBN-10: 0929261135\nISBN-13: 978-0929261133","torrent":{"xt":"urn:btih:02be13611c93fb666515953557fc08ce77fdefeb","amp;dn":"Perspective+-+William+F.+Powell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02be13611c93fb666515953557fc08ce77fdefeb","infoHashBuffer":{"type":"Buffer","data":[2,190,19,97,28,147,251,102,101,21,149,53,87,252,8,206,119,253,239,235]},"announce":[],"urlList":[]}}