{"title":"A Mathematician Plays the Stock Market","uid":4720836,"size":9495418,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03316359ff344267bc3c1d9f5e449d51a4cc61d4&amp;dn=A+Mathematician+Plays+the+Stock+Market&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":5,"uploader":"VasiaZozulia","files":1,"time":1234516773,"description":"Can a renowned mathematician successfully outwit the stock market? Not when his biggest investment is WorldCom.In A Mathematician Plays the Stock Market, best-selling author John Allen Paulos employs his trademark stories, vignettes, paradoxes, and puzzles to address every thinking reader's curiosity about the market--Is it efficient? Is it random? Is there anything to technical analysis, fundamental analysis, and other supposedly time-tested methods of picking stocks? How can one quantify risk? What are the most common scams? Are there any approaches to investing that truly outperform the major indexes?But Paulos's tour through the irrational exuberance of market mathematics doesn't end there. An unrequited (and financially disastrous) love affair with WorldCom leads Paulos to question some cherished ideas of personal finance. He explains why &quot;data mining&quot; is a self-fulfilling belief, why &quot;momentum investing&quot; is nothing more than herd behavior with a lot of mathematical jargon added, why the ever-popular Elliot Wave Theory cannot be correct, and why you should take Warren Buffet's &quot;fundamental analysis&quot; with a grain of salt.Like Burton Malkiel's A Random Walk Down Wall Street, this clever and illuminating book is for anyone, investor or not, who follows the markets--or knows someone who does.","torrent":{"xt":"urn:btih:03316359ff344267bc3c1d9f5e449d51a4cc61d4","amp;dn":"A+Mathematician+Plays+the+Stock+Market","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03316359ff344267bc3c1d9f5e449d51a4cc61d4","infoHashBuffer":{"type":"Buffer","data":[3,49,99,89,255,52,66,103,188,60,29,159,94,68,157,81,164,204,97,212]},"announce":[],"urlList":[]}}