{"title":"Biodiversity, Natural Products and Cancer Treatment","uid":10745974,"size":4262756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03639a565c5f81bbcb06a73c48d84e2eae362989&amp;dn=Biodiversity%2C+Natural+Products+and+Cancer+Treatment&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1407814867,"description":"Biodiversity, Natural Products and Cancer Treatment by Victor Kuete and Thomas Efferth\nEnglish | 2014 | ISBN: 9814583502 | 300 pages | PDF | 4 MB\n\nThis book is the first of its kind in bringing together biodiversity, chemical ecology, phytochemistry and cancer therapy. The highlight of the book is an exhaustive compilation of scientific data on biodiversity of medicinal plants, biodiversity and metagenomics, chemical ecology of medicinal plants, chemical ecology of marine organisms, natural products from terrestrial microbial organisms with activity towards cancer cells, marine organisms, ethnopharmacology and phytotherapy, contribution of African flora in world fight against cancer, natural products derived from terrestrial plants with activity towards cancer cells and established anticancer drugs from natural origin. The book discusses the state-of-the-art of each topic to serve as reference resource tools for graduate students as well as scientists and scholars in pharmaceutical sciences, pharmacology, organic chemistry and biochemistry, pharmacognosy, phytochemistry, ethnomedicine and ethnopharmacology, complementary and alternative medicine, medical and public health sciences and others. It includes cutting-edge developments in anticancer discovery from both medicinal plants and organisms.","torrent":{"xt":"urn:btih:03639a565c5f81bbcb06a73c48d84e2eae362989","amp;dn":"Biodiversity%2C+Natural+Products+and+Cancer+Treatment","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03639a565c5f81bbcb06a73c48d84e2eae362989","infoHashBuffer":{"type":"Buffer","data":[3,99,154,86,92,95,129,187,203,6,167,60,72,216,78,46,174,54,41,137]},"announce":[],"urlList":[]}}