{"title":"Gabriela Mistral - Nobel Prize in Literature, 1945 (5 books)","uid":14561362,"size":14464164,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03b378431720c30e52e9f472f568dce36d51cc68&amp;dn=Gabriela+Mistral+-+Nobel+Prize+in+Literature%2C+1945+%285+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"workerbee","files":12,"time":1462742681,"description":"\nGABRIELA MISTRAL (1889-1957), the pseudonym of Lucila Godoy y Alcayaga, was a Chilean poet-diplomat, educator and humanist.  She was awarded the 1945 Nobel Prize in Literature &quot;for her lyric poetry which, inspired by powerful emotions, has made her name a symbol of the idealistic aspirations of the entire Latin American world.&quot;\r\n\r\nOne of the best-known Latin American poets of her time, Gabriela -- as she was admiringly called all over the Hispanic world -- embodied in her person, as much as in her works, the cultural values and traditions of a continent that had not been recognized until then with the most prestigious international literary prize.  &quot;It is to render homage to the riches of Spanish American literature that we address ourselves today especially to its queen, the poet of 'Desolación' [1922], who has become the great singer of mercy and motherhood,&quot; concludes the citation read at the Nobel Prize ceremony.\r\n\r\nOwing to the suicide of her lover, Mistral never married, and a haunting, wistful strain of thwarted maternal tenderness informs her poetry.  Her later work evidences a broader interest in humanity, but love of children and of the downtrodden remained her principal themes.  Her extraordinarily passionate verse, which is frequently coloured by figures and words peculiarly her own, is marked by warmth of feeling and emotional power.\r\n\r\n\r\nThe following books are in PDF format unless otherwise indicated:\r\n\r\n* Crickets and Frogs: A Fable (Atheneum, 1957).  Bilingual Spanish/English edition.  Translated by Doris Dana and illustrated by Antonio Frasconi.\r\n\r\n* Madwomen: The &quot;Locas mujeres&quot; Poems of Gabriela Mistral (Chicago UP, 2007).  Bilingual Spanish/English edition.  Edited and translated by Randall Couch. -- PDF + ePUB\r\n\r\n* Nobel Acceptance Speech (Nobel Prize Library, 1971).\r\n\r\n* Selected Poems of Gabriela Mistral (Indiana UP, 1957).  Translated by Langston Hughes.\r\n\r\n* Selected Prose and Prose-Poems (Texas UP, 2002).  Bilingual Spanish/English edition.  Edited and translated by Stephen Tapscott.\r\n\r\n* This America of Ours: The Letters of Gabriela Mistral and Victoria Ocampo (Texas UP, 2003).  Edited and translated by Elizabeth Horan and Doris Meyer.\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                              \nhttps://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:03b378431720c30e52e9f472f568dce36d51cc68","amp;dn":"Gabriela+Mistral+-+Nobel+Prize+in+Literature%2C+1945+%285+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03b378431720c30e52e9f472f568dce36d51cc68","infoHashBuffer":{"type":"Buffer","data":[3,179,120,67,23,32,195,14,82,233,244,114,245,104,220,227,109,81,204,104]},"announce":[],"urlList":[]}}