{"title":"Norton Partition Magic 8.0 Portable","uid":4515867,"size":8696000,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:044309ad5880eae36e0c9f913f7b49a82438a70c&amp;dn=Norton+Partition+Magic+8.0+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mcfilthynasty","files":1,"time":1226967673,"description":" Norton Partition Magic 8.0 Portable \n\n\nPartition Magic allows you to easily and quickly create, merge, resize and convert workstation hard-disk partitions without destroying data.\nWith Symantec PartitionMagic Pro, IT professionals can quickly and easily create partitions on desktop hard disks for storing valuable corporate information such as data files, applications, and operating systems. It enables corporations to secure data by physically separating it from other files. Separate partitions also make backups easier.\n\nWhether utilizing the remote agent technology across a TCP/IP connection to copy or move partitions on a computer, or scripting features enabling administrators to change the partitions on a computer simply by running a script, Symantec PartitionMagic Pro is one of the best desktop management products available today.\n\nFeatures\n? Divides a single hard drive into two or more partitions\n? Lets you safely run multiple operating systems on the same PC\n? BootMagic? makes it easy to switch between different operating systems\n? Allows you to copy, move, resize, split, or merge partitions as needed without losing data\n? How-to wizards guide you step by step through the partitioning process\n? Intuitive Windows?-based browser lets you find, copy and paste files in both Windows and Linux? partitions\n? Allows you to create and modify partitions up to 300 GB*\n? Supports USB 2.0, USB 1.1, and FireWire? external drives**\n? Supports FAT, FAT32, NTFS, Ext2, and Ext3 file systems\n? Converts partitions among FAT, FAT32, and NTFS without losing data\n? Allows you to enlarge an NTFS partition without restarting your computer\n? Resizes NTFS system clusters to the most effective size\n\n* Supports operations on partition sizes as large as 300 GB when partition is less than 90% full. Larger hard drives may require additional memory.\n\n** For these devices, operation on partitions with no open files\n\n\n\nScanned with Kaspersky - Clean\n\nFor more proper up&amp;#039;s\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/mcfilthynasty&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/mcfilthynasty&lt;/a&gt;\n\nEnjoy","torrent":{"xt":"urn:btih:044309ad5880eae36e0c9f913f7b49a82438a70c","amp;dn":"Norton+Partition+Magic+8.0+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"044309ad5880eae36e0c9f913f7b49a82438a70c","infoHashBuffer":{"type":"Buffer","data":[4,67,9,173,88,128,234,227,110,12,159,145,63,123,73,168,36,56,167,12]},"announce":[],"urlList":[]}}