{"title":"Fallout 4 Vault Dweller's Survival Guide: Prima Game Guide","uid":12763930,"size":75282330,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:04702ea7337b6e890c798e9b3644a3d9186055a6&amp;dn=Fallout+4+Vault+Dweller%27s+Survival+Guide%3A+Prima+Game+Guide&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mercs215","files":1,"time":1447570551,"description":"Fallout 4 Vault Dweller’s Survival Guide includes...\r\n\r\nNAVIGATING THE WASTELAND - If you do choose to go aboveground, we have provided an atlas of the surrounding area, with as much detail and information as possible, to satisfy your curiosity and dissuade you from ever venturing outside.*\r\n\r\nEQUIPMENT AND SURVIVAL GEAR - In the unfortunate event that you actually decide to leave the Vault, this manual provides schematics and data for the types of weaponry you may be inclined to use while fighting for your life. Again, we urge you to reconsider going outside.\r\n\r\nCRAFTING AND RESOURCES- Making good use of your surroundings is essential for survival, should you make the poor decision to venture outside Vault 111. But, just in case, this guide contains schematics and data vital for creating and repairing useful weapons and essential technology.\r\n\r\nTIPS FOR DANGEROUS ENCOUNTERS - Nothing should deter you from leaving the safety of the Vault like the threat of good, old-fashioned danger. Be sure to study the data that our scientists have compiled about the radiated terrors that you might find outside the comforts of Vault 111. You have been warned!\r\n\r\n*Locations, Points of Interest, &amp; Collectibles are called out in full color.\r\n\r\nCredits: thanks to frodbonzi for uploading the guide","torrent":{"xt":"urn:btih:04702ea7337b6e890c798e9b3644a3d9186055a6","amp;dn":"Fallout+4+Vault+Dweller%27s+Survival+Guide%3A+Prima+Game+Guide","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04702ea7337b6e890c798e9b3644a3d9186055a6","infoHashBuffer":{"type":"Buffer","data":[4,112,46,167,51,123,110,137,12,121,142,155,54,68,163,217,24,96,85,166]},"announce":[],"urlList":[]}}