{"title":"Cancer Bats - Searching for Zero 2015 ak61","uid":11743133,"size":89508482,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:047339c4cb2e7a00c63121269e46e8ca8d5af4e1&amp;dn=Cancer+Bats+-+Searching+for+Zero+2015+ak61&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"analogkid6103","files":11,"time":1425877650,"description":"\nCancer Bats - Searching for Zero\n\n\nBiography\n\nProving that loud, gritty, and ranting punk rock is still alive and thrashing in Canada, Toronto's Cancer Bats were founded in the spring of 2004 by singer Liam Cormier and guitarist Scott Middleton. Cormier and Middleton had worked together before in a metal band called At the Mercy of Inspiration, and were looking to launch a new project that would take their music in a harder but more elemental direction.\n Teaming with bassist Andrew McCracken and drummer Joel Bath, they formed Cancer Bats and recorded a four-song demo that they sold at shows in early 2005; the disc soon sold out two pressings and was later reissued as a 7&quot; vinyl EP by Tragic Comedy Records.\n\n After a few months, the group became disenchanted with drummer Bath, and Mike Peters shortly took over as the group's beat-keeper. Cancer Bats hit the road with a vengeance, playing all over Canada and making occasional jaunts into the United States while sharing stages with most of the Great White North's best punk outfits.\n\n The hard-partying band released its first full-length album, Birthing the Giant, in the fall of 2006. It was released in Canada by Distort Entertainment, in the United States by Abacus Records, and in the U.K. by Hassle Records; each release featured the same songs, though the sequence was changed for the American release of the disc. The band kept up its relentless touring pace after the album hit stores, and played a major American tour opening for Billy Talent.\n\n In 2007, McCracken amicably parted ways with Cancer Bats to devote more time to his design business, and Jason Bailey, a veteran of the bands Shattered Realm and Figure Four, signed on as their new bass player.\n In 2008 the band released its second album, Hail Destroyer. After spending a couple of years touring the metal festival circuit, Cancer Bats released Bears, Mayors, Scraps &amp; Bones in 2010.\n\n Amid plenty of work and development for their own compositions, the band explored a collective love of metal gods Black Sabbath with the low-key inception of Bat Sabbath, an alter ego band whose sole purpose was to dutifully cover Sabbath songs.\n This classic metal influence was heavy on their 2012 album Dead Set on Living, particularly in Cormier's increasingly improving vocals.\n Fifth album Searching for Zero was made during a time of great turmoil for the band, with exhausting amounts of touring and multiple deaths of people close to the band.\n This agonizing time was reflected in the dark and unrelenting tone of the album.\n\n\n\n\n09 - Dusted.mp39.57 Mb torrent search\n06 - Cursed With A Conscience.mp39.54 Mb torrent search\n01 - Satellites.mp39.35 Mb torrent search\n04 - Beelzebub.mp38.77 Mb torrent search\n10 - No More Bull Shit.mp38.37 Mb torrent search\n08 - Buds.mp37.85 Mb torrent search\n02 - True Zero.mp37.63 Mb torrent search\n05 - Devil's Blood.mp35.81 Mb torrent search\n03 - Arsenic In TYOTS.mp35.55 Mb torrent search\n07 - All Hail.mp33.35 Mb torrent search\ncover.jpg1.55 Mb torrent search","torrent":{"xt":"urn:btih:047339c4cb2e7a00c63121269e46e8ca8d5af4e1","amp;dn":"Cancer+Bats+-+Searching+for+Zero+2015+ak61","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"047339c4cb2e7a00c63121269e46e8ca8d5af4e1","infoHashBuffer":{"type":"Buffer","data":[4,115,57,196,203,46,122,0,198,49,33,38,158,70,232,202,141,90,244,225]},"announce":[],"urlList":[]}}