{"title":"Every Man a Menace - Patrick Hoffman [EN EPUB] [ebook] [p_s]","uid":15989066,"size":2303793,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:04ba7d907c868edcd134ac3942417d24c7df3693&amp;dn=Every+Man+a+Menace+-+Patrick+Hoffman+%5BEN+EPUB%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"perfect_stan","files":1,"time":1475994619,"description":"Every Man a Menace by Patrick Hoffman\r\nEnglish | 2016 | Mystery &amp; Crime | 2.2 MB\r\n\r\n\r\nSan Francisco is about to receive the biggest delivery of MDMA to hit the West Coast in years. Raymond Gaspar, just out of prison, is sent to the city by his criminal boss — still locked up on the inside — to check in on the testy Filipina who buys the product and the increasingly erratic dealer expected to take care of distribution. Down in Miami, the club owner responsible for shipping the drugs from Southeast Asia to the Bay Area has just met the girl of his dreams, but there’s something about her past that’s troubling him. And thousands of miles away, in Bangkok, a former conscript of the Israeli army who is farther up the production chain swipes right on a male dating app, taking a chance on the wrong pretty face — and one that threatens to unravel the whole operation.\r\nThese players are fighting to stay ahead in a system that threatens to swallow them whole: an international drug trafficking network that offers them great rewards at even greater risk. Stretching from the Golden Triangle of Southeast Asia to the Golden Gate of San Francisco, Every Man a Menace is a gritty and propulsive novel about the making, moving, and selling of the drug known as Molly — pure happiness in powder form, brought to market by bloodshed and betrayal.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:04ba7d907c868edcd134ac3942417d24c7df3693","amp;dn":"Every+Man+a+Menace+-+Patrick+Hoffman+%5BEN+EPUB%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04ba7d907c868edcd134ac3942417d24c7df3693","infoHashBuffer":{"type":"Buffer","data":[4,186,125,144,124,134,142,220,209,52,172,57,66,65,125,36,199,223,54,147]},"announce":[],"urlList":[]}}