{"title":"Understanding Prejudice, Racism and Social Conflict  [blackatk]","uid":8793806,"size":2058887,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0571f32fda52a73691b49bbdcb21d18573b04ca8&amp;dn=Understanding+Prejudice%2C+Racism+and+Social+Conflict++%5Bblackatk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"blackatk","files":-1,"time":1376020781,"description":"Publication Date: December 15, 2001 | ISBN-10: 0761962085 | ISBN-13: 978-0761962083 | Edition: 1st | With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who has inspired this upload. | filetype: pdf |\n\n\n`This is a comprehensive text that is extremely well written by top social psychologists, with all of the major theoretical perspectives represented. The editors should be commended for putting together this lively and engaging text'\n\n- Nyla Branscombe\n\nDepartment of Psychology, University of Kansas\n\nA range of international events have recently focused attention on issues of prejudice, racism and social conflict: increasing tensions in former Eastern bloc countries, political conflict in Northern Ireland and the United States, as well as racial conflict in the Baltic States, Middle East, Africa, and Australasia. In light of these events, Understanding Prejudice, Racism and Social Conflict presents a timely and important update to the literature, and will a fascinating textbook for all students who need to study the subject.\n\n\nReview\n`This book stands out for a number of reasons...the result is an authoritative, provocative and challenging collection, which will doubtless help to stimulate further debate in the field' Susan Condor, Department of Psychology, Lancaster University\n\n`The authors are to be commended for assembling an unusually stimulating collection of chapters...the book is clearly distinguished by the breadth of its coverage and the theoretical insights it offers. It is a valuable addition to any collection on this topic' Jack Dovidio, Department of Psychology, Colgate University\n\n`This is a comprehensive text that is extremely well written by top social psychologists, with all of the major theoretical perspectives represented. The editors should be commended for putting together this lively and engaging text' Nyla Branscombe, Department of Psychology, University of Kansas\nAbout the Author\nMartha Augoustinos is Professor of Psychology at the University of Adelaide and Co-Director of the Fay Gale Centre for Research on Gender.\n\n[b]About the Author [/b]\n\nAt the ANU I am a member of a team of social psychology researchers. My expertise is in investigating the role of the social self or social identity (sense of self as a group member - &quot;we&quot;, &quot;us&quot;) in shaping people's attitudes, affect and behaviour. Over recent years the focus of my work has been theory-driven research on (a) core organizational topics including leadership, power, diversity, casualization, negotiation and organisational change, (b) understanding the dynamics of social change (intergroup conflict and co-operation, prejudice, stereotyping, discrimination), and (c) the interplay between social identity processes and individual-level functioning (e.g., well-being, performance, personality). A particular strength of this work has been investigating these processes using more naturalistic samples in ACT high schools, community groups, and organisational settings. The research is of interest to a range of policy makers in areas such as educational leadership and school improvement, social norm change in dysfunctional communities, and building social cohesion in the face of ethnic and religious diversity. My research has been published in numerous top-tiered journals including Journal of Personality and Social Psychology, Personality and Social Psychology Bulletin, Journal of Experimental Social Psychology, and European Journal of Social Psychology. It also is supported by numerous large grants from the Australian Research Council (ARC) and I am currently Chief Investigator on three large ARC grants. In relation to other professional activities I am currently an Associate Editor of the Personality and Social Psychology Bulletin, a member of the Governing Council of the International Society of Political Psychology and serve and on numerous other editorial boards (ERSP, BJSP, PP, JASP). My main teaching responsibilities are in the areas of social psychology and organizational psychology. I currently supervise Master and PhD student research projects on understanding personality stability and change, leadership, prejudice reduction, organisational/team functioning, the creation of prejudice through scapegoating, and the formation of social identity. \n\n\nPaperback: 214 pages\nPublisher: SAGE Publications Ltd; 1st edition (December 15, 2001)\nLanguage: English\nISBN-10: 0761962085\nISBN-13: 978-0761962083\n\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Understanding-Prejudice-Racism-Social-Conflict/dp/0761962085/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Understanding-Prejudice-Racism-Social-Conflict/dp/0761962085/&lt;/a&gt;\n\n\n\n\n\n\nTags: race, racism, oppression, cyber, digital, white supremacy, white power, 88, narrative, media, pr, viewpoint, 88, ss, nsdp, aryan, nation, white narrative, contested, space, superiority, inferiority, subtle, racism, thought, logic, sociology, psychology, ethics, african, african american studies, AA, obama, militia, right, wing, mccain, bush, romney, tea, party, white anxiety, white rage, white guilt, inaction, complicity, slave, slavery, jim crow, segregation, knight, ku klux, inequality, Jim, Crow, race, racism, right, wing, republican, race coding, racially coded, subtle, doublespeak, George W Bush, George H.W Bush, Nixon, John Locke, William F Buckley, barack, obama, barry, black, biracial, IR, multiracial, preseident, bush, war, afghanistan, 2008, change, yes, we, can, hope, biden, china, afghanistan, tea, party, republican, democrat, politics, nobel, prize, war, peace, diplomacy, command, military, race, relations, racism, chicago, senator, white guilt, white anxiety, african, american, african american, black, racism, sociology, social mobiility, social climbing, mentor, race relations, race, militia, hate, nazi, white anxiety, oppression, tea party, fundamentalist, fundementalism, political science, hate group, ghettoization, blacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery, experimentation, tuskeegee, unconscious, subconscious,\n\n","torrent":{"xt":"urn:btih:0571f32fda52a73691b49bbdcb21d18573b04ca8","amp;dn":"Understanding+Prejudice%2C+Racism+and+Social+Conflict++%5Bblackatk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0571f32fda52a73691b49bbdcb21d18573b04ca8","infoHashBuffer":{"type":"Buffer","data":[5,113,243,47,218,82,167,54,145,180,155,189,203,33,209,133,115,176,76,168]},"announce":[],"urlList":[]}}