{"title":"Woody Guthrie - Library Of Congress Recordings (1992) {3 CD's]","uid":3346572,"size":242321292,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0583862d9474d72efc2fbce1711e2f9064106949&amp;dn=Woody+Guthrie+-+Library+Of+Congress+Recordings+%281992%29+%7B3+CD%5C%27s%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Ludeki","files":45,"time":1119238291,"description":"Woody Guthrie - Library Of Congress Recordings\nFeb 14, 1992 - Rounder Records\n3-CD Set\nEngineer Alan Lomax\nRecording Time 167 minutes\n\nDISC 1:\n1.Lost Train Blues\n2.Railroad Blues\n3.Rye Whiskey\n4.Old Joe Clark\n5.Beaumont Rag\n6.Texas Oil Fields\n7.Greenback Dollar\n8.Boll Weevil Song\n9.So Long, It's Been Good To Know You\n10.Talking Dust Bowl Blues\n11.Do-Re-Mi\n\nDISC 2:\n1.Hard Times\n2.Pretty Boy Floyd\n3.They Laid Jesus Christ In His Grave\n4.Jolly Banker\n5.I Ain't Got No Home\n6.Dirty Overalls\n7.Chain Around My Leg\n8.Worried Man Blues\n9.Lonesome Valley\n10.Walking Down That Railroad Line\n\nDISC 3:\n1.Goin' Down That Road Feeling Bad\n2.Dust Storm Disaster\n3.Foggy Mountain Top\n4.Dust Pneumonia Blues\n5.California Blues\n6.Dust Bowl Refugees\n7.Will Rogers Highway\n8.Los Angeles New Year's Flood\n\n\nDescription:\nMade by Alan Lomax over a three day period in 1940, LIBRARY OF CONGRESS RECORDINGS includes many of Woody Guthrie's best-loved songs, coupled with his commentary and observations of America in the 30's. Throughout the '30s and '40s, folklorist and historian Alan Lomax traveled the country seeking out traditional folk and blues performers. His field recordings brought the world dozens of treasured performers, some of whom never recorded again after his initial visit. One of his most important finds was the Oklahoma newspaper reporter, social activist, and folk balladeer Woody Guthrie. Lomax's recordings of Guthrie, made over a three-day period in March 1940, are collected in full on the three-disc LIBRARY OF CONGRESS RECORDINGS box set. The sessions were loose, unscripted affairs in the Lomax tradition. Between songs, Guthrie extemporizes on a variety of topics and provides a loose autobiography. But it's the songs, including magnificent performances of originals and standards like the gangster ballad &quot;Pretty Boy Floyd,&quot; the topical &quot;Dust Bowl Blues,&quot; and the spirited singalong &quot;So Long, It's Been Good to Know Ya,&quot; that make this collection indispensable.\n\nReview:\nNot so much an album as a historical aural document, this nearly three-hour, three-CD set chronicles three days of interviews and songs featuring a 27-year-old Woody Guthrie on March 21, 22 and 27, 1940. Alan Lomax and his wife, Elizbeth, take Guthrie through his autobiography and his reflections on the Dust Bowl, and he proves a witty, rustic raconteur who is even more impressive when he picks up the guitar and performs such original songs as &quot;So Long, It's Been Good to Know You,&quot; &quot;Talking Dust Bowl Blues,&quot; &quot;Do-Re-Mi,&quot; and &quot;Pretty Boy Floyd,&quot; as well as traditional material. Guthrie did not make his first studio recordings until later in 1940, but his repertoire and performance style were clearly long-established by this time. It is easy to hear why he was such a revelation to the folk world of the '40s, especially because his influence has been so pervasive: much of the next 20 years in folk music derives from these sessions, even though they were not commercially released until 1964, as a box set on Elektra Records. Rounder reissued the album on LP in the 1988 and on CD in the 1997. ~ William Ruhlmann, All Music Guide","torrent":{"xt":"urn:btih:0583862d9474d72efc2fbce1711e2f9064106949","amp;dn":"Woody+Guthrie+-+Library+Of+Congress+Recordings+%281992%29+%7B3+CD%5C%27s%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0583862d9474d72efc2fbce1711e2f9064106949","infoHashBuffer":{"type":"Buffer","data":[5,131,134,45,148,116,215,46,252,47,188,225,113,30,47,144,100,16,105,73]},"announce":[],"urlList":[]}}