{"title":"Dante Alighieri, Robert Pinsky - The Inferno of Dante","uid":7606194,"size":272503659,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:059da31c7bab57fa3cf8ccfb6403a4656ae51b08&amp;dn=Dante+Alighieri%2C+Robert+Pinsky+-+The+Inferno+of+Dante&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"rambam1776","files":-1,"time":1346952967,"description":"The Inferno of Dante - by Dante Alighieri, Robert Pinsky (Translator), Narrated by George Guidall; Unabridged\n\nOverview\nRobert Pinsky's acclaimed translation of The Inferno was awarded the Los Angeles Times Book Prize for Poetry and the Harold Morton Landon Translation Award given by the Academy of American Poets. As Edward Hirsch wrote in The New Yorker, &quot;Robert Pinsky's translation is fast-paced, idiomatic, and accurate. . . It maintains the original's episodic and narrative velocity. . . . Pinsky succeeds in creating a supple American equivalent for Dante's vernacular music where many others have failed&quot;.\n\nEditorial Reviews\nPublishers Weekly\nThough transforming Dante's terza rima into readable English has bogged down many a distinguished translator, Pinsky (The Want Bone) more than meets the challenge. His rendering has an efficient feel; the lines seem slimmer and less unwieldy than most contemporary verse translations. Each one of the cantos features a good number of stanzas dominated by monosyllables-his answer, along with intriguing patterns of assonance, to approximating the splendor of Dante's profusion of rhymes, which are impossible to replicate in English. The coherent narration of the translation is also welcome, as it keeps a harness on the sometimes meandering diction of the original. Pinsky's voice is nearly irresistible when rounding out the grotesqueries of Dante's Hell: his versions of the ninth and final circle bring the bizarre terror of the fiery pit to life. Plainspoken yet elegant, this Inferno sustains a tactile succession of images over 34 cantos, and lends itself to being read aloud.\n\nLibrary Journal\nSince Charles Rogers published the first complete translation of the Inferno in 1782, nearly 80 versions of Dante's masterpiece have appeared in English. Poet Pinsky (English, Boston Coll.) offers another. This book includes the Italian version at the end of the book, notes on textual allusions, a foreword by scholar John Freccero, and illustrations by Michael Mazur. Unlike other modern verse translations, notably those of Dorothy Sayers, John Ciardi, and Allen Mandelbaum, Pinsky's attempts to capture Dante's terza rima, the interlocking rhyme scheme aba, bcb, cdc, etc., which is difficult to sustain in English. A good poet, Pinsky is fluent if less literal than Ciardi and Mandelbaum, flattening Dante's diction. His version is a pleasure to read, but ultimately it does not supersede Ciardi's or Mandelbaum's.","torrent":{"xt":"urn:btih:059da31c7bab57fa3cf8ccfb6403a4656ae51b08","amp;dn":"Dante+Alighieri%2C+Robert+Pinsky+-+The+Inferno+of+Dante","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"059da31c7bab57fa3cf8ccfb6403a4656ae51b08","infoHashBuffer":{"type":"Buffer","data":[5,157,163,28,123,171,87,250,60,248,204,251,100,3,164,101,106,229,27,8]},"announce":[],"urlList":[]}}