{"title":"Revenge of the Nerds III: The Next Generation (1992) DVDrip","uid":4060337,"size":639882752,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:05d564b40befed0d080d7e4ac0d3b2f369c9c5f4&amp;dn=Revenge+of+the+Nerds+III%3A+The+Next+Generation+%281992%29+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"alcharkov","files":1,"time":1204580245,"description":"Revenge of the Nerds Nerds III: The Next Generation is a 1992 made for TV sequel to the 1984 film Revenge of the Nerds. In the beginning of the movie, a new generation of nerds now rules the Adams College campus, upholding the traditions of nerds from way past to the first film, and the Alpha Betas are now respectful of the nerds&amp;#039; prominence and even wish they could lure more nerds to join their frat. However, this changes when Orrin Price (Morton Downey, Jr.), becomes a member of the Adams College Board of Regents and a new generation of jocks come. Stan Gable is now a pathetic motorcycle police officer whom Orrin Price installs as Dean of Students. Gable tells the Alpha Betas of their past glories and rallies them to cause trouble for the nerds. Meanwhile, Lewis, who lives near the Adams College campus, shows that he is distancing himself from his nerd past by growing a ponytail and asking people to call himself &quot;Lou&quot;, rather than Lewis. His nephew, who is now a student at Adams, is surprised at Lewis&amp;#039; behavior, saying in his college day he was a &quot;nerd George Washington&quot;, and Betty, who is now married to Lewis, tries to remind him she fell in love with him because he had the courage to be himself. When Stan and the Alpha Betas launch a reign of terror against the nerds, Lewis is forced to examine his &quot;self-hating nerd&quot; status, while Stan faces his own stirrings of conscience over the vile actions of Orrin Price and has to decide what he will-and will not-stand for.","torrent":{"xt":"urn:btih:05d564b40befed0d080d7e4ac0d3b2f369c9c5f4","amp;dn":"Revenge+of+the+Nerds+III%3A+The+Next+Generation+%281992%29+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05d564b40befed0d080d7e4ac0d3b2f369c9c5f4","infoHashBuffer":{"type":"Buffer","data":[5,213,100,180,11,239,237,13,8,13,126,74,192,211,178,243,105,201,197,244]},"announce":[],"urlList":[]}}