{"title":"Suits Season 3 Episode 8.Endgame.HDTV(ajnkv)","uid":8891632,"size":278795094,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:05d749b6b6f958f88f9e0da436c46f9972b66af9&amp;dn=Suits+Season+3+Episode+8.Endgame.HDTV%28ajnkv%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"ajnkv","files":1,"time":1378595028,"description":"On the run from a drug deal gone bad, Mike Ross, a brilliant college-dropout, finds himself a job working with Harvey Specter, one of New York City's best lawyers.\n\nSYNOPSIS:\nOpen with Harvey promising Donna he'll make Huntley pay.\n\nHarvey tells Mike they need to wait on telling Eva about Huntley.\n\nDarby assures Harvey and Jessica that he has no idea what Huntley did. He can't testify because he never asked Huntley about his actions. Jessica wants him to do her a favor.\n\nHuntley tells Donna the people who were killed were terrorists. He reminds her that her firm does quite a bit of dirty work of its own. She tells him that he's been fired at the personal request of Darby.\n\nLouis begins busting heads with the associates. Rachel reminds him that the associates essentially chose him over Nigel.\n\nMike talks his way to Moriga's door and gives his security detail a rugby pic of him and Huntley, saying he's Huntley's nephew.\n\nLouis pays Harold visit, telling him he has information related to his firing.\n\nMoriga agrees to see Mike. Moriga tells him that if he had proof Huntley ordered the murders he would be using it. Mike reminds him that if he's sent back home he'll be killed by his own people. He's sticking with Cameron only because he has a deal in place.\n\nHarvey meets with Cameron and tells him &quot;man to man&quot; he's going after the wrong person. He says Moriga can tell him who really ordered the murders, but he'll have to change his deal. Cameron isn't interested in trusting Harvey and wants to hear it from him first.\n\nAn angry Harold confronts Mike about having been lied to regarding the way his career at the firm ended.\n\nRachel tells Louis a computer company represented by Harold is suing him.\n\nDonna is upset that Harvey is waiting to go after Huntley.\n\nMoriga takes the stand and testifies that Eva directed him to kill him. He tells the jury that if what he says turns out to be a lie he'll be sent to his home country and killed quickly.\n\nHarvey is getting nervous that the jury is buying what Moriga is selling on the stand. He wants to go after Huntley and tells Jessica about approaching Cameron. Huntley walks in and says if he's put on the stand he'll go after Eva.\n\nHarvey calls Huntley to the stand, telling Cameron he's giving him the bad guy. Huntley basically takes the fifth on just about everything but upon cross talks about Eva trying to bribe witnesses. Afterwards Eva makes it clear to Mike isn't happy to learn Harvey took a calculated risk with her life without telling her.\n\nHarvey finds Cameron on the street and yells at him for screwing him. Cameron isn't convinced Huntley is the guy.\n\nHarold finds Louis waiting for him in his office. Louis basically runs him over, allowing just one of provisions Harold had requested in his suit.\n\nEva confronts Darby about keeping Huntley from her. She slaps him when he confirms it. After Eva leaves Darby asks Jessica to find a way to help him help Eva. Cut to Jessica dropping by Harvey's place and saying she wants to forgive him for everything. They begin to work on a plan.\n\nHarvey goes to Mike's place and tells him the new strategy is for him to go to Cameron and remind him of the time he convicted the wrong guy.\n\nMike asks Clifford to speak with Cameron. He wants him to tell Cameron that what he did to him has virtually ruined his life. Mike reminds Clifford he broke the law to get him out.\n\nRachel tells Louis that Harold basically pulled one over him, since the clause he agreed to opens up a window to liability. Louis is furious.\n\nMike brings Clifford to see Cameron.\n\nA confident Harold is waiting for Louis in his office. Louis's tactic is to bog Harold down with numerous legal tricks designed to show his new firm his professional weaknesses. It won't win Louis' case but it will probably get Harold fired.\n\nCameron offers Eva eight years. After he leaves the room Jessica says she thinks Cameron has the upper hand and they should take the deal. Darby disagrees and then offers to perjure himself. Harvey doesn't think it will work, but Jessica thinks they can try to convince Cameron.\n\nHarvey and Darby meet with Cameron in a bathroom. They offer Darby accepting an obstruction of justice charge if the charge against Eva is dropped. He accepts because it seems to be a guaranteed win.\n\nDonna goes to see Huntley at a bar with the FBI. He's placed in custody.\n\nJessica and Harvey turn the tables on Darby, adding a clause to his deal that he can no longer practice law in the United States. Harvey reminds Cameron that ultimately he's most concerned with putting the bad guy away.\n\nRachel shows Louis that Harold has dropped his suit. She asks why he hates Harold so much. Louis tells her it goes back to the fact Harold is his one great failure at training associates. He ultimately agrees with her and rips up the notice that Harold dropped the suit. He's going to give Harold the win.\n\nDonna thanks Harvey. He gives her use of his car and goes for a walk.","torrent":{"xt":"urn:btih:05d749b6b6f958f88f9e0da436c46f9972b66af9","amp;dn":"Suits+Season+3+Episode+8.Endgame.HDTV%28ajnkv%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05d749b6b6f958f88f9e0da436c46f9972b66af9","infoHashBuffer":{"type":"Buffer","data":[5,215,73,182,182,249,88,248,143,158,13,164,54,196,111,153,114,182,106,249]},"announce":[],"urlList":[]}}