{"title":"What Americans Need to Know About Jihad - Robert Spencer","uid":11727073,"size":151720,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05dafa5a0d519e9d97b4c3c7b0141529af14367b&amp;dn=What+Americans+Need+to+Know+About+Jihad+-+Robert+Spencer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"starxteel","files":1,"time":1425113643,"description":"\nOne of the most important booklets you will ever read, What Americans Need to Know About Jihad is essential to an understanding of the radical, expansionist, totalitarian ideology that seeks to establish a global Islamic state ruled by Islamic law, or Sharia. These goals and motives of Jihad are detailed in Islamic texts and by Islamic teachers and have been uttered by the likes of Osama Bin Laden, Iranian president Mahmoud Ahmadinejad, and the leader of Hezbollah, Hassan Nasrallah. In this booklet, Robert Spencer lays out the Jihadist ideology in a concise manner, examining the Islamic history behind each of the violent precepts and their modern applications. Spencer shows in chilling detail that the goal of the Jihad is not only isolated acts of violence but world domination by any means necessary.\n\n\nAbout the author:\nRobert Spencer is the director of Jihad Watch, a program of the David Horowitz Freedom Center, and the author of eight books on Islam and jihad. Spencer is a weekly columnist for Human Events and the website Front-Page Magazine, and has led seminars on Islam and jihad for the United States Central Command, United States Army Command and General Staff College, the Joint Terrorism Task Force, and the U.S. intelligence community","torrent":{"xt":"urn:btih:05dafa5a0d519e9d97b4c3c7b0141529af14367b","amp;dn":"What+Americans+Need+to+Know+About+Jihad+-+Robert+Spencer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05dafa5a0d519e9d97b4c3c7b0141529af14367b","infoHashBuffer":{"type":"Buffer","data":[5,218,250,90,13,81,158,157,151,180,195,199,176,20,21,41,175,20,54,123]},"announce":[],"urlList":[]}}