{"title":"Aha!: The Moments of Insight that Shape Our World (2015) pdf","uid":11361931,"size":1794046,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05f299dcf3e46105849ba394d7fe153ac58edebf&amp;dn=Aha%21%3A+The+Moments+of+Insight+that+Shape+Our+World+%282015%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bookzilla","files":1,"time":1415010808,"description":"\n Great ideas often develop gradually after studying a problem at length-but not always. Sometimes, an insight hits like a bolt from the blue. For Archimedes, clarity struck while he was taking a bath. For Gustav Mahler, it came as the blades of his oars touched the water. And for Albert Einstein, it emerged while he was talking to a friend. Why do these moments of insight strike so suddenly? Why do they so often come to us when we are focused on something completely unrelated? And when great ideas &quot;come to&quot; us, where do they come from? In Aha!: The Moments of Insight that Shape Our World, philosopher William B. Irvine, author of A Guide to the Good Life and On Desire, explores these epiphanies, from the minor insights that strike us all daily, to the major realizations that alter the course of history. Focusing on aha moments as they take place in five different domains-religion, morality, science, math, and art-Irvine provides case studies that shed light on the different ways epiphanies happen in the different domains, and on their differing social impact. Along the way, he describes some of the great aha moments in history, from ancient times to the present day. We like to think that our greatest thoughts are the product of our conscious mind. Irvine demonstrates, though, that it is our unconscious mind that is the source of our most significant insights, and that the role the conscious mind plays in eliciting these insights is to try, unsuccessfully, to solve certain problems. Only if the conscious mind is willing to do this-and thereby experience considerable frustration-is the unconscious mind likely to reward it with a breakthrough insight-that the conscious mind will then take credit for. Irvine explores not only the neuroscience of aha moments but also their personal and social ramifications. How does a person respond to having a breakthrough insight that goes against a dominant paradigm? And how does the world respond when she shares that insight? Irvine shows that in many cases, what is most remarkable about those who have had the great insights of human history is not their but their courage and perseverance in fighting for the world to accept those insights. Aha! is a must-read for cognitive scientists, intellectual historians, philosophers, and anyone who has ever been blown away by the ideas that enlighten us when we least expect it","torrent":{"xt":"urn:btih:05f299dcf3e46105849ba394d7fe153ac58edebf","amp;dn":"Aha%21%3A+The+Moments+of+Insight+that+Shape+Our+World+%282015%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05f299dcf3e46105849ba394d7fe153ac58edebf","infoHashBuffer":{"type":"Buffer","data":[5,242,153,220,243,228,97,5,132,155,163,148,215,254,21,58,197,142,222,191]},"announce":[],"urlList":[]}}