{"title":"The Nietzsche Dictionary (2015) pdf","uid":11539265,"size":1933731,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:066f42c71339539fcd333cdc2703eebfc868d561&amp;dn=The+Nietzsche+Dictionary+%282015%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bookzilla","files":1,"time":1416614746,"description":"Nietzsche is not difficult to read, but he is famously difficult to understand. This is because of the bewildering array of words, phrases or metaphors that he uses. The Nietzsche Dictionary aims to help, by giving readers a road map to Nietzsche's language, and how his terminology and images relate together, forming an overall philosophical picture. The Dictionary also includes synopses of Nietzsche's key works, and short articles on the main philosophical and cultural influences leading up to, and resulting from, Nietzsche.\n\n Easy to use and navigate, the book treats all entries thematically and arranges them into seven types: Influences on, or the contemporary context of, Nietzsche; Major influences of Nietzsche; Key concepts; Key metaphors or images; Alternative translations; Other words or phrases found in Nietzsche that are cross-referenced to a main entry; Synopses of major works by Nietzsche.\n\n Designed to be a resource that all readers of Nietzsche will find invaluable, this text is an essential tool for everyone, from beginners to the more advanced","torrent":{"xt":"urn:btih:066f42c71339539fcd333cdc2703eebfc868d561","amp;dn":"The+Nietzsche+Dictionary+%282015%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"066f42c71339539fcd333cdc2703eebfc868d561","infoHashBuffer":{"type":"Buffer","data":[6,111,66,199,19,57,83,159,205,51,60,220,39,3,238,191,200,104,213,97]},"announce":[],"urlList":[]}}