{"title":"Nuclear Hazards in the World - Jun Takada","uid":15372530,"size":6731079,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:069389faa3413385e3a3d8ff4f25757f5aebee45&amp;dn=Nuclear+Hazards+in+the+World+-+Jun+Takada&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"clouderone","files":1,"time":1469155526,"description":"Nuclear Hazards in the World - Jun Takada (Springer, 2005).pdf\r\n\r\nScience and technology have made great progress in energy, information communication and life in the 20th century. Recognition of the negative aspects and the serious efforts to minimize their influence on society is important in the 21st century. Since the beginning of the last century, nuclear science and technology have been developed by advanced countries such as the United States of America, the former USSR, UK, France and Japan. This has had great impact on the world, providing the ultimate weapon to human beings, a new kind of energy, as well as new medical and industrial technologies. Nuclear science and technology were first applied to the generation of electricity on a commercial scale in USSR in 1954 and spread throughout the world. More than 400 nuclear power plants are operating worldwide at the beginning of the 21st century. If the fast-breeder reactor is successfully put to safe practical use, it will alleviate the energy problem for many years. On the other hand, many people are concerned about the occurrence of nuclear disasters and radiation exposure. Historically, the use of nuclear technology has produced several severe disasters resulting in long-term pollution in the world, such as combat use in Hiroshima and Nagasaki, a large number of weapons test explosions and the Chernobyl reactor accident","torrent":{"xt":"urn:btih:069389faa3413385e3a3d8ff4f25757f5aebee45","amp;dn":"Nuclear+Hazards+in+the+World+-+Jun+Takada","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"069389faa3413385e3a3d8ff4f25757f5aebee45","infoHashBuffer":{"type":"Buffer","data":[6,147,137,250,163,65,51,133,227,163,216,255,79,37,117,127,90,235,238,69]},"announce":[],"urlList":[]}}