{"title":"Amy LaVere - Runaway's Diary [2014]  [EAC/FLAC]","uid":10285348,"size":251889300,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:074540c97143f88632a15bc2ec22162798c36a2f&amp;dn=Amy+LaVere+-+Runaway%27s+Diary+%5B2014%5D++%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"dickspic","files":33,"time":1401773789,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Archer Records #ARR 319611\nCountry: USA\nYear: May 26, 2014\nGenre: Americana\nFormat: CD,Album\n\n\n\n01 Rabbit\n02 Last Rock N Roll Boy To Dance\n03 Big Sister\n04 Self Made Orphan\n05 Where I Lead Me\n06 Snowflake\n07 How?\n08 Don't Go Yet John\n09 Lousy Pretender\n10 Dark Moon\n11 I'll Be Home Soon\n12 Reprise \n\n\n\n\nSince she began recording, singer, songwriter, and bassist Amy LaVere has been adept at turning the stuff of her autobiography into fine songs. On 2011's Stranger Me, she detailed her own loss, grief, and heartbreak in one of the finest breakup albums in recent memory. With Runaway's Diary, she goes back to the well, but with a storyteller's twist. This is a road album. It deals with the various kinds of gritty events that occur along the highway in the life of a soul with a desperate need to keep moving. LaVere wrote eight of this set's 12 songs and enlisted Luther Dickinson to produce. He and Will Sexton play guitars; Sharde Thomas and Shawn Zorn are her drummers (often simultaneously); she handles the bass, and Tim Regan plays various keyboards. Her music is deeply rooted in Memphis rockabilly, folk, country, and retro pop. Among its finest songs are the tender, poetic &quot;Rabbit,&quot; that uses the life of Steven Gene Wold (aka blues singer Seasick Steve) for source material -- though LaVere ran away when she was younger, too. Its sparse snare and tom-tom drumming, fingerpicked electric guitars, atmospheric Mellotron, and Wurlitzer piano buoy her bowed bassline and mournful voice with empathetic supporting vocals from Thomas. Jim Sparke's baritone sax plays a key role on the shuffling, sultry, minor-key strut of &quot;Last Rock n Roll Boy to Dance,&quot; a rootsy teen rebellion song from a woman's point of view. &quot;Self-Made Orphan&quot; is strolling rockabilly with twanging Telecasters and honky tonk piano. It's a heartbreaking rebel's anthem about the unwillingness -- and inability -- to accept unconditional love. The deep well of loneliness in &quot;Snowflake,&quot; with its single tom-tom, piano, and interwoven acoustic guitars is as wrenching as it is militant. The slippery old-world pop in &quot;Don't Go Yet John&quot; reveals the intimate consequences of being unable to trust. Even LaVere's covers are so seamlessly well-chosen they intersect with her theme. She uses the grimy blues in Townes Van Zandt's &quot;Where I Lead Me&quot; and transforms it into swaggering Sun Studio-style rockabilly blues. Her reading of Ned Miller's &quot;Dark Moon&quot; is a jazzy, honky tonk ballad. LaVere's take on John Lennon's &quot;How?&quot; is a relatively faithful version, but in her crooning alto it wraps itself naturally inside her narrative arc. Runaway's Diary is the rarest kind of concept record: one that wears the seriousness of its topics like a light jacket, and whose inventive musical savvy counters the restlessness of the soul at its subject's core.","torrent":{"xt":"urn:btih:074540c97143f88632a15bc2ec22162798c36a2f","amp;dn":"Amy+LaVere+-+Runaway%27s+Diary+%5B2014%5D++%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"074540c97143f88632a15bc2ec22162798c36a2f","infoHashBuffer":{"type":"Buffer","data":[7,69,64,201,113,67,248,134,50,161,91,194,236,34,22,39,152,195,106,47]},"announce":[],"urlList":[]}}