{"title":"Insight Guides Pocket - New York (2016).epub Gooner","uid":15292714,"size":29933056,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0816f2e536b76b1ce0722c3467c2fee3309296b5&amp;dn=Insight+Guides+Pocket+-+New+York+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1468435327,"description":"Insight Guides Pocket - New York (2016).epub Gooner\r\n\r\nPublisher: Insight (18 April 2016)\r\nLanguage: English\r\nISBN-10: 1780053363\r\nISBN-13: 978-1780053363\r\n\r\nWhether you're looking for iconic sights, prestigious art galleries or simply want to experience the buzz of this fast-moving city, New York has something for everyone. Be inspired to visit by the brand new Insight Pocket Guide New York, a concise, full-color guide to this inspiring city that combines lively text with vivid photography to highlight the best that New York has to offer.\r\n\r\nInside Insight Pocket Guide New York:\r\n\r\n- Where To Go details all the key sights in the city, from Times Square and Fifth Avenue to Central Park and Greenwich Village, while handy maps on the cover flaps help you find your way around, and are cross-referenced to the text.\r\n\r\n- Top 10 Attractions gives a run-down of the best sights to take in on your trip, including the Empire State Building, the Statue of Liberty and its finest art galleries and museums.\r\n\r\n- A Perfect Day in New York provides an itinerary for one day in the city.\r\n\r\n- What To Do is a snapshot of ways to spend your spare time, from shopping to taking in a Broadway musical or a comedy show.\r\n\r\n- Essential information on New York's diverse culture, including a brief history of the city.\r\n\r\n- Eating Out covers the city's best cuisine.\r\n\r\n- Curated listings of the best hotels and restaurants.\r\n\r\n- A-Z of all the practical information you'll need.\r\n\r\nAbout Insight Guides: \r\n\r\nInsight Guides has over 40 years' experience of publishing high-quality, visual travel guides. We produce around 400 full-color print guide books and maps as well as picture-packed eBooks to meet different travelers' needs. Insight Guides' unique combination of beautiful travel photography and focus on history and culture together create a unique visual reference and planning tool to inspire your next adventure","torrent":{"xt":"urn:btih:0816f2e536b76b1ce0722c3467c2fee3309296b5","amp;dn":"Insight+Guides+Pocket+-+New+York+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0816f2e536b76b1ce0722c3467c2fee3309296b5","infoHashBuffer":{"type":"Buffer","data":[8,22,242,229,54,183,107,28,224,114,44,52,103,194,254,227,48,146,150,181]},"announce":[],"urlList":[]}}