{"title":"Gordon R. Dickson - The Dragon Knight Series [1-9]","uid":12037399,"size":8366096915,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0816a13b7e108b2c363e5e470188595bfb263940&amp;dn=Gordon+R.+Dickson+-+The+Dragon+Knight+Series+%5B1-9%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"Cybotage","files":47,"time":1434710376,"description":"\n\n\nThe Dragon and the George (Dragon Knight #1) by Gordon R. Dickson\n\nJim Eckert was a dragon. He hadn't planned it that way, but that's what happened when he set out to rescue his betrothed. Following her through an erratic astral-projection machine, Jim suddenly found himself in a cockeyed world - locked in the body of a talking dragon named Gorbash.\nThat wouldn't have been so bad if his beloved Angie were also a dragon. But in this magical land, that was not the case. Angie had somehow remained a very female human - or a george, as the dragons called any human. And Jim, no matter what anyone called him, was a dragon.\nTo make matters worse, Angie had been taken prisoner by an evil dragon and was held captive in the impenetrable Loathly Tower. So in this land where georges were edible and beasts were magical - where spells worked and logic didn't - Jim Eckert had a problem.\nAnd he needed help, by george!\n\n\nThe Dragon Knight (Dragon Knight #2) by Gordon R. Dickson\n\nA sequel to The Dragon and the George (Ballantine, 1978), set within the same year. Jim and Angie have decided not to return to the 20th century, but rather have chosen to stay in the fantasy world of 14th-century England with the dragons and sorcery. The two are now the proud possessors of a middling-size castle where they worry about draining moats, fleas, baths, and other prosaic problems of the time. Then the Accounting Office for Magic steps in and turns Jim back and forth into a dragon without his consent. It seems that when you are a magician, even a lowly Class D one, you must use your magic or it uses you. This latest tale involves a quest to France with his newfound friends and cohorts to rescue Prince Edward of England from the hands of the evil French sorcerer, Malvinne. Included are spells, dragons, talking wolves, enchantment, foul play, and a rousing good time. This humorous, engrossing adventure is sure to please fantasy fans.\n\n\nThe Dragon on the Border (Dragon Knight #3) by Gordon R. Dickson\n\nIn &quot;The Dragon on the Border,&quot; Sir James, the Dragon Knight, faces his most terrifying challenge - the Hollow Men, spirits of the dead in empty suits of armor. Their weapons are all too real, and a slain Hollow Man can be resurrected within two days. As long as one of their unholy number endures, no Hollow Man can ever truly die...\n\n\nThe Dragon at War (Dragon Knight #4) by Gordon R. Dickson\n\n\nJim Eckert is &quot;The Dragon Knight&quot;. A 20th-century professor transported to an alternate medieval England, he gains the ability to transform himself into a dragon. In a land where magic is the rule, not the exception, the Dragon Knight must battle powerful sea serpents.\n\n\nThe Dragon, the Earl and the Troll (Dragon Knight #5) by Gordon R. Dickson\n\nThe Earl of Somerset is throwing a Christmas feast. But the Dark Powers have chosen this joyous time to launch a massive offensive. An army of land-hungry trolls has laid siege outside the Earl's fortress, while a nest of traitors waits to hatch its deadly plan from the inside. Now Sir James, the brave Dragon Knight, must fight a battle unlike any he has ever known.\n\n\nThe Dragon and The Djinn (Dragon Knight #6) by Gordon R. Dickson\n\n\nGordon R. Dickson continues his acclaimed saga of a twentieth-century American transformed into a Dragon Knight - and transported into a fantastic medieval adventure! The Dragon Knight's journey to the Holy Land is supposed to be a simple quest...but pirates, sea giants, and the legendary Djinn threaten to make his voyage the most dangerous odyssey known to man - and dragon.\n\n\nThe Dragon and the Gnarly King (Dragon Knight #7) by Gordon R. Dickson\n\n\nEckert's daring exploits have earned him a title - Baron de Bois de Malencontri et Riveroak - and he has settled down to a peaceful life as a feudal lord, with his beloved Angela at his side. But a new peril endangers his enchanted realm as the King of the Gnarlies teams up with the Earl of Cumberland, Jim's longtime rival, to kidnap his adopted son, Robert.\n\n\nThe Dragon in Lyonesse (Dragon Knight #8) by Gordon R. Dickson\n\n\nMathematician Jim Eckert, who has come to live in magical medieval times and can become a dragon at will, becomes an unlikely ally of King Arthur and his Knights of the Round Table.\n\n\nDragon and the Fair Maid of Kent (Dragon Knight #9) by Gordon R. Dickson\n\n\n\nJim Eckert, the Dragon Knight, must now confront the three disasters that lie in wait for any visitor to the English Middle Ages: war, plague, and Plantagenets.\nThe plagues is caused by a covert invasion of shape-shanging goblins with plague-tipped spears that seek to take over the world. Meanwhile, Eckert's castle is invaded by Plantagenets: Edward III, his son Edward the Black Prince, and Joan, the Fair Maid of Kent.\nAgainst the background of a full-scale human-versus-goblin war, these worthies move in a swirl of intrigue and dynastic tension. And, as usual, it's up to the Jim Eckert, in all his scaly glory, to make sure good triumphs in the end!","torrent":{"xt":"urn:btih:0816a13b7e108b2c363e5e470188595bfb263940","amp;dn":"Gordon+R.+Dickson+-+The+Dragon+Knight+Series+%5B1-9%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0816a13b7e108b2c363e5e470188595bfb263940","infoHashBuffer":{"type":"Buffer","data":[8,22,161,59,126,16,139,44,54,62,94,71,1,136,89,91,251,38,57,64]},"announce":[],"urlList":[]}}