{"title":"Best Practice in Professional Supervision A Guide for the Helpin","uid":9566958,"size":10517428,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:084601b1cf2fe8cbb14978afe514fd9cc70f420e&amp;dn=Best+Practice+in+Professional+Supervision+A+Guide+for+the+Helpin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"MucGar","files":-1,"time":1391535584,"description":"Best Practice in Professional Supervision A Guide for the Helping Professions\n\n\nEnglish | English | ISBN: 1843109956 | 256 pages | PDF | 10 MB\n\n\nBest Practice in Professional Supervision is an authoritative guide to being an excellent supervisor, covering the role, functions and dispositions involved.\n\nThe authors consider basic skills, the practicalities of forming and maintaining the supervision relationship, and the organisational context and culture of supervision. The book offers practical examples and a model of supervision that draws together ideas from adult learning theory and reflective practice. Viewing supervision as a place for learning, this guide considers how supervision can assist practitioners in developing professional resilience and managing the stresses of complex work environments. It also includes specific chapters on supervision of clinical student placements and in child protection settings.\n\nThis book covers a range of professions including social care, nursing, counselling, social work and allied health professions, and is an essential guide for all those undertaking supervision or supervision training in these and related professions.","torrent":{"xt":"urn:btih:084601b1cf2fe8cbb14978afe514fd9cc70f420e","amp;dn":"Best+Practice+in+Professional+Supervision+A+Guide+for+the+Helpin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"084601b1cf2fe8cbb14978afe514fd9cc70f420e","infoHashBuffer":{"type":"Buffer","data":[8,70,1,177,207,47,232,203,177,73,120,175,229,20,253,156,199,15,66,14]},"announce":[],"urlList":[]}}