{"title":"Astronomical Discoveries You Can Make Too - Replicating the Work","uid":14085009,"size":13074523,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:086a742c90e8720c6666760357a2c6f2d1a2bd0f&amp;dn=Astronomical+Discoveries+You+Can+Make+Too+-+Replicating+the+Work&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1459256334,"description":"Astronomical Discoveries You Can Make Too - Replicating the Work of the Great Observers (2015).pdf Gooner\r\n\r\nPublisher: Springer; 2015 edition (May 13, 2015)\r\nLanguage: English\r\nISBN-10: 3319156594\r\nISBN-13: 978-3319156590\r\n\r\nYou too can follow in the steps of the great astronomers such as Hipparchus, Galileo, Kepler and Hubble, who all contributed so much to our modern understanding of the cosmos. This book gives the student or\r\namateur astronomer the following tools to replicate some of these seminal observations from their own homes:\r\n\r\nWith your own eyes: Use your own observations and measurements to discover and confirm the phenomena of the seasons, the analemma and the equation of time, the logic behind celestial coordinates, and even the precession of the equinoxes.\r\n\r\nWith a consumer-grade digital camera: Record the changing brightness of an eclipsing binary star and show that a pulsating star changes color as it brightens and dims. Add an inexpensive diffraction grating to your camera and see the variety of spectral features in the stars, and demonstrate that the Sun’s spectrum is similar to one particular type of stellar spectrum.\r\n\r\nWith a backyard telescope: Add a CCD imager and you can measure the scale of the Solar System and the distance to a nearby star. You could even measure the distance to another galaxy and observe the cosmological redshift of the expanding universe.\r\n\r\nAstronomical Discoveries You Can Make, Too! doesn’t just tell you about the development of astronomy; it shows you how to discover for yourself the essential features of the universe","torrent":{"xt":"urn:btih:086a742c90e8720c6666760357a2c6f2d1a2bd0f","amp;dn":"Astronomical+Discoveries+You+Can+Make+Too+-+Replicating+the+Work","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"086a742c90e8720c6666760357a2c6f2d1a2bd0f","infoHashBuffer":{"type":"Buffer","data":[8,106,116,44,144,232,114,12,102,102,118,3,87,162,198,242,209,162,189,15]},"announce":[],"urlList":[]}}