{"title":"Longtion Software AutoRun Pro Enterprise II v6 0 5 155 WinAll Re","uid":11292049,"size":15123254,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:087dd319a6f7594cf7980cc43fb80f7c574de707&amp;dn=Longtion+Software+AutoRun+Pro+Enterprise+II+v6+0+5+155+WinAll+Re&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"TeX","files":4,"time":1414345502,"description":" &lt;a href=&quot;https://rarbg.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;https://rarbg.com&lt;/a&gt;\n\nB L I Z Z A R D\n\nLongtion Software AutoRun Pro\nEnterprise II v6.0.5.155\nrelease date: 2014-10-26 supplier: TEAM BLZ\ndisks: 3 cracker: TEAM BLZ\nprotection: Registration os: WinALL\n\nRELEASE INFO\n\nCreate your own custom autorun menus, interactive presentations\nmultimedia applications, and custom software in just minutes\nAutoRun Pro Enterprise II features a completely visual drag and\ndrop environment. Simply add content such as buttons, photos and\ntext to your pages and position them using your mouse. Even if\nyou have absolutely no programming experience you'll be able to\nget started creating your own custom applications in just\nminutes\n\nAutoRun Pro Enterprise II is a popular design tool for rapid\ncreation of autorun CD browsers and presentations. Offering a\nsimple point-and-click design environment, AutoRun Pro Enterprise\nII allows anyone, regardless of computer competence and creative\nability, to blend texts, images, video and audio into an\ninteractive front-end for CDs and DVDs. In doing this, you can\nmake use of wizards, templates and demos that let you jumpstart\nyour autorun project in minutes. The end result can be compiled\nas a single executable file and burned onto a CD or DVD disk\ndirectly using the built-in CD Burner\n\nThe best in AutoRun Pro Enterprise II is that it has been\ndesigned with the ordinary user in mind, the one who doesn't want\nto take the time to learn how to use a complicated design tool or\nhire a designer to do the work. It lets you create and edit a\nfront-end in much the same way as you would design a presentation\nin Microsoft PowerPoint. Just click, drag, position in the\ndesired area and preview to see whether you have the intended\nresult. In just a few clicks, you can create a main page, a\nsplash screen, an agreement form, a security form and an exit\nform, plus add the unlimited number of sub pages. Pages can be\nconnected by using transition effects like page fade in, fade out\nand others. You can elaborate pages by adding buttons, images\nsimple text, links and many other objects and associate each of\nthem with actions so that end users can interact with and\nnavigate through the front-end content. The front-end can let\nthem open and execute files, print documents, send email, visit\nweb sites, browse CD and more\n\nAutoRun Pro Enterprise II is a powerful visual tool to create\nprofessional autorun (autoplay) interfaces and presentations for\nyour CD/DVDs. It is the easiest way to create, edit professional\nautorun (autoplay) interface and generate autorun files for\nCD/DVDs in a WYSIWYG environment, just click, point, place and\ntest (preview). So all is visual, fast, simple. AutoRun Pro is\neasy to learn, with demos and wizards you can get started in just\nminutes!\n\n35 Objects: ScrollBox, Panel, TabNotebook, TabSheet, GroupBox\nButton, ImageButton, Image, Bevel, SimpleText, ScrollText, Link\nSplitter, FadeButton, Label, Text, Shape, Balloon, Note, ListBox\nDropDownList, ListView, TreeView, ShellListView, ShellTreeView\nTextBox, RichText, Browser, MediaPlayer, FlashPlayer, SlideShow\nEdit, UserPassword, CheckBox and RadioButton\n\nScrollBox, Panel, TabNotebook, TabSheet, GroupBox are container\nobjects. The container object can serve as a container (parent)\nfor other objects. The parent of an object is the object that\ncontains the object. For example, if a page includes three\nRadioButton objects in a GroupBox object, the GroupBox object is\nthe parent of the three RadioButton objects, and the RadioButton\nobjects are the child objects of the GroupBox object\n\nPage Template and Object Template make it more easy\n\nIt's fast and easy to use. Anyone can quickly create autorun\nCD-ROMs within minutes\n\nFeatures:\n\nDisplay of every registered document (e.g: TXT, DOC, HTML) via\nautomatic start of the corresponding application\nPrint of every registered document (e.g: TXT, DOC, HTML) via\nautomatic start of the corresponding application\nStart any program\nStart the default browser with document URL\nSend email\nIntegrated Web browser and internal commands\nIntegrated sound player\nIntegrated RTF (Rich Text) viewer\nIntegrated Media Player\nSlide Show images (Photo album), more than 100 styles\nBackground color, Gradient color and Transparent Form\nBackground sound\nSplash screen, splash screen sound\nFull screen background and logo image\nLicense agreement. You can display a license agreement before\nany files are launched. The user is required to accept the\nlicense in order to continue. If the user does not accept the\nlicense, then the AutoRun exits\nSecurity. You can protect your CD from being started by\nunlicensed users by requiring users to submit a User Name and\nPassword or an Authentication Code\nExit Form. Show information or confirm exit before program\nexits\nUnlimited Sub Pages\nPage FadeIn, FadeOut\nImages include bitmap, icon, JPEG, EMF, WMF, GIF (Static or\nAnimated), PNG images\nPage template\nObject template\nCD Icon and Page icon can be displayed in the title bar\nTest without burning CD\nBurn project to CD-R/CD-RW directly with built-in CD Burner\nCreate a single executable file\nPublish project to new folder\nCreate ISO CD-ROM image file\nInstall Software - You may want to install a default viewer for\nthe files if the user does not have one on his computer. For\nexample, if you are launching a PDF file, you may want to\ninclude Adobe Acrobat Reader software on your CD and install it\nif the user does not already have it installed. You can define\none or more files to be installed\nCreate drop down menu bar (main menu), tool bar and status bar\nfor pages like most standard windows to make your page more\nprofessional\nCreate popup menu, you can define the pop-up menu that appears\nwhen the user clicks on an object or page background with the\nright mouse button, like most professional applications\nCD expire date, Specifies an expiration date for the CDs\nSet object(s) Enable or Disable, Show or Hide Object(s)\nNo programming knowledge required\nNo registry entry necessary\nRuns from CD-ROM without installation\nNo runtime module required\n\nINSTALL INFO\n\nRun setup and follow instructions\n\nRegister using these infos:\n\nName: CLUSTER/BLiZZARD!\nSerial: 00209FB082D46543\nKey: A6D4B8636401D775\n\nGREETINGS\n\ngreets fly out to all groups which actively and courageously\nwork on building better release conditions and\nthus keep the scene up\n\nspecial greets to our friends in:\n\nabsokt - acme - air - digerati - explosion - f4cg\norion - pdx - shock - ssg - tbe - tmg - unleashed - zwt\n\nCONTACT\n\nWe are a closed group, if we need you then we will contact you!\n\nSoftware worth using is worth buying.. keep this in mind!\n\nnfo updated on\n2009.07.19\n\nINFOFILE DRAWN BY\nH7/ACCESSiON","torrent":{"xt":"urn:btih:087dd319a6f7594cf7980cc43fb80f7c574de707","amp;dn":"Longtion+Software+AutoRun+Pro+Enterprise+II+v6+0+5+155+WinAll+Re","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"087dd319a6f7594cf7980cc43fb80f7c574de707","infoHashBuffer":{"type":"Buffer","data":[8,125,211,25,166,247,89,76,247,152,12,196,63,184,15,124,87,77,231,7]},"announce":[],"urlList":[]}}