{"title":"The Mixing Engineers Handbook.pdf","uid":5280298,"size":15574632,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:091abfdf37326f3fc6909df8e85f651a8741a5d2&amp;dn=The+Mixing+Engineers+Handbook.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"The_Kraken","files":-1,"time":1263523075,"description":"Throughout his 30 years of experience in studios, Bobby Owsinski interviewed many well-known engineers, from Bruce Swedien to George Massenburg, and the transcripts of the interviews make up half of this book's 200 pages. The other half details all the aspects of mixing, framed by comments extracted from the interviews. Top-notch organization allows the reader to access engineers' comments by topic or by the name of the engineer.\n\nThis well-written handbook should entertain everyone from the rookie engineer to the seasoned professional through chapters on the history of mixing, dynamics, EQ'ing, sound-field placement and effects. With additional chapters on balance, &quot;the key to a great mix,&quot; the final mix, and an extensive section on mixing for surround sound, solutions to common conundrums are both detailed and varied. Most refreshing is the candor with which the engineers describe their craft.\n\nThis is a very revealing visit into the often mythical realms of mixing, and even established engineers can learn something new from this book.","torrent":{"xt":"urn:btih:091abfdf37326f3fc6909df8e85f651a8741a5d2","amp;dn":"The+Mixing+Engineers+Handbook.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"091abfdf37326f3fc6909df8e85f651a8741a5d2","infoHashBuffer":{"type":"Buffer","data":[9,26,191,223,55,50,111,63,198,144,157,248,232,95,101,26,135,65,165,210]},"announce":[],"urlList":[]}}