{"title":"Tao Of Jeet Kune Do","uid":6565236,"size":307253234,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:092318c70e79eafa74c673f566bfabced1247b36&amp;dn=Tao+Of+Jeet+Kune+Do&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"megatron333","files":1,"time":1311655632,"description":"Tao of Jeet Kune Do is a book expressing Bruce Lee's martial arts philosophy and viewpoints, published posthumously (after Bruce Lee's death in 1973). The project for this book began in 1970 when Bruce Lee suffered a back injury during one of his practice sessions. During this time he could not train in martial arts. He was ordered by his doctors to wear a back brace for 6 months in order to recover from his injury. This was a very tiring and dispiriting time for Lee who was always very physically active.\nIt was during his convalescence that he decided to compile a treatise on the system or approach to martial arts that he was developing; he called it Jeet Kune Do. The bulk of these writings would become the &quot;core set of writings&quot;. Many of these writings were done during a single session which provided natural continuity. Lee had also kept various notes throughout the development of his combat philosophy and these would become the disparate notes used in the book. Many of these notes were &quot;sudden inspirations&quot; which were incomplete and lacked any kind of a construct. The combination of the &quot;core set of writings&quot; and the &quot;disparate notes&quot; would be known as the text Tao of Jeet Kune Do.","torrent":{"xt":"urn:btih:092318c70e79eafa74c673f566bfabced1247b36","amp;dn":"Tao+Of+Jeet+Kune+Do","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"092318c70e79eafa74c673f566bfabced1247b36","infoHashBuffer":{"type":"Buffer","data":[9,35,24,199,14,121,234,250,116,198,115,245,102,191,171,206,209,36,123,54]},"announce":[],"urlList":[]}}