{"title":"Timothy Chappell - Knowing What To Do. Imagination, Virtue, and ","uid":11212631,"size":2187417,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:092963b9e7707863d1ea27d34f59521cfa253534&amp;dn=Timothy+Chappell+-+Knowing+What+To+Do.+Imagination%2C+Virtue%2C+and+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Anette14","files":-1,"time":1413248193,"description":"Description\nProduct Details\nBook Title: Knowing What To Do: Imagination, Virtue, and Platonism in Ethics\t\nBook Author: Timothy Chappell (Author)\nHardcover: 352 pages\nPublisher: Oxford University Press (May 27, 2014)\nLanguage: English\nISBN-10: 0199684855\nISBN-13: 978-0199684854\n\nBook Description\nTimothy Chappell develops a picture of what philosophical ethics can be like, once set aside from the idealising and reductive pressures of conventional moral theory. His question is 'How are we to know what to do?', and the answer he defends is 'By developing our moral imaginations'. The series of studies presented in Knowing What To Do contribute to the case that the moral imagination is a key part of human excellence or virtue by showing that it plays a wide variety of roles in our practical and evaluative lives. There is no short-cut or formulaic way of knowing what to do; but the longer and more painstaking approach is more rewarding anyway. This approach involves developing our repertoire of natural human capacities for imagination, open deliberation, and contemplative attention to the world, the people, and the reality of value around us.\n\nAbout the Author\nTimothy Chappell is the author of numerous books and articles on ethics, ancient philosophy, epistemology, and philosophy of religion. He has taught at universities including the University of Oxford, the University of British Columbia, the University of East Anglia, and the University of Manchester. Since 2006 he has been Professor of Philosophy at The Open University","torrent":{"xt":"urn:btih:092963b9e7707863d1ea27d34f59521cfa253534","amp;dn":"Timothy+Chappell+-+Knowing+What+To+Do.+Imagination%2C+Virtue%2C+and+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"092963b9e7707863d1ea27d34f59521cfa253534","infoHashBuffer":{"type":"Buffer","data":[9,41,99,185,231,112,120,99,209,234,39,211,79,89,82,28,250,37,53,52]},"announce":[],"urlList":[]}}