{"title":"Malleus Maleficarum - The Witches Hammer  - Published 1486","uid":6580720,"size":5759891,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:096e3aab21056f4822cae2aadb1986567df99693&amp;dn=Malleus+Maleficarum+-+The+Witches+Hammer++-+Published+1486&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"CyrustheVirus1","files":2,"time":1312388504,"description":"Hello All here is another Ebook upload From me :)\n\nThe Malleus Maleficarum was published in 1486 by Heinrich Kramer (Latinised Institoris) and James Sprenger (also known as Jacob or Jakob Sprenger). Scholars have debated how much Sprenger contributed to the work. Some say his role was minor, and that the book was written almost entirely by Kramer, who used the name of Sprenger for his prestige only, while others say there is little evidence for this claim.\n\nIn 1484 Kramer made one of the first attempts at a systematic persecution of witches in the region of Tyrol. It was not a success: Kramer was thrown out of the territory, and dismissed by the local bishop as a &quot;senile old man&quot;. According to Diarmaid MacCulloch, writing the book was Kramer's act of self-justification and revenge. Some scholars have suggested that following the failed efforts in Tyrol, Kramer and Sprenger requested and received a papal bull Summis desiderantes affectibus in 1484. It allegedly gave full papal approval for the Inquisition to prosecute witchcraft in general and for Kramer and Sprenger specifically. Malleus Maleficarum was written in 1484 or 1485 and the papal bull was included as part of the preface.","torrent":{"xt":"urn:btih:096e3aab21056f4822cae2aadb1986567df99693","amp;dn":"Malleus+Maleficarum+-+The+Witches+Hammer++-+Published+1486","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"096e3aab21056f4822cae2aadb1986567df99693","infoHashBuffer":{"type":"Buffer","data":[9,110,58,171,33,5,111,72,34,202,226,170,219,25,134,86,125,249,150,147]},"announce":[],"urlList":[]}}