{"title":"DiRT Rally 2015 (PC)","uid":12931168,"size":21951512592,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:097efd34dc5fcd453d61fdfb43acc0ce4d23aced&amp;dn=DiRT+Rally+2015+%28PC%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"annuaireweb","files":1,"time":1449526846,"description":"Développé par Codemasters et testé sur plus de 90 millions de kilomètres par la communauté DiRT, DiRT Rally est LE jeu de rallye par excellence. Il capture l’essence même des courses de rallye, et ce de manière inégalée. Vous devrez ainsi garder le contrôle de vos émotions, alors que vous foncerez à toute allure sur de dangereuses routes sinueuses, tout en sachant que le moindre faux-pas pourrait mettre en péril votre performance.\r\nChaque étape mettra vos compétences à rude épreuve, que vous dévaliez des routes recouvertes de neige, de glace, de bitume ou de poussière, et ce par tous les temps. À mesure que votre voiture se détériore, vous devrez prendre en considération les dégâts mécaniques que votre équipe s’efforcera de réparer rapidement pour vous maintenir dans la course. Au fil des étapes, chaque rallye devient un véritable marathon de concentration, dans lequel vous devrez accorder une totale confiance à votre copilote pour décrocher le chrono parfait…\r\n\r\n1. Télécharger le jeu.\r\n2. Graver ou monter l'image (Vous pouvez utiliser cet utilitaire de Slysoft).\r\n3. Installer le jeu\r\n4. Copier le contenu du dossier &quot;Crack&quot; dans le répertoire du jeu.\r\n5. Vérifier que vous aviez les derniers pilotes pour la carte graphique.\r\n6. Jouer","torrent":{"xt":"urn:btih:097efd34dc5fcd453d61fdfb43acc0ce4d23aced","amp;dn":"DiRT+Rally+2015+%28PC%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"097efd34dc5fcd453d61fdfb43acc0ce4d23aced","infoHashBuffer":{"type":"Buffer","data":[9,126,253,52,220,95,205,69,61,97,253,251,67,172,192,206,77,35,172,237]},"announce":[],"urlList":[]}}