{"title":"IL-2 Sturmovik Collection","uid":3579136,"size":3822340517,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:09a5f9087bad8d69a6f821f5684c2f03e4d2c6c0&amp;dn=IL-2+Sturmovik+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Jeraqui","files":50,"time":1166436613,"description":" &lt;a href=&quot;http://www.pacific-fighters.com/en/home.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.pacific-fighters.com/en/home.php&lt;/a&gt;\n\n------------------------------------------------------------------------------------\n# IL-2 Sturmovik: Forgotten Battles is a STAND ALONE product\n\n# The Forgotten Battles consists of:\n\n    * 20 single-player missions\n    * 10 multiplayer missions\n    * 5 new maps\n    * Dynamic campaigns that are working on all existing maps of IL-2 Sturmovik and IL-2 Sturmovik: Forgotten Battles\n\n# Forgotten Battles offers all the gameplay of IL-2 Sturmovik, plus many new additions. These include (but are not limited to):\n\n    * 30 new flyable aircraft\n    * 23 new AI-controlled aircraft\n    * New AI ground objects and vehicles for each new map area, with new 3D building models\n    * Ranking and award system for Finnish and Hungarian pilots\n    * Selectable custom user-made skins in single play mode for players and all AI aircraft\n    * All IL-2 Sturmovik: Forgotten Battles aircraft available in Quick Mission Builder, except seaplanes and gliders\n    * Improved flight dynamics\n    * More realistic AI scripting to create more realistic battles\n    * New engine management relating to radiators, superchargers and fuel mixture control for different altitudes\n    * Online track recorder and editor\n    * A New system of single play track recording and editing\n    * Search lights and barrage balloons (including intercommunication with AA artillery)\n    * New ships including the Russian battleship Marat, Russian cruisers Aurora and Kirov and German cruiser Niobe (but not limited to)\n    * Play up to 32 players online in dogfight and in cooperative modes (depending on your internet connection)\n    * IL-2 Sturmovik and IL-2 Sturmovik: Forgotten Battles are not compatible with each other when playing online\n\n# IL-2 Sturmovik: Forgotten Battles includes from the original IL-2 Sturmovik game:\n\n    * All aircraft (including those released for free in add-ons)\n    * All maps\n\n# IL-2 Sturmovik: Forgotten Battles does not include from the original IL-2 Sturmovik game:\n\n    * The single missions\n    * The multiplayer missions\n    * The 3 offline single player campaigns\n \n------------------------------------------------------------------------------------\n\n \t\nIL2 SturmovikTM Forgotten Battles: ACE Expansion Pack is an incredible add-on allowing the Forgotten Battles owners to upgrade drastically their game. With new aircraft, environments, and effects.\n\n    *  New Flyable aircraft - At least 11 flyable aircraft including Ju-87D-3, Hurricane MK I &amp; II and BF-109G-14.\n    * New Non-Flyable aircraft - At least 10 AI aircraft including the Finnish Bristol Blenheim MK I, the IL4 &amp; the Hungarian Ca-1.\n    * 2 unexplored environments - 1 Finnish map area representing the Finnish front and Hungarian map area representing the Balaton Lake area in Hungary.\n    * 2 brand new campaigns - One using the Finnish Map area and One using the Hungarian Map area.\n    * 20 new single missions - 10 in Finland, 10 in Hungary.\n    * 10 exciting cooperative Multiplayer missions - 5 on the Finnish Map area &amp; 5 on the Hungarian Map area.\n    * Dynamic campaign system - Will work with all existing Il-2 maps.\n    * New AI ground objects for each new map area - Includes 3D modelling of new types of buildings for each new map area.\n    * Improvements in flight dynamics ?Featuring additional complex and precise calculations.\n    * Ranking and award campaign system - For Finns and Hungarians.\n    * Resign of AI ? Includes improved AI since Il-2 release. \n\n------------------------------------------------------------------------------------\n\nThe award-winning flight combat from Oleg Maddox?s IL-2 series moves the setting from the Eastern front to the fierce combat of the Pacific theater. Allied fighters and bombers square off against the notorious air power of the Japanese empire. For the first time, a large variety of British aircraft will be included along with the U.S. and Australia. Target enemy ships, vehicles, airfields, and a host of AI-controlled aircraft. Re-enact some of the most famous air battles of WWII in places like Pearl Harbor, Guadalcanal, and Iwo Jima.\n\n    *  Fly a variety of WWII Fighters and Bombers.\n      Fly for the U.S., Japan, Great Britain, and Australia in famous fighters such as the F6F Hellcat, the deadly Japanese Zero, and the UK?s Supermarine Seafire. Flyable bombers such as the Aichi D3A1 Val, G4M2 Betty, SBD Dauntless, and A-20 Havoc are also included. Over 40 flyable aircraft models are available.\n    * Includes new aircraft carriers.\n      For the first time in the 1C: Maddox game series, players will have the option to take-off from, land on, and engage enemy aircraft carriers in combat.\n    * Accessible to players of all skill levels.\n      With its extensive tutorials and customizable settings, the game will be appealing to both beginning and expert pilots. Nearly every level of realism and difficulty can be tuned to fit user tastes.\n    * Award-winning IL-2-style combat-simulation gameplay.\n      As with every product in the IL-2 series, Pacific Fighters offers unparalleled attention to detail. The smart AI, unequaled damage model, and sense of realism combine to immerse players like no other combat flight simulation.\n    * Maps of the most famous battles of the Pacific.\n      16 new maps are included with famous historical locations such as Midway, Okinawa, Pearl Harbor, and Singapore. Wave movements on the beach, volumetric clouds, and thick vegetation are some of the visual attributes that are rendered in detail.\n    * Attack a vast array of targets ranging from railroads to battleships.\n      Ground objects such as trains, trucks, and tanks can all be pounded from the air. Torpedo historically accurate ships, drop parafrags on enemy airfields, and encounter over 100 other targets on the ground and at sea.\n    * An unsurpassed multiplayer option.\n      Take part in massive live engagements on huge maps that feature plane formations, numerous ships, and ground troops in a variety of modes from free-for-all dogfights to multiplayer campaigns. \n\n\n------------------------------------------------------------------------------------\n\n\n\nENJOY :)","torrent":{"xt":"urn:btih:09a5f9087bad8d69a6f821f5684c2f03e4d2c6c0","amp;dn":"IL-2+Sturmovik+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09a5f9087bad8d69a6f821f5684c2f03e4d2c6c0","infoHashBuffer":{"type":"Buffer","data":[9,165,249,8,123,173,141,105,166,248,33,245,104,76,47,3,228,210,198,192]},"announce":[],"urlList":[]}}