{"title":"Misquoting Jesus: The Story Behind Who Changed the Bible and Why","uid":6923376,"size":526912746,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:09ae25b846cd9715b29f19fc3f987b9d252d6ed3&amp;dn=Misquoting+Jesus%3A+The+Story+Behind+Who+Changed+the+Bible+and+Why&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"UncleO","files":-1,"time":1325347044,"description":"When world-class biblical scholar Bart Ehrman first began to study the texts of the Bible in their original languages he was startled to discover the multitude of mistakes and intentional alterations that had been made by earlier translators. In Misquoting Jesus, Ehrman tells the story behind the mistakes and changes that ancient scribes made to the New Testament and shows the great impact they had upon the Bible we use today. He frames his account with personal reflections on how his study of the Greek manuscripts made him abandon his once ultraconservative views of the Bible.\n\nSince the advent of the printing press and the accurate reproduction of texts, most people have assumed that when they read the New Testament they are reading an exact copy of Jesus\\'s words or Saint Paul\\'s writings. And yet, for almost fifteen hundred years these manuscripts were hand copied by scribes who were deeply influenced by the cultural, theological, and political disputes of their day. Both mistakes and intentional changes abound in the surviving manuscripts, making the original words difficult to reconstruct. For the first time, Ehrman reveals where and why these changes were made and how scholars go about reconstructing the original words of the New Testament as closely as possible.\n\nEhrman makes the provocative case that many of our cherished biblical stories and widely held beliefs concerning the divinity of Jesus, the Trinity, and the divine origins of the Bible itself stem from both intentional and accidental alterations by scribes -- alterations that dramatically affected all subsequent versions of the Bible.\n\n\nThis torrent contains the complete unabridged audiobook.  \n","torrent":{"xt":"urn:btih:09ae25b846cd9715b29f19fc3f987b9d252d6ed3","amp;dn":"Misquoting+Jesus%3A+The+Story+Behind+Who+Changed+the+Bible+and+Why","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09ae25b846cd9715b29f19fc3f987b9d252d6ed3","infoHashBuffer":{"type":"Buffer","data":[9,174,37,184,70,205,151,21,178,159,25,252,63,152,123,157,37,45,110,211]},"announce":[],"urlList":[]}}