{"title":"Introduction to Modern Cryptography{BBS}","uid":6624838,"size":39556346,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a09dda5705009d311a385328ded8a7221adcf42&amp;dn=Introduction+to+Modern+Cryptography%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314119767,"description":"Cryptography plays a key role in ensuring the privacy and integrity of data and the security of computer networks. Introduction to Modern Cryptography provides a rigorous yet accessible treatment of modern cryptography, with a focus on formal definitions, precise assumptions, and rigorous proofs.\n\nThe authors introduce the core principles of modern cryptography, including the modern, computational approach to security that overcomes the limitations of perfect secrecy. An extensive treatment of private-key encryption and message authentication follows. The authors also illustrate design principles for block ciphers, such as the Data Encryption Standard (DES) and the Advanced Encryption Standard (AES), and present provably secure constructions of block ciphers from lower-level primitives. The second half of the book focuses on public-key cryptography, beginning with a self-contained introduction to the number theory needed to understand the RSA, Diffie-Hellman, El Gamal, and other cryptosystems. After exploring public-key encryption and digital signatures, the book concludes with a discussion of the random oracle model and its applications.\n\nServing as a textbook, a reference, or for self-study, Introduction to Modern Cryptography presents the necessary tools to fully understand this fascinating subject.\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 552 pages\n    * Publisher: Chapman and Hall/CRC; 1 edition (August 31, 2007)\n    * Language: English\n    * ISBN-10: 1584885513\n    * ISBN-13: 978-1584885511","torrent":{"xt":"urn:btih:0a09dda5705009d311a385328ded8a7221adcf42","amp;dn":"Introduction+to+Modern+Cryptography%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a09dda5705009d311a385328ded8a7221adcf42","infoHashBuffer":{"type":"Buffer","data":[10,9,221,165,112,80,9,211,17,163,133,50,141,237,138,114,33,173,207,66]},"announce":[],"urlList":[]}}