{"title":"Marvel NOW! Week 75 (4/23/2014) (darkhomr) [ALL]","uid":10030248,"size":558625786,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0a16b8bb910fd0d18916311e5be4c45dfd7ce493&amp;dn=Marvel+NOW%21+Week+75+%284%2F23%2F2014%29+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"dadrkhomr","files":13,"time":1398330224,"description":"Welcome to the 2014 version of Marvel NOW!  Week after week I will be bringing you the latest in comics in the Marvel NOW universe as well as the All-New Marvel NOW stories.  Can you believe we are 75 weeks in the Marvel NOW and they are putting out an ALL NEW version of the titles?  What will NOT be included is Disney stuff, TV stuff, and the kids books. Those will be included (when available) in my Total Marvel pack.\n\nThis weeks' release (April 23, 2014) includes 13 issues with 2 new #1's (Elektra and Original Sin)  \n\nMy release packs are as follows: \n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\nAll New Invaders #4 (CBR 4/23/2014)\n\n&quot;GODS AND SOLDIERS&quot; PART FOUR THE INVADERS incursion into Hala, the Kree Homeworld, has begun . . . and already our heroes are in trouble. Now the team must fight a Kree-controlled God, but which God? From which pantheon? And how can they defeat an immortal with unlimited power? See NAMOR unleashed, CAPTAIN AMERICA fight and THE HUMAN TORCH turn up the heat!!! And what is the dangerous side mission that only WINTER SOLDIER and AARKUS THE GOLDEN AGE VISION can complete? \n\nAvengers Undercover #3 (CBR 4/23/2014)\n\nFACE-TO-FACE WITH ARCADE! What happens when the Murder World survivors confront their former captor? Hint: Someone doesn't survive! \n\nDaredevil #2 (CBR 4/23/2014)\n\nDaredevil's in over his head in his new hometown, which isn't at all as he remembers it! New threats, new obstacles . . . and a forgotten Marvel hero steps from the shadows to make him feel MOST unwelcome! \n\nElektra #1 (CBR 4/23/2014)\n\nWitness the beautifully violent return of the world's deadliest assassin. A life spent in silent pain has led Elektra to the precipice of despair. As she prepares to shed her past and take her next step, everything you know about her will change! Death is no escape, but she will find her way as a new option opens up that will take Elektra to places no other Marvel character can go. \n\nFantastic Four #3 (CBR 4/23/2014)\n\n&quot;THE FALL OF THE FANTASTIC FOUR&quot; PART 3 The FANTASTIC FOUR were victorious defending Manhattan from inter-dimensional invasion but at a terrible cost!!! Is this 'Flame Off' forever for the HUMAN TORCH? Introducing a new stronger, deadlier version of the WRECKING CREW!!! \n\nGuardians of the Galaxy #14 (CBR 4/23/2014)\n\n100th issue ANIVERSARY CELEBRATION! 45 years in the making! It's finally here!!! The 100th issue of Guardians of the Galaxy! (Okay it's actually the 101st, but we had an X-Men crossover to get through! Sheesh!) It's an all-star celebration of the most popular super team of 2014 as cosmic captain Brian Michael Bendis welcomes Nick Bradshaw (WOLVERINE AND THE X-MEN) to the team! As the GOTG gets ready for new members VENOM and CAPTAIN MARVEL, there are unexpected dangers that promise to tear the team to its core. Plus in this special double sized anniversary issue . . . two special back up stories by former GOTG writers Dan Abnett and Andy Lanning! \n\nIron Patriot #2 (CBR 4/23/2014)\n\n&quot;UNBREAKABLE&quot; PART 2 Who is controlling the IRON PATRIOT suit? The conspiracy to destroy America from within grows. And . . . James Rhodes dies!?! \n\nOriginal Sin #0 (CBR 4/23/2014)\n\nIT'S THE PROLOGUE TO THE BIGGEST MARVEL SERIES OF THE SUMMER! WHO IS THE WATCHER? That's what Nova is wondering after his latest brush with the moon-dwelling enigma he's encountered before! But what he discovers will have a profound effect on the young hero, as well as priming the pump for the most cataclysmic event in Marvel history! WHAT DID HE SEE? \n\nSavage Wolverine #17 (CBR 4/23/2014)\n\nLogan stands between an innocent family and a corrupt time! What is the secret of Grand Rapids? And how is it connected to Logan? Richard Isanove (THE DARK TOWER) concludes his most brutal tale in the life of Wolverine! \n\nSuperior Spider-Man Team Up #12 (CBR 4/23/2014)\n\nAs THE AMAZING SPIDER-MAN Returns, flashback to a never before revealed team-up between Doctor Octopus and Peter Parker that sheds new light on their violent relationship. \n\nThunderbolts #25 (CBR 4/23/2014)\n\nThe Tbolts turn adventurer as they trek into Central America! Thrill, chills, and romance in the heart of the jungle! A mysterious power that's too much for anyone to contain! \n\nUncanny Avengers #19 (CBR 4/23/2014)\n\nAVENGE THE EARTH Continues! Kang's Chronos Corps arrives on Planet X with a terrible offer! The former members of the Uncanny Avengers must reunite to save the Earth! Magneto's all-new X-Force are out for the blood of a Summers! \n\nWhat If Age Of Ultron #4 (of 5) (CBR 4/23/2014)\n\nTRI-CENTENNIAL BATTLES! In a world without Captain America, the United States has lost its spirit, its inspiration. A secret cabal unites to create a new Captain America in the nation's most trying time. The war veteran Frank Castle is transformed into something far more than he ever imagined--but not everyone is Steve Rogers . . . \n\n\n\n","torrent":{"xt":"urn:btih:0a16b8bb910fd0d18916311e5be4c45dfd7ce493","amp;dn":"Marvel+NOW%21+Week+75+%284%2F23%2F2014%29+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a16b8bb910fd0d18916311e5be4c45dfd7ce493","infoHashBuffer":{"type":"Buffer","data":[10,22,184,187,145,15,208,209,137,22,49,30,91,228,196,93,253,124,228,147]},"announce":[],"urlList":[]}}