{"title":"Dr. David R. Hawkins - The Highest Level of Enlightenment","uid":4784835,"size":343495441,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0a392c515bd927382241a3d198eb5cb1fdc3521b&amp;dn=Dr.+David+R.+Hawkins+-+The+Highest+Level+of+Enlightenment&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"orotnref","files":-1,"time":1237511807,"description":"Dr. David R. Hawkins - The Highest Level of Enlightenment\n\nAbout The Highest Level of Enlightenment\n\nScientific blueprint for enlightenment spearheads a major\njump in spiritual knowledge! Acclaimed by Nobel Prize\nwinners and world leaders, it is described by experts\nas &quot;breathtaking!&quot;\n\nDavid Hawkins, M.D., Ph.D, conducted a 29-year study that demonstrated that the human body becomes stronger or weaker depending on a person's mental state. He created a scale from 1-1000 that mapped human consciousness. Furthermore, he demonstrated that this map can be used as a blueprint to reach higher states of consciousness that can be identified simply by applying a small amount of pressure on an outstretched arm!\n\nDr. Hawkins' research is based on a well-established science called kinesiology, which has to do with the testing of an all-or-none muscle response stimulus. A positive stimulus generates a strong muscle response and a negative stimulus results in a demonstrable weakening of the test muscle. Clinical kinesiological muscle testing as a diagnostic technique has been verified widely over the past 25 years.\n\nNot only that, but this simple method has also been demonstrated to be an effective tool for instantly calibrating human consciousness. Hawkins created a scale of consciousness based on current discoveries in advanced theoretical physics and the nonlinear dynamics of chaos theory. And this &quot;map of consciousness&quot; now makes it possible for anyone to advance toward higher levels of enlightenment faster than ever imagined!\n\nAfter listening to this program, you'll be able to:\n\nAdvance your level of consciousness and your understanding of human behavior, just by learning the map of consciousness.\n\nGain instant access to information that is beyond the capacity of all the world's computers.\n\nDetect the exact point in any complex system where the least effort brings about the greatest result.\n\nUnderstand the power of a simple attitude adjustment as well as the consequences of various emotional states.\n\nLearn how people who calibrate high on the map of consciousness can raise the energy level and calibration of thousands of others just by being in their presence!\n\nHeal yourself of illness or addiction by reaching the state of consciousness in which it vanishes.\n\nLearn which foods, environments, companies, books, etc. are harmful (low energy) and which are beneficial (high energy).\n\nDiscover the truth or falsity of any statement, irrespective of your opinions or feelings about it.\n\nAnd much more!\n\n\n\n\n\nGloria in Excelsis Deo!\n\n\n\n\n~*~*~ Please Seed For As Long As Possible ~*~*~\n\n\n\nDR. DAVID R. HAWKINS\nBiography Summary\n\nSir David R. Hawkins, M.D., Ph.D. is a nationally renowned psychiatrist, physician, researcher, and lecturer. He co-authored the ground-breaking work, Orthomolecular Psychiatry with Nobel Laureate Linus Pauling, that helped revolutionize psychiatry. His national television appearances include The MacNeil/Lehrer News Hour, The Barbara Walters Show, and The Today Show. Winner of the Huxley Award, knighted by the Sovereign Order of the Hospitaliers of St. John of Jerusalem, nominated for the Templeton Prize and honored in the East with the title &quot;Tae Ryoung Sun Kak Tosa&quot; (Foremost Teacher of the Way to Enlightenment), Dr. Hawkins' honors are vast. His background is detailed in Who's Who in America and Who's Who in the World, and his work has been acclaimed by many world leaders and Nobelists, including Mother Teresa.\n\nDr. Hawkins has lectured at the University of Argentina; Notre Dame, Stanford, and Harvard Universities; Westminster Abbey; and the Oxford Forum. In addition, he has been an advisor to Catholic, Protestant, and Buddhist monasteries. He has conferred with foreign governments on international diplomacy and has been instrumental in resolving long-standing conflicts that were major threats to world peace. He is the author of the best-selling trilogy, Power vs. Force (published in 17 languages), The Eye of the I, and I: Reality and Subjectivity, and four additional books, including Truth vs. Falsehood, Transcending the Levels of Consciousness, Discovery of the Presence of God and Spirituality and Modern Man.\n\n\n\n~*~*~ Please Seed For As Long As Possible ~*~*~\n\n\n","torrent":{"xt":"urn:btih:0a392c515bd927382241a3d198eb5cb1fdc3521b","amp;dn":"Dr.+David+R.+Hawkins+-+The+Highest+Level+of+Enlightenment","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a392c515bd927382241a3d198eb5cb1fdc3521b","infoHashBuffer":{"type":"Buffer","data":[10,57,44,81,91,217,39,56,34,65,163,209,152,235,92,177,253,195,82,27]},"announce":[],"urlList":[]}}