{"title":"Words Fail Me - Patricia T. O'Conner","uid":9979378,"size":220266,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a5ec00ff6370270f57fbaf384e2561826ae8e22&amp;dn=Words+Fail+Me+-+Patricia+T.+O%27Conner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1397716302,"description":"Words Fail Me: What Everyone Who Writes Should Know about Writing by Patricia T. O'Conner\n\nA fun, focused guide to making words work for you\n\nWhether you are working on the novel that's been in the back of your mind for years or simply facing an increasing demand to write well at work or school, the fact remains: we all write more often these days, be it reports, e-mails, blog posts, or texts. But despite the increase in written communication, the fundamentals of good writing have been lost. Grammar maven Patricia T. O'Conner comes to the rescue with the most painless, practical, and funny writing book ever written. In short, snappy chapters filled with crystal-clear examples, amusing comparisons, and humorous allegories that cover everything from &quot;Pronoun Pileups&quot; and &quot;Verbs That Zing&quot; to &quot;What to Do When You're Stuck,&quot; O'Conner provides simple, straightforward tips to help you sort through your thoughts and make your sentences strong.\n\nReview\nPatricia T. O'Conner's Words Fail Me is written in the same lighthearted tone as her snappy grammar guide, Woe Is I. This time out, O'Conner tackles the writer's art. &quot;Good writing,&quot; she says, &quot;is writing that works.&quot; This book is the perfect text for the novice writer who tends to gravitate toward comedic instructors. &quot;Crummy spelling,&quot; says O'Conner, &quot;is more noticeable than crummy anything else.&quot; Organizing your material &quot;may be a pain in the butt, but it's thankless, too!&quot; &quot;Write as though you were addressing someone whose opinion you value, even if the reader is ... a stingy insurance company that won't pay for your tummy tuck.&quot; O'Conner's material isn't new--like many such books, Words Fail Me advocates the use of small words, fresh verbs, and only well-chosen modifiers--but rarely is a primer so amusing. And the clever titles strewn throughout--&quot;Taking Leave of Your Tenses,&quot; &quot;The It Parade&quot;--provide added pleasure, particularly for anyone who knows how hard it can be to put a headline on a piece of writing. --Jane Steinberg","torrent":{"xt":"urn:btih:0a5ec00ff6370270f57fbaf384e2561826ae8e22","amp;dn":"Words+Fail+Me+-+Patricia+T.+O%27Conner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a5ec00ff6370270f57fbaf384e2561826ae8e22","infoHashBuffer":{"type":"Buffer","data":[10,94,192,15,246,55,2,112,245,127,186,243,132,226,86,24,38,174,142,34]},"announce":[],"urlList":[]}}