{"title":"Wes Montgomery - Talkin' Verve (Roots of Acid Jazz)@320","uid":4095151,"size":209590672,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0aa1769c4f50fa73bb4f9e16787b74e14f5601ca&amp;dn=Wes+Montgomery+-+Talkin%5C%27+Verve+%28Roots+of+Acid+Jazz%29%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"alekow1","files":25,"time":1206279981,"description":"The title of this compilation tries to make Montgomery viable for a younger generation, but it&amp;#039;s not exactly &quot;acid jazz.&quot; Rather, it&amp;#039;s an anthology of some of Montgomery&amp;#039;s better pop- and soul-oriented material from the mid-&amp;#039;60s. The 16 tracks show Montgomery in both orchestral and small combo settings, a few cuts taken from his collaborations with Jimmy Smith. Purists have long disdained this phase of Montgomery&amp;#039;s career. But those who don&amp;#039;t measure work by how straight-ahead it is will find much to enjoy here, in either the cuts with Oliver Nelson&amp;#039;s orchestra, or the less elaborate sessions with the likes of Smith, Grady Tate, Ron Carter, and Ray Barretto.\n\n\n\n\n1   Movin&amp;#039; Wes - Part 1 (3:28) \n2   Movin&amp;#039; Wes - Part 2 (2:51)     Orchestra - Johnny Pate&amp;#039;s Orchestra \n3   Bumpin&amp;#039; On Sunset (4:49)     Orchestra - Claus Ogerman&amp;#039;s Orchestra \n4   Green Peppers (2:55)     Orchestra - Don Sebesky&amp;#039;s Orchestra \n5   O.G.D. (Aka &quot;Road Song&quot;) (6:05) \n6   In An Out (2:49) \n7   Impressions (5:02) \n8   13 (Aka &quot;Death March&quot;) (5:19)     Orchestra - Don Sebesky&amp;#039;s Orchestra \n9   The Thumb (4:48) \n10   Boss City (3:43)     Orchestra - Oliver Nelson&amp;#039;s Orchestra \n11   Sunny (4:02) \n12   Mr. Walker (3:38)     Orchestra - Don Sebesky&amp;#039;s Orchestra \n13   Bumpin&amp;#039; (6:50)     Orchestra - Don Sebesky&amp;#039;s Orchestra \n14   Willow Weep For Me (7:35) \n15   Tequila (3:21) \n16   Night Train (6:46)     Orchestra - Oliver Nelson&amp;#039;s Orchestra\n\n\nPersonnel:\n\n Wes Montgomery (guitar); Don Sebesky (conductor, arranger); Jack Jennings (vibraphone); Wynton Kelly (piano); Jimmy Smith (organ); Paul Chambers, Ron Carter, Richard Davis (bass); Grady Tate, Jimmy Cobb (drums); Ray Barretto (conga).\n\nJohnny Pate&amp;#039;s Orchestra includes: Johnny Pate (conductor, arranger); Ernie Royal, Clark Terry, Snooky Young (trumpet); Jimmy Cleveland, Urbie Green, Quentin Jackson, Chauncey Welsch (trombone); Bobby Scott (piano); Bob Cranshaw (bass); Grady Tate (drums).\n\nClaus Ogerman&amp;#039;s Orchestra includes: Claus Ogerman (conductor, arranger); Bernard Eichen, Arnold Eidus, Paul Gershman, Emanuel Green, Julius Held, Harry Lookofsky, Joe Malin, Gene Orloff (violin); Abe Kessler, Charles McCracken, George Ricci, Harvey Shapiro (cello); Cedar Walton (piano); Grady Tate (drums); Ray Barretto (conga).\n\nDon Sebesky&amp;#039;s Orchestra includes: Don Sebesky (conductor, arranger); Stan Webb (alto &amp; baritone saxophones, English horn, clarinet); Ray Beckenstein (alto saxophone, flute, piccolo); Walter Kane (baritone saxophone, clarinet, bassoon); Mel Davis, Bernie Glow, Jimmy Nottingham (trumpet); Wayne Andre, John Messner, Bill Watrous (trombone); James Buffington (French horn); Don Butterfield (tuba); Arnold Eidus, Lewis Eley, Paul Gershman, Louis Haber, Julius Held, Harry Lookofsky, Joe Malignaggi, Gene Orloff, Sol Shapiro (violin); Harold Coletta, David Schwartz (cello); George Ricci, Charles McCracken (cello); Margaret Ross (harp); Herbie Hancock, Roger Kellaway (piano); Richard Davis, Bob Cranshaw (bass); Grady Tate (drums); Ray Barretto (conga).\n\nOliver Nelson&amp;#039;s Orchestra includes: Oliver Nelson (conductor, arranger); Jerry Dodgion (alto saxophone, flute, clarinet); Phil Woods (alto saxophone, clarinet); Bob Ashton (tenor saxophone, flute, clarinet); Romeo Penque (tenor saxophone); Danny Bank (baritone saxophone, flute, clarinet, bassoon); Clark Terry (trumpet, flugelhorn); Jimmy Maxwell, Joe Newman, Ernie Royal, Donald Byrd, Danny Moore (trumpet); Jimmy Cleveland, Dick Hixson, Quentin Jackson, Melba Liston, Wayne Andre, Tony Studd (trombone); Jerome Richardson (flute, clarinet); Jimmy Smith (organ); Richard Davis, George Duvivier (bass); Grady Tate (drums); Ray Barretto (conga).\n\nCompilation producer: Aric Lach Morrison.\nPrincipally recorded at Van Gelder Recording Studio, Englewood Cliffs, New Jersey between 1964 and 1966. \nIncludes liner notes by Bill Milkowski.\nLabel: Verve Records\nReleased: 1996\n\n\nBITRATE: 320\n\nMy cd-rips (EAC and Lame)\nCovers Included\n\n\n\nEnjoy,Seed and Share\t\n","torrent":{"xt":"urn:btih:0aa1769c4f50fa73bb4f9e16787b74e14f5601ca","amp;dn":"Wes+Montgomery+-+Talkin%5C%27+Verve+%28Roots+of+Acid+Jazz%29%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0aa1769c4f50fa73bb4f9e16787b74e14f5601ca","infoHashBuffer":{"type":"Buffer","data":[10,161,118,156,79,80,250,115,187,79,158,22,120,123,116,225,79,86,1,202]},"announce":[],"urlList":[]}}