{"title":"Emma - Miniserie Capitulo 1 y 2 HDTV DVB Spanish","uid":5651880,"size":920784024,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0b04eee13ead81213c6a9326984dbccccf71dd07&amp;dn=Emma+-+Miniserie+Capitulo+1+y+2+HDTV+DVB+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Mois20","files":2,"time":1277663308,"description":"Romola Garai (&quot;Atonement&quot;, Vanity Fair) interpreta a la hermosa e inteligente Emma Woodhouse en esta divertida y fresca adaptaciÃƒÂ³n de la obra maestra de Jane Austen, rodada en el verano de 2009 en Inglaterra.Adaptada por la ganadora del BAFTA Sandy Welch (Jane Eyre), esta entretenida serie producida por BBC nos muestra a uno de los personajes mÃƒÂ¡s complejos y enrevesados de la escritora inglesa. La historia se sitÃƒÂºa en el pequeÃƒÂ±o mundo provincial de Highbury. Su protagonista, Emma, estÃƒÂ¡ convencida de que es una experta casamentera y repetidamente intenta emparejar a sus amigos y conocidos. Durante cuatro episodios de una hora de duraciÃƒÂ³n, este drama nos enseÃƒÂ±a las terribles consecuencias de los fracasos de Emma en una inteligente narraciÃƒÂ³n de superaciÃƒÂ³n y autodescubrimiento personal.El productor ejecutivo de la miniserie es Phillippa Giles (Jane Eyre), el director Jim OÃ‚Â¿Hanlon (House of Saddam) y el productor es George Ormond (Testigo silencioso, EastEnders).AdemÃƒÂ¡s de Romola Garai, Emma cuenta con la participaciÃƒÂ³n de Michael Gambon (Harry Potter) en el papel del padre neurÃƒÂ³tico de Emma; Jonny Lee Miller (Eli Stone, Trainspotting) como el seÃƒÂ±or Knightley, el vecino atractivo de la joven; Jodhi May (El ÃƒÂºltimo mohicano) como la seÃƒÂ±orita Taylor; Robert Bathurst (Cold Feet) como el seÃƒÂ±or Weston y Tamsin Greig (El diario de Anna Frank) como la parlanchina Miss Bates.","torrent":{"xt":"urn:btih:0b04eee13ead81213c6a9326984dbccccf71dd07","amp;dn":"Emma+-+Miniserie+Capitulo+1+y+2+HDTV+DVB+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b04eee13ead81213c6a9326984dbccccf71dd07","infoHashBuffer":{"type":"Buffer","data":[11,4,238,225,62,173,129,33,60,106,147,38,152,77,188,204,207,113,221,7]},"announce":[],"urlList":[]}}