{"title":"My.Kitchen.Rules.s06e12.WS.PDTV.x264.BF1.mkv","uid":11709396,"size":642632383,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0b3b309b833d0681f02432d4ce1bc3953e7883b6&amp;dn=My.Kitchen.Rules.s06e12.WS.PDTV.x264.BF1.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"bigfish5","files":1,"time":1424221000,"description":"My Kitchen Rules Australia Series 6 Episode 12\n\nIt's off to South Australia for mother and daughter duo, Vicky and Celine's Instant Restaurant. They may be big deals in Adelaide but will they be able to take the pressure and impress the judges? Hosted by Pete Evans and Manu Feildel.\n\nVicky and Celine South Australia\nWe're a big deal in Adelaide. We would say we're celebrities. \nMy Kitchen Rules has its first celebrity team.\n&quot;We're a big deal in Adelaide. There's not a lot of people who don't know us,&quot; says Celine. &quot;We would say we're celebrities.&quot;\nCeline has entered the competition with her mother Vicky, who is here to share the recipes perfected by her 77-year- old dad Anthony, who was the head chef at The Greek restaurant in Adelaide for a long time.\nRetired now, Celine says her Papa still cooks every day. &quot;He cooks for everyone even if we don't go there. He'll ring up and say, 'Darling I have cooked. You need to come and eat please.'&quot;\nIt's Vicky's dream to write a cookbook featuring many of her dad's creations, while crafting more of her own along with Celine to add to the collection.\nDespite their Greek heritage, Vicky and Celine venture into a lot of different cuisines in addition to Greek, inspired by chefs such as Curtis Stone, Jamie Oliver and Nigella Lawson.\nWhile Celine loves Italian flavours, Vicky is also keen on exploring some more exotic cooking combinations.\n&quot;We've just gotten into Persian and Moroccan food too. We like anything that's a little bit different. And we love eating Thai food. I don't cook as much of it; I'd rather go out and eat it,&quot; says Vicky.\nCeline, 20, applied for the show without telling Vicky, 49. &quot;I did it because mum and I always cook. That's what brings us together. In the kitchen we cook together and it's a passionate thing in our whole family.&quot;\nLeaving older daughter Yvonne at home, Vicky says she would've loved to have both her daughters by her side for MKR.\n&quot;It would've been good if we could've bought all three of us because she could've done the desserts,&quot; she says.\n&quot;And cleaned up after us because I make a lot of mess,&quot; adds Celine.\nWhile sweets aren't their specialty, Celine and Vicky say they more than make up for it with their savoury dishes.\n&quot;Even if the dish isn't pretty you're going to overlook that because it has the flavour,&quot; says Vicky. &quot;There's no point in it looking pretty if it's not going to taste good. So we're about flavour above everything else.&quot;\nAnd if Celine doesn't get a tasty dish served up to her in return, she won't be shy about letting you know.\n&quot;If the food I'm eating isn't good or to what I expect, I don't mind sending it back,&quot; she confesses. &quot;We have our opinions. I think that's the whole point, to learn from each other and to do that you have to be honest.&quot;\nIn addition to cooking, Vicky loves florestry and works part- time in a flower market and Celine is a competitive soccer player studying a police course at Tafe.\nProudly, they think their relationship is their strength in the competition.\n&quot;We're funny,&quot; says Vicky. &quot;Extremely funny. Celine is the entertainer. She's a comedienne. And we work really well together. She's positive. She gets things done. She's very thorough.&quot;\nThey might fight a bit in the kitchen, but at the end of the day Celine admits you can't really break up with your mum","torrent":{"xt":"urn:btih:0b3b309b833d0681f02432d4ce1bc3953e7883b6","amp;dn":"My.Kitchen.Rules.s06e12.WS.PDTV.x264.BF1.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b3b309b833d0681f02432d4ce1bc3953e7883b6","infoHashBuffer":{"type":"Buffer","data":[11,59,48,155,131,61,6,129,240,36,50,212,206,27,195,149,62,120,131,182]},"announce":[],"urlList":[]}}