{"title":"Unconquered (1947) Xvid 1cd - Western Adventure - Gary Cooper, P","uid":10592923,"size":733782016,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0b5544cfaf6e54f1623b2acb7b390c51e93ab93c&amp;dn=Unconquered+%281947%29+Xvid+1cd+-+Western+Adventure+-+Gary+Cooper%2C+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"SaM","files":-1,"time":1405821233,"description":"Unconquered (1947) Xvid 1cd - Western - Gary Cooper, Paulette Goddard [DDR]\n\nUnconquered is a 1947 adventure film produced and directed by Cecil B. DeMille, released by Paramount Pictures, and starring Gary Cooper and Paulette Goddard. The film depicts the violent struggles between American colonists and Native Americans on the western frontier in the mid-18th century during the time of Pontiac's Rebellion, primarily around Fort Pitt (modern-day Pittsburgh). \nThe film cost $4 million, $1 million of which was spent on the actors salaries. The salary costs were the largest in de Mille's career to date.\n\n    CAST:-\n    Gary Cooper as Captain Christopher Holden\n    Paulette Goddard as Abigail 'Abby' Martha Hale\n    Howard Da Silva as Martin Garth\n    Boris Karloff as Chief Guyasuta\n    Cecil Kellaway as Jeremy Love\n    Ward Bond as John Fraser\n    Virginia Campbell as Mrs. Fraser\n    Katherine DeMille (the director's daughter) as Hannah\n    Henry Wilcoxon as Capt. Steele\n    C. Aubrey Smith as Lord Chief Justice\n    Victor Varconi as Capt. Simeon Ecuyer\n    Virginia Grey as Diana\n    Mike Mazurki as Dave Bone\n    Porter Hall as Leach\n    Matthew Boulton as Captain Brooks\n    Richard Gaines as Colonel George Washington\n\nProduced and Directed by Cecil B. DeMille\nMusic by Victor Young\nRunning time 146 min.\n\nPlot summary\nBased on Neil Swanson's Unconquered, a Novel of the Pontiac Conspiracy, the film focuses on &quot;Abby&quot; Hale (Paulette Goddard), who is condemned to death by a British court, then offered clemency if she will become an indentured servant in America. There is a bidding competition between Captain Christopher Holden (Gary Cooper) and Martin Garth (Howard Da Silva), which Holden wins. He then sets her free. Unfortunately, Garth is a sore loser; he kidnaps Abby and takes her to the western frontier, where he is involved in illegal arms sales to the Native Americans. Soon, Holden becomes involved in the conflict with the warring tribes and is reunited with Abby; he also has further confrontations with Garth and his henchman (Mike Mazurki).\n\nThe &quot;White Slave&quot; letter\nThe original Neil Swanson novel, on which the film was based, was prefaced by an excerpt from a genuine historical document, providing much of the background: a letter concerning the Holdens of Virginia, written by one of their descendants in the frontier village of St. Anthony in Minnesota, at the great falls of the Mississippi, in the summer of 1862 - a century after the time of the plot.\n\n    &quot;My great-grandmother was a slave. She was white. She was an English girl. Yet she was exhibited and sold at auction, not by barbarous Algerian but by the brutal laws of her own people. For it was even possible, in those days, for a man who had grown weary of his wife to put a rope around her neck, lead her to a public market, and there sell her.\n\n    This girl was a virgin. She was accused of murder, tried, found guilty, sentenced to the gallows-and then given the harsh choice of death by hanging or of slavery. (In a court in London) To live was to hope. She chose life, and so became the property of a man who lusted for her, though he had a wife.\n\n    She was young when these things happened-only seventeen-and it is said that she was very lovely. I tell you of her so that you may see how far a journey we have come from the day when, in America, a white girl could be sold and bought as you would sell or buy a cow, a horse, a dog - could be lawfully and publicly stripped naked, whipped, shamed, and degraded&quot; \n\nTECHNICAL SPECIFICATIONS:-\nVideo Bitrate: 1295 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: English\nRunTime: 146 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]   \nDuration: 146 mins","torrent":{"xt":"urn:btih:0b5544cfaf6e54f1623b2acb7b390c51e93ab93c","amp;dn":"Unconquered+%281947%29+Xvid+1cd+-+Western+Adventure+-+Gary+Cooper%2C+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b5544cfaf6e54f1623b2acb7b390c51e93ab93c","infoHashBuffer":{"type":"Buffer","data":[11,85,68,207,175,110,84,241,98,59,42,203,123,57,12,81,233,58,185,60]},"announce":[],"urlList":[]}}