{"title":"Coats &amp; Schauberger - The Energy Evolution - Harnessing Free Ene","uid":3494269,"size":10606743,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b60583d221d3e34eb4b983bede0292aaa209b2f&amp;dn=Coats+%26+Schauberger+-+The+Energy+Evolution+-+Harnessing+Free+Ene&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"red_gonzo","files":1,"time":1149938184,"description":"British architect Callum Coats edited and translated this book from Viktor Schauberger&amp;#039;s works with the full title The Energy Evolution - Harnessing Free Energy from Nature (2000). Schauberger, a famous austrian natural philosopher, predicted the ecological catastrophes which are occuring all around us and proposed the solution - return to the principles of mother nature.  Among other topics discussed here, this particular book lays out the philosophy of implosion which is nature&amp;#039;s own way to make things move without destroying them as our current technology does via explosion. Many applications of implosion technology are discussed which can be constructed and used in our homes to provide clean ways of harnessing nature&amp;#039;s gigantic energy potential. 260 pages, many pictures. A must read for everyone.\n\nFrom the backcover:\nThis final volume in the Eco-technology series deals with generation of energy using Nature&amp;#039;s enormous potential. Nature produces energy by slow, cool, implosive means - by a centripetal inward motion, while our present culture uses explosive centrifugal (outwards) movement, which is wasteful and many times less powerful and effective. It also uses up the Earth&amp;#039;s resources and pollutes her ecosystems.\nThis volume describes different kinds of energy machines which depend on the principle of implosion:\n? a spring water-producing machine\n? a tornado home energy generator\n? a Klimator which produces mountain-quality air\n? the biotechnical submarine\n? a technique for producing power from ocean deeps\n? a flying saucer prototype which rose at fantastic speed to high altitudes\n? a perpetual motion suction-based implosion machine\n","torrent":{"xt":"urn:btih:0b60583d221d3e34eb4b983bede0292aaa209b2f","amp;dn":"Coats+%26+Schauberger+-+The+Energy+Evolution+-+Harnessing+Free+Ene","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b60583d221d3e34eb4b983bede0292aaa209b2f","infoHashBuffer":{"type":"Buffer","data":[11,96,88,61,34,29,62,52,235,75,152,59,237,224,41,42,170,32,155,47]},"announce":[],"urlList":[]}}