{"title":"East 17 - Around The World Hit Singles-The Journey So Far - (199","uid":4290637,"size":176163511,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0bc324aa0590f56cb817d3d77bd634f557adc1db&amp;dn=East+17+-+Around+The+World+Hit+Singles-The+Journey+So+Far+-+%28199&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"seanprince","files":27,"time":1215886665,"description":"East 17 - Around The World  Hit Singles-The Journey So Far - (1996)[EAC-MP3@320KBPS]\n\nTrack list\n\nEast Seventeen - Around The World: Hit Singles-The Journey So Far\n\n01.\tHouse Of Love (Pedigree Mix)\t\t\t04:40\n02.\tDeep (Breath Mix)\t\t\t\t04:01\n03.\tIt&amp;#039;s Alright (Guvnor Mix)\t\t\t04:41\n04.\tStay Another Day (S.A.D. Mix)\t\t\t04:27\n05.\tSteam (Vapoureyes Mix)\t\t\t\t03:23\n06.\tLet It Rain (Thunder Radio Edit)\t\t03:33\n07.\tSlow It Down (Perpetual Motion)\t\t\t04:45\n08.\tIf You Ever (Featuring Gabrielle)\t\t04:14\n09.\tWest End Girls (Faces On Posters Mix)\t\t04:27\n10.\tAround The World (Ourworld Master 7&amp;#039;&amp;#039; Inch)\t04:37\n11.\tThunder (Radio Edit)\t\t\t\t04:16\n12.\tGold (7&amp;#039;&amp;#039; Collar Size)\t\t\t\t04:20\n13.\tDo U Still? (Single Remix)\t\t\t04:18\n14.\tSomeone To Love (Summer Of Love Mix)\t\t04:00\n15.\tHey Child\t\t\t\t\t04:33\n16.\tHold My Body Tight (7&amp;#039;&amp;#039; Radio Edit)\t\t03:39\n17.\tStay Another Day (Less Sad Mix)\t\t\t03:35\n\nBiography\tby Stephen Thomas Erlewine\n\nWith the notable exception of Take That, East 17 were the most successful teen-oriented dance-pop band in Britain of the early &amp;#039;90s. Led by songwriter Tony Mortimer, the group initially tried to emulate American rap and hip-hop, before settling down into a commercial fusion of new jack R&amp;B, hip-hop beats, rap, and pop melodies. The stylish, accessible blend of dance music, plus the group&amp;#039;s boyish good looks, made East 17 into a teen pop sensation. Occasionally, the band achieved some credibility from dance circles when they convinced remixers to reshape their infectious singles, but for the most part, East 17 was a decidedly adolescent -- and decidedly British -- phenomenon, scoring a number of hit singles during the early and mid-&amp;#039;90s, before Brit-pop captured the attention of the majority of British teens.\nComprised of four vocalists/rappers -- Tony Mortimer (born Anthony Michael Mortimer, October 21, 1970), Brian Harvey (born Brian Lee Harvey, August 8, 1974), Terry Coldwell (born Terence Mark Colwell, July 21, 1974), and John Hendy (born Jonathan Darren Hendy, March 26, 1971) -- East 17 were formed in London in the early &amp;#039;90s. Taking their name from their local London postal code in Walthamstow, the group began their musical career by imitating American rap outfits, eventually finding inspiration from urban soul and dance music as well. By 1992, their demo tapes had made their way to London Records, where Tom Watkins -- an A&amp;R instrumental in launching the careers of the Pet Shop Boys and Bros -- signed the band in April of 1992. In August of that year, the group&amp;#039;s debut single, &quot;House of Love,&quot; was released and it shot into the British Top Ten, selling over 600,000 copies by the end of the year. It was quickly followed in 1993 by their debut album, Walthamstow, which became a hit, despite being panned by critics.\nFor the next two years, East 17 was very popular throughout Britian, and managed to gain a following in Europe, as well. Steam, the band&amp;#039;s second album, was a hit upon its release in 1995, but it wasn&amp;#039;t quite as popular as their debut, largely due to the shifting musical tastes of the U.K. As the country gravitated toward guitar rock and electronic music, East 17&amp;#039;s dance-pop began to lose ground on the charts. In 1996, the band released the singles compilation Around the World: The Journey So Far.\nIn January of 1997, Brian Harvey was kicked out of East 17 following an interview in which he endorsed the drug ecstasy.\n\nReview\tby Stephen Thomas Erlewine\n\nAround the World -- The Story So Far contains all of the teen-oriented dance-pop band&amp;#039;s biggest hits, making it not only the definitive retrospective, but also East 17&amp;#039;s most consistent and entertaining album. \n\nEnjoy.","torrent":{"xt":"urn:btih:0bc324aa0590f56cb817d3d77bd634f557adc1db","amp;dn":"East+17+-+Around+The+World+Hit+Singles-The+Journey+So+Far+-+%28199","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bc324aa0590f56cb817d3d77bd634f557adc1db","infoHashBuffer":{"type":"Buffer","data":[11,195,36,170,5,144,245,108,184,23,211,215,123,214,52,245,87,173,193,219]},"announce":[],"urlList":[]}}