{"title":"Fluid 3 (NEW Evil Angel) [Split Scenes]","uid":11743538,"size":1929516578,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0bdb5d23d31f95f5f3ca83a68e91c6bcf2635bdd&amp;dn=Fluid+3+%28NEW+Evil+Angel%29+%5BSplit+Scenes%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"imgbabes","files":4,"time":1425895423,"description":"\n\nAnal, Behind The Scene, Big Dick, Big Tits, Blonde, Blowbang, Blowjob, Brunette, Cum Swapping, Cumshot\n\nCarter Cruise, Chad Diamond, Dana DeArmond, Dana Vespoli, Eric John, Jessa Rhodes, London Keyes, Manuel Ferrara, Sovereign Syre, Steven St.Croix\n\nStylish director/beautiful performer Dana Vespoli presents a variety of liquid fetish in the ambitious, visually sumptuous 'Fluid Volume 3.' Smokin' hot, natural-breasted blondes Carter Cruise and Jessa Rhodes romp and splash in an inflatable pool. Then it's a threesome of slobber, spanking, choking, rim jobs and rough fucking with stud Manuel Ferrara (in cartoonish rapper gear). The director and brunette beauty Dana DeArmond don strap-ons and join three studs surrounding American Asian cutie London Keyes for a rough circle-suck. London's head is repeatedly dunked in a tub as an underwater cam shows her face plunging in! The pricks plaster London's face with thick sheets of spunk. Curvy Sovereign Syre and veteran stud Steven St. Croix play out a tense power exchange scenario; the curious girl succumbs to the dominant fucker for fearsome breath control and sex in a running shower and full bathtub. Gorgeous underwater shots show Ms. Vespoli and pretty, pale Stoya making love in a pool. Out of the water they share cunnilingus and flavorful pussy-to-mouth kisses. The movie pays tribute to iconic cinema; two scenes start with theatrical, costumed dance intros","torrent":{"xt":"urn:btih:0bdb5d23d31f95f5f3ca83a68e91c6bcf2635bdd","amp;dn":"Fluid+3+%28NEW+Evil+Angel%29+%5BSplit+Scenes%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bdb5d23d31f95f5f3ca83a68e91c6bcf2635bdd","infoHashBuffer":{"type":"Buffer","data":[11,219,93,35,211,31,149,245,243,202,131,166,142,145,198,188,242,99,91,221]},"announce":[],"urlList":[]}}