{"title":"Gunnm (Battle Angel Alita)","uid":6084124,"size":1773823612,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0bdc1679392d1b902d2b7cafd28575c6dcbe35c8&amp;dn=Gunnm+%28Battle+Angel+Alita%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Saylek","files":-1,"time":1294245770,"description":"=== Gunnm / Gun Dream / Battle Angel Alita ===\n\n \nContains BAA and Last Order (with latest phases), the extra BAA stories and extra pages, Bashaku Ando, and also the Glossary. \n\nEverything is the latest versions (v2s, etc) and updates as of writing this. \n\nAlso contains the awesome, must-have program MMCE. Its by far the best manga-reading software in existence. Theres many ways you can configure it. \n\nIts not included, but with the help of JoyToKey you can even use a controller (like a DualShock 2 for example) with MMCE. \n\nMMCE reads .rar files, so theres no need to extract anything. \n\nPLEASE NOTE THAT the Glossary contains massive amounts of spoilers everywhere, so DONT even check it slightly before you have finished reading the whole manga! \n\nALSO NOTE THAT a certain page of each of the Extra Stories also contain spoilers for later BAA events, so its best to read them after finishing BAA. \n\nBashaku Ando is set just after Last Order Vol 2. It does not contain any spoilers for any future Last Order events, so it can thus safely be read after LO Vol 2. \n\nSeed after downloading, and do not delete or change or rename anything. \n\nHave fun reading! \n\n \n\n \n\n(additional info: Things have been slightly renamed and reorganized vs what you get from the RA (RippersAnime) downloads, in order to make it all more sorted and neater and nicer. The rars themselves are not the original rars; everything has been unpacked and rared again because some of the original rars made certain pages unviewable in MCCE. And this is why the size of the rars are different vs the originals, because when re-raring everything was merely stored and not compressed - just in order to make 100% sure that theres no problems reading the files. Anyway, the size difference between this compressed and stored is minor, due to the images themselves already having been compressed.) ","torrent":{"xt":"urn:btih:0bdc1679392d1b902d2b7cafd28575c6dcbe35c8","amp;dn":"Gunnm+%28Battle+Angel+Alita%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bdc1679392d1b902d2b7cafd28575c6dcbe35c8","infoHashBuffer":{"type":"Buffer","data":[11,220,22,121,57,45,27,144,45,43,124,175,210,133,117,198,220,190,53,200]},"announce":[],"urlList":[]}}