{"title":"The Almost - Discography (2007-2013) [FLAC]","uid":8950576,"size":1431976731,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0c11c1d4062c8fddc384672d91f50c9f6afe482d&amp;dn=The+Almost+-+Discography+%282007-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"politux","files":-1,"time":1379874639,"description":"\n  The Almost - Discography (2007-2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Post-Hardcore, Post-Grunge\n  Source: CD\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  2007 Southern Weather\n  2008 No Gift to Bring (EP)\n  2009 Monster Monster\n  2011 Monster Monster (EP)\n  2013 Fear Inside Our Bones\n\n  The Almost is an emo solo project by Aaron Gillespie, drummer and occasional lead singer for Underoath, the Christian metalcore outfit he co-founded in 1998. Choosing to come out from behind the skins like his idol Dave Grohl before him, the Florida-bred Gillespie (who relocated to Salt Lake City in early 2007, following his marriage) wanted to explore a different outlet for his songwriting outside of his hard-hitting main gig. Written as Underoath were recording their critically acclaimed 2006 album, Define the Great Line (and recorded soon after that album's completion), the songs on The Almost's melodically inclined debut album, 2007's Southern Weather, are pointedly lacking Underoath's metalcore sound; the album's first single, &quot;Say It Sooner,&quot; features a rhythm guitar track directly inspired by Johnny Cash's original musical partner, Luther Perkins, among others. \n\n  Although Gillespie played all of the instruments on Southern Weather, which was jointly released by Tooth &amp; Nail and Virgin, he formed a full-band version of The Almost for touring purposes. This incarnation featured Gillespie on vocals, guitarist Jay Vilardi, bassist Alex Aponte, and drummer Kenny Bozich. For their second album, Monster Monster, Gillespie opted for a more collaborative approach to the songwriting and brought the entire band into the studio with him, making the leap from solo project to actual band. The album was released in 2009 by Tooth &amp; Nail. Fear Inside Our Bones, the group's third long-player, followed in 2013.","torrent":{"xt":"urn:btih:0c11c1d4062c8fddc384672d91f50c9f6afe482d","amp;dn":"The+Almost+-+Discography+%282007-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c11c1d4062c8fddc384672d91f50c9f6afe482d","infoHashBuffer":{"type":"Buffer","data":[12,17,193,212,6,44,143,221,195,132,103,45,145,245,12,159,106,254,72,45]},"announce":[],"urlList":[]}}