{"title":"Wind Energy Generation - Modelling and Control","uid":12151731,"size":3942443,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0c28fda5dfb56c81185e2fab37a05d08ff01d1ac&amp;dn=Wind+Energy+Generation+-+Modelling+and+Control&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"clouderone","files":1,"time":1437610242,"description":"Wind Energy Generation - Modelling and Control (Wiley, 2009).pdf\n\nISBN 978-0-470-71433-1\n\nWith increasing concern over climate change and the security of energy supplies, wind power is emerging as an important source of electrical energy throughout the world.Modern wind turbines use advanced power electronics to provide efficient generator control and to ensure compatible operation with the power system. &quot;Wind Energy Generation&quot; describes the fundamental principles and modelling of the electrical generator and power electronic systems used in large wind turbines. It also discusses how they interact with the power system and the influence of wind turbines on power system operation and stability.\n\nKey features: Includes a comprehensive account of power electronic equipment used in wind turbines and for their grid connection.Describes enabling technologies which facilitate the connection of large-scale onshore and offshore wind farms.Provides detailed modelling and control of wind turbine systems.Shows a number of simulations and case studies which explain the dynamic interaction between wind power and conventional generation","torrent":{"xt":"urn:btih:0c28fda5dfb56c81185e2fab37a05d08ff01d1ac","amp;dn":"Wind+Energy+Generation+-+Modelling+and+Control","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c28fda5dfb56c81185e2fab37a05d08ff01d1ac","infoHashBuffer":{"type":"Buffer","data":[12,40,253,165,223,181,108,129,24,94,47,171,55,160,93,8,255,1,209,172]},"announce":[],"urlList":[]}}