{"title":"Need For Speed - Porsche Unleashed (1-click run)","uid":8184246,"size":413216518,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0c400d3de4e19677d80600cc30899326db97f702&amp;dn=Need+For+Speed+-+Porsche+Unleashed+%281-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1361696775,"description":"No need to install,\nNo need to put serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from USB-Stick.\nThese are a few things that makes a '1-click run' version a, better version.\nYou can find uninstall information here: http://www.friendsinwar.com/information.php\n\nNeed for Speed Porsche Unleashed gives the player the opportunity to race Porsche cars throughout a range of tracks located in Europe. The cars were studied in detail in terms of driving mechanics in order to create a realistic simulation. The premise of the game remains largely the same compared to previous games in the series: driving and racing sports cars. However, the game only offers Porsches. The handling of the cars was improved, and the player can customize their cars drawing from an in-depth catalog of different Porsche-parts. Although the game retains the police chases from Hot Pursuit and High Stakes, the feature is relatively minor and is only seen in the Factory Driver mode (see Modes).\nIn terms of game concept, Porsche Unleashed is often hailed for the unusual effort of focusing on a single car brand, thus allowing greater depth and acting as a platform of information on the Porsche brand. Apart from the vast number of cars and spare parts, the game also features many historical videos and pictures of Porsche vehicles, as well as written information.","torrent":{"xt":"urn:btih:0c400d3de4e19677d80600cc30899326db97f702","amp;dn":"Need+For+Speed+-+Porsche+Unleashed+%281-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c400d3de4e19677d80600cc30899326db97f702","infoHashBuffer":{"type":"Buffer","data":[12,64,13,61,228,225,150,119,216,6,0,204,48,137,147,38,219,151,247,2]},"announce":[],"urlList":[]}}