{"title":"[PSX] The X Files (4 Disc) [NTSC]","uid":11034090,"size":1950285582,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:0d7de6f290c363bbd5e143b13f6e02fa8b9cc226&amp;dn=%5BPSX%5D+The+X+Files+%284+Disc%29+%5BNTSC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Big_dude","files":-1,"time":1410763036,"description":"The X Files for Playstation One                                   Rel. 10/13/1999\n\n \n\nFormat:        CD-R NTSC-USA\nLang.:         English\nDiscs:         4\nImage:         CCD/SUB/IMG\nRating:        Teen\nTheme:         FMV, First Person, SCI/FI\nRequirements:  Modded/Chipped Playstation or Ps2, Breaker Pro/Boot-cd, \n               Game Enchancer/Built-in Mod, or psx emulator.\n               (You only need to use one of these mentioned methods)\n\n\nCompressed with 7zip. Game was tested and works.\n\n\n\nNote: No Psone Backup Disc/game or copy will work unless your Psone or Ps2 \n      Console is modded, or if you use a Boot Disc like Breaker Pro, or\n      Use a Game Enchancer Plug in Port which is like a boot disc and\n      Can Load Backups. For Multi Disc PS1 games on a modded/chipped console\n      you don't have to worry on inserting next disc.  However if using\n      a boot disc like breaker pro you still have to double swap using disc\n      or an original ps1 game once disc starts spining faster you quickly swap\n      in your disc backup to load.\n\n\n\nRelease Notes - Psx emulator is included if you need it.\n\n\n\nGame Description:\n\nAs an extension of one of the most long-running television series of all time, The X-Files, play through the eyes of Special Agent Craig Willmore, a new FBI field investigator brought in to locate missing agents Fox Mulder and Dana Scully whose last location was the Everett, Washington, area. In this &quot;movie quality&quot; video production, characters are played by the actors and actresses from the show, including Gillian Anderson (Scully) and David Duchovny (Mulder).\n\nAs the game begins, you are given a briefing of your mission. Gather up all state-of-the-art spy tools (night vision goggles, a digital camera, PDA, lock picks, evidence kit, a standard issue revolver, handcuffs and badge) and then head out to follow their trail. As you explore the various locations, take photographs, pick up pieces of evidence and talk with people. Use your Newton PDA to access the navigational map, to make notes and send/receive e-mail. Trace telephone numbers, run background checks and license plate ids and even post an All Points Bulletin on missing persons using the computer network at your home or office. By using photo viewer software, download field photographs to the computer where they can be enlarged and studied more closely for clues.\n\nFeatures include emotion icons for interjecting different tones during conversations (mean, humorous or technical) which effect the answer given. An in-game hint system, Artificial Intelligence, can be set on or off. In addition, there are multiple endings as a direct result of actions you take. \n\n\nGame Pics Included.\n\n\nBurn with Alcohol 120% (Included).\n\n\nSet DataType to Playstation (Write Method Raw/Dao) and burn at 8x Speed.\n\n\nUse Verbatim or Tayio Yuden CD-R Media for best quality, or if other media isn't\nworking.\n\n\nIf this is working fine for you let us know post a comment.\n\n\n\nPlease Support This Torrent, Seed and Enjoy!","torrent":{"xt":"urn:btih:0d7de6f290c363bbd5e143b13f6e02fa8b9cc226","amp;dn":"%5BPSX%5D+The+X+Files+%284+Disc%29+%5BNTSC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d7de6f290c363bbd5e143b13f6e02fa8b9cc226","infoHashBuffer":{"type":"Buffer","data":[13,125,230,242,144,195,99,187,213,225,67,177,63,110,2,250,139,156,194,38]},"announce":[],"urlList":[]}}