{"title":"On Bullshit - Harry G. Frankfurt - Comedy Philosophy Audiobook","uid":4674711,"size":19023858,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0ebebcdfe20c9fbd9a44e179aa90f0646016df5f&amp;dn=On+Bullshit+-+Harry+G.+Frankfurt+-+Comedy+Philosophy+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"rambam1776","files":21,"time":1232859323,"description":"On Bullshit is an essay by philosopher Harry Frankfurt. Originally published in the journal Raritan in 1986, the essay was republished as a separate volume in 2005 and became a nonfiction bestseller, spending twenty-seven weeks on the New York Times Best Seller list\n\nIn the essay, Frankfurt sketches a theory of bullshit, defining the concept and analyzing its applications. In particular, Frankfurt distinguishes bullshitting from lying; while the liar deliberately makes false claims, the bullshitter is simply uninterested in the truth. Bullshitters aim primarily to impress and persuade their audiences. While liars need to know the truth, the better to conceal it, the bullshitter, interested solely in advancing his own agenda, has no use for the truth. Following from this, Frankfurt claims that &quot;bullshit is a greater enemy of the truth than lies are.&quot;\n\nThis work laid the foundation for Frankfurt's 2006 follow-up book, On Truth.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/On_Bullshit&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/On_Bullshit&lt;/a&gt;\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Bullshit-Harry-G-Frankfurt/dp/0691122946/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1232847415&amp;sr=1-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Bullshit-Harry-G-Frankfurt/dp/0691122946/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1232847415&amp;sr=1-1&lt;/a&gt;\n\nEditorial Reviews\nAmazon.com Review\n&quot;One of the most salient features of our culture is that there is so much bullshit,&quot; Harry G. Frankfurt writes, in what must surely be the most eyebrow-raising opener in modern philosophical prose. &quot;Everyone knows this. Each of us contributes his share. But we tend to take the situation for granted.&quot; This compact little book, as pungent as the phenomenon it explores, attempts to articulate a theory of this contemporary scourge--what it is, what it does, and why there's so much of it. The result is entertaining and enlightening in almost equal measure. It can't be denied; part of the book's charm is the puerile pleasure of reading classic academic discourse punctuated at regular intervals by the word &quot;bullshit.&quot; More pertinent is Frankfurt's focus on intentions--the practice of bullshit, rather than its end result. Bullshitting, as he notes, is not exactly lying, and bullshit remains bullshit whether it's true or false. The difference lies in the bullshitter's complete disregard for whether what he's saying corresponds to facts in the physical world: he &quot;does not reject the authority of the truth, as the liar does, and oppose himself to it. He pays no attention to it at all. By virtue of this, bullshit is a greater enemy of the truth than lies are.&quot; \nThis may sound all too familiar to those of use who still live in the &quot;reality-based community&quot; and must deal with a world convulsed by those who do not. But Frankfurt leaves such political implications to his readers. Instead, he points to one source of bullshit's unprecedented expansion in recent years, the postmodern skepticism of objective truth in favor of sincerity, or as he defines it, staying true to subjective experience. But what makes us think that anything in our nature is more stable or inherent than what lies outside it? Thus, Frankfurt concludes, with an observation as tiny and perfect as the rest of this exquisite book, &quot;sincerity itself is bullshit.&quot; --Mary Park \n\nReview\n&quot; it is tempting to say that On Bullshit comes very close to defining the essence of postindustrial society&quot;. -- Scott McLemee, Inside Higher Education\n\n&quot;... the book was definitely not meant to be taken lightly. It is, after all, not a knee-slapper.&quot; -- Kevin Cowherd, The Baltimore Sun\n\n&quot;Credo che chi pronuncia stronzate confidi anche nella debole memoria del suo uditorio&quot;. -- Umberto Eco, L'Espresso\n\n&quot;Editors and reporters will likely recognize their current challenges in the changed cultural landscape he describes.&quot; -- Barbara Bedway, Editor &amp; Publisher\n\n&quot;For any genre, however, this humble book is a noteworthy success, and promises to continue to be so.&quot; -- Alan Williams, The Simon\n\n&quot;For bullshit artistry demands our complicity. It is, in its own way, a demonstration of power&quot; -- Jonathan Lear, The New Republic\n\n&quot;Frankfurt's deadpan tone gives a comic flavor to many of his observations&quot;. -- Kenneth Baker, The San Francisco Chronicle\n\n&quot;On Bulls - - t&quot; is both very funny and refreshingly unpedantic.&quot; -- Jon Newlin, The Times-Picayune\n\n&quot;Prize Bull ... We are drowning in bullshit. I mean, the Bush administration has practically made it a Cabinet position&quot;. -- Dan Neill, The Los Angeles Times\n\n&quot;The humor, and the naughtiness, lie in the contrast between the highfalutin'and the indelicate&quot;. -- Roger Kimball, The Wall Street Journal\n\n[Frankfurt] tries, with the help of Wittgenstein, Pound, St. Augustine and the spy novelist Eric Ambler, among others, to ask some of the preliminary questions--to define the nature of a thing recognized by all but understood by none... What is bullshit, after all? Mr. Frankfurt points out it is neither fish nor fowl. Those who produce it certainly aren't honest, but neither are they liars, given that the liar and the honest man are linked in their common, if not identical, regard for the truth. -- Peter Edidin New York Times The scholar who answers the question, 'What is bullshit?' bids boldly to define the spirit of the present age... Frankfurt's conclusion ... is that bullshit is defined not so much by the end product as by the process by which it is created. Eureka! Frankfurt's definition is one of those not-at-all-obvious insights that become blindingly obvious the moment they are expressed. -- Timothy Noah Slate Immediately, I must say: read it. Beautifully written, lucid, ironic and profound, it is a model of what philosophy can and should do. It is a small and highly provocative masterpiece, and I really don't think I am bullshitting you here. -- Bryan Appleyard The Sunday Times This is what the world has long needed... Bullshit is now such a dominant feature of our culture that most of us are confident we can recognize and rebuff it. But Frankfurt shows the reader just how insidious (and destructive) it can be... This book will change your life. -- Leopold Froehlich Playboy Frankfurt's book should be required reading for anyone whose speech or writing are intended for public consumption. Despite his subject, he is definitely not full of it. -- Kevin Wood The Daily Yomiuri On Bullshit offers a tightly focused, telling critique of a political and cultural climate that seems positively humid with mendacity, obfuscation, evasion and illusion. -- Steven Winn San Francisco Chronicle There is an interesting problem sketched at the end of the book, wherein sincerity is described as an ideal for those who do not believe that there is any (objective) truth, thus departing from the ideal correctness... Needless to say, there are numerous problems which may be expanded, looked into and analyzed concerning bullshit. And I dare say that Frankfurt's little book is a nice starting point. -- Petter A. Naessan Philosophy Now [On Bullshit's] calm, clearheaded deconstruction of everyday deceit is without parallel. don Phinn, Books in Canada With its relevance to contemporary issues and culture, On Bullshit is well worth the read... The analysis is strict and philosophical with the clear intention of seeking the truth. -- Karen Boore The Michigan Review Harry Frankfurt, a Princeton philosophy professor, presents a scholarly and formal essay on inflated truth, purposeful obfuscation, and pretentious duplicity... I'm sure he had a blast writing it, and the droll prose is a tasty treat. -- Richard Pachter The Boston Globe Professor Frankfurt concludes that bullshit is a process rather than an end product... If you are fed up with hype, spin and bullshit this book will provide insight - and therapy. tralian Doctor Terrific... Has anything truer ever been written? -- William Watson Montreal Gazette \n\nProduct Details\nHardcover: 80 pages \nPublisher: Princeton University Press (January 10, 2005) \nLanguage: English \nISBN-10: 0691122946 \nISBN-13: 978-0691122946 \n","torrent":{"xt":"urn:btih:0ebebcdfe20c9fbd9a44e179aa90f0646016df5f","amp;dn":"On+Bullshit+-+Harry+G.+Frankfurt+-+Comedy+Philosophy+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ebebcdfe20c9fbd9a44e179aa90f0646016df5f","infoHashBuffer":{"type":"Buffer","data":[14,190,188,223,226,12,159,189,154,68,225,121,170,144,240,100,96,22,223,95]},"announce":[],"urlList":[]}}