{"title":"Foo Fighters - Flac","uid":9613217,"size":3010489148,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0eca94cfd0751322538f9d5022c3decdc4fd73b3&amp;dn=Foo+Fighters+-+Flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"jmwreck","files":99,"time":1392363451,"description":"The Foo Fighters are an American rock band, formed in Seattle in 1994. It was founded by Nirvana drummer Dave Grohl as a one-man project following the death of Kurt Cobain and the resulting dissolution of his previous band. The group got its name from the UFOs and various aerial phenomena that were reported by Allied aircraft pilots in World War II, which were known collectively as foo fighters. Prior to the release of Foo Fighters' 1995 debut album Foo Fighters, which featured Grohl as the only official member, Grohl recruited bassist Nate Mendel and drummer William Goldsmith, both formerly of Sunny Day Real Estate, as well as fellow Nirvana touring bandmate Pat Smear as guitarist to complete the lineup. The band began with performances in Portland, Oregon. Goldsmith quit during the recording of the group's second album, The Colour and the Shape (1997) when most of the drum parts were re-recorded by Grohl himself. Smear's departure followed soon afterward.\n\nThey were replaced by Taylor Hawkins and Franz Stahl, respectively, although Stahl was fired before the recording of the group's third album, There Is Nothing Left to Lose (1999). The band briefly continued as a trio until Chris Shiflett joined as the band's lead guitarist after the completion of There Is Nothing Left to Lose. The band released its fourth album, One by One, in 2002. The group followed that release with the two-disc In Your Honor (2005), which was split between acoustic songs and heavier material. Foo Fighters released its sixth album, Echoes, Silence, Patience &amp; Grace, in 2007. In 2010, it was confirmed that Smear had officially rejoined the band after touring with Foo Fighters as an unofficial member between 2006 and 2009. Over the course of the band's career, four of its albums have won Grammy Awards for Best Rock Album. The band's seventh studio album, Wasting Light, was released in 2011. Grohl stated in January 2013 that the band had started writing material for an eighth studio album. Producer Butch Vig is set to produce his second album with the group.","torrent":{"xt":"urn:btih:0eca94cfd0751322538f9d5022c3decdc4fd73b3","amp;dn":"Foo+Fighters+-+Flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0eca94cfd0751322538f9d5022c3decdc4fd73b3","infoHashBuffer":{"type":"Buffer","data":[14,202,148,207,208,117,19,34,83,143,157,80,34,195,222,205,196,253,115,179]},"announce":[],"urlList":[]}}