{"title":"Taiyo o Nusunda Otoko - The Man Who Stole the Sun (Japan movie,","uid":3561346,"size":1468220905,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0f0298ef656658acee82a2bf1365385e5221036e&amp;dn=Taiyo+o+Nusunda+Otoko+-+The+Man+Who+Stole+the+Sun+%28Japan+movie%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"Pemu","files":5,"time":1164057216,"description":"Starring:  \tKenji Swawada, Bunta Sugawara, Kimiko Ikegami \n \nDirector: \tMataichiro Yamamoto   \n\nSynopsis:\n\nA Japanese science teacher (Kenji Sawada) creates a homemade atomic bomb, and threatens to use it unless his strange demands ? which include a Rolling Stones concert ? are met. This dark comedy centers on the teacher\\&amp;#039;s attempts to achieve his goals, while avoiding capture by a persistent detective.\n\nMakoto Kido, a high school science teacher meets an old fanatic who hijacks a bus. Police Inspector Yamashita arrests the old man at the cost of his injury. Makoto has a fanatic plan- to make an A-bomb. The police are shocked by his phony bomb. Makoto demands the police to arrange a baseball game broadcasting on TV, the police comply. Makoto again coeres the police to invite the Rolling Stones Tokyo, The police are planned to arrest Makoto, can Makoto escape?\n\nMy Thoughts: a Japanese science teacher is somewhat traumatised after the event of a gunman hijacking the bus on the school field trip. He decides to steal plutonium from a nuclear power plant and builds one. He makes somewhat bizarre demands such as baseball match live coverage should be broadcasted till the game finishes, not until routine deadline comes and goes off broadcast. If his demands are not met, the bomb goes off?!\nFirst of all, what a suprisingly fun movie! Totally impressed me! A cat-and-mouse play between the teacher and the police detective and time is slowly running out for both of them. Entertaining movie added with tongue-in-cheek humour and the cheesy car-chase scene. Despite being rather unreasonable long but a well worth seeing!","torrent":{"xt":"urn:btih:0f0298ef656658acee82a2bf1365385e5221036e","amp;dn":"Taiyo+o+Nusunda+Otoko+-+The+Man+Who+Stole+the+Sun+%28Japan+movie%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f0298ef656658acee82a2bf1365385e5221036e","infoHashBuffer":{"type":"Buffer","data":[15,2,152,239,101,102,88,172,238,130,162,191,19,101,56,94,82,33,3,110]},"announce":[],"urlList":[]}}