{"title":"Harlequin Desire - June 2015","uid":11949820,"size":2863256,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f14b0b8d60446f639efe5f539ae5998cba3a757&amp;dn=Harlequin+Desire+-+June+2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Mohammad_AT","files":18,"time":1432138311,"description":"Carrying a King's Child - Katherine Garbera\n\n\n\nOne night leads to the pregnancy surprise of a lifetime in this novel from USA TODAY bestselling author Katherine Garbera...\n\nTapped to become king of his family's ancestral homeland, hotshot Miami businessman Rafe Montoro needs a break from the pressure. A night with Key West bartender Emily Fielding is just the ticket--until weeks later, when she shows up pregnant!\n\nEmily wants her child to know its father, though as an &quot;unsuitable commoner,&quot; she doesn't want to block Rafe's ascent to the throne. Still, there's that unrelenting chemistry between them that won't be denied. Will Rafe have to choose between love and country after all?\n\nPursued by the Rich Rancher - Catherine Mann\n\n\n\nA millionaire cowboy must woo a single mom to earn his inheritance! Only from USA TODAY bestselling author Catherine Mann...\n\nSingle mom Nina Lowery has never understood the sex appeal of cowboys. Until she brings her son to a weeklong horse camp and meets the wealthy rancher in charge...\n\nSeduction isn't part of Alex McNair's plan to earn his piece of his family's estate. Yet plans have a way of changing. Nina and her little boy hold the key to Alex's future. Breaking the promise he made to his dying grandmother is not an option...but neither is breaking Nina's heart.\n\nSeduced by the CEO - Barbara Dunlop\n\n\n\nFalling for the CEO is a minefield of secrets in this tale from New York Times and USA TODAY bestselling author Barbara Dunlop\n\nBorn on the wrong side of the bed, Riley Ellis is done playing second fiddle to his half brother--the legitimate heir. Determined to make his own company a success, Riley needs leverage and Kalissa Smith is it. Only he knows Kalissa is the long-lost identical twin to his rival's beloved wife. What a scandal their union could cause...\n\nBy the time Kalissa learns the truth, Riley's passion is the real deal. But can he convince her she isn't a mere pawn in his seduction scheme?\n\nThe Sheikh's Secret Heir - Kristi Gold\n\n\n\nShe's about to have the sheikh's baby!\n\nTasked with entertaining a mysterious billionaire, Bajul diplomat Kira Darzin never expects her assignment to extend to the bedroom. But one look into Tarek Azzmar's smoldering eyes and she's helpless to resist. Now her unplanned pregnancy--and Tarek's secret identity--threaten the royal family she holds dear...\n\nThe illegitimate son of Bajul's former king, Tarek vows revenge on the father who rejected him. And Kira is a complication he can't afford--no matter how the sultry beauty challenges him. But when the truth about his past is revealed, will Tarek lose Kira and his unborn child for good?\n\nThe Wife He Couldn't Forget - Yvonne Lindsay\n\n\n\nA husband's amnesia means a second chance at love in this story by USA TODAY bestselling author Yvonne Lindsay\n\nAfter an accident leaves Xander Jackson with no memory of the past several years, he doesn't realize he walked out on his marriage. And his wife, Olivia, grabs this chance to start over with the man she still desires.\n\nAllowing Xander to believe they're still the passionate, loving couple they once were is one thing. But Olivia must also hide all evidence of the devastating loss that destroyed their relationship. It's the biggest gamble of her life...and everything depends on reclaiming Xander's heart.\n\nWhat the Prince Wants - Jules Bennett\n\n\n\nWhat happens when a royal daddy falls for his child's live-in nanny?\n\nWidowed Prince Mikos Colin Alexander wants to raise his little girl out of the spotlight. Granted a six-month leave from his royal duties, he escapes to Los Angeles, posing as a regular guy, one in need of a live-in nanny. Colin reluctantly hires Darcy Cooper, the curvy beauty who easily wins over his baby duchess. But soon the lush, love-shy American wins him over, too. Now he's torn between duty to the crown and what feels like his newfound family. But when Darcy discovers her emotionally distant boss is royalty, will all bets be off?","torrent":{"xt":"urn:btih:0f14b0b8d60446f639efe5f539ae5998cba3a757","amp;dn":"Harlequin+Desire+-+June+2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f14b0b8d60446f639efe5f539ae5998cba3a757","infoHashBuffer":{"type":"Buffer","data":[15,20,176,184,214,4,70,246,57,239,229,245,57,174,89,152,203,163,167,87]},"announce":[],"urlList":[]}}