{"title":"Faith Hill - Faith 320cbr 1998 CDrip","uid":9329126,"size":122564905,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0f242fae10af755aca72b4c31ae1551b97c80fb6&amp;dn=Faith+Hill+-+Faith+320cbr+1998+CDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":8,"uploader":"Big-Papi","files":-1,"time":1386697452,"description":"Source: 1998 CD\n-\nFaith Hill - Faith 320cbr (Big Papi) 1998 Pop Country Music \n-\nBy &quot;arebafan&quot;\nThis album has variety, and the variety keeps my interest. Up tempo, slow tempo, the gospel sound (Somebody Stand Beside Me), a duet (with her husband), several styles of love songs, and a thought provoking look at the secret of life through the eyes of a bartender and two of his bar steadies. I really enjoy all of the songs, especially &quot;The Secret of Life&quot;. The song choice and the variety in the songs may be the heart and soul of the album. Each song is so different in style, and this gives Faith the opportunity to show how versatile she is as a singer. She sings with emotion, with heart, with high energy, a story telling style (&quot;The Secret of Life&quot;), and a gospel style. Wonderful delivery on every song! Faith's voice and vocal style could easily allow her to sing mainstream pop (as she does with &quot;This Kiss&quot;), but the solid lyrics and the awesome fiddle work give this listener the distinct impression that he is still listening to &quot;Country Music&quot;. This album may differ from her last (&quot;It Matters to Me&quot;), but I believe it is, both, an acceptable and pleasant addition to the country music industry. Another well done and well produced piece of music by Faith Hill and the Gallimore group. It is one of my favorites, and deserves the 5 star rating.","torrent":{"xt":"urn:btih:0f242fae10af755aca72b4c31ae1551b97c80fb6","amp;dn":"Faith+Hill+-+Faith+320cbr+1998+CDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f242fae10af755aca72b4c31ae1551b97c80fb6","infoHashBuffer":{"type":"Buffer","data":[15,36,47,174,16,175,117,90,202,114,180,195,26,225,85,27,151,200,15,182]},"announce":[],"urlList":[]}}