{"title":"Freethinkers- A History of American Secularism by Susan Jacoby {","uid":11294012,"size":4016480,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f692b70779439f67c877b106e454016bbebd203&amp;dn=Freethinkers-+A+History+of+American+Secularism+by+Susan+Jacoby+%7B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1414361167,"description":"At a time when the separation of church and state is under attack as never before, Freethinkers offers a powerful defense of the secularist heritage that gave Americans the first government in the world founded not on the authority of religion but on the bedrock of human reason. In impassioned, elegant prose, celebrated author Susan Jacoby traces more than two hundred years of secularist activism, beginning with the fierce debate over the omission of God from the Constitution. Moving from nineteenth-century abolitionism and suffragism through the twentieth century's civil liberties, civil rights, and feminist movements, Freethinkers illuminates the neglected achievements of secularists who, allied with tolerant believers, have led the battle for reform in the past and today.\n\nRich with such iconic figures as Thomas Jefferson, Abraham Lincoln, Thomas Paine, and the once-famous Robert Green Ingersoll, Freethinkers restores to history the passionate humanists who struggled against those who would undermine the combination of secular government and religious liberty that is the glory of the American system","torrent":{"xt":"urn:btih:0f692b70779439f67c877b106e454016bbebd203","amp;dn":"Freethinkers-+A+History+of+American+Secularism+by+Susan+Jacoby+%7B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f692b70779439f67c877b106e454016bbebd203","infoHashBuffer":{"type":"Buffer","data":[15,105,43,112,119,148,57,246,124,135,123,16,110,69,64,22,187,235,210,3]},"announce":[],"urlList":[]}}