{"title":"Exploring the World Around You - Gary Parker","uid":11773213,"size":4691621,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f91517f0e57089d2c965e16f6fd98cc1261b52f&amp;dn=Exploring+the+World+Around+You+-+Gary+Parker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"starxteel","files":1,"time":1427158276,"description":"It has been said that our planet is really just an insignificant speck in a vast universe, but that's not true! In fact, the conditions for life found on earth are supremely unique and make our life here comfortable. This despite the reality that the world around us is also tainted and in need of careful calibration in order to continue.\n\nThis scripturally founded book opens a window to the spectacular environments found on our planet, from deserts to the tropics, with respect to creationism. Researchers and biologist Dr. Garry Parker brings his vast knowledge of ecology to a teaching setting, exploring and explaining ecosystems, population growth, habitats, adaptations, energy problems, and much more. Learn about insect control in California, why mammals have fur, and how sharks maintain &quot;friendships&quot; with small fish know as remora.\n\nExploring the World Around You brings the varieties of our planet's habitats alive to the reader, and is a wonderful learning tool complete with illustrations, chapter tests, and an index.\n\n\nAbout the author:\nAfter starting his 30-year college teaching career as a non-Christian evolutionist, Dr. Gary Parker became a zealous creationist, eventually serving as professor of biology at the Institute for Creation Research in San Diego, lecturing worldwide for both ICR and Answers in Genesis, writing five science textbooks and seven creation books (translated into over 10 languages), and appearing in numerous films, videos and television programs. Dr. Parker and his wife, Mary, also run family camps, workshops, and credit courses through the Creation Adventures Museum near their home in Arcadia, Florida","torrent":{"xt":"urn:btih:0f91517f0e57089d2c965e16f6fd98cc1261b52f","amp;dn":"Exploring+the+World+Around+You+-+Gary+Parker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f91517f0e57089d2c965e16f6fd98cc1261b52f","infoHashBuffer":{"type":"Buffer","data":[15,145,81,127,14,87,8,157,44,150,94,22,246,253,152,204,18,97,181,47]},"announce":[],"urlList":[]}}