{"title":"Nickelback - No Fixed Address [2014][320 KBPS]","uid":11574872,"size":108651334,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0f94c78eb4c78e44832f56d949c59b2b983872b1&amp;dn=Nickelback+-+No+Fixed+Address+%5B2014%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"LameDuck69","files":16,"time":1417065014,"description":"Nickelback - No Fixed Address [2014]\n\n\n\n01. Million Miles An Hour    \n02. Edge Of A Revolution    \n03. What Are You Waiting For  \n04. She Keeps Me Up    \n05. Make Me Believe Again   \n06. Satellite    \n07. Get 'Em Up    \n08. The Hammer's Coming Down \n09. Miss You \n10. Got Me Runnin' Round [Feat. Flo Rida]   \n11. Sister Sin \n\n\n\n\n320 KBPS [CBR]\nCover Art\n\n\n\n\n\nFrom Wikipedia:\n\n\nNickelback is a Canadian rock band formed in 1995 in Hanna, Alberta. The band is composed of guitarist and lead vocalist Chad Kroeger, guitarist, keyboardist and backing vocalist Ryan Peake, bassist Mike Kroeger, and drummer Daniel Adair. The band went through a few drummer changes between 1995 and 2005, achieving its current form when Adair replaced drummer Ryan Vikedal.\n\nNickelback is one of the most commercially successful Canadian groups, having sold more than 50 million albums worldwide and ranking as the eleventh best-selling music act, and the second best-selling foreign act in the U.S. of the 2000s, behind The Beatles. Billboard ranks them the top rock group of the decade, and their hit song &quot;How You Remind Me&quot; was listed as the top rock song of the decade and the fourth song of the decade. They were listed number seven on the Billboard top artist of the decade, with four albums listed on the Billboard top albums of the decade.\n\nThe band signed with Roadrunner Records in 1999 and re-released their once-independent album The State. The band achieved commercial success with the release of their 2000 album The State and then they achieved mainstream success with the release of their 2001 album Silver Side Up. Following the release of Silver Side Up the band released their biggest and most known hit today, &quot;How You Remind Me&quot; which peaked number 1 on the American and Canadian charts at the same time. Then, the band's fourth album The Long Road (2003) spawned 5 singles and continued the band's mainstream success with their hit single &quot;Someday&quot; which peaked at number 7 on the Billboard Hot 100 and number 1 at the Canadian Singles Chart. Afterwards, the band put out their biggest album to date, All The Right Reasons (2005) which produced 3 top 10 singles and 5 top 20 singles, on the Billboard Hot 100 example of songs like &quot;Photograph&quot;, &quot;Far Away&quot;, and &quot;Rockstar&quot; The band's album Dark Horse (2008) was a success which produced eight singles, one of which peaked on the top 10 on the Billboard Hot 100 and two of which peaked on the top 20 on the Billboard Hot 100. In 2011, the band released their seventh album Here and Now which again topped the charts. Their eighth studio album No Fixed Address was released on 17 November 2014.\n\nThe band is based in Vancouver, Canada. The band's original domestic signing was with EMI Canada. They subsequently obtained an American deal with global distribution via Roadrunner Records. For the release of their seventh album, the band parted from EMI Canada and signed a new Canadian domestic distribution deal with Universal Music Canada.\n\n--------------------------------------------------------------------------------\n\nNo Fixed Address is the eighth studio album from Canadian rock band Nickelback. It was released on November 14, 2014 in Australia via Republic Records. The album release coincides with the 6 year anniversary of their sixth studio album, Dark Horse. The album is preceded by the lead single &quot;Edge of a Revolution&quot;, which was released on August 18, 2014. This is the band's first release on Republic Records, after leaving long-time record label Roadrunner Records in 2013.\n\n--------------------------------------------------------------------------------\n\nDuring an interview with Chad Kroeger on CFOX-FM, Chad stated that the band planned to release their eighth studio album before the end of 2014. The lead rock single was also announced, &quot;Revolution&quot;, which was scheduled to be released sometime in August 2014. The track was described as a 'departure' for Nickelback and a political song. It was also announced that frequent collaborator Chris Lord-Alge will return to mix some of the tracks on the album. It was also announced the band had signed to Republic Records. Chad also hinted that a potential album title was No Fixed Address.\n\nOn August 22, 2014, Nickelback announced via Twitter that the album will be titled No Fixed Address and they released the track listing along with it.\n\nThe album title, No Fixed Address, was inspired by the fact that the album was recorded in many different places, and they never settled in a single spot.\n\nLead singer Chad Kroeger said the album has some songs that are a significant departure from the band's typical musical style, including a song called &quot;Got Me Runnin' Round&quot; that features Flo Rida and has a horn section in it.\n\n--------------------------------------------------------------------------------\n\nNickelback:\n\n\nChad Kroeger: lead vocals, guitar\n\nRyan Peake: guitar, keyboards, backing vocals\n\nMike Kroeger: bass, backing vocals\n\nDaniel Adair: drums, backing vocals","torrent":{"xt":"urn:btih:0f94c78eb4c78e44832f56d949c59b2b983872b1","amp;dn":"Nickelback+-+No+Fixed+Address+%5B2014%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f94c78eb4c78e44832f56d949c59b2b983872b1","infoHashBuffer":{"type":"Buffer","data":[15,148,199,142,180,199,142,68,131,47,86,217,73,197,155,43,152,56,114,177]},"announce":[],"urlList":[]}}