{"title":"Franz Kafka - The Trial [trans. Breon Mitchell] (1998)","uid":8486956,"size":2108080,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0fd2cf55fe77885115a931f381175ab9637a529e&amp;dn=Franz+Kafka+-+The+Trial+%5Btrans.+Breon+Mitchell%5D+%281998%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"workerbee","files":-1,"time":1368893322,"description":"Franz Kafka - The Trial: A New Translation Based on the Restored Text, translated by Breon Mitchell (Schocken Books, 1998).\n\nISBN: 0805241655 | 276 pages | EPUB\n\n\nWritten in 1914, &quot;The Trial&quot; is one of the most important novels of the twentieth century: the terrifying tale of Josef K., a respectable bank officer who is suddenly and inexplicably arrested and must defend himself against a charge about which he can get no information. Whether read as an existential tale, a parable, or a prophecy of the excesses of modern bureaucracy wedded to the madness of totalitarianism, Kafka's nightmare has resonated with chilling truth for generations of readers.\n\nThis new edition is based upon the work of an international team of experts who have restored the text, the sequence of chapters, and their division to create a version that is as close as possible to the way the author left it.\n\nIn his brilliant translation, Breon Mitchell masterfully reproduces the distinctive poetics of Kafka's prose, revealing a novel that is as full of energy and power as it was when it was first written.\n\n\nReviews\n\n&quot;Kafka's 'legalese' is alchemically fused with a prose of great verve and intense readability.&quot; -- James Rolleston\n\n&quot;Breon Mitchell's translation is an accomplishment of the highest order that will honor Kafka far into the twenty-first century.&quot; -- Walter Abish\n","torrent":{"xt":"urn:btih:0fd2cf55fe77885115a931f381175ab9637a529e","amp;dn":"Franz+Kafka+-+The+Trial+%5Btrans.+Breon+Mitchell%5D+%281998%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fd2cf55fe77885115a931f381175ab9637a529e","infoHashBuffer":{"type":"Buffer","data":[15,210,207,85,254,119,136,81,21,169,49,243,129,23,90,185,99,122,82,158]},"announce":[],"urlList":[]}}