{"title":"The American Plate: A Culinary History in 100 Bites (2014) epub","uid":11547103,"size":12273469,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:100b83c5521743bba2b03cd531e9d71d102c0693&amp;dn=The+American+Plate%3A+A+Culinary+History+in+100+Bites+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Jallentino","files":-1,"time":1416748203,"description":"Libby O'Connell, &quot;The American Plate: A Culinary History in 100 Bites&quot;\nISBN: 1492603023 | 2014 | EPUB | 352 pages | 12 MB\n\nDid you know that the first graham crackers were designed to reduce sexual desire? Or that Americans have tried fad diets for almost two hundred years? Why do we say things like &quot;buck&quot; for a dollar and &quot;living high on the hog&quot;? How have economics, technology, and social movements changed our tastes? Uncover these and other fascinating aspects of American food traditions in The American Plate.\n\nDr. Libby H. O'Connell takes readers on a mouth-watering journey through America's culinary evolution into the vibrant array of foods we savor today. In 100 tantalizing bites, ranging from blueberries and bagels to peanut butter, hard cider, and Cracker Jack, O'Connell reveals the astonishing ways that cultures and individuals have shaped our national diet and continue to influence how we cook and eat.\n\nPeppered throughout with recipes, photos, and tidbits on dozens of foods, from the surprising origins of Hershey Bars to the strange delicacies our ancestors enjoyed, such as roast turtle and grilled beaver tail. Inspiring and intensely satisfying, The American Plate shows how we can use the tastes of our shared past to transform our future","torrent":{"xt":"urn:btih:100b83c5521743bba2b03cd531e9d71d102c0693","amp;dn":"The+American+Plate%3A+A+Culinary+History+in+100+Bites+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"100b83c5521743bba2b03cd531e9d71d102c0693","infoHashBuffer":{"type":"Buffer","data":[16,11,131,197,82,23,67,187,162,176,60,213,49,233,215,29,16,44,6,147]},"announce":[],"urlList":[]}}