{"title":"The Netter Collection of Medical Illustrations, 2E, Vol 5- Urina","uid":9878405,"size":37739678,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:112ceee9adc41d4a1ac87b1edd6578ede0073e94&amp;dn=The+Netter+Collection+of+Medical+Illustrations%2C+2E%2C+Vol+5-+Urina&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":3,"time":1396504976,"description":"Author: Christopher R Kelly, Jaime Landman\nSeries: Netter Green Book Collection (Book 5)\nHardcover: 288 pages\nPublisher: Saunders; 2 edition (March 6, 2012)\nLanguage: English\nISBN-10: 1437722385\nISBN-13: 978-1437722383\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nThe Urinary System, 2nd Edition provides a concise and highly visual approach to the basic sciences and clinical pathology of the kidney, bladder, and ureters. This volume in The Netter Collection of Medical Illustrations (the CIBA &quot;Green Books&quot;) has been expanded and revised by Drs. Christopher Rehbeck Kelly and Jaime Landman to capture current clinical perspectives in nephrology and urology - from normal anatomy, histology, physiology, and development to glomerular and tubular diseases, infections, urological surgeries, and cancers. It also features hundreds of radiologic and pathologic images to supplement the classic Netter illustrations, as well as new illustrations created\n\n* Get complete, integrated visual guidance on the kidney, ureters, and bladder in a single source, from basic sciences and normal anatomy and function through pathologic conditions.\n\n* Adeptly navigate current controversies and timely topics in clinical medicine with guidance from expert editors, authors, and the input of an international advisory board.\n\n* Gain a rich, comprehensive clinical view of the urinary system by seeing classic \n\n* Netter anatomic illustrations side by side with cutting-edge radiologic images, pathology slides, and the latest molecular biology findings.\nVisualize the timely topics in nephrology and urology, including HIV-associated nephropathy, hepatorenal syndrome, laparoscopic and robotic surgeries, and tumor cryoblation.\n\n* See current clinical concepts captured in the visually rich Netter artistic tradition via contributions from Carlos Machado, MD, and other artists working in the Netter style.\n\nA reliable and effective reference on the urinary system with the visual support of Netter","torrent":{"xt":"urn:btih:112ceee9adc41d4a1ac87b1edd6578ede0073e94","amp;dn":"The+Netter+Collection+of+Medical+Illustrations%2C+2E%2C+Vol+5-+Urina","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"112ceee9adc41d4a1ac87b1edd6578ede0073e94","infoHashBuffer":{"type":"Buffer","data":[17,44,238,233,173,196,29,74,26,200,123,30,221,101,120,237,224,7,62,148]},"announce":[],"urlList":[]}}