{"title":"Depeche Mode - Music For The Masses (Remaster 2006) [EAC-FLAC] [","uid":5040569,"size":764000525,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:114913bc48d04112136312dc8685606e7057323e&amp;dn=Depeche+Mode+-+Music+For+The+Masses+%28Remaster+2006%29+%5BEAC-FLAC%5D+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"repopo","files":-1,"time":1249353495,"description":"*******************************************************************************\n              Depeche Mode - Music For The Masses (Remaster 2006)\n*******************************************************************************\n\nThis torrent contains both the Audio CD in its remastered stereo form, as \nreleased in 2006, plus a short video, which tells the story of DM during the \nera.  \n\nThe video is presented in XviD with .mp3 sound.  There are spanish and english \nsubtitles already ripped and a subpack which also includes subs in Deutsch, \nFranÃƒÂ§ais and Italiano.  You have to rip it yourself (I currently use SubRip on \nWindows), in order to use them.\n\nNote: There's no 5.1 audio here.  I repeat: there's no 5.1 audio here.  Only the \n2.0 stereo album remastered.  And sounds great!\n\n\nCD: Depeche Mode - Music For The Masses (Remastered - SACD)\n\n01. Never Let Me Down Again    [0:04:48.35]\n02. The Things You Said    [0:04:02.58]\n03. Strangelove    [0:04:54.49]\n04. Sacred    [0:04:49.58]\n05. Little 15    [0:04:18.69]\n06. Behind The Wheel    [0:05:18.03]\n07. I Want You Now    [0:03:44.40]\n08. To Have And To Hold    [0:02:51.39]\n09. Nothing    [0:04:18.08]\n10. Pimpf    [0:04:55.47]\n\nDOCUMENTARY\n\n87-88 Sometimes You Do Need Some New Jokes    [0:37:06]\n\n-------------------------------------------------------------------------------\n                              THE ALLMUSIC REVIEW\n-------------------------------------------------------------------------------\n\nby Ned Raggett\n\nInitially the title must have sounded like an incredibly pretentious boast, \nexcept that Depeche Mode then went on to do a monstrous world tour, score even \nmore hits in America and elsewhere than ever before, and pick up a large number \nof name checks from emerging house and techno artists on top of all that. As for \nthe music the masses got this time around, the opening cut, &quot;Never Let Me Down \nAgain,&quot; started things off wonderfully: a compressed guitar riff suddenly \nslamming into a huge-sounding percussion/keyboard/piano combination, anchored to \na constantly repeated melodic hook, ever-building synth/orchestral parts at the \nsong's end, and one of David Gahan's best vocals (though admittedly singing one \nof Martin Gore's more pedestrian lyrics). It feels huge throughout, like they \ntaped Depeche recording at the world's largest arena show instead of in a \nstudio. Other key singles &quot;Strangelove&quot; and the (literally) driving &quot;Behind the \nWheel&quot; maintained the same blend of power and song skill, while some of the \nquieter numbers such as &quot;The Things You Said&quot; and &quot;I Want You Now&quot; showed \nmusical and lyrical intimacy could easily co-exist with the big chart-busters. \nAdd to that other winners like &quot;To Have and to Hold,&quot; with its Russian radio \nbroadcast start and dramatic, downward spiral of music accompanied by Gahan's \nsubtly powerful take on a desperate Gore love lyric, and the weird, wonderful \nchoral closer, &quot;Pimpf,&quot; and Depeche's massive success becomes perfectly clear. \n\n-------------------------------------------------------------------------------\n                          SOME WIKIPEDIA INFORMATION\n-------------------------------------------------------------------------------\n\nMusic for the Masses is the sixth studio album by Depeche Mode. Released by Mute \nRecords on September 28, 1987, it provided the band with mainstream success in \nthe United States for the first time since Some Great Reward, and the new styles \nof music that appeared on the album and its predecessor Black Celebration formed \nthe foundation for their breakthrough effort, Violator.\n\nIt was supported by the Music for the Masses Tour, which compiles material into \nthe band's first live album 101.\n\nThe album became the band's highest-charting in the US upon its release, \nreaching #35 on the Billboard 200. It also contained more hit singles than any \nof their previous releases. While there was no extremely popular single from the \nalbum (&quot;People Are People&quot; from Some Great Reward reached #13 on the Billboard \nHot 100), the three singles that were released all made it onto the Hot 100, a \nfeat that hadn't been achieved by any Depeche Mode single after those from Some \nGreat Reward. Moreover, all three singles achieved modest success on the chart.\n\nThe first single from the album, &quot;Strangelove&quot;, only reached #76 and spent 6 \nweeks on the chart upon its initial release. &quot;Never Let Me Down Again&quot; was then \nissued and hit #63, spending 10 weeks on the chart. Its success was duplicated \nby &quot;Behind the Wheel&quot; which had a similar chart run. This propelled a re-\nreleased &quot;Strangelove&quot; (as &quot;Strangelove '88&quot;) to #50, making it the highest-\ncharting single from the album.\n\nThe story was similar in the United Kingdom. While no single reached the chart \nheights of Depeche Mode's early career, &quot;Strangelove&quot; narrowly became the band's \nsecond-highest charting single since 1984 when it hit #16. The two follow-up \nsingles charted in the upper 20s. The album was less successful, reaching only \n#10, though it was a major success throughout Europe. Generally, this album and \nits extracted singles continued the trend for Depeche Mode's releases to chart \nhigher in Continental Europe than in their home country: &quot;Strangelove&quot; and \n&quot;Never Let Me Down Again&quot; both hit #2 on the singles chart in what was then West \nGermany, &quot;Behind The Wheel&quot; hit #6 there, and &quot;Little 15&quot; reached #16.\n\nThe Music for the Masses Tour was one of Depeche Mode's biggest, notably because \nof the sell-out Pasadena Rose Bowl show where the band performed to around \n65,000 fans, cementing their place in United States alternative culture. This \nmade the band question if they had reached the peak of their careers, according \nto the 101 DVD, a documentary on the concert, but put that notion to rest with \nViolator, which was even more successful.\n\nIn 2006, Music For the Masses became one of the first Depeche Mode albums (along \nwith Speak and Spell and Violator) to be released on a special 2-Disc SACD/CD \nHybrid + DVD format, in the vein of their 2005 album Playing the Angel, which \nhad a limited edition SACD + DVD release. The format was the same as Playing the \nAngel's, the first disc had a special digitally remastered version of the album, \nwhile the DVD had the album on three formats (PCM Stereo, 5.1 Surround Sound and \nDTS 5.1) plus bonus tracks, and a documentary on the album. The rerelease \npreserves the album as it was originally intended. Thus, the four bonus tracks \ndo not appear on the SACD, but appear on the DVD. The DVD also features all B-\nSides from the Music for the Masses era, but unlike the album and the bonus \ntracks, are only available in PCM Stereo.\n\nThe documentary, a 37 minute short film called Depeche Mode: 1987-88 (Sometimes \nYou Do Need Some New Jokes) is an extensive look at the album, featuring \ncommentary from a wide variety of people, including the current Depeche Mode, \nformer member Alan Wilder, producer Dave Bascombe, Daniel Miller, Daryl Bamonte, \nMartyn Atkins (who came up with the loudspeakers idea for the cover), Anton \nCorbijn, and others. The documentary features new facts on the album, and also \nan extensive look at the movie 101.\n\nThe rerelease came out April 3, 2006 in Europe. The US version was delayed to \nJune 2, 2006 and will only be available on a CD + DVD format, with no SACD. The \nDVD on all the versions are region independent however, so one can simply import \nthe SACD version without worrying about the DVD being incompatible.\n\n-------------------------------------------------------------------------------\n                       SOME TRACKS REVIEWED AT ALLMUSIC\n-------------------------------------------------------------------------------\n\nNEVER LET ME DOWN AGAIN     by Ned Raggett\n\nThat the Smashing Pumpkins covered this in later years isn't too surprising -- \nbut what is interesting is that they chose to do an acoustic version, perhaps \nfiguring they couldn't top the original. It's doubtful anyone could; with Martin \nGore's compressed guitar riff leading the way, Depeche here created not merely \nthe calling card for its smash success Music for the Masses album, but an all-\ntime anthem for the band and electronic music as a whole. About the only thing \nabout the song that doesn't totally work is the lyrics, which are suggestive but \nnot as intriguingly poisonous as so many of the band's other tunes. That one \nrhyme goes &quot;Promises me I'm safe as houses/As long as I remember who's wearing \nthe trousers&quot; is a bit giggle-worthy. David Gahan's performance of the same, \nhowever, is big and strong, Gore's hidden harmony vocals an extra. What really \nmakes the song is the overall delivery and arrangement, a massive beat echoing \nin the mix and the lead synth lines later accompanied by mock horns, strings, \nand more. It's as if Laibach were able to get one of its brutal post- Wagnerian \nepics onto the charts, and with a weird romantic patina at that. As Gore \ndelivers the last &quot;See the stars, they're shining bright&quot; line with the song's \nfade, it's clear the band were on even more of a roll than ever. \n\n\n\nSTRANGELOVE     by Ned Raggett\n\nReleased in a slightly different, more accessible remix than was originally \nfound on Music for the Masses, &quot;Strangelove&quot; is still another big, strong number \nfrom Depeche Mode, with an attention-grabbing start and lead melody, reflecting \nmember Alan Wilder's increasing skill at arrangements. Martin Gore's lyric is \nanother one of his sly, aggressively wounded best, David Gahan's almost \nchallenging vocal turn on it playing up the confessions of emotional guilt and \nsadism to an almost outrageous degree. Again, one has to wonder at how \neffortlessly Gore could make such material the open heart of a pop single, and a \nsuccessful one at that. Gahan's overdubbed vocals make the &quot;Pain -- will you \nreturn it?&quot; section equally grabbing, the bell/chime-like lead melody continuing \non relentlessly as much as the beat does, while Gore's spare, low guitar parts \nadd a sharp, unexpected hook on top of things. Extra synth orchestrations fill \nout the mix toward the end, the song as a whole a brilliantly effective \nencapsulation of hooks, studio experimentation, and production. \n\n\n\nBEHIND THE WHEEL     by Tim DiGravina\n\nDespite all of its imagery of driving and being a passenger, its opening sample \nof a wheel falling off a car, and its hypnotic beat symbolic of a car gliding \ndown a roadway, &quot;Behind the Wheel&quot; isn't really about automobiles at all. It's a \nclassic song of sexual submission or of just giving in to another person's \ncontrol over any aspect of one's life. Martin Gore's favorite subject has proven \nto be relationships, and &quot;Behind the Wheel&quot; blends a little bit of bondage and a \nlittle bit of codependence to make for a quintessential Depeche Mode song. David \nGahan seems completely and perfectly exhausted emotionally, singing &quot;Do what you \nwant; I don't care tonight/I hand myself over on a plate.&quot; He goes on to offer, \n&quot;I prefer you behind the wheel/And me the passenger.&quot; The ravishing beat and \nhigh-tech synth sounds that engulf Gahan's voice suggest he's looking for love \nas long as he doesn't have to be the one in control. He wants &quot;[his] little girl \n[to] come pull [his] strings.&quot; &quot;Behind the Wheel&quot; shares a sonic and thematic \nresemblance to &quot;Never Let Me Down Again.&quot; Where the latter sees escape in drugs, \nthe former finds similar comfort in giving up one's free will to a lover. A \nstylish promotional video for the song directed by Anton Corbijn was released in \n1987. \n\n\n\nI WANT YOU NOW     by Tim DiGravina\n\n&quot;I Want You Now&quot; couldn't be much more straight-forward. From its samples of \nlovers in ecstasy to Martin Gore's desperate pleas, the song has one focus and \none focus only: sex. Gore offers his vocals as if he's just stepped front and \ncenter from a church choir. The heavy breathing and cries of joy that surround \nhim work like pistons, adding texture, life, and a beat to the pensive keyboards \nand accordion musical backdrop. Without the moaning samples, &quot;I Want You Now&quot; \nwould probably be Depeche Mode's most spare musical offering, so it really was \nimperative that Gore set just the right tone with his vocals. The song would be \na study in atmosphere like &quot;Pimpf&quot; without Gore's vocals. Usually the songs that \nGore assigns to himself as a vocalist express deeper emotions, but here he's \nconcentrating on lust, even if he offers that he doesn't just &quot;want to be like \none of the boys.&quot; The wavering quiver in his voice paints his desperation and \ndesires perfectly. His repeated declaration of &quot;I want you now&quot; drips passion \nand frustration. Even if &quot;I Want You Now&quot; isn't Depeche Mode's most high concept \ncreation or most complex song, Martin Gore's captivating honesty makes the song \nan integral part of Music for the Masses. \n\n\n\nNOTHING     by Tim DiGravina\n\n&quot;Nothing&quot; is Music for the Masses' brightest and most musically upbeat track, \ndespite the fact that it expresses an unrelenting sense of indifference. When \none thinks of Depeche Mode's energetic 101 film and album, the rollicking \n&quot;Nothing&quot; might pop to mind. One imagines Dave Gahan spinning in circles or \nraising his mic stand to the heavens, and it's difficult not to add his 101 \nshouts of &quot;thank you&quot; and his general exultations and grunts over the keyboard \nsolos on the Music for the Masses version. The song consists of two primary \nsegments: a percolating sampler section where Gahan sings of &quot;sitting waiting&quot; \nand &quot;life's&quot; unadvertised surprises and an addictively catchy quickening where \nGahan tells listeners there's not really much new to say. All along the way, \nMartin Gore and company provide a backdrop of hushed harmonies, mostly singing \nthe world &quot;nothing&quot; sweetly as a group. The contrast of &quot;Nothing&quot;'s bored lyrics \nand its jangling, jolly electronics makes for a humorous, interesting listen. \nThat the album follows up the song with the atmospheric epic &quot;Pimpf&quot; only serves \nto make Music for the Masses a more compelling, varied experience. \n\n-------------------------------------------------------------------------------\n                               EAC LOG EXTRACT\n-------------------------------------------------------------------------------\n\nExact Audio Copy V0.99 prebeta 4 from 23. January 2008\n\nEAC extraction logfile from 2. August 2009, 14:16\n\nDepeche Mode / Music For The Masses (Remastered)\n\nUsed drive  : HL-DT-STDVD-RAM GSA-H55N   Adapter: 0  ID: 0\n\nRead mode               : Secure\nUtilize accurate stream : Yes\nDefeat audio cache      : Yes\nMake use of C2 pointers : No\n\nRead offset correction                      : 102\nOverread into Lead-In and Lead-Out          : No\nFill up missing offset samples with silence : Yes\nDelete leading and trailing silent blocks   : No\nNull samples used in CRC calculations       : Yes\nUsed interface                              : Installed external ASPI interface\nGap handling                                : Appended to previous track\n\nUsed output format              : User Defined Encoder\nSelected bitrate                : 1024 kBit/s\nQuality                         : High\nAdd ID3 tag                     : No\nCommand line compressor         : F:Archivos de programaExact Audio \nCopyFLACFLAC.EXE\nAdditional command line options : -8 -V -T &quot;ARTIST=%a&quot; -T &quot;TITLE=%t&quot; -T \n&quot;ALBUM=%g&quot; -T &quot;DATE=%y&quot; -T &quot;TRACKNUMBER=%n&quot; -T &quot;GENRE=%m&quot; -T &quot;COMMENT=%e&quot; %s -o \n%d\n\n-------------------------------------------------------------------------------\n                                ACCURIP REPORT\n-------------------------------------------------------------------------------\n\n[Verification date: 02/08/2009 14:17:08]\n[Disc ID: 0010f6d4-0086d514-880a520a]\nTrack\t[ CRC    ] Status\n 01\t[105bb268] (72/99) Accurately ripped as in pressing(s) #1\n 02\t[8f252737] (73/101) Accurately ripped as in pressing(s) #1\n 03\t[b0a78bdd] (72/100) Accurately ripped as in pressing(s) #1\n 04\t[2cc8d3fa] (72/100) Accurately ripped as in pressing(s) #1\n 05\t[d1df716b] (71/99) Accurately ripped as in pressing(s) #1\n 06\t[a8025b39] (73/101) Accurately ripped as in pressing(s) #1\n 07\t[ff0ab45f] (71/99) Accurately ripped as in pressing(s) #1\n 08\t[0a708c0c] (72/100) Accurately ripped as in pressing(s) #1\n 09\t[78e35a59] (70/98) Accurately ripped as in pressing(s) #1\n 10\t[1e074075] (67/94) Accurately ripped as in pressing(s) #1\n\n-------------------------------------------------------------------------------\n                      IMPORTANT: PLEASE READ (A REQUEST)\n-------------------------------------------------------------------------------\n\nIt's usual to post comments only to complain about a torrent which doesn't work \nin your configuration.  It's normal, after a few hours/days downloading and \nexpecting a release, to feel deceived if it doesn't work properly, and \nexpressing this is legitimate.\n\nI've often found one comment (negative) on a movie/CD downloaded by 2000+ \npeople, and since that single negative feedback, people simply stop downloading \nand therefore, sharing.  But a few times it was due not to the torrent itself, \nbut to some issues on the downloader side (not updated codecs, misused \ntools...), and that's unfair for the person who took the time to share it for\nfree.\n\nIF YOU FIND THIS RELEASE DESERVES TO BE RECOMMENDED TO OTHERS, HELP BY DROPPING \nA LINE AFTER YOU'VE CHECKED IT.  This way, You'll help in keeping the torrent \nalive, almost as much as keeping it in your HDD until a 1:1 ratio is\nreached.\n\nThanks\n\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:114913bc48d04112136312dc8685606e7057323e","amp;dn":"Depeche+Mode+-+Music+For+The+Masses+%28Remaster+2006%29+%5BEAC-FLAC%5D+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"114913bc48d04112136312dc8685606e7057323e","infoHashBuffer":{"type":"Buffer","data":[17,73,19,188,72,208,65,18,19,99,18,220,134,133,96,110,112,87,50,62]},"announce":[],"urlList":[]}}