{"title":"Behold the Dreamers_ A Novel - Imbolo Mbue","uid":15645357,"size":1006561,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:122e181d43fefd56a1bd2875cc4c47d2bad5b6e5&amp;dn=Behold+the+Dreamers_+A+Novel+-+Imbolo+Mbue&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mr_mando","files":2,"time":1472049194,"description":"A compulsively readable debut novel about marriage, immigration, class, race, and the trapdoors in the American Dream—the unforgettable story of a young Cameroonian couple making a new life in New York just as the Great Recession upends the economy\r\n\r\nJende Jonga, a Cameroonian immigrant living in Harlem, has come to the United States to provide a better life for himself, his wife, Neni, and their six-year-old son. In the fall of 2007, Jende can hardly believe his luck when he lands a job as a chauffeur for Clark Edwards, a senior executive at Lehman Brothers. Clark demands punctuality, discretion, and loyalty—and Jende is eager to please. Clark’s wife, Cindy, even offers Neni temporary work at the Edwardses’ summer home in the Hamptons. With these opportunities, Jende and Neni can at last gain a foothold in America and imagine a brighter future.\r\n\r\nHowever, the world of great power and privilege conceals troubling secrets, and soon Jende and Neni notice cracks in their employers’ façades.\r\n\r\nWhen the financial world is rocked by the collapse of Lehman Brothers, the Jongas are desperate to keep Jende’s job—even as their marriage threatens to fall apart. As all four lives are dramatically upended, Jende and Neni are forced to make an impossible choice","torrent":{"xt":"urn:btih:122e181d43fefd56a1bd2875cc4c47d2bad5b6e5","amp;dn":"Behold+the+Dreamers_+A+Novel+-+Imbolo+Mbue","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"122e181d43fefd56a1bd2875cc4c47d2bad5b6e5","infoHashBuffer":{"type":"Buffer","data":[18,46,24,29,67,254,253,86,161,189,40,117,204,76,71,210,186,213,182,229]},"announce":[],"urlList":[]}}