{"title":"Boardwalk Empire Seasons 1-3 Complete HDTV {KNIX} ","uid":8485181,"size":19336631015,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:12520be6d9409f46735a76901ccac3862b429efc&amp;dn=Boardwalk+Empire+Seasons+1-3+Complete+HDTV+%7BKNIX%7D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":9,"uploader":"knix14760","files":37,"time":1368838960,"description":"From Terence Winter, Emmy Award-winning writer of 'The Sopranos,' and Academy Award-winning director Martin Scorsese, 'Boardwalk Empire' is set in Atlantic City during Prohibition, when the sale of alcohol became illegal throughout the United States.\n\nAmerica in the 1920s. The Great War is over, Wall Street is about to boom and everything is for sale, even the World Series. It is a time of change: Women have the right to vote, broadcast radio spreads the news, young people rule the world, and Prohibition gave birth to various criminal enterprises.\n\nOn the beach in southern New Jersey sits Atlantic City, a spectacular resort known as &quot;The World's Playground,&quot; a place where rules don't apply. Massive hotels line its famous Boardwalk, along with nightclubs, amusement piers and entertainment to rival Broadway. For a few dollars, a working man can get away and live like a king -- legally or illegally.\n\nThe undisputed ruler of Atlantic City is Enoch &quot;Nucky&quot; Thompson, (Steve Buscemi) a political fixer and backroom dealer who is equal parts politician and gangster and equally comfortable in either role. Because of its strategic location on the seaboard, the town is a hub of activity for rum-runners, minutes from Philadelphia, hours from New York City and a day's drive from Chicago. And Nucky Thompson takes full advantage.","torrent":{"xt":"urn:btih:12520be6d9409f46735a76901ccac3862b429efc","amp;dn":"Boardwalk+Empire+Seasons+1-3+Complete+HDTV+%7BKNIX%7D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12520be6d9409f46735a76901ccac3862b429efc","infoHashBuffer":{"type":"Buffer","data":[18,82,11,230,217,64,159,70,115,90,118,144,28,202,195,134,43,66,158,252]},"announce":[],"urlList":[]}}