{"title":"Jonah From Tonga S01 complete","uid":10375136,"size":822933304,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:12afcbf85df60eb242e1d5c2b773955b4d7d6f1d&amp;dn=Jonah+From+Tonga+S01+complete+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"dwmusic","files":6,"time":1402982875,"description":"Series Description:\nJonah From Tonga takes us on an adventurous journey into the life of 14-year-old rebellious schoolboy Jonah Takalua, his family, friends and the crew of teachers and counsellors who are exhaustively trying to help him channel his seemingly limitless energy into bigger and brighter things.\n\nDescription of episodes: \n\nE01: \nBanished to Tonga to live with his uncle, fourteen-year-old Jonah is causing more trouble than ever. His dad takes him back to Sydney to start a new life, but he quickly forms a new school gang and it's not long until trouble starts.\nE02:\nJonah and the Fobbalicious boys are forced to meet with youth worker Kool Kris after making bully videos. But when Jonah's brother is picked on, he gathers Year Seven rangas and attempts to make the ultimate bully video.\n\nE03:\nWhile grounded, Jonah and the Fobbalicious boys escape and go bowling. Their counselling session with Kool Kris leads to the boys taking part in the 'Feel Da Beat' song competition.\n\nE04:\nAfter a crazy day at school, Jonah and the boys embark on their biggest, most dangerous mission yet, but their plans backfire in a massive way.\n\nE05:\nJonah's harsh new surrounds bring new opponents and some unexpected allies. But the pressure is mounting on family, fame and friendship.\n\nE06:\nJonah entertains his mates with all his stories of prison life but will Jonah still find himself behind bars with other bad boys or will he prove he can be a real man? ","torrent":{"xt":"urn:btih:12afcbf85df60eb242e1d5c2b773955b4d7d6f1d","amp;dn":"Jonah+From+Tonga+S01+complete+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12afcbf85df60eb242e1d5c2b773955b4d7d6f1d","infoHashBuffer":{"type":"Buffer","data":[18,175,203,248,93,246,14,178,66,225,213,194,183,115,149,91,77,125,111,29]},"announce":[],"urlList":[]}}