{"title":"The White Stripes - Elephant [24 bit FLAC] vinyl","uid":8111676,"size":1017243387,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:132ed8f1a744d7d231293adab49aeca7442eeec9&amp;dn=The+White+Stripes+-+Elephant+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"24.96","files":-1,"time":1360200569,"description":"  White Blood Cells may have been a reaction to the amount of fame the White Stripes had received up to the point of its release, but, paradoxically, it made full-fledged rock stars out of Jack and Meg White and sold over half a million copies in the process. Despite the White Stripes' ambivalence, fame nevertheless seems to suit them: They just become more accomplished as the attention paid to them increases. Elephant captures this contradiction within the Stripes and their music; it's the first album they've recorded for a major label, and it sounds even more pissed-off, paranoid, and stunning than its predecessor. Darker and more difficult than White Blood Cells, the album offers nothing as immediately crowd-pleasing or sweet as &quot;Fell in Love With a Girl&quot; or &quot;We're Going to Be Friends,&quot; but it's more consistent, exploring disillusionment and rejection with razor-sharp focus. Chip-on-the-shoulder anthems like the breathtaking opener, &quot;Seven Nation Army,&quot; which is driven by Meg White's explosively minimal drumming, and &quot;The Hardest Button to Button,&quot; in which Jack White snarls &quot;Now we're a family!&quot; - one of the best oblique threats since Black Francis sneered &quot;It's educational!&quot; all those years ago - deliver some of the fiercest blues-punk of the White Stripes' career. &quot;There's No Home for You Here&quot; sets a girl's walking papers to a melody reminiscent of &quot;Dead Leaves and the Dirty Ground&quot; (though the result is more sequel than rehash), driving the point home with a wall of layered, Queen-ly harmonies and piercing guitars, while the inspired version of &quot;I Just Don't Know What to Do With Myself&quot; goes from plaintive to angry in just over a minute, though the charging guitars at the end sound perversely triumphant. At its bruised heart, Elephant portrays love as a power struggle, with chivalry and innocence usually losing out to the power of seduction. &quot;I Want to Be the Boy&quot; tries, unsuccessfully, to charm a girl's mother; &quot;You've Got Her in Your Pocket,&quot; a deceptively gentle ballad, reveals the darker side of the Stripes' vulnerability, blurring the line between caring for someone and owning them with some fittingly fluid songwriting.\n \n  The battle for control reaches a fever pitch on the &quot;Fell in Love With a Girl&quot;-esque &quot;Hypnotize,&quot; which suggests some slightly underhanded ways of winning a girl over before settling for just holding her hand, and on the show-stopping &quot;Ball and Biscuit,&quot; seven flat-out seductive minutes of preening, boasting, and amazing guitar prowess that ranks as one the band's most traditionally bluesy (not to mention sexy) songs. Interestingly, Meg's star turn, &quot;In the Cold, Cold Night,&quot; is the closest Elephant comes to a truce in this struggle, her kitten-ish voice balancing the song's slinky words and music. While the album is often dark, it's never despairing; moments of wry humor pop up throughout, particularly toward the end. &quot;Little Acorns&quot; begins with a sound clip of Detroit newscaster Mort Crim's Second Thoughts radio show, adding an authentic, if unusual, Motor City feel. It also suggests that Jack White is one of the few vocalists who could make a lyric like &quot;Be like the squirrel&quot; sound cool and even inspiring. Likewise, the showy &quot;Girl, You Have No Faith in Medicine&quot; - on which White resembles a garage rock snake-oil salesman - is probably the only song featuring the word &quot;acetaminophen&quot; in its chorus. &quot;It's True That We Love One Another,&quot; which features vocals from Holly Golightly as well as Meg White, continues the Stripes' tradition of closing their albums on a lighthearted note. Almost as much fun to analyze as it is to listen to, Elephant overflows with quality - it's full of tight songwriting, sharp, witty lyrics, and judiciously used basses and tumbling keyboard melodies that enhance the band's powerful simplicity (and the excellent &quot;The Air Near My Fingers&quot; features all of these). Crucially, the White Stripes know the difference between fame and success; while they may not be entirely comfortable with their fame, they've succeeded at mixing blues, punk, and garage rock in an electrifying and unique way ever since they were strictly a Detroit phenomenon. On these terms, Elephant is a phenomenal success.","torrent":{"xt":"urn:btih:132ed8f1a744d7d231293adab49aeca7442eeec9","amp;dn":"The+White+Stripes+-+Elephant+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"132ed8f1a744d7d231293adab49aeca7442eeec9","infoHashBuffer":{"type":"Buffer","data":[19,46,216,241,167,68,215,210,49,41,58,218,180,154,236,167,68,46,238,201]},"announce":[],"urlList":[]}}