{"title":"Ministry Monday #2","uid":10599882,"size":160974929,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:13d11c5cf5deeee5fa7eeff06a40e47297edf9c4&amp;dn=Ministry+Monday+%232&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Coma13","files":4,"time":1405904111,"description":"MINISTRY MONDAYS #2\n\nSo we've made it to week #2 of these Ministry Mondays. This week we have Punch in the Face (remember we are releasing the RemiXXXes in the order of the album) and Ministry's Engineer, Sammy D, (he has a different last name but I can't fucking spell it) writes a little about why this particular remix was special to him. \n\nAlso, just for those who care, we are releasing a smaller MP3 version on this website but if you want the full 320 experience, download it from The Pirate Bay. To make up for those that wanted the 320 of last weeks, I uploaded it with this weeks torrent. If you don't know the difference between 320 and 420... just click on the link below and don't let anyone harsh your mellow today.\n\nSo, remember: 1. like my Alien Jourgensen and Ministry fan pages on Facebook AND hit up my Twitter @alfknjourgensen. 2. Set a link back to us from you website, social media or online magazines.\n\nHow easy was that... one new track gets released EVERY Monday (along with some extras on the Pirate Bay... yes...THAT Pirate Bay) and will be released in the same order as on the album. If that weren't enough...we're gonna do the same with the Relapse remixxxes after From Beer to Eternity's are all done... so download away..\n\n-Uncle Al\nwww.alfuckingjourgensen.com\n\nIncludes:\n \nPunch in the Face (Drop the Gloves RemiXXX) 320\nWebisode of Sin and a naked bear.\nHail to His Majest (BadMuthaFucka MiXXX) 320\nPunch in the Face Youtube Video\n\n\n ","torrent":{"xt":"urn:btih:13d11c5cf5deeee5fa7eeff06a40e47297edf9c4","amp;dn":"Ministry+Monday+%232","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13d11c5cf5deeee5fa7eeff06a40e47297edf9c4","infoHashBuffer":{"type":"Buffer","data":[19,209,28,92,245,222,238,229,250,126,239,240,106,64,228,114,151,237,249,196]},"announce":[],"urlList":[]}}