{"title":"ABBYY Lingvo x5 «20 languages» Professional 15.0.826","uid":8912267,"size":2791200583,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:13f7a1dc2492f78fe9bb0561bc97e9ec8d1e6bdd&amp;dn=ABBYY+Lingvo+x5+%26laquo%3B20+languages%26raquo%3B+Professional+15.0.826&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"yfjfrj","files":-1,"time":1379052871,"description":"                               Interface language - Russian\n\n\nABBYY Lingvo X5 Professional Edition 20 languages\n-----------------------------------------------------------------------------\nABBYY Lingvo Dictionary supports 20 languages: Chinese, Danish, Dutch, English, Finnish, French, German, Greek, Hungarian, Italian, Kazakh, Latin, Norwegian, Polish, Portuguese, Russian, Spanish, Tatar, Turkish, and Ukrainian languages.\nMore than 220 comprehensive dictionaries from authoritative publishers such as Oxford University Press, HarperCollins Publishers, ABBYY, ABBYY Press, Russky Yazyk Media and Russo with accurate definitions and translations for more than 12,600,000 headwords and phrases.\nGet translation from within any application or file including web-browsers, e-mails, documents, PDFs, images and even movie subtitles, by simply pointing the mouse cursor at them. This is convenient when working with several applications simultaneously, and it saves time spent on manual typing.\nCreate your custom dictionaries for preserving the integrity of terminology when translating corporate documents. Custom dictionaries can be added to the existing dictionary collection and become available for all users across the organization. You can enhance your custom dictionaries with pictures* of the described objects to provide more information on a specific term for easier translation processes. \nListen to the pronunciation of key words recorded by native speakers\nCreate and review flashcards to memorize new words\nView verb conjugations\nCollection of samples for official correspondence in English, German, French and Spanish\nMore than 1,000 illustrations in the New Oxford American Dictionary\nSystem Requirements\n1 GHz or faster processor\nMicrosoftÃ‚Â® WindowsÃ‚Â® 7, Microsoft Windows VistaÃ‚Â®, Microsoft Windows XP (Service Pack 2 or later), Microsoft Windows ServerÃ‚Â® 2003, Microsoft Windows Server 2008, Microsoft Windows Server 2008 R2. Windows Installer 3.0 or greater is required. Notes: (1) Cyrillic dictionary support required to work with the Russian language interface; (2) To work with Chinese language dictionary, you need install Chinese language fonts first\nAt least 512 MB RAM\n150 MB to 5 GB hard disk space, depending on the edition of ABBYY Lingvo x5 and the type of installation\nSound card, headphones or loudspeakers to listen to audio content\nMicrosoft Internet ExplorerÃ‚Â® 6.0, 7.0, 8.0\nDVD-ROM drive\nABBYY Lingvo x5 supports the following user interface languages:\nEnglish, Russian, Ukrainian\n-----------------------------------------------------------------------------\t\n","torrent":{"xt":"urn:btih:13f7a1dc2492f78fe9bb0561bc97e9ec8d1e6bdd","amp;dn":"ABBYY+Lingvo+x5+%26laquo%3B20+languages%26raquo%3B+Professional+15.0.826","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13f7a1dc2492f78fe9bb0561bc97e9ec8d1e6bdd","infoHashBuffer":{"type":"Buffer","data":[19,247,161,220,36,146,247,143,233,187,5,97,188,151,233,236,141,30,107,221]},"announce":[],"urlList":[]}}