{"title":"You Can Teach Med-Surg Nursing! [PDF] [StormRG]","uid":11037509,"size":4864653,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1466971da32f9140c7e976e4bd69bb54c8726807&amp;dn=You+Can+Teach+Med-Surg+Nursing%21+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":2,"time":1410810786,"description":"Author: Mary Miller RN MSN CCRN (Author), Deborah Wirwicz BSN MSN.Ed (Author)\nPaperback: 352 pages\nPublisher: Springer Publishing Company; 1 edition (July 29, 2014)\nLanguage: English\nISBN-10: 0826119077\nISBN-13: 978-0826119070\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n_______________________________________________________________________________\n\n\nThis is the first comprehensive resource for clinical medical-surgical nursing instructors responsible for guiding students through their entire clinical rotation. Filling a huge gap in resources for instructors required to teach this course, it contains everything the new or adjunct instructor needs to teach expertly and confidently. The guide describes the role of medical-surgical instructor and provides an introduction to the clinical site. It features a week-by-week instructional plan for the clinical rotation and includes all materials necessary to effectively perform administrative leadership and supervision, assess students' knowledge and learning styles, maximize the learning process, simplify evaluation, and help ensure a smooth transition to clinical practice.\n\nBrimming with helpful information, the guide will be a welcome companion to both experienced and novice medical-nursing instructors with its organizational teaching templates, teaching and learning resources, and evaluation materials. These include a course syllabus, comprehensive skills checklist, medication guidelines, resources for patient teaching, pre-and post-conference expectations and activities; even make-up assignments for students who miss a clinical class. Clinical instruction materials such as PowerPoints and simulation scenarios,are provided. Additionally, the book contains quizzes with answers, discussion questions, critical thinking exercises, and interactive student activities.\n\nKey Features:\nComprises the first complete resource for successfully guiding students through their clinical rotations from start to finish\nHelps to allay the &quot;fear factor&quot; for new and adjunct clinical nursing instructors\nProvides a week-by-week instructional guide that includes organizational teaching templates, teaching and learning resources, and evaluation aids\nIncludes numerous forms and templates to facilitate administrative responsibilities, student assessment, and student evaluation\nOrganizes key clinical information by body system and includes multiple interactive teaching tools","torrent":{"xt":"urn:btih:1466971da32f9140c7e976e4bd69bb54c8726807","amp;dn":"You+Can+Teach+Med-Surg+Nursing%21+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1466971da32f9140c7e976e4bd69bb54c8726807","infoHashBuffer":{"type":"Buffer","data":[20,102,151,29,163,47,145,64,199,233,118,228,189,105,187,84,200,114,104,7]},"announce":[],"urlList":[]}}