{"title":"Jeff Buckley - Grace (1994) [24 bit FLAC] vinyl","uid":9412247,"size":1097843658,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:14a032a79426437e271557dc4a47ed7e76cc1b18&amp;dn=Jeff+Buckley+-+Grace+%281994%29+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"politux","files":-1,"time":1388332600,"description":"\n  Jeff Buckley - Grace (1994) [24 bit FLAC] vinyl\n\n  Genre: Pop/Rock\n  Styles: Singer/Songwriter, Alternative\n  Source: Music On Vinyl 180 Gram LP (EU, MOVLP007)\n  Codec: FLAC\n  Bitrate: ~  2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  01 Mojo Pin\n  02 Grace\n  03 Last Goodbye\n  04 Lilac Wine\n  05 So Real\n  06 Hallelujah\n  07 Lover, You Should've Come Over\n  08 Courpus Christi Carol\n  09 Eternal Life\n  10 Dream Brother\n  \n  Rip Info (Ripped by Dr. Robert)\n  \n  Nitty Gritty RCM 1.5\n  Technics SL-1200MK2 Turntable \n  KAB Fluid Damping and KAB record grip\n  Ortofon 2M Black cartridge\n  Pro-Ject Tube Box SE II Preamp\n  Tascam US-144 external USB 2.0 Audiointerface\n  Bias Peak LE 6 recording software\n  iZotope RX Advanced 1.21 for Redbook conversion\n  xACT 1.71 for Redbook SBE correction\n\n  RCM&gt; TT &gt; Ortofon 2M Blk&gt; Tube Box preamp&gt; \n  ADC&gt; Mac Pro Dual Xeon&gt; Peak LE @ 24/96 &gt;\n  analyze (no clipping, no DC Bias offset, \n  eeach side maximized to -0.3 dB) &gt;\n  split into individual Tracks &gt; \n  Click Repair 3.02 used in Manual Mode, \n  30 Rev, Pitch Protection, X2 &gt;\n  FLAC encoded Level 8 with XLD Version 20100302 (116.7)\n\n  Since he was the son of cult songwriter Tim Buckley, Jeff Buckley faced more expectations and pre-conceived notions than most singer/songwriters. Perhaps it wasn't surprising that Jeff Buckley's music was related to his father's by only the thinnest of margins. Buckley's voice was grand and sweeping, which fit with the mock-operatic grandeur of his Van Morrison-meets-Led Zeppelin music. His audacious debut Grace made him one of the most popular alternative artists of the '90s, accentuated by his early and tragic death in 1997, and his cover of Leonard Cohen's &quot;Hallelujah&quot; virtually redefined the song for a modern audience.\n  \n  Buckley began playing while in high school. Eventually, he moved to Los Angeles to study music; while he was there, he performed with several jazz and funk bands, as well as playing with Shinehead, a leader in the dancehall reggae movement. A few years later, he moved to New York, forming Gods &amp; Monsters with the experimental guitarist Gary Lucas. The band became a hip name, yet their lifespan was short. Buckley began a solo career playing clubs and coffeehouses, building up a considerable following. Soon, he signed a record deal with Columbia Records, releasing the Live at Sin-e EP in November of 1993. It received good reviews, yet they didn't compare to the raves Buckley's full-length debut, 1994's Grace, received. Unlike the EP, the album was recorded with a full band, which gave the record textures that surprised some of his long-time New York followers. Nevertheless, it made several year-end &quot;Best of 1994&quot; lists and earned him a belated alternative hit, &quot;Last Goodbye,&quot; in the spring of 1995.\n  \n  A long hiatus followed as Buckley worked on material for his follow-up effort, provisionally titled My Sweetheart, The Drunk. Originally slated to be produced by Tom Verlaine, who later dropped out of the project, Buckley finally began work on the record in Memphis during the late spring of 1997. On the night of May 29, he and a friend traveled to the local Mud Island Harbor, where Buckley spontaneously decided to go swimming in the Mississippi River and waded into the water fully clothed. A few minutes later, he disappeared under the waves; authorities were quickly contacted, but to no avail -- on June 4, his body was finally found floating near the city's famed Beale Street area. Buckley was 30 years old. A collection of unreleased recordings, Sketches for My Sweetheart the Drunk, appeared in 1998, and two live albums arrived during 2000-2001, Mystery White Boy and Live a l'Olympia.","torrent":{"xt":"urn:btih:14a032a79426437e271557dc4a47ed7e76cc1b18","amp;dn":"Jeff+Buckley+-+Grace+%281994%29+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14a032a79426437e271557dc4a47ed7e76cc1b18","infoHashBuffer":{"type":"Buffer","data":[20,160,50,167,148,38,67,126,39,21,87,220,74,71,237,126,118,204,27,24]},"announce":[],"urlList":[]}}