{"title":"StreetMeatAsia - Protude","uid":12092522,"size":861086658,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:14ec03f06c06500a6a3cc51a31f4f54e86781d46&amp;dn=StreetMeatAsia+-+Protude&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Ctrlme","files":1,"time":1436092223,"description":"Screenshot(s): &lt;a href=&quot;\nhttp://imgctrl.com/image/AJ1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/AJ1&lt;/a&gt; &lt;a href=&quot;\nhttp://imgctrl.com/image/AJO&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/AJO&lt;/a&gt;\n\nDon't you feel sorry? Sorry for those unfortunate girls, the nuts and the crazies? They all need love too you know. Protrude was completely nutty at one early point in her life. Totally out of it, howling at the moon at night, never knowing that she could be accepted as part of the human race. She ended up in an asylum. She ripped the curtains off her window, tore up her sheets, trashed her cell. Foul mouthed filthy little fucker, she was punished with six months solitary confinement. There she lay in a large light room, with no furniture, except an enormous replica penis. It was made out of toughened polyethylene, and was almost indestructible by bear hands. Protrude could not trash this cell, there was nothing in it, but she thrashed away at the penis with no effect. Gradually, after days, weeks, and months, she came to accept that the penis was to be respected, and was the center point of her life. She calmed down. She grew to love the penis. She yearned for real penis. A changed girl with a goal in life and a reason to live contently with other people, she was released. Protrude became a gogo girl, and now has penises to talk to and caress on a regular basis. Now you might want to know why a girl has such an unusual name, Protrude. It was noted by one of the asylum male nurses that when she was skipping about in her cell naked, as she often was, that her vaginal mound was more than merely prominent, it was large and protruded rearwards, almost the same size as her small buttocks. Watch out for it on the video. Thank goodness for mental hospitals.\n\nâ˜† Ctrlme Exclusive Torrent List â˜† Daily Updates &lt;a href=&quot;\nhttps://pirates-forum.org/Thread-Ctrlme-Exclusive-Torrent-List&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/Thread-Ctrlme-Exclusive-Torrent-List&lt;/a&gt;","torrent":{"xt":"urn:btih:14ec03f06c06500a6a3cc51a31f4f54e86781d46","amp;dn":"StreetMeatAsia+-+Protude","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14ec03f06c06500a6a3cc51a31f4f54e86781d46","infoHashBuffer":{"type":"Buffer","data":[20,236,3,240,108,6,80,10,106,60,197,26,49,244,245,78,134,120,29,70]},"announce":[],"urlList":[]}}