{"title":"Divinity.Original.Sin.[v1.0.107.0].Repack-R.G.Mechanics","uid":10732884,"size":5761380592,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:157992a56dd58221e492a8d42e3c1fb29b0da927&amp;dn=Divinity.Original.Sin.%5Bv1.0.107.0%5D.Repack-R.G.Mechanics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Taker009","files":-1,"time":1407647845,"description":"Divinity.Original.Sin.[v1.0.107.0].Repack-R.G.Mechanics\n\n\n\n\n\nRelease Info:\n\n\nYear: 2014\nGenre: RPG / 3D / Isometric\nDeveloper: Larian Studios\nPublisher: Larian Studios\nPublication Type: RePack\nGame Language: Eng |Rus\nVoiceLanguage: Eng\nCrack : 3DMGAME | RELOADED\n\n\n\nSystem Requirements:\n\nOperating system: Windows Vista, Windows 7, Windows 8\nProcessor: Intel Core2 Duo E6600 or equivalent\nMemory: 2 GB\nVideo Card: NVIDIA Geforce 8800GTS / ATI Radeon HD 3870 or better DirectX 9.0c compatible\nSound Card: Sound device compatible with DirectXÂ® 9.0\nFree space on hard disk: 10.5 GB\n\nGame information:\n:\nIn the story of Divinity: Original Sin us falls\nthe role of some &quot;Hunters source&quot; - a little-known\nwarriors guild, which had already been dubbed &quot;magic police.&quot;\n\nIn this largely storyline Divinity: Original Sin event precedes\nthe very first part of the Divinity, which marked the beginning\nof the world-famous fantasy series. We are waiting for the familiar\ncharacters, but radically different approach to the story campaign.\n\nFrom the outset, the passage of Divinity: Original Sin tell\nus that the world faces an invasion of orcs rivellona Tanarota\nwho managed to master the powerful magic that distort reality.\nNow free peoples in Divinity simply impossible to resist the\nfury of the orcs, and only two people are able to prevent future wars.\n\nSo, the main characters Divinity: Original Sin became at\nonce two characters: damn warrior, who was released from\ncustody, and a mysterious girl, who managed to conquer death.\nHowever, throughout the game in Divinity saved pleasant affair:\nHeroes combines some terrible secret which will only be able to find you.\n\nAnother key feature of Divinity: Original Sin was that the game\nimplements a classless system, which will be the basis of a number\nof diverse abilities to develop skills of the protagonists. However,\nin order to resist the stronger enemies in Divinity: Original Sin\nimplemented to collect detachments of troops, which can be assigned to\ncommanders, as well as steps to improve the combat system of the army.\n\nThe game world in the new part of Divinity surprise you its realism\nand openness: you will travel through the vast Rivellon, facing face\nto face with a variety of unknown creatures, showing extreme caution.\nEach offense in the world Divinity can cost you your life!\n\nGame Features:\n\nThe two main characters\nThe lack of classes in the system of character development\nSet of capabilities and a wide arsenal of weapons\nAbility to recruit mercenaries in the squad and develop\ngeneral skills and spells to deal effectively with the enemy\nAdvanced system of dialogues, which gives\nan opportunity to express their point of view\nInteraction with any objects and combining them to create new objects\nTurn-based battle system with the ability to implement\nan elaborate tactics, using and combining skills, spells,\nterrain and terrain features, work together\nMultiplayer mode.\nLevel editor. Two in one: the game and the opportunity to\ncreate your own campaign!\nMusic for the game was written by Kirill Pokrovsky,\nthe ex-keyboardist of &quot;Aria&quot; and &quot;Masters&quot;\n\nRepack Features:\n\nDivinity: Original Sin\nVersion of the game - v1.0.107.0\nDo not cut / recoded\n\nChoice of Cracks during installation between 3DMGAME &amp; RELOADED\n\nAdditions :\n\nThe Golden Grail\nZandalor's Trunks\n","torrent":{"xt":"urn:btih:157992a56dd58221e492a8d42e3c1fb29b0da927","amp;dn":"Divinity.Original.Sin.%5Bv1.0.107.0%5D.Repack-R.G.Mechanics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"157992a56dd58221e492a8d42e3c1fb29b0da927","infoHashBuffer":{"type":"Buffer","data":[21,121,146,165,109,213,130,33,228,146,168,212,46,60,31,178,155,13,169,39]},"announce":[],"urlList":[]}}