{"title":"The Passivhaus Handbook (ePUB,Retail){32Skulls}","uid":11171861,"size":16901011,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1653e1448558074cb7c04e6032e1f519d686e8a6&amp;dn=The+Passivhaus+Handbook+%28ePUB%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"32Skulls","files":-1,"time":1412716838,"description":"                     â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\nAs we move towards the 2016 zero carbon target in house building, Passivhaus construction looks like becoming not just popular in the UK, but commonplace. This is a no-nonsense and engaging introduction on how to do it.' Kevin McCloud The Passivhaus Handbook is an essential guide for anyone wanting to realise a supremely comfortable, healthy and durable home with exceptionally low energy costs. Passivhaus design focuses on getting the building fabric right, to achieve ultra-low energy consumption in the most cost-effective manner. The approach is relevant to a wide range of building types and climates. Passivhaus methodology can be combined with elements of other building standards, such as the Code for Sustainable Homes (CSH), or with other sustainable building goals, such as a commitment to using low-impact or natural building materials. Whether you are building an extension, retrofitting your house or starting from scratch, and whether you are new to low-energy design or already have some experience, this book will help you navigate around the potential pitfalls and misconceptions. It brings together current thinking and best practice. the book includes: A clear explanation of the underlying building physics and terminology. Detailed information on key elements of Passivhaus: avoiding air leakage, designing out thermal (cold) bridges, moisture management and ventilation strategy. Practical advice on setting up a project, including developing a motivated project team. A discussion of economic considerations and the policy context in the UK. As pressure on global resources increases and energy prices continue to rise, the Passivhaus approach, proven over 20 years, meets the challenge of ultra-low-energy building for the future.\n\n\nBy Janet Cotterell, Adam Dadeby\nPublished by UIT Cambridge Ltd. in 2012\nEPUB, Retail, 257 pages, English ","torrent":{"xt":"urn:btih:1653e1448558074cb7c04e6032e1f519d686e8a6","amp;dn":"The+Passivhaus+Handbook+%28ePUB%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1653e1448558074cb7c04e6032e1f519d686e8a6","infoHashBuffer":{"type":"Buffer","data":[22,83,225,68,133,88,7,76,183,192,78,96,50,225,245,25,214,134,232,166]},"announce":[],"urlList":[]}}