{"title":"The.Chronicles.of.Nadiya-2.Eps--w.subs-468p-MP4","uid":15724006,"size":1314148998,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:168bfa1936ef100e1cab93459191db2f3f95bdd3&amp;dn=The.Chronicles.of.Nadiya-2.Eps--w.subs-468p-MP4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"uggauga","files":4,"time":1472692119,"description":"The Chronicles of Nadiya\r\n\r\nTwo-part series in which The Great British Bake Off 2015 winner Nadiya Hussain explores the recipes that have shaped her love of cooking\r\n\r\nBBC (2016) - 2 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/b07r272z\r\n________________________________________\r\n\r\n832x468 resolution - MP4 files\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - Enjoy !!\r\n________________________________________\r\n\r\nEpisode 1 of 2\r\nNadiya Hussain visits her family village near Sylhet in the north east of the Bangladesh. Using local produce and techniques she shares her favourite recipes, including baked fish with green mango chutney and a halva called thoosha shinni. As she cooks she reveals the roots of Bangladeshi cuisine.\r\nWhen she is invited to a relative's wedding, Nadiya decides to bake a three-tiered pumpkin celebration cake for the bride. It is a decision she may have thought twice about if she had realised the only available oven would be in an industrial bakery.\r\nThis trip is also a chance to reconnect with family Nadiya has not seen since her own arranged marriage over ten years ago, and it proves to be a moving trip down memory lane.\r\n\r\nEpisode 2 of 2\r\nNadiya has just spent a week with her family in Sylhet, and in this episode, she is setting off on her own to cook her way around Bangladesh and learn more about the country, its people and its food.\r\nIn the capital city, Dhaka, Nadiya spends time with a charity that delivers school dinners to some of the country's most deprived children and she cooks coconut and fennel samosas as a delicious treat for the kids.\r\nInvited to travel south from Dhaka aboard one of the last remaining rocket steamer passenger ferries, Nadiya cooks the captain and crew a delicious goat biryani to say thank you. As she travels deeper into Bangladesh, she visits a small Hindu fishing village on the banks of the Padma, where she learns about an ancient fishing method that uses trained otters, and she cooks one of her favourite dishes - grilled chicken with shatkora pickle - to share with the fisherman and his family.\r\nNadiya's journey continues across Bangladesh as she meets and learns from food entrepreneurs and experiences a side of modern Bangladesh she never knew existed. As her adventure comes to an end, she returns to her family village to share one last meal - beef curry with spiced okra and rice chapatis - and say her goodbyes, filled with optimism and pride and a better understanding of herself and Bangladesh","torrent":{"xt":"urn:btih:168bfa1936ef100e1cab93459191db2f3f95bdd3","amp;dn":"The.Chronicles.of.Nadiya-2.Eps--w.subs-468p-MP4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"168bfa1936ef100e1cab93459191db2f3f95bdd3","infoHashBuffer":{"type":"Buffer","data":[22,139,250,25,54,239,16,14,28,171,147,69,145,145,219,47,63,149,189,211]},"announce":[],"urlList":[]}}