{"title":"Tell the Truth Shame the Devil - Melina Marchetta [EN EPUB MOBI]","uid":16008439,"size":1367074,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:16ba4345f216d130b8690f230149390cc23282e9&amp;dn=Tell+the+Truth+Shame+the+Devil+-+Melina+Marchetta+%5BEN+EPUB+MOBI%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"perfect_stan","files":3,"time":1476207460,"description":"Tell the Truth, Shame the Devil by Melina Marchetta\r\nEnglish | 2016 | Mystery &amp; Thriller | 1.3 MB\r\n\r\n\r\nMelina Marchetta’s gripping new novel Tell the Truth, Shame the Devil is part family saga, part crime fiction, and wholly unputdownable.\r\nChief Inspector Bish Ortley of the London Met, divorced and still grieving the death of his son, has been drowning his anger in Scotch. Something has to give, and he’s no sooner suspended from the force than a busload of British students is subject to a deadly bomb attack across the Channel. Bish’s daughter is one of those on board.\r\nAlso on the bus is Violette LeBrac. Raised in Australia, Violette has a troubled background. Thirteen years ago her grandfather bombed a London supermarket, killing dozens of people. Her mother, Noor, is serving a life sentence in connection with the incident. But before Violette’s part in the French tragedy can be established she disappears.\r\nBish, who was involved in Noor LeBrac’s arrest, is now compelled to question everything that happened back then. And the more he delves into the lives of the family he helped put away, the more he realises that truth wears many colours.\r\nTell the Truth, Shame the Devil is an irresistible novel about human identity, lost children and the nature of real love. With a cast of unforgettable characters and Melina Marchetta’s trademark social insight and wry wit, it’s a cracking fusion of suspense and heart-rending drama.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:16ba4345f216d130b8690f230149390cc23282e9","amp;dn":"Tell+the+Truth+Shame+the+Devil+-+Melina+Marchetta+%5BEN+EPUB+MOBI%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16ba4345f216d130b8690f230149390cc23282e9","infoHashBuffer":{"type":"Buffer","data":[22,186,67,69,242,22,209,48,184,105,15,35,1,73,57,12,194,50,130,233]},"announce":[],"urlList":[]}}