{"title":"ZBrush Studio Projects: Realistic Game Characters","uid":8458379,"size":117525455,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:16c2d667382bef494674f264c8e7aec93a769a26&amp;dn=ZBrush+Studio+Projects%3A+Realistic+Game+Characters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Niksrock","files":-1,"time":1368160618,"description":"Tips and techniques for bringing reality and creativity to your game characters and art\n\nAs video games evolve, the bar moves ever higher for realism, one of the most challenging artistic frontiers is creating realistic human characters. In ZBrush Studio Projects: Realistic Game Characters, ZBrush expert Ryan Kingslien zeroes in on specific areas of concern for game creation: human body style, faces, skin texturing, clothing, shoes, weaponry, and putting your character into a game environment. Throughout the book Ryan offers tips and insights that provide readers with the depth and breadth they need to bring reality and creativity to their game characters and art. Projects start from the beginning, just as they do in the studio, with the author to guide you step by step through attributes and tools. Projects encompass multiple disciplines to obtain finished, professional results.Although some step by step explanations are given, projects serve more as a guide for readers to complete their own version of the project. Each project comes with support files to validate results\n\n    Covers one of the most unique challenges for game artists -- sculpting realistic and moveable human characters for a game environment\n    Brings you up to speed on ZBrush, the top digital sculpting tool used to create characters and props in such games as Rock Band and World of Warcraft\n    Covers body style, faces, skin texturing, clothing, shoes, weaponry, and how to put your character into a game environment\n    Provides in-depth techniques and tips for everyone from aspiring digital sculptors to high-level professional ZBrush artists\n    Includes a DVD with supporting files from the projects in the book, as well as videos that illustrate concepts\n\nBuild the next game-winning action character with ZBrush and this professional guide!\n\nNote: CD-ROM/DVD and other supplementary materials are not included as part of eBook file.\n","torrent":{"xt":"urn:btih:16c2d667382bef494674f264c8e7aec93a769a26","amp;dn":"ZBrush+Studio+Projects%3A+Realistic+Game+Characters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16c2d667382bef494674f264c8e7aec93a769a26","infoHashBuffer":{"type":"Buffer","data":[22,194,214,103,56,43,239,73,70,116,242,100,200,231,174,201,58,118,154,38]},"announce":[],"urlList":[]}}