{"title":"Bettye LaVette - The Scene Of The Crime [2007][EAC,log,cue. FLAC","uid":8859763,"size":255834779,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:16d36afd07d7ff50edf208fa323de1c78c2b43d0&amp;dn=Bettye+LaVette+-+The+Scene+Of+The+Crime+%5B2007%5D%5BEAC%2Clog%2Ccue.+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"dickspic","files":13,"time":1377746932,"description":"Artist:Bettye LaVette\nRelease:The Scene Of The Crime\nReleased: 2007\nLabel: Anti-\nCatalog#: 268732 \nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:soul, rhythm.and.blues\n\n1.\tI Still Want To Be Your Baby (Take Me Like I Am)\t3:45\n2.\tChoices\t3:04\n3.\tJealousy\t5:36\n4.\tYou Don't Know Me At All\t3:58\n5.\tSomebody Pick Up My Pieces\t5:22\n6.\tThey Call It Love\t3:57\n7.\tThe Last Time\t2:58\n8.\tTalking Old Soldiers\t4:26\n9.\tBeforeThe Money Came (The Battle Of Bettye Lavette)\t4:30\n10.\tI Guess We Shouldn't Talk About That Now\t3:47\n\n\nOn the surface, it may seem that pairing soul survivor Bettye LaVette with Southern rockers the Drive-By Truckers is a match made in hell, and no one could be blamed for that assumption. Since LaVette singed to Anti for 2005's I've Got My Own Hell to Raise, an album produced by Joe Henry that brought her back into the public eye after more than 30 years (she did record and continued to sing, and was in no way retired), the stakes were higher for her return effort. Label president Andy Kaulkin is a cagey guy who understands that milking a successful formula isn't the way to make records, nor is it any way for an artist of LaVette's stature to be treated -- especially when she's in the prime of her recording life. He suggested the collaboration to the Truckers' Patterson Hood. Hood is from Alabama, the home of the Muscle Shoals Sound Studio, and his father was co-owner and a session bassist. LaVette recorded what was supposed to be her breakthrough album at Muscle Shoals' Fame Studios for Atlantic (Hood's father David, along with Spooner Oldham, played on the sessions for that disc). But the finished record, Child of the Seventies (and the rest of its studio sessions), sat in the vault for 30 years before being issued in Europe and finally released stateside by Rhino Handmade in 2005 -- after she'd won a W.C. Handy Award for Woman Like Me on Blues Express (her actual return to recording in America after 20 years) in 2003, and her critically acclaimed Anti debut that reached an even bigger audience.\nLaVette agreed to return to Fame some 35 years later, the studio where Scene of the Crime was recorded. The set is co-produced by David Barbe, Patterson Hood, and LaVette. Along with the Drive-By Truckers (Hood, Mike Colley, Shonna Tucker, and Brad Morgan), special guests include Spooner Oldham on Wurlitzer and piano throughout, David Hood on bass on three cuts, Kelvin Holly (a member of Little Richard's band the Decoys), steel guitarist John Neff, and Sum Haque on piano for a couple of numbers. These ten tracks -- all but one are covers, as LaVette considers herself in the proper soul tradition as an interpreter, not a songwriter -- are gritty, loud, raw, and drenched in Southern soul, blues, and gospel-tinged R&amp;B. From the opening notes of &quot;I Still Want to Be Your Baby (Take Me Like I Am)&quot; -- written by another genius chewed up and spat out by the music biz, the late Eddie Hinton -- it becomes obvious why this unlikely pairing was a match made in roadhouse heaven. Roiling and steamy from the word go, the guitars are held in check with a riff that sounds like it could have come from Junior Kimbrough's juke joint over Mississippi way. Oldham's Wurlitzer, the cracking snare, a bottom-heavy bassline -- that has not an iota of rubber in it -- and those distorted intertwining six-strings are still barely enough to hold the sheer wall-busting voice of LaVette. She doesn't have to stretch to get above them (and many of these tracks are comprised of &quot;scratch,&quot; or first-take vocals). It comes pouring out of her. She's a disciplined singer who understands tension and dynamic and where in her belly to get the power from. Her reading of Frankie Miller's &quot;Jealousy&quot; is all simmering and scorching soul; the Wurlitzer and rim-clicking snare are her allies here in delivering the lyric. The bassline provides a rock for the trio to jump off and the guitars just color the sound purple. She has all the advice of a strict maternal figure who has learned from hard experience. When the track begins to cut loose of its moorings, she simply gets right on top of the mix and lets her voice fall over it. Whew!\nAs fine as these cuts are -- and they are all solid, without a weak one in the bunch -- there are three clear head-and-shoulders winners. The first is a devastating and now definitive reading of Willie Nelson's &quot;Somebody Pick Up My Pieces&quot; that transcends its country roots and becomes a soul song in the classic Otis Redding tradition. It's draped in sorrow, which Neff's pedal steel underscores in every line. The bassline carries the only support in the mix and LaVette allows everything to come through her body and voice: it's the sound of every heart in the world breaking, straining for control for even one moment, and then realizing it's futile. Next is the most incredible reading of Elton John's &quot;Talking Old Soldiers,&quot; a sultry, sad ballad that is completely reinvented here. John doesn't own it anymore, even if he and Bernie Taupin did write it. The emptiness of her surroundings surrounds the protagonist, and there is nothing but vastness and the curse of memory and the frailty of age to express the ultimate truth of life's only promise: the graveyard. But it's not all sorrow and heartache. &quot;Before the Money Came (The Battle of Bettye Lavette),&quot; written by Hood and the singer, is the triumphant survivor's tale it sounds like. The hardcore bar band nature of the Truckers with Oldham comes choogling, and LaVette's down with this kind of rock &amp; roll -- she was singing the rhythm and blues version long before all but Oldham were even born. And there's nothing corny, nostalgic, or novelty about this blues. This is not a song about bragging rights, but the redemptive voice of a champion -- one who has paid more dues than most people can fathom let alone perceive, and has not only lived to tell about it but has risen above it all without ever once surrendering. Henry's production job with LaVette was brilliant. He understood her strengths better than the staff producers at Atlantic did and found a sympathetic band that could hang with her incredible ability. But Scene of the Crime, though far more basic, was the album she was born to make. It gets better with each listen, and stands so far outside the realm of anything her better-known peers are doing today that it's almost scary. They are not even in her league -- any of them. And while one can only hope she makes records for a long time to come (she's in her early sixties and in fantastic health), if she never made another one, listeners would have the ultimate gift here. This CD was nominated for a Grammy award in 2007 for Best Contemporary Blues Album.","torrent":{"xt":"urn:btih:16d36afd07d7ff50edf208fa323de1c78c2b43d0","amp;dn":"Bettye+LaVette+-+The+Scene+Of+The+Crime+%5B2007%5D%5BEAC%2Clog%2Ccue.+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16d36afd07d7ff50edf208fa323de1c78c2b43d0","infoHashBuffer":{"type":"Buffer","data":[22,211,106,253,7,215,255,80,237,242,8,250,50,61,225,199,140,43,67,208]},"announce":[],"urlList":[]}}