{"title":"Monstercock Trans Takeover 10 (Trans 500 Studios) 2016","uid":15803025,"size":3234923882,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:16ee12213009c0dbd2beedb4b234fca6393f04ae&amp;dn=Monstercock+Trans+Takeover+10+%28Trans+500+Studios%29+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":4,"uploader":"EndYou","files":1,"time":1473532860,"description":"... : More exclusive porn at : ...\r\n    https://thepiratebay.org/user/EndYou\r\n\r\n          ... : Screenshots : ... \nhttp://imgpremium.com/img-57d437a5c6791.html  \nhttp://imgpremium.com/img-57d437a656a8a.html \r\n\r\nSimine (Asian) Kylie Maria Valentina (TS) Sara Ramon Castro Supreme.\r\n\r\nFor the 10th iteration in the series, we see Ramon out exercising in the woods. Up beside him runs Sara in purple tights and bra. Next we see them in the car and Ramon is flashing money around to get her to show her titties. He pays her some more and she goes down on him a bit. They take the fun back to the hotel and Ramon shows off and plays with her ass. She goes down on him and then he fucks her doggy style, cowgirl, reverse cowgirl, and beside her. He finiches with a nice facial. Valentina Perez is the star in the following scene, she comes over to Ramon's Hotel room to deliver some drinks. They fondle each other some and then she goes down on him. Ramon fucks her doggy style, cowgirl, reverse cowgirl, and side by side. He pulls out and then busts on her tits. Ramon is chilling with Castro Supreme in the next vid. Ramon is giving him a nice gift and Castro opens it to find a santa claus outfit. Him and Ramon sport one and hilariously go out to try and get some women. They run into Kylie Maria and take her back to a Christmas decorated place. She goes down on the both of them and then Castro is the first to fuck her and they go at it doggy style while she blows Ramon. Then she gets on her back and takes it while stroking herself and still blowing Ramon. Then Ramon dives in from behind while laying beside her. He takes her on her back for a bit also. Then he pulls out and he and Castro both stroke off on her face. Lastly is the super cute Simin She's smiling and seated in a chair chatting with the cameraman. She says she likes small cocks which is going to be a disappointment because Ramon is going to step in. She goes down on him eagerly and then Ramon fucks her from behind as they lay on the bed. She hops on him reverse cowgirl and then turns around to cowgirl. Lastly they go at it doggy style and then Ramon pulls out and explodes on her face.\r\n\r\nMKV H.264/AVC 720х406","torrent":{"xt":"urn:btih:16ee12213009c0dbd2beedb4b234fca6393f04ae","amp;dn":"Monstercock+Trans+Takeover+10+%28Trans+500+Studios%29+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16ee12213009c0dbd2beedb4b234fca6393f04ae","infoHashBuffer":{"type":"Buffer","data":[22,238,18,33,48,9,192,219,210,190,237,180,178,52,252,166,57,63,4,174]},"announce":[],"urlList":[]}}