{"title":"FALSE CHOICES The Faux Feminism of Hillary Rodham Clinton","uid":15522502,"size":2323949,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:16ef7ad8b3b08126f547c260d4d2c9c9b92888f6&amp;dn=FALSE+CHOICES+The+Faux+Feminism+of+Hillary+Rodham+Clinton&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"nosnavis","files":3,"time":1470762321,"description":"False Choices: The Faux Feminism of Hillary Rodham Clinton\r\n\r\nLiza Featherstone (ed.) \r\n\r\n\r\n\r\nHillary Rodham Clinton is one of the most powerful women in world politics, and the irrational right-wing hatred of Clinton has fed her progressive appeal, helping turn her into a feminist icon. To get a woman in the White House, it’s thought, would be an achievement for all women everywhere, a kind of trickle-down feminism.\r\n\r\nIn the run-up to the 2016 presidential election, the mantle of feminist elect has descended on Hillary Clinton, as a thousand viral memes applaud her, and most mainstream feminist leaders, thinkers, and organizations endorse her. In this atmosphere, dissent seems tantamount to political betrayal.\r\n\r\nIn False Choices, an all-star lineup of feminists contests this simplistic reading of the candidate. A detailed look at Hillary Clinton’s track record on welfare, Wall Street, criminal justice, education, and war reveals that she has advanced laws and policies that have done real harm to the lives of women and children across the country and the globe. This well-researched collection of essays restores to feminism its revolutionary meaning, and outlines how it could transform the United States and its relation to the world.\r\n\r\nIncludes essays from prominent feminist writers Liza Featherstone, Laura Flanders, Moe Tkacik, Medea Benjamin, Frances Fox Piven and Fred Block, Donna Murch, Kathleen Geier, Yasmin Nair, Megan Erickson, Tressie McMillan Cottom, Catherine Liu, Amber A’Lee Frost, Margaret Corvid, Belén Fernández, Zillah Eisenstein, and others.\r\n \nhttp://bibliotecafeminista.com/2016/06/10/false-choices-the-faux-feminism-of-hillary-rodham-clinton/","torrent":{"xt":"urn:btih:16ef7ad8b3b08126f547c260d4d2c9c9b92888f6","amp;dn":"FALSE+CHOICES+The+Faux+Feminism+of+Hillary+Rodham+Clinton","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16ef7ad8b3b08126f547c260d4d2c9c9b92888f6","infoHashBuffer":{"type":"Buffer","data":[22,239,122,216,179,176,129,38,245,71,194,96,212,210,201,201,185,40,136,246]},"announce":[],"urlList":[]}}