{"title":"This is What I Call Minimal 80s! Vol. 1 - 20","uid":10311606,"size":3289121608,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1740fb78398119e6577d1e96bee9f776efa02d82&amp;dn=This+is+What+I+Call+Minimal+80s%21+Vol.+1+-+20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"80zforever","files":-1,"time":1402189699,"description":"For some time I had been asked in a few other forums/torrent sites if I could put all volumes of this compilations in one torrent as apparently older torrents are often dead with no seeders. So I finally had a chance to do so and will be seeding this torrent for some time until I have another HD crash! So please help seeding them for the others to discover and experiment this different style of music. Now what was minimal/synth music?\n\n\n&quot;Mainly characterized by minimal musical structures, the sound of Minimal Wave was hallmarked by the use of the analog synthesizers and drum machines that were manufactured in the 1970s and 1980s by Roland, Korg, Yamaha, ARP, Linn, Oberheim, Moog and Sequential Circuits (to name a few).\n\nMost of the Minimal Wave bands recorded in their home studios and created their own album artwork, which naturally paved the way for a D.I.Y. aesthetic to emerge. Generally, the musicians were influenced by avant-garde movements such as futurism and constructivism as well as by the literature of science fiction and existentialism. They had an innovative, unique approach to music-making, which was less polished than the music that appeared on mainstream charts during the same time period.\n\nThe Minimal Wave genre actually formed only several years ago, as a result of a resurgence of interest in the roots of pre-MIDI electronic New Wave (1978-1985), mainly from North America, Europe and Japan. This music is sometimes referred to as Minimal Electronic, Minimal Synth, Cold Wave, New Wave, Techno pop, or Synthpop, depending on the particular style, year, and location of the band. Many of these bands released their music in small batches on cassette or vinyl, and distributed it themselves.&quot;","torrent":{"xt":"urn:btih:1740fb78398119e6577d1e96bee9f776efa02d82","amp;dn":"This+is+What+I+Call+Minimal+80s%21+Vol.+1+-+20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1740fb78398119e6577d1e96bee9f776efa02d82","infoHashBuffer":{"type":"Buffer","data":[23,64,251,120,57,129,25,230,87,125,30,150,190,233,247,118,239,160,45,130]},"announce":[],"urlList":[]}}