{"title":"Paul Butterfield - The Paul Butterfield Blues Band (1965)","uid":8685058,"size":251852506,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:175ba2000e7466c0e9a1198954abc4558c5fb7cc&amp;dn=Paul+Butterfield+-+The+Paul+Butterfield+Blues+Band+%281965%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":24,"time":1373779404,"description":"This is the same torrent that was uploaded to Demonoid in August 2008.\n\n\nPaul Butterfield - The Paul Butterfield Blues Band (1965) [1987]\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51ZDSTV63WL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51ZDSTV63WL.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop.\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio Excerpt from All Music:\n\nPaul Butterfield was the first white harmonica player to develop a style original and powerful enough to place him in the pantheon of true blues greats. It's impossible to overestimate the importance of the doors Butterfield opened: before he came to prominence, white American musicians treated the blues with cautious respect, afraid of coming off as inauthentic. Not only did Butterfield clear the way for white musicians to build upon blues tradition (instead of merely replicating it), but his storming sound was a major catalyst in bringing electric Chicago blues to white audiences who'd previously considered acoustic Delta blues the only really genuine article. His initial recordings from the mid-'60s -- featuring the legendary, racially integrated first edition of the Paul Butterfield Blues Band -- were eclectic, groundbreaking offerings that fused electric blues with rock &amp; roll, psychedelia, jazz, and even (on the classic East-West) Indian classical music. As members of that band -- which included Michael Bloomfield and Elvin Bishop -- drifted away, the overall impact of Butterfield's music lessened, even if his amplified harp playing was still beyond reproach. He had largely faded from the scene by the mid-'70s, and fell prey to health problems and drug addiction that sadly claimed his life prematurely. Even so, the enormity of Butterfield's initial impact ensured that his legacy was already secure. ...\n\nTo read the entire bio: &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:wifoxq95ldje~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:wifoxq95ldje~T1&lt;/a&gt;\n\nAll Music Album Review:\n\nEven after his death, Paul Butterfield's music didn't receive the accolades that were so deserved. Outputting styles adopted from Howlin' Wolf and Muddy Waters among other blues greats, Butterfield became one of the first white singers to rekindle blues music through the course of the mid-'60s. His debut album, The Paul Butterfield Blues Band, saw him teaming up with guitarists Elvin Bishop and Mike Bloomfield, with Jerome Arnold on bass, Sam Lay on drums, and Mark Naftalin playing organ. The result was a wonderfully messy and boisterous display of American-styled blues, with intensity and pure passion derived from every bent note. In front of all these instruments is Butterfield's harmonica, beautifully dictating a mood and a genuine feel that is no longer existent, even in today's blues music. Each song captures the essence of Chicago blues in a different way, from the back-alley feel of &quot;Born in Chicago&quot; to the melting ease of Willie Dixon's &quot;Mellow Down Easy&quot; to the authentic devotion that emanates from Bishop and Butterfield's &quot;Our Love Is Drifting.&quot; &quot;Shake Your Money Maker,&quot; &quot;Blues With a Feeling,&quot; and &quot;I Got My Mojo Working&quot; (with Lay on vocals) are all equally moving pieces performed with a raw adoration for blues music. Best of all, the music that pours from this album is unfiltered...blared, clamored, and let loose, like blues music is supposed to be released. A year later, 1966's East West carried on with the same type of brash blues sound partnered with a jazzier feel, giving greater to attention to Bishop's and Bloomfield's instrumental talents.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:gifexqw5ld6e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:gifexqw5ld6e&lt;/a&gt;\n\nAmazon sells this CD: &lt;a href=&quot; http://www.amazon.com/dp/B000002GZ1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000002GZ1&lt;/a&gt;\n\nTrack List:\n\n01. Born In Chicago\n02. Shake Your Moneymaker\n03. Blues With A Feeling\n04. Thank You Mr. Poobah\n05. I Got My Mojo Working\n06. Mellow Down Easy\n07. Screamin'\n08. Our Love Is Drifting\n09. Mystery Train\n10. Last Night\n11. Look Over Yonders Wall\n","torrent":{"xt":"urn:btih:175ba2000e7466c0e9a1198954abc4558c5fb7cc","amp;dn":"Paul+Butterfield+-+The+Paul+Butterfield+Blues+Band+%281965%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"175ba2000e7466c0e9a1198954abc4558c5fb7cc","infoHashBuffer":{"type":"Buffer","data":[23,91,162,0,14,116,102,192,233,161,25,137,84,171,196,85,140,95,183,204]},"announce":[],"urlList":[]}}