{"title":"Handbook of Clinical Psychopharmacology for Therapists, 7E [PDF]","uid":9897408,"size":28652366,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1769c6d1952812adabdf9c42e11da43138530575&amp;dn=Handbook+of+Clinical+Psychopharmacology+for+Therapists%2C+7E+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"0xmovva","files":-1,"time":1396728588,"description":"Author: John D. Preston, John H. O'Neal,Mary C. Talaga \nHardcover: 376 pages\nPublisher: New Harbinger Publications; Seventh Edition edition (February 2, 2013)\nLanguage: English\nISBN-10: 1608826643\nISBN-13: 978-1608826643\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\nHandbook of Clinical Psychopharmacology for Therapists has become the go-to resource for mental health clinicians looking for clear, reliable information about the treatment of mental health issues. Organized by disorder and, within each disorder, by medication, this book is designed to familiarize clinicians and students with the basic terminology and models of pharmacokinetics.\n\nThis updated seventh edition provides essential information on new medications and treatment options and includes the latest research on side effects, contraindications, and efficacy of all major medications prescribed for mental health disorders. The book also features an important new chapter on the effects of withdrawing from psychopharmacological medications.\n\nThis handbook makes it simple to:\n\n* Get the facts about drug interactions and side effects\n* Find out how medications affect adults, children, and adolescents differently\n* Learn how different cultures view medical treatment, vital information for anyone who treats clients from a variety of backgrounds\n* Discontinue medication safely when needed","torrent":{"xt":"urn:btih:1769c6d1952812adabdf9c42e11da43138530575","amp;dn":"Handbook+of+Clinical+Psychopharmacology+for+Therapists%2C+7E+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1769c6d1952812adabdf9c42e11da43138530575","infoHashBuffer":{"type":"Buffer","data":[23,105,198,209,149,40,18,173,171,223,156,66,225,29,164,49,56,83,5,117]},"announce":[],"urlList":[]}}