{"title":"In the Loop DVDRip","uid":6194879,"size":751684947,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:17c60a257bb22b81ea3d3b05aee9d6a67c78bb93&amp;dn=In+the+Loop+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"TSV","files":-1,"time":1298425582,"description":"In the Loop is a 2009 British black comedy satire film directed by Armando Iannucci. It is based on the BBC Television series The Thick of It satirising Anglo-American politics in the 21st century and the Invasion of Iraq. The film was nominated for the 2010 Academy Award for Best Writing (Adapted Screenplay).\n\nIn the film, the President of the United States and the Prime Minister of the United Kingdom are looking to launch a war in the Middle East. The plot follows government officials and advisors in their behind-the-scenes efforts either to promote the war or prevent it. It stars Tom Hollander, Mimi Kennedy, James Gandolfini, Chris Addison, Peter Capaldi, Anna Chlumsky, Gina McKee, Steve Coogan and David Rasche. The film is a joint collaboration between BBC Films and the UK Film Council.\n\nFilming took place between May 2008 and December 2008, and a world premiere was held at the Sundance Film Festival on 22 January 2009. The European gala premiere screening was held in the independent Glasgow Film Theatre as the opening of the 2009 Glasgow Film Festival on 12 February 2009, attended by Iannucci and members of the cast. The film was released on 17 April 2009 in the United Kingdom.","torrent":{"xt":"urn:btih:17c60a257bb22b81ea3d3b05aee9d6a67c78bb93","amp;dn":"In+the+Loop+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17c60a257bb22b81ea3d3b05aee9d6a67c78bb93","infoHashBuffer":{"type":"Buffer","data":[23,198,10,37,123,178,43,129,234,61,59,5,174,233,214,166,124,120,187,147]},"announce":[],"urlList":[]}}