{"title":"Placement Learning in Surgical Nursing, Howard [PDF][StormRG]{HT","uid":11785117,"size":1686870,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1821f8c1e6784a211c97d88ad41575db88d733b8&amp;dn=Placement+Learning+in+Surgical+Nursing%2C+Howard+%5BPDF%5D%5BStormRG%5D%7BHT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":3,"time":1427725297,"description":"TITLE/EDITION Placement Learning in Surgical Nursing: A guide for students in practice, 1e\nBy: Karen Holland BSc(Hons) MSc CertEd SRN (Author), Roxburgh MSc SPQ RNT RGN (Author)\nSeries: Placement Learning\nPaperback: 224 pages\nPublisher: Bailliere Tindall; 1 edition (October 24, 2012)\nLanguage: English\nISBN-10: 0702043052\nISBN-13: 978-0702043055\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nAre you unsure about your surgical nursing placement? Do you need guidance on what to prepare to get the most out of your practice learning? Will you have the range of skills to care for people undergoing surgery? What learning opportunities will there be to meet your competencies? How can you maximise your learning during this placement?\n\nThis book will help you with all these concerns. It will advise you on what to expect from the placement, what you can learn, how to link theory and practice, and how to make the most of your learning opportunities and meet your competencies.\n\nTakes a logical, step-by-step approach to preparing for learning on a surgical placement\nProvides an introduction to the principles of care, treatment and management of an individual undergoing surgery, linking university-learned theory to clinical practice\nGives helpful evidence-based practice examples and resources to support placement learning\nIdentifies clinical skills that underpin care of a person undergoing surgery\nHighlights potential learning opportunities and experiences available on a surgical nursing placement\nExplains how to develop your clinical portfolio by completing specific exercises and activities\nMaps all activities and exercises to the NMC competencies\nDiscusses the possible challenges that may arise during a surgical placement and advises on approaches to a range of situations\nAdopts a case study/patient pathway approach to learning, from pre-admission to discharge.\nSeries features:\nA unique guide to getting the most from clinical placements\nHow to prepare for your placement\nWhat you can expect to learn during a placement\nClear links to, and examples of, achieving NMC competencies\nGuidance on what to use as evidence for your portfolio\nCase studies that link theory with practice\nHow to consolidate your experience and learn from the placement\nTips, activities, further reading suggestions and useful websites.\nWorried about your next placement? Will you 'fit in'? Will you have the right skills? What do you need to learn to meet practice assessments?\n\nThis series will help you with all these concerns. It will tell you what to expect from each placement, what you can learn, how to link theory and practice, and how to make the most of your learning opportunities.\n\nThis is the only series specifically for student nurses undertaking specific practice placements, and will give you all the information you need in a user-friendly format. Each book in the series covers a specific area of practice for a typical placement on a pre-registration nursing course.\n\nTitles in this series:\n\nSurgical nursing\n\nMedical nursing\n\nCancer and palliative care nursing\n\nMental health nursing\n\nCommunity care nursing\n\nOlder people nursing\n\nEach book also covers:\n\nA unique guide to getting the most from clinical placements\nWhat to expect before a placement\nWhat you can expect to learn on placement\nHow to consolidate your experience and learning\nClear links and examples with NMC proficiencies\nGuidance on what to use as evidence for portfolios\nShort case studies to link theory with practice\nKey points reminder boxes","torrent":{"xt":"urn:btih:1821f8c1e6784a211c97d88ad41575db88d733b8","amp;dn":"Placement+Learning+in+Surgical+Nursing%2C+Howard+%5BPDF%5D%5BStormRG%5D%7BHT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1821f8c1e6784a211c97d88ad41575db88d733b8","infoHashBuffer":{"type":"Buffer","data":[24,33,248,193,230,120,74,33,28,151,216,138,212,21,117,219,136,215,51,184]},"announce":[],"urlList":[]}}