{"title":"Professional ASP.NET 3.5 SP1 Edition: In C# and VB","uid":4980390,"size":21813966,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:19060de86bd9a112db78a77dcc5e3b6c7e88c6ad&amp;dn=Professional+ASP.NET+3.5+SP1+Edition%3A+In+C%23+and+VB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"VasiaZozulia","files":-1,"time":1246268525,"description":"Professional ASP.NET 3.5 SP1 In C# and VB\n\nASP.NET 3.5 brings the power of Visual StudioÃ‚Â® 2008 along with the multitude of language improvements in C# 2008 and Visual BasicÃ‚Â® 2008 as well as powerful new technology called LINQ, together with the ASP.NET 2.0 Framework you already know and love. Packed with valuable coverage of ASP.NET 3.5 SP1, this essential resource offers both C# and VB examples throughout the book, and shares new and updated content on the ADO.NET Entity Framework, ADO.NET Dynamic Data, and ADO.NET Data Services.\n\nWhile ASP.NET 3.5 boasts server controls like the ListView and the incredibly flexible GridView, it also includes advancements in AJAX technology combined with JavaScriptÃ‚Â® debugging features in Visual Studio 2008. With this book, a stellar author team covers the new controls in the AJAX toolbox, the back button history, and script combining, and they also examine the new capabilities of WCF including changes to DataContractSerializer. In addition, the accompanying CD-ROM features the entire book in PDF format.\n\nWhat you will learn from this book\n\n*\n\nThe concepts underlying the server control and its pivotal role in ASP.NET development\n*\n\nHow to create templated ASP.NET pages using the master page feature\n*\n\nHow to work with data from enterprise databases including SQL ServerÃ‚Â®\n*\n\nWays to debug, package, and deploy ASP.NET applications, monitor their health and performance, and handle errors\n*\n\nHow to retrieve, update, and delete data quickly and logically using LINQ with side-by-side examples comparing LINQ to existing techniques\n*\n\nWays to localize your web site in multiple languages for a world-wide audience\n*\n\nMethods for adding AJAX capabilities to your ASP.NET applications\n*\n\nThe many benefits of the new data access additions\n*\n\nWays to use and extend the Provider Model for accessing data stores, processes, and more\n*\n\nWhat freeware tools you need in Scott Hanselman's ASP.NET Ultimate Developer Tools appendix \n\nWho this book is for\n\nThis book is for programmers and developers who are looking to make the transition to ASP.NET 3.5 SP1 with Visual Studio 2008 and either C# 3.0 (2008) or Visual Basic 9 (2008). \n","torrent":{"xt":"urn:btih:19060de86bd9a112db78a77dcc5e3b6c7e88c6ad","amp;dn":"Professional+ASP.NET+3.5+SP1+Edition%3A+In+C%23+and+VB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19060de86bd9a112db78a77dcc5e3b6c7e88c6ad","infoHashBuffer":{"type":"Buffer","data":[25,6,13,232,107,217,161,18,219,120,167,125,204,94,59,108,126,136,198,173]},"announce":[],"urlList":[]}}