{"title":"Syberia","uid":3235973,"size":1455174907,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1907828a8f15bb8d28521cc14c569c0a5889ea16&amp;dn=Syberia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"ZeCone","files":5,"time":1094131018,"description":"The lawyer Kate Walker has been entrusted by the Universal Toy Company to negotiate the takeover of an old luxury toy and automaton factory. Over\nthe centuries, the factory has been developing clockwork devices,\nspecializing in perpetual mechanical movement. The factory's ambitions,\nhowever, are ill-suited to the contemporary economic climate, and the\nelderly Anna Voralberg, at the helm of the Valadilene factory for more\nthan half a century, has decided to sell up.\n\nIt turns out that the takeover might not be as straightforward as expected.\nThe day that Kate Walker arrives, Anna Voralberg is being buried. What is\nmore is that she has left an heir - her brother Hans. But Hans had left\nthe valley at the end of the thirties and never returned, and was\nactually believed to be dead. However, a letter written by Anna in the\ndays leading up to her death reveals that Hans is well and truly alive\nand living somewhere in. Siberia! Valadilene's elderly notary entrusted to take care of Anna's affairs suggests that Anna find Hans Voralberg\nas he is now the only person in a position to ratify the sale of the\nfamily business. The player will take on the role of the heroine,\nKate Walker, as she sets out on her long journey eastwards, encountering\ncities along the way bearing the mark of Hans' genius, cities that\nstill exude the bygone days of the twentieth century in so many\ndifferent ways.","torrent":{"xt":"urn:btih:1907828a8f15bb8d28521cc14c569c0a5889ea16","amp;dn":"Syberia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1907828a8f15bb8d28521cc14c569c0a5889ea16","infoHashBuffer":{"type":"Buffer","data":[25,7,130,138,143,21,187,141,40,82,28,193,76,86,156,10,88,137,234,22]},"announce":[],"urlList":[]}}