{"title":"Head First HTML and CSS - 2nd Ed (2012) (Pdf and Epub) Gooner","uid":13623377,"size":168205844,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:193b619971a9edb8887f25637ccfd440be2a69c7&amp;dn=Head+First+HTML+and+CSS+-+2nd+Ed+%282012%29+%28Pdf+and+Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"GoonerTPB","files":3,"time":1455990341,"description":"Head First HTML and CSS - 2nd Edition (2012) (Pdf &amp; Epub) Gooner\r\n\r\nPublisher: O'Reilly Media; 2nd edition (September 8, 2012)\r\nLanguage: English\r\nISBN-10: 0596159900\r\nISBN-13: 978-0596159900\r\n\r\nTired of reading HTML books that only make sense after you're an expert? Then it's about time you picked up Head First HTML and CSS, and really learned HTML. You want to learn HTML so you can finally create those web pages you've always wanted, so you can communicate more effectively with friends, family, fans, and fanatic customers. You also want to do it right so you can actually maintain and expand your web pages over time so they work in all browsers and mobile devices. Oh, and if you've never heard of CSS, that's okay--we won't tell anyone you're still partying like it's 1999--but if you're going to create web pages in the 21st century then you'll want to know and understand CSS.\r\n\r\nLearn the real secrets of creating web pages, and why everything your boss told you about HTML tables is probably wrong (and what to do instead). Most importantly, hold your own with your co-worker (and impress cocktail party guests) when he casually mentions how his HTML is now strict, and his CSS is in an external style sheet.\r\n\r\nWith Head First HTML and CSS, you'll avoid the embarrassment of thinking web-safe colors still matter, and the foolishness of slipping a font tag into your pages. Best of all, you'll learn HTML and CSS in a way that won't put you to sleep. If you've read a Head First book, you know what to expect: a visually-rich format designed for the way your brain works. Using the latest research in neurobiology, cognitive science, and learning theory, this book will load HTML and CSS into your brain in a way that sticks.\r\n\r\nSo what are you waiting for? Leave those other dusty books behind and come join us in Webville. Your tour is about to begin","torrent":{"xt":"urn:btih:193b619971a9edb8887f25637ccfd440be2a69c7","amp;dn":"Head+First+HTML+and+CSS+-+2nd+Ed+%282012%29+%28Pdf+and+Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"193b619971a9edb8887f25637ccfd440be2a69c7","infoHashBuffer":{"type":"Buffer","data":[25,59,97,153,113,169,237,184,136,127,37,99,124,207,212,64,190,42,105,199]},"announce":[],"urlList":[]}}