{"title":"Mike Oldfield - Tubular Bells (The Ultimate Edition 2009 3CD) [E","uid":4953175,"size":845966314,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1982812b1aaaab071f9d1b35037d2bea964e7460&amp;dn=Mike+Oldfield+-+Tubular+Bells+%28The+Ultimate+Edition+2009+3CD%29+%5BE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"repopo","files":-1,"time":1244988663,"description":"*******************************************************************************\n                     Tubular Bells - The Ultimate Edition\n*******************************************************************************\n\n\nThe 2009 (Ultimate) reissue\n\nIn 2008 when Oldfield's original 35 year deal with Virgin Records ended, the \nrights to the piece were returned to him, and were transferred to Mercury \nRecords. Mercury issued a press release on 15 April 2009, where Oldfield's \nVirgin albums were transferred to the label, and re-released, starting 8 June \n2009. Tubular Bells was released in four physical variations, and two digital \nvariations in the UK and Ireland, and as five physical editions elsewhere.[18] \nIn April 2009 a new official website, TubularBells2009.com, was unveiled.\n\nThe new releases contain a new 2009 stereo mix of the album, which Oldfield \ncreated at his home in the Bahamas in March 2009. The &quot;Deluxe Edition&quot; contains \na 5.1 mix, and the &quot;Ultimate Edition&quot; box set contains a 60 page hardback book, \na poster, plectrums and other pieces such as rough mixes and demo versions of \nthe album. There is also a vinyl version released as part of the Back to Black \nseries.\n\nThe liner notes include photos from the time and text written by Mark Powell \nabout Oldfield and the album. The DVD also states on its label that it features \nthe &quot;Tubular Bells film&quot; from The Old Grey Whistle Test as visual content, \nhowever this appears not to be on the DVD and is also not listed on the outer \ncover of the album.\n\nThe Digital Edition contains the same audio content as the Ultimate Edition. The \nVinyl Edition is part of the Back to Black series, and contains the original \n1973 mix of the album. Downloads are also available from Back to Black website. \nThe Vinyl Edition carries the original seascape artwork.\n\n\n\n-------------------------------------------------------------------------------\n\n    * CD one - (As Standard edition)\n\n       1. &quot;Tubular Bells Part One&quot; (New stereo mix by Mike Oldfield, Bahamas, \nMarch 2009) - 22:58\n       2. &quot;Tubular Bells Part Two&quot; (New stereo mix by Mike Oldfield, Bahamas, \nMarch 2009) - 23:20\n       3. &quot;Mike Oldfield's Single&quot; - 3:53\n       4. &quot;Sailor's Hornpipe&quot; (Vivian Stanshall version) - 2:48\n\n    * CD two - (Original Stereo Mix)\n\n       1. &quot;Tubular Bells Part One&quot; (Original stereo mix)\n       2. &quot;Tubular Bells Part Two&quot; (Original stereo mix)\n\n    * CD three - (Demos)\n\n         1. &quot;Tubular Bells (long)&quot; (demo) - 22:55\n         2. &quot;Caveman Lead-in&quot; (demo) - 2:44\n         3. &quot;Caveman&quot; (demo) - 5:06\n         4. &quot;Peace Demo A&quot; (1971 demo) - 7:01\n         5. &quot;Peace Demo B&quot; (1971 demo) - 4:22\n         6. &quot;Tubular Bells, Part One&quot; (scrapped first mix Spring 1973) - 25:13\n\n\n    * DVD - (As Deluxe edition)  [Note: NOT INCLUDED IN THIS TORRENT]\n    * Vinyl - (As Vinyl edition)  [Note: NOT INCLUDED IN THIS TORRENT]\n\n\n\nEquipment\n\nFor the 2009 remix, the following equipment was utilised. A screenshot of the \nsession in Steinberg Nuendo was included in the Ultimate Edition book.\n\n    * Steinberg Nuendo 422\n    * Apple Mac Pro, 2xQuad 3GHz\n    * 24 Channel Euphonix MC Mix System and one MC Control\n    * Digidesign 003 + audio interface\n    * Dynaudio Acoustic Air Series networking 5.1 loudspeaker system\n    * Solid State Logic Duende\n    * TCC Electronic Powercore\n    * DVR 2 digital vintage reverb\n    * Coffee machine\n\n\n\n-------------------------------------------------------------------------------\n                  SOME (MOSTLY) USELESS WIKIPEDIA INFORMATION\n-------------------------------------------------------------------------------\n\nALBUM PROGRESSION\n\nProgression of part one\n\nPart one opens with a soft minor key piano line in 15/8 eventually played \nverbatim by organ and glockenspiel. This riff is made up of two bars; the first \nbar is in 7/8, the second bar is in 8/8. These are later joined by a \ndifferent line in bass guitar. An occasional punchy organ chord, first heard at \nabout 1:02 in, accents this piece, harmonised by variations of the anchor line \nand a later incorporated 3/4 chord sequence, both in piano. At around 3:38, a \ngentle flute line appears, which segues into a section of 4/4-7/8-7/8-4/4, and \nat 3:40 an electric guitar line, the latter entirely in 4/4.\n\nAfter the electric guitar line ends, a softer, fast guitar line (&quot;speed guitar,&quot; \nas listed in the liner notes) takes over, only to be interrupted by an acoustic \nguitar line overlaying the original piano phrase in major key. A gentle \nglockenspiel/piano piece takes over, but is later replaced with a fast piano \nsection, occasionally accented with organ chords.\n\nThe mood of the first 6 minutes is soon replaced by edgy electric guitar and, \nafterward, a sinister organ chord, with various changes in pitch and duration. \nBut, once again, a more refined, carefree section ensues, dominated by acoustic \nguitar and piano, eventually returning to the soft riff first heard just past \nfour minutes into the piece.\n\nA 3/4 variation of the original theme comes next, followed by eerie bass and \norgan playing, segueing into a bluesy shuffle on electric guitar. Once again, \nwhen it looks like the piece will be serene (when the nasal choir intervenes), \nanother edgy guitar line ensues, with Oldfield incorporating both 4/4 and 7/8.\n\nAfter that, a more folky acoustic line plays (with background tambourine), but \nis suddenly cut off by the tolling of bells. A weary acoustic guitar line \nfollows, breaking into the eight-and-a-half minute &quot;Finale&quot; section, commencing \nwith a double bass line in 5/4, polyrhythmically played with a 4/4 acoustic \nline. After the bass and guitar unite into the 4/4 line, the acoustic guitar \ntacets and is eventually replaced by soft pipe organ notes (usually lasting four \nor eight full beats) while the bass line plays.\n\nAfter the 10-bar bass phrase is repeated several times, Stanshall introduces \nmany of the instruments appearing in part one up to then, beginning with the \nkeyboards, followed by glockenspiel and all guitars before the tubular bells are \nannounced, the ensemble becoming more dynamic and full as more instruments are \nsaid. Finally, after the tubular bells enter, a wordless feminine chorus starts \nto sing. Farther down, the Finale ensemble fades out to an acoustic guitar solo, \nwhich takes up the remainder of part one.\n\nProgression of part two\n\nPart two begins where part one left off; a soft, simple piece, this time, \nbeginning with bass guitar and working up with other guitars and keyboards. The \nopening time signature is 6/8, but a later line plays a similar melody in 3/4 on \nvarious instruments, beginning with guitar. The opening section builds for five \nminutes before the second section starts, another 3/4 section at half tempo on \nacoustic guitar, with accompaniment on organ, mandolin and female chorus.\n\nAt around 8:48, the piece becomes edgy and surreal again, as the &quot;bagpipe \nguitars&quot; enter the piece (electric guitars with added effects to give it the \nbagpipe-esque sound), playing a 12/8 piece of sorts. About 11 minutes in, the \nintensity of the section builds as the guitar pitches increase and a heavy piano \n&quot;roll&quot; plays, climaxed by a sudden ascending glissando on the piano.\n\nWhat comes next is one of the more unusual parts of the entire album. Tympani \nrolls and drum kit commence this part, highlighted by unintelligible &quot;lyrical&quot; \nutterances, growls, and screams by Oldfield (who, according to rumours, was then \nintoxicated), in rebellion to how Richard Branson wanted him to include at least \none part with lyrics to release as a single (at the time, Oldfield was not \ninterested in adding lyrics to his music). This is listed in the liner notes as \nthe &quot;Piltdown Man&quot;. Oldfield's yelling is countered by various phrases on piano, \nguitars, and the &quot;Moribund chorus,&quot; with this piece abruptly ending on one loud \nshout exactly 16:29 in.\n\nAs expected, another quiet section ensues, a 12/8 piece mostly dominated by \nguitars and organ. This section gives an excellent insight into the psychedelic, \nspacey side of Oldfield (a similar sound to that of Pink Floyd's David Gilmour), \nwhich would also be present in his third album, Ommadawn. After about five \nminutes, an optimistic organ line plays, segueing into a climactic arrangement \nof &quot;Sailor's Hornpipe&quot;.\n\n&quot;Sailor's Hornpipe&quot; begins with just one guitar playing at a moderately slow \ntempo, but quickly mutates into a gradually accented piece with multiple \ninstruments (including an unlisted violin), ending with two loud, accented \nnotes. In live performances, Oldfield would reach incredible tempos and \n&quot;Sailor's Hornpipe&quot; alone became a staple of his concerts.\n\n-------------------------------------------------------------------------------\n\nThe recording sessions\n\n    * Part one was recorded in just one week at The Manor Studio, owned by the \nfounder of Virgin Records, Richard Branson. Oldfield used this studio \nimmediately after John Cale's sessions and just before the Bonzo Dog Doo-Dah \nBand began recording.[35]\n    * Oldfield's working title for Tubular Bells was Opus One; Richard Branson \nthought to call it Breakfast in Bed. One of the possible album covers for \nBreakfast in Bed included a boiled egg with blood pouring out of it. This cover \nwas edited and used as the artwork for Oldfield's final album with Virgin, \nHeaven's Open.[36]\n    * Mike Oldfield had been performing &quot;The Sailor's Hornpipe&quot; for years before \nincluding it on Tubular Bells, when he was the bass player with Kevin Ayers and \nThe Whole World.[37]\n    * The only electric guitar to be used on the album was a 1966 blonde Fender \nTelecaster (serial no. 180728) which used to belong to Marc Bolan. Oldfield had \nadded an extra Bill Lawrence pickup and has since sold the guitar and donated \nthe money to the SANE charity.[38]\n    * According to Oldfield the &quot;Piltdown Man&quot; shouting sequence came about when \nhe had practically finished recording the instruments for the section, but felt \nthat it needed something else. The whiskey-fueled idea to create the &quot;Piltdown \nMan&quot; effect was to shout and scream into a microphone while running the tape at \na lower speed.\n    * The album was recorded on an Ampex 2&quot; 16 track tape recorder, which was \nThe Manor's main recording equipment at the time.\n    * To create the double speed guitar, the tape was simply run at half speed \nduring recording. Oldfield also used a custom effects unit, named the Glorfindel \nbox, to create the 'fuzz' or 'bagpipe' distortion on some guitar pieces on the \nalbum. The Glorfindel box was given to David Bedford at a party, who then \nsubsequently gave it to Oldfield. Tom Newman criticised the wooden cased unit in \na 2001 interview with Q magazine noting that it rarely gave the same result \ntwice.[39]\n    * The set of tubular bells that were used on the album had been left by an \ninstrument hire company after John Cale's sessions at the Manor, at the request \nof Oldfield.[40]\n    * According to Phil Newell the Bass guitar used on the album was one of his \nFender Telecaster Basses.\n    * Vivian Stanshall, who was staying at the Manor at the time, was asked to \nintroduce the instruments for the finale of part one. It was the way in which \nStanshall had said plus... tubular bells which gave Oldfield the idea to call \nthe album Tubular Bells.[41] The &quot;lyrics&quot; announcing the instruments are: &quot;Grand \npiano; reed and pipe organ; glockenspiel; bass guitar; double speed guitar; two \nslightly distorted guitars; mandolin! Spanish guitar, and introducing acoustic \nguitar, plus... tubular bells&quot;.\n\n\n\n-------------------------------------------------------------------------------\n\nDemo version\n\nOldfield recorded the demo pieces of Tubular Bells in his flat in Tottenham, \nLondon in 1971. Oldfield recorded the demos on a Bang &amp; Olufsen Beocord 1/4&quot; \ntape machine which he had borrowed from Kevin Ayers. Oldfield was able to \noverdub his playing by blocking off the erase head of the tape machine. The \ndemos titled, &quot;Tubular Bells Long&quot;, &quot;Caveman Lead-In&quot;, &quot;Caveman&quot;, &quot;Peace Demo A&quot; \nand &quot;Peace Demo B&quot; appeared on the DVD-Audio version of the rerecording of \nTubular Bells, Tubular Bells 2003.\n\nPieces from Oldfield's 1971 demos appear on the 2009 Mercury reissue of Tubular \nBells; also included on this release is a scrapped mix of the album from Spring \n1973.\n\n-------------------------------------------------------------------------------\n\n&quot;Sailor's Hornpipe&quot; and the original ending\n\nWhen recorded in 1973, the coda at the end of Part Two, the &quot;Sailor's Hornpipe&quot;, \nwas originally preceded by a longer slightly bizarre rendition of the piece. \nLoud marching footsteps trot around the sound channels as the &quot;Sailor's \nHornpipe&quot; is played on acoustic instruments, whilst announcer Vivian Stanshall \ngives an obviously-inebriated, improvised tour of the Manor. According to the \nliner notes for the Boxed vinyl set, this session occurred at four in the \nmorning after Oldfield, engineer Tom Newman and Stanshall had been drinking \nheavily. They placed microphones in the rooms of the Manor, hit record and set \noff on an unplanned tour of the house.\n\nIt was cut from the final version for being too strange to be put on an unknown \nartist's first album, though it can be heard &quot;in all its magnificent \nfoolishness&quot; (from the liner notes) on Boxed. The Boxed set reinstates the \nsection at the end of side two of Tubular Bells. It can also be heard on the \nSACD (multi-channel track only) This rendition of &quot;Sailor's Hornpipe&quot; was \nincluded in the 2009 Mercury reissue of Tubular Bells.\n\nThe &quot;lyrics&quot; to Stanshall's improvised tour of the Manor follows:\n\n    &quot;The hallway.\n\n    From outside, an ordinary house. A great house, true - four hundred and \neighty three rooms, each one with its own marble wash basin and douche, bidet as \nit may. But inside, and the positions are reversed. A human failing, some say a \ndisease, but a disease that Sir Francis Dashwood knew, and knew it well.\n\n    Upstairs, inside and a revelation. It's a discotheque. No, no, uh.. there \nare paintings, real, and look here - a rare seventeenth century masterpiece, and \nif I can scrape a little of it off, beneath I can find hidden a fourteenth \ncentury underpiece.\n\n    Made entirely of tiny pieces of eggshells, this lurid work has caused \ncontroversy in the world of embroidery and anthropologicky. No, I'll say it \nagain, anthropolology. Umm.. no quite possibly make an anthropol, no, uh, I mean \nan apolog..ph.. It has enthralled distinguished professors, and in layman's \nlanguage is &quot;blinking well baffling&quot;.\n\n    But to be more obtusely, &quot;buggered if I know.&quot; Yes, &quot;buggered if I know.&quot; \nAnd that's all we've gleaned so far from experts in fourteenth century painting, \nrenaissance, greengrocers, and recently revived members of the public. Buggered \nif I know.\n\n    Vivian Stanshall, about three o'clock in the morning, Oxfordshire, 1973, \nGoodnight&quot;\n\n-------------------------------------------------------------------------------\n                           EXTRACT FROM EAC LOG FILE\n-------------------------------------------------------------------------------\n\n\nExact Audio Copy V0.99 prebeta 4 from 23. January 2008\n\nEAC extraction logfile from 14. June 2009, 2:17\n\nMike Oldfield / Tubular Bells (The 2009 Stereo Mixes)\n\nUsed drive  : HL-DT-STDVD-RAM GSA-H55N   Adapter: 0  ID: 0\n\nRead mode               : Secure\nUtilize accurate stream : Yes\nDefeat audio cache      : Yes\nMake use of C2 pointers : No\n\nRead offset correction                      : 102\nOverread into Lead-In and Lead-Out          : No\nFill up missing offset samples with silence : Yes\nDelete leading and trailing silent blocks   : No\nNull samples used in CRC calculations       : Yes\nUsed interface                              : Installed external ASPI interface\nGap handling                                : Appended to previous track\n\nUsed output format              : User Defined Encoder\nSelected bitrate                : 1024 kBit/s\nQuality                         : High\nAdd ID3 tag                     : No\nCommand line compressor         : F:Archivos de programaExact Audio \nCopyFLACFLAC.EXE\nAdditional command line options : -8 -V -T &quot;ARTIST=%a&quot; -T &quot;TITLE=%t&quot; -T \n&quot;ALBUM=%g&quot; -T &quot;DATE=%y&quot; -T &quot;TRACKNUMBER=%n&quot; -T &quot;GENRE=%m&quot; -T &quot;COMMENT=%e&quot; %s -o \n%d\n\n\n\n-------------------------------------------------------------------------------\n\n\n\nExact Audio Copy V0.99 prebeta 4 from 23. January 2008\n\nEAC extraction logfile from 14. June 2009, 3:27\n\nMike Oldfield / Tubular Bells (The Original 1973 Stereo Album Mix)\n\nUsed drive  : HL-DT-STDVD-RAM GSA-H55N   Adapter: 0  ID: 0\n\nRead mode               : Secure\nUtilize accurate stream : Yes\nDefeat audio cache      : Yes\nMake use of C2 pointers : No\n\nRead offset correction                      : 102\nOverread into Lead-In and Lead-Out          : No\nFill up missing offset samples with silence : Yes\nDelete leading and trailing silent blocks   : No\nNull samples used in CRC calculations       : Yes\nUsed interface                              : Installed external ASPI interface\nGap handling                                : Appended to previous track\n\nUsed output format              : User Defined Encoder\nSelected bitrate                : 1024 kBit/s\nQuality                         : High\nAdd ID3 tag                     : No\nCommand line compressor         : F:Archivos de programaExact Audio \nCopyFLACFLAC.EXE\nAdditional command line options : -8 -V -T &quot;ARTIST=%a&quot; -T &quot;TITLE=%t&quot; -T \n&quot;ALBUM=%g&quot; -T &quot;DATE=%y&quot; -T &quot;TRACKNUMBER=%n&quot; -T &quot;GENRE=%m&quot; -T &quot;COMMENT=%e&quot; %s -o \n%d\n\n\n\n\n-------------------------------------------------------------------------------\n\nExact Audio Copy V0.99 prebeta 4 from 23. January 2008\n\nEAC extraction logfile from 14. June 2009, 4:51\n\nMike Oldfield / Tubular Bells (The Demos)\n\nUsed drive  : HL-DT-STDVD-RAM GSA-H55N   Adapter: 0  ID: 0\n\nRead mode               : Secure\nUtilize accurate stream : Yes\nDefeat audio cache      : Yes\nMake use of C2 pointers : No\n\nRead offset correction                      : 102\nOverread into Lead-In and Lead-Out          : No\nFill up missing offset samples with silence : Yes\nDelete leading and trailing silent blocks   : No\nNull samples used in CRC calculations       : Yes\nUsed interface                              : Installed external ASPI interface\nGap handling                                : Appended to previous track\n\nUsed output format              : User Defined Encoder\nSelected bitrate                : 1024 kBit/s\nQuality                         : High\nAdd ID3 tag                     : No\nCommand line compressor         : F:Archivos de programaExact Audio \nCopyFLACFLAC.EXE\nAdditional command line options : -8 -V -T &quot;ARTIST=%a&quot; -T &quot;TITLE=%t&quot; -T \n&quot;ALBUM=%g&quot; -T &quot;DATE=%y&quot; -T &quot;TRACKNUMBER=%n&quot; -T &quot;GENRE=%m&quot; -T &quot;COMMENT=%e&quot; %s -o \n%d\n\n\n-------------------------------------------------------------------------------\n                      IMPORTANT: PLEASE READ (A REQUEST)\n-------------------------------------------------------------------------------\n\nIt's usual to post comments only to attack a torrent which doesn't work in your \nconfiguration.  It's normal, after a few hours/days downloading and expecting a\nrelease, to feel deceived if it doesn't work properly, and expressing this is\nlegitimate.\n\nI've often found one comment (negative) on a movie/CD downloaded by 2000+ \npeople, and since that single negative feedback, people simply stop downloading \nand therefore, sharing.  But a few times it was due not to the torrent itself, \nbut to some issues on the downloader side (not updated codecs, misused \ntools...), and that's unfair for the person who took the time to share it for\nfree.\n\nIF YOU FIND THIS RELEASE DESERVES TO BE RECOMMENDED TO OTHERS, HELP BY DROPPING \nA LINE AFTER YOU'VE CHECKED IT.  This way, You'll help in keeping the torrent \nalive, almost as much as keeping it in your HDD until a 1:1 ratio is\nreached.\n\nThanks\n\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:1982812b1aaaab071f9d1b35037d2bea964e7460","amp;dn":"Mike+Oldfield+-+Tubular+Bells+%28The+Ultimate+Edition+2009+3CD%29+%5BE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1982812b1aaaab071f9d1b35037d2bea964e7460","infoHashBuffer":{"type":"Buffer","data":[25,130,129,43,26,170,171,7,31,157,27,53,3,125,43,234,150,78,116,96]},"announce":[],"urlList":[]}}