{"title":"Antonio Vivaldi - The Four Seasons - Janine Jansen (2005) [FLAC]","uid":10838173,"size":193033112,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1aa1206f8b0bbc316de169f82328e76d12602b24&amp;dn=Antonio+Vivaldi+-+The+Four+Seasons+-+Janine+Jansen+%282005%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":null,"files":-1,"time":1408716274,"description":"Antonio Vivaldi - The Four Seasons - Janine Jansen\n\n\nComposer: Antonio Vivaldi\nPerformer: Janine Jansen\nAlbum: The Four Seasons\nYear: 2005\nLabel: DECCA\nGenre: Classical\n\nBiography\n\nJanine Jansen's 1997 debut with the Amsterdam Concertgebouw signaled the rise of a major violin talent. But Jansen remained little known outside of the Netherlands until her 2002 London debut with the Philharmonia Orchestra under Vladimir Ashkenazy. Thereafter, invitations to appear with the major European and American orchestras poured in, and in 2003 she was awarded the Dutch Music Prize, the highest artistic award given in the Netherlands. While her beauty and statuesque appearance often figure in the marketing of her recordings, Jansen is rightly regarded as one of her generation's foremost violinists. With a formidable technique and immaculate tone, Jansen fashions her interpretations with both imagination and maturity. And her repertory is broad, taking in works by J.S. Bach, Vivaldi, Beethoven, Mendelssohn, Sibelius, Debussy, Prokofiev, Shostakovich, and modern composers like Robert Helps and Richard Dubugnon. Jansen has recorded for Decca and Naxos.\n\nJanine Jansen was born in Soest, Netherlands, on January 7, 1978. She began lessons on the violin at six and had advanced studies at the University of Utrecht. Her list of teachers includes Philippe Hirschhorn, Coosje Wijzenbeek, and Boris Belkin.\n\nFollowing her 1997 Concertgebouw debut, Jansen slowly began building her career abroad. From 1998, she regularly took part in the Spectrum Concerts Berlin, a chamber music series of the Berlin Philharmonic. In 2001 she performed the Brahms Violin Concerto with the National Youth Orchestra of Scotland. Jansen also began performing in the U.K. as a BBC New Generation Artist.\n\nWhile her London debut with Ashkenazy in 2002 ushered in more concert opportunities, it also led to several successful recordings. Naxos issued her first CD in 2003, a disc of works by John Harbison, and Decca followed in the two succeeding years with an album of various concertante works entitled simply Janine Jansen and a disc of Vivaldi's The Four Seasons.\n\nWhile the latter recording generated some controversy, it became a best-seller on iTunes and received an Echo award in 2006. Two more Echo awards followed for her Decca recordings of Mendelssohn and Bruch concertos (2007) and Beethoven and Britten concertos (2010).\n\nIn the 2007-2008 season Jansen made impressive debuts with the New York and Los Angeles Philharmonic Orchestras and in October 2009 she debuted with the Berlin Philharmonic in an acclaimed performance of the Britten Violin Concerto. In 2011 Decca issued Jansen's first recital disc, Beau Soir, a collection of French works featuring accompaniment by pianist Itamar Golan.\n\nDescription:\n\nJanine Jansen follows her first Decca album of violin favorites with this high-energy account of Vivaldi's four violin concertos, known and loved as 'The Four Seasons'. The Dutch violinist leads her specially selected group of soloists in a fresh look at the most loved of all classical works. What gives this recording its tremendous freshness and sparkle is Janine's use of just one player per part. Gone is the heavy orchestral sound which is so familiar, this is a four seasons which sparkles with new life and energy, like a freshly cleaned old painting revealed in its true colors.\n\nTracklist:\n\nConcerto No. 1 in E Major for solo violin &quot;La Primavera&quot;\n01.    1. Allegro\n02.    2. Largo\n03.    3. Allegro\n\nConcerto No. 2 in G minor for solo violin, &quot;L'Estate&quot;\n04.    1. Allegro non molto\n05.    2. Adagio - Presto\n06.    3. Presto\n\nConcerto No. 3 in F Major for solo violin, &quot;L'Autunno&quot;\n\n07.    1. Allegro\n08.    1. Adagio molto\n09.    1. Allegro\n\nConcerto No. 4 in F minor for solo violin, &quot;L'Inverno&quot;\n\n10.    1. Allegro non molto\n11.    1. Largo\n12.    1. Allegro","torrent":{"xt":"urn:btih:1aa1206f8b0bbc316de169f82328e76d12602b24","amp;dn":"Antonio+Vivaldi+-+The+Four+Seasons+-+Janine+Jansen+%282005%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1aa1206f8b0bbc316de169f82328e76d12602b24","infoHashBuffer":{"type":"Buffer","data":[26,161,32,111,139,11,188,49,109,225,105,248,35,40,231,109,18,96,43,36]},"announce":[],"urlList":[]}}