{"title":"shampoo Anti-Virus 2016 1.3.0[ThePirateBay]","uid":13449185,"size":192513888,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1ac280b3fc22338ab319e82e8057bebcfadf3f6a&amp;dn=shampoo+Anti-Virus+2016+1.3.0%5BThePirateBay%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"robertt16","files":4,"time":1454781507,"description":"\n\r\n\r\n\r\nAshampoo Anti-Virus 2016 - antivirus program from the well-known developer of software company Ashampoo. The program is designed to protect your computer from viruses, worms, Trojans and other malware. Ashampoo AntiVirus can operate in automatic mode, scanning the user's files and operating system components. Anti determines both known viruses and suspicious objects that may be potential carriers of viruses.\r\n\r\nIf necessary, the user can check any files on CD and DVD drives, hard drive and other storage devices. Special attention is paid to checking e-mail. You can automatically update antivirus databases, changes in which developers are making several times a day.\r\n\r\nSecurity Components\r\n* Real-time protection: Neutralize the attack as soon as they occur\r\n* Behavioral blocker: It monitors the behavior of applications and prevents even classifying threats\r\n* On-Access Guard: attempts to neutralize infection during file operations.\r\n* Multi-Scanner: The union of two scan engines for maximum accuracy\r\n* Customizable whitelist to exclude files from scanning\r\n* Web Protection: Prevents access to malicious Web sites\r\n* Game mode: all security issues automatically to ensure continuous play\r\n* Self-defense: A vital part of the program is encrypted to prevent the circumvention of security measures\r\n\r\nUser interface\r\n* Intuitive overview page with quick access to all program areas\r\n* Logically arranged tabs\r\n* Flat widget hierarchy without complex nested dialogs\r\n\r\nUtilities\r\n* File Wiper: Protect your privacy and permanently delete files and folders. It is also possible to overwrite the empty space on the hard disk to prevent recovery of deleted files already.\r\n* Internet Cleaner: Remove all traces of your Internet aktivanosti and delete temporary Internet files, clear your browser cache and delete your browsing history.\r\n* HOSTFILE Checker: check your windows HOSTFILE for unwanted forwarding DNS\r\n* ADS Scanner: Scan NTFS drives for hidden data streams and remove them\r\n* StartUp Tuner: reduce the time you start your computer and disable unnecessary startup entries.\r\n* Viewer LSP: Winsock-management layers and network activity","torrent":{"xt":"urn:btih:1ac280b3fc22338ab319e82e8057bebcfadf3f6a","amp;dn":"shampoo+Anti-Virus+2016+1.3.0%5BThePirateBay%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ac280b3fc22338ab319e82e8057bebcfadf3f6a","infoHashBuffer":{"type":"Buffer","data":[26,194,128,179,252,34,51,138,179,25,232,46,128,87,190,188,250,223,63,106]},"announce":[],"urlList":[]}}