{"title":"Infernal Restraints--Conjugal Visit BONUS Charlotte Vale Low","uid":12948667,"size":1763473175,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:1b182573ec12334352ac824db214c1f8e1910a4d&amp;dn=Infernal+Restraints--Conjugal+Visit+BONUS+Charlotte+Vale+Low&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"merzedes","files":1,"time":1449704259,"description":"Conjugal Visit BONUS | Charlotte Vale\t\r\n\r\nDecember 9, 2015\r\n\r\n\r\nLow bitrate MP4 only.\r\n\r\n\r\nLife is tough for Charlotte Vale \r\n\r\nConjugal visits are rare in the U.S. but PD does not run the average prison. He keeps only one or two inmates at a time and for one as hot as Charlotte Vale he is definitely going to take advantage of her. She gets to languish a bit while he contemplates exactly what to do with her. It is likely to be the only peace she will get all day. \r\n\r\nIt is a long day and it shows no sign of ending as the sun goes down. Out in the woods PD may not have all of his tools available, but the one that matters is ready to go. She was let out of her cell for a reason and it was not just to look pretty and take a beating. PD wants to use her and if she wants to stay out of the deepest, darkest, dirtiest hole he can find she is going to perform. \r\n\r\nLife is tough for Charlotte Vale. This day starts with a rude awakening. She had to spend the night locked away with her mouth in prime cock-sucking position because that is what the man that owns her wants. Now she needs to demonstrate what that experience has taught her. While most people would enjoy eggs and bacon for breakfast, hers is just dry oats swimming in her own juice. She needs to eat. She is starving but he will not give her anything else. She has to eat it, as much as it makes her wretch. \r\n\r\nThere is cold, electrified metal inside of her now. PD wants to watch her cum, but all Charlotte wants is a warm cock. Her screams and her tears are what make him hard, and that is the nature of her predicament. To get the fucking she so desperately desires she has to take the pain and humiliation that terrifies her. \r\n\r\nScreens \nhttp://www.infernalrestraints.com/device/bondage/trailer.php?y=2015&amp;p=12_09cvale2&amp;u=InfernalRestraints-Charlotte-Vale-Conjugal-Visit-BONUS\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n19 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\r\n\r\nJust keep on leaving us the nice comments below and we are happy :)\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:1b182573ec12334352ac824db214c1f8e1910a4d","amp;dn":"Infernal+Restraints--Conjugal+Visit+BONUS+Charlotte+Vale+Low","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b182573ec12334352ac824db214c1f8e1910a4d","infoHashBuffer":{"type":"Buffer","data":[27,24,37,115,236,18,51,67,82,172,130,77,178,20,193,248,225,145,10,77]},"announce":[],"urlList":[]}}