{"title":"Ben Macintyre - A Spy Among Friends (epub)","uid":10746611,"size":2576995,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b2ae9152323a5e9847d95c8f096446378ff8c80&amp;dn=Ben+Macintyre+-+A+Spy+Among+Friends+%28epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"SectorVector","files":-1,"time":1407824473,"description":"\nA Spy Among Friends: Kim Philby and the Great Betrayal,\n\nby Ben Macintyre.\n\n# Bloomsbury Publishing, 2014\n# 368 pages (epub)\n\n\nKim Philby was the most notorious British defector and Soviet mole in history. Agent, double agent, traitor and enigma, he betrayed every secret of Allied operations to the Russians in the early years of the Cold War.\n\n\nPhilby's two closest friends in the intelligence world, Nicholas Elliott of MI6 and James Jesus Angleton, the CIA intelligence chief, thought they knew Philby better than anyone, and then discovered they had not known him at all. This is a story of intimate duplicity; of loyalty, trust and treachery, class and conscience; of an ideological battle waged by men with cut-glass accents and well-made suits in the comfortable clubs and restaurants of London and Washington; of male friendships forged, and then systematically betrayed. \n\n\nWith access to newly released MI5 files and previously unseen family papers, and with the cooperation of former officers of MI6 and the CIA, this definitive biography unlocks what is perhaps the last great secret of the Cold War.\n\nReview\n======\n\nArguably his most ambitious account yet: a penetrating portrait of the double agent Kim Philby, notoriously the most successful provider of secret intelligence to the Soviet Union of all the &quot;Cambridge Spies&quot; Daily Telegraph A stranger-than-fiction account of the extraordinary double-agent Kim Philby from the bestselling historian ... The plot is mind-blowing. If you made it up, it would be too far-fetched Bookseller \n\n\nAuthor\n======\n\nBen Macintyre is a columnist and Associate Editor on The Times. He has worked as the newspaper's correspondent in New York, Paris and Washington. He is the author of nine previous books including Agent Zigzag, shortlisted for the Costa Biography Award and the Galaxy British Book Award for Biography of the Year 2008, and the no. 1 bestsellers Operation Mincemeat and Double Cross. He lives in North London with his wife and three children. \n\n &lt;a href=&quot;\nhttp://www.goodreads.com/book/show/20543546-a-spy-among-friends&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.goodreads.com/book/show/20543546-a-spy-among-friends&lt;/a&gt;\n\n-_-","torrent":{"xt":"urn:btih:1b2ae9152323a5e9847d95c8f096446378ff8c80","amp;dn":"Ben+Macintyre+-+A+Spy+Among+Friends+%28epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b2ae9152323a5e9847d95c8f096446378ff8c80","infoHashBuffer":{"type":"Buffer","data":[27,42,233,21,35,35,165,233,132,125,149,200,240,150,68,99,120,255,140,128]},"announce":[],"urlList":[]}}