{"title":"BlazeVideo HDTV Player Professional 6.6.0.3","uid":7668163,"size":29679820,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1b63593706f62672e0a938f9c4b39ae024e964d6&amp;dn=BlazeVideo+HDTV+Player+Professional+6.6.0.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1348499232,"description":"BlazeVideo HDTV Player is a full-featured and easy to use BlazeVideo HDTV Player software, combining HDTV playback, FM receiving, video record and DVD playback functions. You can make advantage of PC monitor's high resolution, watch, record, playback high definition HDTV program or teletext broadcast program. Supports HDTV, teletext, FM radio, DVD and media files playback. With more advanced features: scan channels, EPG guide, multi-channel preview, realtime/schedule record HDTV, schedule watch HDTV, video capture, DVD record, DVD bookmark, photo slideshow, smart stretch, equalizer &amp; visualization, etc.\n\nBlazeVideo HDTV Player also acts as your multi-media center, with superior video and audio quality, it supports DVD, VCD, SVCD, MP3, MPEG and Pictures playback. The more advanced features, such as video/audio record, video capture, bookmark preview, picture slideshow, screen control, special audio effect, optional skin, bring you an infinite wonderful multi-media world.\n\nBlazeVideo HDTV Player (BlazeDTV) totally supports H.264/Mpeg-2 HDTV decoder for DMB-TH (Chinese DTV Standard). With wide compatibility, BlazeVideo HDTV Player fully complies with DVB-T, ATSC, DVB-S1, VB-S2 standard, supports most popular TV Card with BDA interface on market, and runs stably and smoothly on Windows 98/Me/2000/XP/Vista operating system.\n\nRun application\nCopy patch in install dir and replace","torrent":{"xt":"urn:btih:1b63593706f62672e0a938f9c4b39ae024e964d6","amp;dn":"BlazeVideo+HDTV+Player+Professional+6.6.0.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b63593706f62672e0a938f9c4b39ae024e964d6","infoHashBuffer":{"type":"Buffer","data":[27,99,89,55,6,246,38,114,224,169,56,249,196,179,154,224,36,233,100,214]},"announce":[],"urlList":[]}}