{"title":"Wizardry 6 and 7 GoG","uid":8749859,"size":523854086,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1bce59b9a9d5f874a314beaf500c5b5c77809369&amp;dn=Wizardry+6+and+7+GoG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"AN0NYMOUS142857","files":19,"time":1375004411,"description":"What's cool about it:\nIncludes Wizardry 6: Bane of the Cosmic Forge and Wizardry 7: Crusaders of the Dark Savant which also comes as the improved Wizardry Gold on top of the classic DOS version.\nBoth Wizardry games offer classic hard core turn-based role-playing with 14 ranked professions and 11 unique races.\nTons and tons of treasure to find, elaborate dungeons to explore, tough tactical battles to win, and that s just the start of the adventure of up to 500 hours of playtime.\nOverview:\n\nWizardry 6: Bane of the Cosmic Forge\nPrepare yourself for a journey of epic proportions as you embark on a quest to retrieve a powerful artifact--the magical pen known as the Cosmic Forge. Its writings affect both Time and Space, allowing its holder to rewrite reality itself! Build your party of six companions, determine their skills, professions, and stats and enter the ancient castle where you ll find treasure, armor, and powerful magic items to advance your quest. Meet the fortress' wizened and cryptic dwellers who hold secrets that must be unearthed and solve the riddles and puzzles that abound. Beware, however, as you and your party of stalwart adventurers will encounter countless dangers, hazards, and creatures of dazzling and terrifying form. Only by using your magic and skills, ever growing as you progress, can the dangers of the dungeon be vanquished. With over 400 items ranging from armor to weaponry researched for authenticity to the tactical combat structure, with Primary and Secondary attacks, Wizardry 6 stands tall against any and all RPGs.\n\nWizardry 7: Crusaders of the Dark Savant\nYou thought the adventure was over? It has only just begun! Import your characters from Wizardry 6: Bane of the Cosmic Forge or begin anew with a party of adventurers who ll conquer the rigors of a strange alien world. You ll discover both friends and foes as you search for the long-forgotten secret of a madman--the mystery of the very universe itself. You won t be alone in your quest, however, as other adventuring groups are after the very same goal. Choose your actions wisely as there will be consequences: if you anger one person, be prepared to fight his friends later! From the depths of a dungeon to the blue and limitless skies, you ll see it all in Wizardry 7: Crusaders of the Dark Savant.\n\nWizardry 6+7 offers two games that brought veritable incline to the RPG genre. Brave through tough, tactical, and turn-based battles that will push your skills to their extreme limits. Unravel fiendish puzzles and avoid devious traps, here to test your intellect as you navigate labyrinthine dungeons. Many will play but only a few will make it to the end of the glorious and majestic quest. Will you be one of the chosen few?","torrent":{"xt":"urn:btih:1bce59b9a9d5f874a314beaf500c5b5c77809369","amp;dn":"Wizardry+6+and+7+GoG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bce59b9a9d5f874a314beaf500c5b5c77809369","infoHashBuffer":{"type":"Buffer","data":[27,206,89,185,169,213,248,116,163,20,190,175,80,12,91,92,119,128,147,105]},"announce":[],"urlList":[]}}