{"title":"Transformers Age Of Extinction 2014 720p BRRip H264 - HeAdCnA","uid":11157571,"size":1025588901,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:1c115ad345a1a5e500ffb2d89809d6ed9c64f145&amp;dn=Transformers+Age+Of+Extinction+2014+720p+BRRip+H264+-+HeAdCnA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"BmF247","files":8,"time":1412463225,"description":"[img]http://i1371.photobucket.com/albums/ag285/HeAdCnA/Transformers_Age_of_Extinction_Posterjpeg_zpsb90df33c.jpeg[/img]\n\nTransformers: Age of Extinction is a 2014 science fiction action film based on the Transformers franchise. It is the fourth installment of the live-action Transformers film series and stars Mark Wahlberg in the lead role. A sequel to Transformers: Dark of the Moon, the film takes place five years later, after the Decepticon invasion of Chicago. Like its predecessors, the film is directed by Michael Bay[6] and executive produced by Steven Spielberg. Ehren Kruger is the film's screenwriter, having written every Transformers film since Transformers: Revenge of the Fallen. The film features an entirely new cast of human characters and is the first in the series to feature the Dinobots. Returning Transformers include Optimus Prime, Bumblebee, Ratchet, Leadfoot, Brains and Megatron (now known as Galvatron). The film was released on June 27, 2014, in IMAX and 3D.[7]\n\nReception to the film was generally positive among casual film-goers, who gave it a 6.1/10,[8] but negative among film critics, who expressed an overall dislike for the acting, directing, length, and writing. It received an average rating of 18% on Rotten Tomatoes, making it the lowest rated film of the franchise, although some praised the action scenes, visual effects, and Wahlberg's and Stanley Tucci's performances. The film was a commercial success, grossing over $1 billion in worldwide box office revenue. A fifth film as of now titled Transformers 5 is scheduled for a summer 2016 release.\n\nPlot\nSixty-five million years ago, during the Cretaceous period, beings known as the Creators detonate many metallic devices known as Seeds, wiping out most life on Earth. In the present, a geologist named Darcy Tyril discovers a dinosaur corpse covered in a strange metal in the Arctic.\n\nFive years have passed since the Battle of Chicago and humanity has grown fearful of the Autobots and joint combat operations between them have been severed. Officially the Autobots are granted sanctuary but secretly, even without the U.S. President's knowledge, Cemetery Wind, an elite CIA unit headed by paranoid agent Harold Attinger and team leader James Savoy, tasked with hunting down the remaining Decepticons, is also secretly hunting down Autobots, believing them to be a threat, and have killed most of them. With the aid of the Transformer bounty hunter Lockdown, they ambush and brutally kill Ratchet. Their primary target, however, is Optimus Prime, whom Lockdown personally wants alive.\n\nMeanwhile in rural Texas, Cade Yeager, a struggling inventor, and his friend Lucas buy an old truck to strip it for parts in hopes of sending Cade's daughter Tessa to college. Cade soon discovers that the truck is an injured Optimus Prime and repairs him. After locating Optimus in Texas, Cemetery Wind and Lockdown travel there and confront Cade, Tessa, and Lucas. Optimus comes out of hiding and attacks the operatives, allowing Cade and his friends to escape. They are saved by Tessa's secret boyfriend, Shane Dyson, with whom they escape, though Lucas is killed by Lockdown's grenade. While in hiding, tensions between Cade, his daughter and Shane rise due to the fact that the two teenagers kept their relationship secret. Optimus, meanwhile rallies the last remaining Autobots: Bumblebee, Hound, Drift, and Crosshairs. Cade hacks into a drone he took from the attack in Texas, and learns that Cemetery Wind is working with a corporation called KSI. They decide to infiltrate KSI headquarters in Chicago for information.\n\nMeanwhile, Joshua Joyce, the head of KSI, shows Tyril that he has perfected transformium, the codeable, molecularly unstable metal that of which the Transformers are comoposed. He has imprisoned Brains to decode dead Transformers' brains and utilize their data for human-created Transformers. He shows Tyril his prized creation, Galvatron, who was created using data from Megatron's brain. Optimus and the Autobots storm the facility, free Brains, and start to destroy the facility. Joyce stops them, and when he explains that humans don't need the Autobots anymore, now that they can create their own Transformer soldiers, the Autobots leave.\n\nAttinger forces Joyce to launch Galvatron and another man-made Transformer, Stinger, to pursue the Autobots. Galvatron and Optimus battle before Lockdown wounds and captures Optimus, along with Tessa, into his ship, where he locks Optimus in the middle of his trophy room, which also houses the Dinobots, who are regarded as legendary knights. Lockdown explains that the Creators want Optimus back. Before leaving, Lockdown gives Cemetery Wind a Seed, a bomb that can cyberform any area of land, giving Cade, Shane, and the Autobots time to board the ship. Cade and Shane save Tessa, and escape with Bumblebee. The other Autobots save Optimus and escape on the detachable section of Lockdown's ship containing the trophy room, before Lockdown's ship enters deep space. Optimus and Brains reveal that Galvatron is Megatron reincarnated, and that he has been manipulating KSI to build an army and steal the Seed in order to wipe out humans and create more Decepticons. Joyce retreats to Beijing with Tyril and his business associate, Su Yueming, to use the production facilities there. Cade warns Joyce, who decides to go back on his deal with Attinger. As the two argue, Galvatron activates by himself and infects all the KSI prototypes, enabling him to command them to do his bidding.\n\nAs the Autobots try to retrieve the Seed in Hong Kong, their ship is shot down by Galvatron's army, leaving Hound and Bumblebee to fight the battle outnumbered. Knowing this, Optimus releases and tames the Dinobots. With their help, they destroy Galvatron's army. Lockdown returns and uses a magnetic weapon in an effort to reclaim Optimus and the Dinobots. However, Optimus destroys it and proceeds to fight Lockdown. Cade, after managing to evade and kill Savoy, tries to help but is held at gunpoint by Attinger, who is disgusted by Cade's choice to side with the Autobots. Optimus saves Cade by killing Attinger, but Lockdown impales Optimus with his sword into a wall. Cade and Bumblebee distract Lockdown while Tessa and Shane take the sword out of Optimus, who then kills Lockdown. Galvatron retreats, vowing to battle Optimus another day. Optimus sets the Dinobots free and requests the Autobots to protect Cade and his family before flying into space with the Seed, sending a message to the Creators that he is coming for them.\n\nVideo:\n\nSource - BluRay Disc\n\nFile Type - m4v\n\nFile Size - 977 mb\n\nLength - 02:45:07\n\nFrame Width - 640\n\nFrame Height - 420\n\nData Rate - 711 kbps\n\nTotal Bitrate - 820 kbps\n\nFrame Rate - 30 fps\n\nAudio:\n\nType - mp3\n\nBit Rate - 109 kbps\n\nChannels - 2(stereo)\n\nAudio Sample Rate - 48 khz\n\nWhats up to ET and 1337X! Fuck you to kat and tpb!\n\n[img]http://i1371.photobucket.com/albums/ag285/HeAdCnA/TransformersAgeOfExtinction2014720pBRRipH264-HeAdCnAm4v_thumbs_20141004_144831_zpsf829fe88.jpg[/img]\n\n[img]http://i1371.photobucket.com/albums/ag285/HeAdCnA/vlcsnap-2014-10-04-14h46m56s122_zps8764948c.png[/img]\n\n[img]http://i1371.photobucket.com/albums/ag285/HeAdCnA/vlcsnap-2014-10-04-14h47m08s242_zps4051ffee.png[/img]","torrent":{"xt":"urn:btih:1c115ad345a1a5e500ffb2d89809d6ed9c64f145","amp;dn":"Transformers+Age+Of+Extinction+2014+720p+BRRip+H264+-+HeAdCnA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c115ad345a1a5e500ffb2d89809d6ed9c64f145","infoHashBuffer":{"type":"Buffer","data":[28,17,90,211,69,161,165,229,0,255,178,216,152,9,214,237,156,100,241,69]},"announce":[],"urlList":[]}}