{"title":"Gibson, William - The Peripheral - Calibre epub","uid":11599516,"size":841853,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ceb48f421e5d1e78f8a7de7f84d80ff4c86eb98&amp;dn=Gibson%2C+William+-+The+Peripheral+-+Calibre+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ericb2038","files":3,"time":1417324542,"description":"This is a conversion in epub format of this torrent in .mobi : http://thepiratebay.se/torrent/11363018/Gibson__William_-_The_Peripheral_%282014%29\n\n\nThe Peripheral by William Gibson is a thrilling new novel about two intertwined futures, from the bestselling author of Neuromancer.\n\nFlynne Fisher lives down a country road, in a rural near-future America where jobs are scarce, unless you count illegal drug manufacture, which she's keen to avoid. Her brother Burton lives, or tries to, on money from the Veterans Association, in compensation for neurological damage suffered in a Marines elite unit. \n\nFlynne earns what she can by assembling product at the local 3D printshop. She used to make more as a combat scout in an online game, playing for a rich man, but she's had to let the shooter games go. \n\nWilf Netherton lives in London, seventy-some years later, on the far side of decades of slow-motion apocalypse. Things are pretty good now, for the haves, and there aren't many have-nots left. Wilf, a high-powered publicist and celebrity-minder, fancies himself as a romantic misfit in a society where reaching into the past is just another hobby.\n\nBurton's been moonlighting online, secretly working security in some game prototype, a virtual world that looks vaguely like London, but a lot weirder. He's got his sister taking over shifts, promised her the game's not a shooter. Still, the crime Flynne witnesses there is plenty bad. \n\nFlynne and Wilf are about to meet one another. Her world will be altered utterly, irrevocably, and Wilf's, for all its decadence and power, will learn that some of these third-world types from the past can be badass.\n\nAccording to the Guardian, in terms of influence Gibson is 'probably the most important novelist of the past two decades'. The Peripheral, which marks a return to the futurism of Neuromancer, will be adored by Gibson readers and will also appeal to fans of Ender's Game, Looper and Source Code","torrent":{"xt":"urn:btih:1ceb48f421e5d1e78f8a7de7f84d80ff4c86eb98","amp;dn":"Gibson%2C+William+-+The+Peripheral+-+Calibre+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ceb48f421e5d1e78f8a7de7f84d80ff4c86eb98","infoHashBuffer":{"type":"Buffer","data":[28,235,72,244,33,229,209,231,143,138,125,231,248,77,128,255,76,134,235,152]},"announce":[],"urlList":[]}}