{"title":"Mind of God by Paul Davies","uid":10707534,"size":6942242,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1cf8d59426f0c1984558cd59678077865fdd75f0&amp;dn=Mind+of+God+by+Paul+Davies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"gratefuldawg77","files":5,"time":1407312186,"description":"Throughout history, humans have dreamed of knowing the reason for the existence of the universe. In The Mind of God, physicist Paul Davies explores whether modern science can provide the key that will unlock this last secret. In his quest for an ultimate explanation, Davies reexamines the great questions that have preoccupied humankind for millennia, and in the process explores, among other topics, the origin and evolution of the cosmos, the nature of life and consciousness, and the claim that our universe is a kind of gigantic computer. Charting the ways in which the theories of such scientists as Newton, Einstein, and more recently Stephen Hawking and Richard Feynman have altered our conception of the physical universe. Davies puts these scientists' discoveries into context with the writings of philosophers such as Plato. Descartes, Hume, and Kant. His startling conclusion is that the universe is &quot;no minor byproduct of mindless, purposeless forces. We are truly meant to be here.&quot; By the means of science, we can truly see into the mind of God.","torrent":{"xt":"urn:btih:1cf8d59426f0c1984558cd59678077865fdd75f0","amp;dn":"Mind+of+God+by+Paul+Davies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cf8d59426f0c1984558cd59678077865fdd75f0","infoHashBuffer":{"type":"Buffer","data":[28,248,213,148,38,240,193,152,69,88,205,89,103,128,119,134,95,221,117,240]},"announce":[],"urlList":[]}}