{"title":"The Road to Shiloh - early battles in the West (Time-Life The Ci","uid":11566193,"size":39664571,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d012b4730747a564b78c4616dc838de5580911c&amp;dn=The+Road+to+Shiloh+-+early+battles+in+the+West+%28Time-Life+The+Ci&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"STBGD","files":-1,"time":1416954512,"description":"Pdf / English / 1983 Time-Life / 175 pages / ISBN 10 0809447169 / 37.8 MB\n\nAlthough the battles of the Army of the Potomac in the Eastern Theater garner most of the historical interest, the battles in the West were arguably more significant. In &quot;The Road to Shiloh: Early Battles in the West,&quot; David Nevin and the Editors of Time-Life Books cover General Ulysses Grant's campaign in Tennessee in 1861-62. Chapter 1, &quot;The Struggle for Missouri,&quot; covers the Battle of Wilson's Creek that proved pivotal for the control of this border state. Chapter 2, &quot;The Go-ahead General,&quot; details the path by which Grant came to command the Union Army in the West (including that infamous photo of Grant with a fully cultivated square-cut beard). Chapter 3, &quot;Clash at Fort Donelson,&quot; relates how Grant followed up his successfully attack on Fort Henry with an attack that would give the Federals control of the Cumberland River. Chapter 4, &quot;The Devil's Own Day,&quot; covers the first day of the Battle of Shiloh, in which the Union army was almost routed one of the bloodiest days of the war; this chapter includes Theophile Poilpot's 400 foot long panoramic painting of the battle for the Hornet's Nest. Chapter 5, &quot;An Incomplete Victory,&quot; tells how Grant and Sherman defeated Johnston's Confederate Army. Like all of the volumes in the Time-Life Civil War series, &quot;The Road to Shiloh&quot; provides dozens of contemporary illustrations, photographs, paintings, and the like. My one complaint is that if you read these volumes a lot, and it is hard not to, they tend to fall apart. The cover ends up being a nice gray folder. The rest of Grant's Western Campaign including the siege of Vicksburg is covered in the volume &quot;War on the Mississippi.&quot;\n\nAmazon","torrent":{"xt":"urn:btih:1d012b4730747a564b78c4616dc838de5580911c","amp;dn":"The+Road+to+Shiloh+-+early+battles+in+the+West+%28Time-Life+The+Ci","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d012b4730747a564b78c4616dc838de5580911c","infoHashBuffer":{"type":"Buffer","data":[29,1,43,71,48,116,122,86,75,120,196,97,109,200,56,222,85,128,145,28]},"announce":[],"urlList":[]}}