{"title":"Dr Harry Henshaw Power of Breath Hypertension Treatment Program","uid":11967393,"size":138096554,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1d3b7a08cb2ea426ccc31d8efc61068727555cf5&amp;dn=Dr+Harry+Henshaw+Power+of+Breath+Hypertension+Treatment+Program&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"elessedilgirl","files":7,"time":1432737795,"description":"Hypertension is a problem that affects many individuals living today. One in every three individuals has hypertension. While there are no symptoms of high blood pressure one third of those who have high blood pressure do not even know that they have it. Uncontrolled high blood pressure can lead to a stroke, heart attack, heart failure and kidney failure. Hypertension or high blood is defined as a blood pressure reading of over 120/80.\n\nThere are a variety of treatments that can be done to help a person with hypertension or high blood pressure. One of the traditional treatments for hypertension is with the use of high blood pressure medications. The primary goal of the medications is to simply lower a person's blood pressure. It is commonly believed that this type of treatment is for the duration of the individual's life.\n\nAnother way of treating hypertension is to help a person learn how to alter his or her breathing pattern. While many physicians do not believe that there is any connection between a person's high blood pressure condition and his or her breathing pattern, research is now starting to explore the fundamental relationship between blood pressure and breathing. Unlike biofeedback and relaxation exercises, it is believed that this type of treatment approach will help the individual to restore a healthy blood pressure.\n\nAccording to some researchers, when we breath we draw oxygen into our body, into our lungs. The lungs absorb the oxygen that we breathe in and then transmit it to the cells of our body to produce the energy needed for our daily functioning. As a result of this process, carbon dioxide is that which is transferred from the cells back to the lungs to be exhaled from our body. In a very fundamental sense, our breathing pattern affects every part of our body.\n\nMost individuals have a shallow breathing pattern. However, shallow breathing creates a very serious problem for us. When we have a shallow breathing pattern we do not bring in enough oxygen into our lungs and for the needs of our body. With shallow breathing, we also leave a great deal of carbon dioxide in our lungs. Shallow breathing deprives the body of needed oxygen. As a result the heart will tend to compensate by pumping more blood to the body. High blood pressure will be the result of the hearts attempt to compensate and supply needed oxygen to the cells of the body.\n\nHowever, many researchers now believe that this situation and the serious problem that is created as a result can be changed. Research is starting to reveal that by helping a person to learn how to change his or her breathing pattern that their blood pressure can be not only lowered but also restored to a healthy level. It is believed that our breathing pattern is learned, primarily from the experience of fear. Given that it is learned, we have the ability to relearn how to breathe harmoniously and as a result restore our blood pressure to his normal level. Further research is also suggesting that the use of therapeutic relaxation music will have a beneficial effect on restoring a person's normal blood pressure.\n\nDr Harry Henshaw has created a product specifically designed to help a person create a more effective way of breathing and as a result possibly lower his or her blood pressure. This unique audio product combines a guided imagery breathing exercise with specially designed therapeutic relaxation music. The purpose of the guided imagery breathing exercise is to help a person start to learn how to breathe properly. The primary purpose of the therapeutic relaxation music is to create an audio environment that will enhance the person's learning. The primary purpose of this special audio product is to teach a person how to breathe more effectively and as a result assist in creating a blood pressure that is within a normal range.\n\nFirst, this product consists of six audio tracks that can be downloaded from this site. Two of the tracks consist of a guided imagery breathing exercise combined with therapeutic relaxation music compositions, two tracks with positive affirmations and the therapeutic relaxation music and two tracks of therapeutic relaxation music only. The first two tracks will assist a person in learning the breathing process. The two tracks with positive affirmations are designed to assist a person in improving his or her inner messages that will further assist in this healing process. The two tracks with therapeutic relaxation music only are for the actual practice of the breathing exercise after the breathing technique is learned.\n\nIt is recommended that a person listen to the guided imagery exercise twice a day (in the morning and then again in the evening, preferably before sleep) until the breathing exercise is learned. Once learned then it is recommended that the person utilize the therapeutic relaxation music track only with an occasional listening of the guided imagery exercise as a reinforcement. The tracks with positive affirmations should be listened to once a day. As stated above the positive affirmations are designed to assist a person in improving his or her inner messages, messages that will both motivate and assist in the healing process.\n\nWhile an individual should also consider traditional suggestions for lowering blood pressure, that is, losing weight, eliminating smoking and alcohol, having a healthy diet, exercising daily, etc., research is suggesting that hypertension can be favorably treated with the use of deep breathing exercises and therapeutic relaxation music designed to help a person learn how to relax and breathe more effectively. An individual with hypertension should remember to always remain under the care and supervision of a qualified physician or health care professional.\n\nSuggestions for effectively utilizing this program:\n\n# For best result always use high quality headphones. The technology of the program is only fully utilized with the use of headphones.\n# Find a place and time where you will be alone, for approximately twenty minutes, free from distractions and interruptions.\n# Use the program twice every day, in the mornings and in the evenings before sleep.\n# Utilize one of the positive affirmation tracks once a day.\n# Remember to practice taking deep breathes throughout the day. The goal is to make deep breathing your regular way of breathing.\n# After you learn the process of the guided imagery exercise make sure to practice the breathing exercise with the therapeutic relaxation music selections.\n# Remember that the change process takes work and commitment.\n# Be patient and persistence!\n\nThe Holistic Healing Programs are designed to help you improve the quality of your life. All of our programs have been developed by Dr. Harry Henshaw and utilize three therapeutic components: guided imagery, positive affirmations and therapeutic relaxation music. Each program has three tracks. The first track contains the guided imagery exercise designed to teach a specific technique. The second track contains positive affirmations which have been chosen to support and reinforce the learning from the guided imagery exercise on track one. Track three contains Dr Henshaw's therapeutic relaxation music only, the purpose of which is to give a person the opportunity to practice the particular exercise taught in Track one.\n\nMP3 - 160 kbps - CBR","torrent":{"xt":"urn:btih:1d3b7a08cb2ea426ccc31d8efc61068727555cf5","amp;dn":"Dr+Harry+Henshaw+Power+of+Breath+Hypertension+Treatment+Program","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d3b7a08cb2ea426ccc31d8efc61068727555cf5","infoHashBuffer":{"type":"Buffer","data":[29,59,122,8,203,46,164,38,204,195,29,142,252,97,6,135,39,85,92,245]},"announce":[],"urlList":[]}}