{"title":"Scott H. Biram - Something's Wrong/Lost Forever [2009][EAC,log,c","uid":8331626,"size":215555141,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1d4df9453c61d273466faa4aaff5cc16285ce5da&amp;dn=Scott+H.+Biram+-+Something%27s+Wrong%2FLost+Forever+%5B2009%5D%5BEAC%2Clog%2Cc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"dickspic","files":16,"time":1364902230,"description":"Artist: Scott H. Biram\nRelease: Something's Wrong/Lost Forever\nDiscogs: 1934602\nReleased: 2009\nLabel: Bloodshot Records\nCatalog#: BS 167\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: US\nStyle: Rock, Blues Rock, Country Rock\n\nTracklisting:\n\n01. Hospital Escape\n02. Time Flies\n03. Sinkin' Down\n04. Still Drunk, Still Crazy, Still Blue\n05. Ain't It A Shame\n06. Judgement Day\n07. Draggin' Down The Line\n08. I Feel So Good\n09. Wildside\n10. Hard Time\n11. The Wishing Well\n12. Go Down Ol' Hannah\n\nAmerica in 2009 is a place and time where it isn't hard at all to have the blues, and Scott H. Biram sure seems to know it. The &quot;Dirty One-Man-Band&quot;'s third album for Bloodshot, Something's Wrong/Lost Forever, doesn't spend a lot of time dwelling on the specifics, but if ever there was set of songs that reflects the edgy malaise of a nation trying to shake off war, unemployment and bad karma, this disc fills the bill. &quot;Ain't It A Shame&quot; is a tough bit of gospel-tinged blues in which Biram and his harmonica preaches on a nation full of hate and confusion, and it segues into &quot;Judgement Day,&quot; a considerably more raucous assessment of a day when greed and bad ideas work hand in hand with the devil to bring the whole planet down. Elsewhere, Something's Wrong/Lost Forever is dominated by stories of lost souls just trying to get by, a theme that's always timely but feels even more weighty right now. Biram sounds a bit less manic on these sessions than in his earlier work, but the grit and raw, plain-spoken emotional edge of his music hasn't changed much even if he's spending a bit more time with keyboards and acoustic instruments than a blown-out electric guitar on tunes like &quot;Sinkin' Down,&quot; &quot;Draggin' Down The Line&quot; and the excellent &quot; &quot;Still Drunk, Still Crazy, Still Blue.&quot; But don't get the notion that Biram has forsaken his wild side -- &quot;The Wishing Well&quot; and &quot;Hard Time&quot; still crank it up loud and dirty, and he teams up with the Black Diamond Heavies on &quot;I Feel So Good&quot; to chase those bad vibes away. Scott H. Biram isn't trying to deliver a State Of The Union Address on Something's Wrong/Lost Forever, but he's sure made a record that resonates with the times; sometimes it's dark, sometimes it's edgy, but there's always soul, passion and life in it, and it comes straight from the heart of a man who sings and plays like his life depends on it each time he steps up to the microphone.\n\n","torrent":{"xt":"urn:btih:1d4df9453c61d273466faa4aaff5cc16285ce5da","amp;dn":"Scott+H.+Biram+-+Something%27s+Wrong%2FLost+Forever+%5B2009%5D%5BEAC%2Clog%2Cc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d4df9453c61d273466faa4aaff5cc16285ce5da","infoHashBuffer":{"type":"Buffer","data":[29,77,249,69,60,97,210,115,70,111,170,74,175,245,204,22,40,92,229,218]},"announce":[],"urlList":[]}}