{"title":"TW Doane - Bible Myths and Their Parallels in Other Religions.pd","uid":4837667,"size":71972635,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1da11dbad60d4781d960f0748d2fff9169a654ec&amp;dn=TW+Doane+-+Bible+Myths+and+Their+Parallels+in+Other+Religions.pd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":4,"uploader":"moman73","files":1,"time":1239381389,"description":"BIBLE MYTHS AND THEIR PARALLELS IN OTHER RELIGIONS\nBeing a Comparison of the Old and New Testament Myths and Miracles with Those of Heathen Nations of Antiquity Considering Also Their Origin and Meaning\n\nBy: T.W. Doane. (1882).\n\n\nExcerpts from CHAPTER XL(CONCLUSION):\n\nWE now come to the last, but certainly not least, question to be answered; which is, what do we really know of the man Jesus of Nazareth? How much of the Gospel narratives can we rely upon as fact?\n\nJesus of Nazareth is so enveloped in the mists of the past, and his history so obscured by legend, that it may be compared to footprints in the sand. We know some one has been there, but as to what manner of man he may have been, we certainly know little as fact. The Gospels, the only records we have of him, have been proven, over and over again, unhistorical and legendary; to state\nanything as positive about the man is nothing more nor less than assumption; we can therefore conjecture only.\n. . . . . .\n\nThe actual Jesus is inaccessible to scientific research. His image cannot be recovered. He left no memorial in writing of himself; his followers were illiterate; the mind of his age was confused. Paul received only traditions of him, how definite we have no means of knowing, apparently not significant enough to be treasured, nor consistent enough to oppose a barrier to his own speculations.\n. . . \n\n","torrent":{"xt":"urn:btih:1da11dbad60d4781d960f0748d2fff9169a654ec","amp;dn":"TW+Doane+-+Bible+Myths+and+Their+Parallels+in+Other+Religions.pd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1da11dbad60d4781d960f0748d2fff9169a654ec","infoHashBuffer":{"type":"Buffer","data":[29,161,29,186,214,13,71,129,217,96,240,116,141,47,255,145,105,166,84,236]},"announce":[],"urlList":[]}}