{"title":"Fred Alan Wolf - Dr. Quantum Presents Do-It-Yourself Time Travel","uid":7744411,"size":422091713,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1db55cd3e08747c7d46f66c8eaa068609c83d87e&amp;dn=Fred+Alan+Wolf+-+Dr.+Quantum+Presents+Do-It-Yourself+Time+Travel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"geogaddi000","files":-1,"time":1350718761,"description":"Dr. Quantum Presents Do-It-Yourself Time Travel (Sounds True Audio Learning Course)\n\nBy Fred Alan Wolf\n\nPublished by Sounds True Incorporated in 2008\n\nTags: nonfiction, science, physics, technology, exploration\n\nMP3, Abridged, English\n\nTime travel doesn't take a machine with flashing lights, spinning dials, and a warp engine--in fact, you were born with the power to navigate the timestream. Impossible? Not according to Dr. Quantum! The &quot;superhero of science&quot; Fred Alan Wolf makes his triumphant return in Dr. Quantum Presents: Do-It-Yourself Time Travel. Filled with mind-bending physics, dazzling insights, and potent practices for expanding your power to journey through space and time, this new audio course teaches listeners how to use their hidden time-warping powers for improving the quality of their lives. Join Dr. Quantum as he opens the doors of possibility to reveal: * The technology of &quot;ordinary&quot; time travel: simple exercises to dip your toes into the temporal stream * How the flow of time goes backward, forward, and . . . sideways? Exploring the past, future, and parallel universes * Paradoxes, wormholes, and endless loops: Learning to avoid the pitfalls of time travel * How you can take charge of your own timeline for creative growth, liberation from fear, and experience of the divine. When the past rushes into the future and the doors to parallel dimensions fly open, who can you call? Dr. Quantum, of course! Team up with the champion of spacetime on Dr. Quantum Presents: Do-It-Yourself Time Travel, to unlock the time-traveling &quot;superpowers&quot; of your own consciousness.","torrent":{"xt":"urn:btih:1db55cd3e08747c7d46f66c8eaa068609c83d87e","amp;dn":"Fred+Alan+Wolf+-+Dr.+Quantum+Presents+Do-It-Yourself+Time+Travel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1db55cd3e08747c7d46f66c8eaa068609c83d87e","infoHashBuffer":{"type":"Buffer","data":[29,181,92,211,224,135,71,199,212,111,102,200,234,160,104,96,156,131,216,126]},"announce":[],"urlList":[]}}