{"title":"Railworks TS2016 DTG Hamburg Lubeck Route+DB BR 474.3","uid":13204722,"size":961374033,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1dd2e2faeb40e95b4815431eb5b29abb8d99aa25&amp;dn=Railworks+TS2016+DTG+Hamburg+Lubeck+Route%2BDB+BR+474.3+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"TS2015","files":1,"time":1452584379,"description":"As one of the most important routes in the state of Schleswig-Holstein, the Hamburg-Lübeck Railway forms part of the Vogelfluglinie, connecting Germany’s second largest city with the capital of Denmark, Copenhagen. \r\n\r\nInitial plans to build a direct railway between the two German cities were drawn up in 1831, however it was another 34 years until the railway actually opened. Previous to the direct route, trains had to travel via Büchen to join the Berlin-Hamburg railway, a diversion approximately 32km (20 miles) longer than the direct route. \r\n\r\nToday, the Hamburg-Lübeck Railway has the highest passenger numbers in Schleswig-Holstein, and starts out at Hamburg Hauptbahnhof, the second busiest station in Europe. On departure, the route heads north-east through the suburbs of Hamburg, crossing connecting lines to Hannover, Berlin, Harburg and Hamburg Airport. \r\n\r\nBetween Hamburg-Rahlstedt and Ahrensburg, the line runs alongside the Stellmoor tunnel valley, and at Bad Oldesloe, the line connects with hourly services to Bad Segeberg and Neumünster, making it the most important intermediate stop on the line. From Bad Oldesloe, the line heads east to Reinfeld before turning north into Lübeck Hauptbahnhof. \r\n\r\nStandard services on the line are usually formed of a DB BR 143 or DB BR 218 hauling double decker coaches and the S-Bahn uses DB BR 474.3s, with Regionalbahn services operated by DB BR 648s. ICE TD and IC3 units also run on the route, although since the construction of the Great Belt Bridge between Funen and Zealand, long-distance rail traffic has significantly reduced on the route. \r\n\r\nStarting in 2017, upgrades to the Hamburg to Bad Oldesloe section will see new stations at Claudiusstraße, Bovestraße, Holstenhofweg and Pulverhof for S-Bahn operations. \r\n\r\nThe Hamburg-Lübeck Railway route add-on for Train Simulator includes a number of prototypical rolling stock, including the DB BR 145 electric locomotive, DB BR 218 diesel hydraulic locomotive and DBAG Class 294 diesel freight shunter.\r\n\r\n\r\nTHIS ADDON WILL NOT WORK ON LEGIT TRAIN SIMUALTOR 2016!!!!","torrent":{"xt":"urn:btih:1dd2e2faeb40e95b4815431eb5b29abb8d99aa25","amp;dn":"Railworks+TS2016+DTG+Hamburg+Lubeck+Route%2BDB+BR+474.3+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dd2e2faeb40e95b4815431eb5b29abb8d99aa25","infoHashBuffer":{"type":"Buffer","data":[29,210,226,250,235,64,233,91,72,21,67,30,181,178,154,187,141,153,170,37]},"announce":[],"urlList":[]}}