{"title":"An Illustrated Journey (2013) (Pdf, Epub) Gooner","uid":12046635,"size":77458290,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1de8ad6c299e368fc8be97b254b4cd6b4df1613b&amp;dn=An+Illustrated+Journey+%282013%29+%28Pdf%2C+Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1434912165,"description":"Publisher: HOW Books (February 28, 2013)\nLanguage: English\nISBN-10: 144032025X\nISBN-13: 978-1440320255\n\nTravel + Sketching = Inspiration\n\nWhen we travel, we don't want to follow the same itinerary as everyone who's come before us. We want to feel like explorers, adventurers in undiscovered territory. And that's exactly what sketching can bring to the travel experience.\n\nAn Illustrated Journey captures the world through the eyes of 40 talented artists, illustrators and designers. You'll experience the wonder of seeing familiar sights through a fresh lens but, more important, you'll be inspired to set pen to paper and capture your own vistas.\n\nThe really wonderful thing about a sketchbook is that it can be totally private. You don't have to have an ounce of talent to enjoy learning how to really see what's in front of you. But lucky for us, the sketchbooks captured here are lovely, creative, intimate windows into each artist's mind.\n\nSo, whether you're just returning to the art of drawing, abandoned by most of us after childhood, or you're looking for inspiration to take your illustration work in a new direction, An Illustrated Journey will take you on a wonderful trip of the imagination. All you need to pack are a pencil and a piece of paper.\n\nAbout the Author\n\nDanny Gregory is the author of several successful books on creativity, including An Illustrated Life, The Creative License, and Everyday Matters. He has a worldwide following of people who are inspired to develop their own creativity through illustrated journaling. He is a managing partner at a leading NY advertising agency and lives in Greenwich Village with his son and two long-haired dachshunds","torrent":{"xt":"urn:btih:1de8ad6c299e368fc8be97b254b4cd6b4df1613b","amp;dn":"An+Illustrated+Journey+%282013%29+%28Pdf%2C+Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1de8ad6c299e368fc8be97b254b4cd6b4df1613b","infoHashBuffer":{"type":"Buffer","data":[29,232,173,108,41,158,54,143,200,190,151,178,84,180,205,107,77,241,97,59]},"announce":[],"urlList":[]}}