{"title":"Smugglers V (Latest version with 1.1 Patch) (GOG)","uid":9352824,"size":73832480,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1e06b21340d1f73854c5d82ccadb33f149be1bce&amp;dn=Smugglers+V+%28Latest+version+with+1.1+Patch%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Sarah116","files":3,"time":1387172048,"description":"Hey guys, here the latest version of smuggles V with 1.1 patch. Hope you guys enjoy and please help seed. Game info and change notes below.\n\n\nSmugglers V 1.1 Patch Notes\n\n\nSmugglers 5 V. 1.1.: \n\n- New feature: For missions involving a fleet command, the player and \nenemy fleet stength depends on the current war situation between both \nopposing factions or the current battle situation, in case there is a \nbattle in the system the combat takes place. Please note that due to the \nfeature of the missions you only encounter a freighter fleet in the \n&quot;raiding&quot; and &quot;flanking&quot; missions and in the &quot;siege&quot;, &quot;battle&quot; and \n&quot;raiding&quot; missions the enemy fleet is stronger than usually. \n- New feature: When winning a fleet confrontation (mission or otherwise) \nthe game calculates and compares the losses. A decisive victory will \npositively influence a battle occuring in the same system. It has the \nsame effect like an asteroid base. Effect is stronger when the enemy \nfleet is winning the battle (to make it possible to tip the balance over). \n\n- Game change: Winning tendency on the battle screen now shows earlier \nin the battle \n\n- Balance change: Pirates will now effectively use their cloaking skill \nto escape combat. This makes the playerÂ´s &quot;mark&quot; skill now important. \n- Balance change: When the special combat event &quot;EMP storm&quot; is happening \nyou and the enemy cannot use the ability EMP strike. \n- Balance change: When attacking an enemy star base directly the \nattacking and defending fleets are calculated depending on the current \nbattle situation. With this update the random factor has been slightly \nreduced. You should notice the difference. \n- Balance change: Amount of secret data obtained by espionage (skill \n&quot;spy&quot; plus spy sensors) has been increased and now depends on ship size. \n- Balance change: Ship hospitals now heal 50% of all casualties (men and \ndroids) after a ship boarding. Remember: You do not need boarding \nshuttles for boarding as long as you have pirates in your crew. \n- Balance change: Up to now invaders won over a system when they just \nhad at least 1 point more victory points than the defender. This \nresulted in invaders winning although the campaign screen showed similar \nopposing forces. Now invaders need to have at least 25% more victory \npoints than the defenders, which always shows on the campaign map. \n\n- Bug fixed: Turning on/off music sometimes did not work. \n- Bug fixed: When being criminal flagged, you could try to land on \nasteroids (which you should never be able to, because they are just \nrocks really). \n- Bug fixed: In the LandÂ´s End system one of the exploration stories on \nHowlings Wind had no &quot;continue&quot; button \n- Bug fixed: Blind-compatibility mode - The sun of a space system could \nnot be selected as travel destination \n- Bug fixed: In systems with 10 or more planets / travel locations there \nwas no sound effect when the 10th&gt; planet is selected. \n- Bug fixed: There was a problem with selecting the 12th travel location \nin systems with 12 or more planets / travel locations. \n- Bug fixed: A bug in crew combat has been fixed where you encountered \nmore enemy crewmen during crew combat than allowed on the ship. \n- Bug fixed: Description text for spy sensors has been corrected \n- Bug fixed: Description for &quot;recharge&quot; skill corrected. \n- Bug fixed: Asteroid bases tried to &quot;flee&quot; from combat. \n- Bug fixed: Asteroid bases were described as &quot;ships&quot; on the radar screen. \n- Bug fixed: Star date differed on travel map and events by 3 years. \n- Bug fixed: During a fleet battle corvettes were wrongly described as \n&quot;destroyers&quot;. Destroyers and corvettes are not described &quot;escorts&quot; on \nthis screen. \n- Bug fixed: On the campaign screen there was an empty space in the text \ndescribing your war efforts where it did not belong. \n- Bug fixed: On the campaign screen there was an empty space in the text \ndescribing the battle status where it did not belong. \n- Bug fixed: Description for &quot;mark&quot; skill corrected. \n- Bug fixed: There was a bug where the game crashed on some rare \noccasions, when the enemy escaped from combat. \n- Bug fixed: On some occasions there was a problem with combat \ncontinuing for one turn after the enemy escaped. \n- Bug fixed: The game AI will no longer try to use gun-specific skills \nwhen handling non-gun ships like the Orca. \n- Bug fixed: When doing an abduction mission and you blow up the ship, \nthe mission was successful (and you got a failed message afterwards, but \nstill the reward). \n- Interface change: Font size for high score / buy full version button \nreduced. \n\nSmugglers 5 V. 1.0.9: \n- Included in V.1.1. \n\n &lt;a href=&quot;\nhttp://www.gog.com/game/smugglers_v&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/game/smugglers_v&lt;/a&gt;\n\n\nExplore a dynamic universe by trading, fighting, managing a crew and factories, boarding ships, and plundering planets\n\n80,000 words of new and dynamic short stories plus a non-linear campaign\n4 factions, 6 professions with 100+ different skills, 30+ spaceships ranging from fighters to battleships, cruise missiles and star bases\n\nYou can start and rule your own star empire or perform a hostile takeover of a pirate base!\n\n\nThe galaxy is at war - the Federation, the Coalition, the Outer Rim systems and the criminal Syndicate battle for control. It's a dangerous life for a pilot on the front lines, but it can also be a lucrative one - are you an honest trader, or does smuggling illegal goods sound more profitable? Will you join the war effort for your faction, set up your own empire, or simply explore the galaxy?\n\nThe fifth installment in the long-running Smugglers series features a completely revised turn-based combat system and a range of new ships to fly, as well as a host of exciting features.\n\n\n","torrent":{"xt":"urn:btih:1e06b21340d1f73854c5d82ccadb33f149be1bce","amp;dn":"Smugglers+V+%28Latest+version+with+1.1+Patch%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e06b21340d1f73854c5d82ccadb33f149be1bce","infoHashBuffer":{"type":"Buffer","data":[30,6,178,19,64,209,247,56,84,197,216,44,202,219,51,241,73,190,27,206]},"announce":[],"urlList":[]}}