{"title":"Grant R. Jeffrey - Shadow Government - How the Secret Global Eli","uid":15523404,"size":13037213,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e1364e97d1a43173942f11c23d0591e72a4a428&amp;dn=Grant+R.+Jeffrey+-+Shadow+Government+-+How+the+Secret+Global+Eli&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1470766261,"description":"https://extraimago.com/images/2016/08/09/dc0fbe6e9073df2391ff2c3b000c856b.jpg\r\n\r\nGrant R. Jeffrey - Shadow Government - How the Secret Global Elite Is Using Surveillance Against You\r\n\r\nSecurity cameras, surveillance of your financial transactions, radio frequency spy chips hidden in consumer products, tracking of your Internet searches, and eavesdropping on your e-mail and phone calls. Without your knowledge or consent, every aspect of your life is observed and recorded. But who is watching the watchers? \r\n\r\nAn ultra-secret global elite, functioning as a very real shadow government, controls technology, finance, international law, world trade, political power, and vast military capabilities. Those who hold power are invisible to all but a few insiders. These unrivaled leaders answer to no earthly authority, and they won’t stop until they control the world. \r\n\r\nIn Shadow Government, Grant Jeffrey removes the screen that, up to now, has hidden the work of these diabolical agents. Jeffrey reveals the biblical description of Satan’s global conquest and identifies the tools of technology that the Antichrist will use to rule the world. \r\n\r\nYour eyes will be opened to the real power that is working behind the scenes to destroy America and merge it into the coming global government. Armed with this knowledge, you will be equipped to face spiritual darkness with the light of prophetic truth","torrent":{"xt":"urn:btih:1e1364e97d1a43173942f11c23d0591e72a4a428","amp;dn":"Grant+R.+Jeffrey+-+Shadow+Government+-+How+the+Secret+Global+Eli","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e1364e97d1a43173942f11c23d0591e72a4a428","infoHashBuffer":{"type":"Buffer","data":[30,19,100,233,125,26,67,23,57,66,241,28,35,208,89,30,114,164,164,40]},"announce":[],"urlList":[]}}