{"title":"Fundamentals of Magento Development","uid":7509746,"size":7131157272,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e3ad3a8d7c1327fbd1c011b6cce1d77e412a386&amp;dn=Fundamentals+of+Magento+Development&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"kotfare","files":31,"time":1344279924,"description":"Fundamentals of Magento Development\n\nEssential development skills for implementing and customizing solutions on the Magento eCommerce platform\n\nDuration: 5 days Classroom / 40 hours On-Demand\n\nTarget Audience\nDevelopers who want to learn the architecture, terminology, and core functionality of Magento, along with best practices of extending the platform. This course is appropriate for both developers who are new to Magento, as well as those developers who are experienced with launching and extending the platform.\n\nPre-Requisites\nStudents must be familiar with developing in a LAMP environment and have a basic understanding of Unix-based systems. Students must have a working knowledge of HTML, CSS, XML, PHP 5.0+ and object-oriented programming techniques. Familiarity with MVC and Zend Framework is strongly recommended but not required. Students should have at least 2 years of PHP experience and understand the basic principles of database operations (e.g., foreign keys, difference between engines, query and schema optimization).\n\nCourse Description \nThis course will introduce the new Magento developer to the Magento architecture. The student will review how Magento leverages MVC, Zend Framework and Object-oriented programming. The course will take the student through the process of Magento Rendering, Request Flow, Adminhtml, Database and EAV. The course is lecture-lab format with extended hands-on exercises on Magento EE.","torrent":{"xt":"urn:btih:1e3ad3a8d7c1327fbd1c011b6cce1d77e412a386","amp;dn":"Fundamentals+of+Magento+Development","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e3ad3a8d7c1327fbd1c011b6cce1d77e412a386","infoHashBuffer":{"type":"Buffer","data":[30,58,211,168,215,193,50,127,189,28,1,27,108,206,29,119,228,18,163,134]},"announce":[],"urlList":[]}}