{"title":"Pascale Ferran - Lady Chatterley (2006) - Freakyflicks","uid":4160550,"size":3091846177,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1e43db83307b59b1262f311ee7a6852635b16b07&amp;dn=Pascale+Ferran+-+Lady+Chatterley+%282006%29+-+Freakyflicks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"clownmonkey","files":5,"time":1209351109,"description":"AKA &quot;Lady Chatterley et l&amp;#039;homme des bois&quot;\nIMdB: http://www.imdb.com/title/tt0459880/\n\nFor screenshots, please see the NEW RELEASES thread in the Freakyflicks forum.\n\nDrawing on the most scandalous summer romance in English literature, Pascale Ferran&amp;#039;s Lady Chatterley is itself a sort of vacation?a leisurely immersion in a verdant, sensuous world that&amp;#039;s largely free of the sexual pontifications intrinsic to D.H. Lawrence&amp;#039;s novel.\n\nFerran&amp;#039;s adaptation is based on the penultimate draft of Lady Chatterley&amp;#039;s Lover, known to Lawrence scholars as John Thomas and Lady Jane (after the adulterous lovers&amp;#039; pet names for each other&amp;#039;s private parts), and the narrative is considerably streamlined. Didactic subplots are eliminated; more emphasis is placed on the characters&amp;#039; actions than their words. The movie is a tale rather than a tract. Not that Lady Chatterley, which won five Cesar awards last spring and had its local premiere at the Tribeca Film Festival, is without ideas; like the novel, it prescribes a regimen of healthy vitalism in response to the wasteland carnage of World War I or the cost of industrialization.\n\nPerhaps because this is a French production, social class is less of an issue; the ecstatic carnal affair between young Constance Chatterley (a star-making role for slim, freckled Marina Hands) and her husband&amp;#039;s gamekeeper, here called Oliver Parkin (the sensitively inexpressive Jean-Louis Coulloc&amp;#039;h), is a relatively angst-free and overwhelmingly &quot;natural&quot; affair?at once open-ended and overdetermined.\n\nThe plot is a ribald anecdote that Lawrence decided to elevate to philosophical myth. Unmanned by his war injuries, Lord Clifford Chatterley (Hippolyte Girardot) is a huffy, if understandable, sulk who compensates for his disability by grimly running the family mines and thus contributing to the despoliation of the countryside. His love-starved wife, meanwhile, is inexorably drawn into the woods around the Chatterley estate, where she inevitably encounters Parkin?a robust, if no longer young, man, the sight of whose shirtless, work-hardened back, glimpsed by chance as she gathers flowers, literally knocks her dizzy.\n\nWhether it&amp;#039;s because Ferran has based her movie on Lawrence&amp;#039;s second version or because the director has her own sense of what a woman might want, Parkin is as tender and competent a lover as the Oliver Mellors of the last Lady Chatterley, but an altogether nicer, less attitudinous fellow. (There&amp;#039;s no equivalent here to Mellors&amp;#039;s talk-like-a-pirate postcoital bluster: &quot;A woman&amp;#039;s a lovely thing when er&amp;#039;s deep ter fuck . . . . Ah luv thee wi&amp;#039; ma ba&amp;#039;s and wi&amp;#039; my heart.&quot;) Coulloc&amp;#039;h, whose flattened, craggy features suggest a discarded model of Marlon Brando, projects a resigned melancholy that adds gravitas to Hands&amp;#039;s demurely determined pursuit.\n\nFerran&amp;#039;s direction encompasses both points of view. Her camera is at once objective and avid. Her unostentatious analysis is reinforced by the curiosity in Hands&amp;#039;s dark, watchful eyes, whether regarding herself in the mirror or studying her partner&amp;#039;s preparations for lovemaking. The filmmaker early on provides a brisk inventory of Connie&amp;#039;s undergarments, the better for the viewer to appreciate the practical logistics of what Lawrence calls the &quot;sex thing.&quot; But, although the movie?like the novel?is structured around a half-dozen trysts, each with its own particular lesson, it never feels schematic. Ferran lavishes her close-ups mainly on the couple&amp;#039;s hands and faces. This sensitivity is less coy than an insistence that the lady and the gamekeeper, for whom every interaction naturally leads to intercourse, are just two humans following their best, rather than basest, instincts.\n\nThe montage-based spectacle of the world joyously blossoming along with the lovers&amp;#039; libidos was the basis for two previous movies that provocatively glossed Lawrence&amp;#039;s story: Czech director Gustav Machaty&amp;#039;s famously uninhibited Ecstasy, the outrage of 1932, and, 20 years later, Douglas Sirk&amp;#039;s necessarily repressed?but more subversive?American version, All That Heaven Allows. Ferran revels in the objective correlative as a means to restore something of the novel&amp;#039;s archaic essence. Lady Chatterley&amp;#039;s Lover is, after all, a straightforward adult fairy tale about a spellbound princess who wanders into the deep woods and discovers the enchanted rustic cottage where the solitary Green Man makes his home.\n\nNearly three hours long, Lady Chatterley passes as swiftly as the summer shower that occasions the novel&amp;#039;s most celebrated scene?handled by Ferran with a cool lack of embarrassment. This is not so much a love story (and even less a story about love) than it is a movie of passionate loveliness. - J. HOBERMAN, The Village Voice\n\nMy rip.  In French with external English subtitles.\n\n--- File Information ---                                                         \nFile Size (in bytes):                           3,091,712,000                     \n                                                                                \n--- Container Information ---                                           \nBase Type (e.g &quot;AVI&quot;):                          AVI(.AVI)          \nSubtype (e.g &quot;OpenDML&quot;):                        Multipart OpenDML AVI,                   \nInterleave (in ms):                             33          \nPreload (in ms):                                504       \nAudio alignment(&quot;split across interleaves&quot;):    Aligned         \nTotal System Bitrate (kbps):                    0            \nBytes Missing (if any):                                     \nNumber of Audio Streams:                        1       \n                                                                                \n--- Video Information ---                                                   \nVideo Codec Type(e.g. &quot;DIV3&quot;):                  xvid     \nDuration (hh:mm:ss):                            02:41:18                \nFrame Count:                                    290053             \nFrame Width (pixels):                           720                  \nFrame Height (pixels):                          432                  \nFrame Aspect Ratio (e.g &quot;1.3333&quot;):                        \nFrame Aspect Ratio (e.g. &quot;4:3&quot;):                             \nPixel Aspect Ratio (&quot;SAR&quot;):                                          \nDisplay Aspect Ratio (&quot;DAR&quot;):                   1.667                     \nFrames Per Second:                              23.96                     \nVideo Bitrate (kbps):                           2229                 \nMPEG-4 (&quot;MPEG-4&quot; or &quot;&quot;):                        MPEG-4                   \nB-VOP (&quot;B-VOP&quot; or &quot;&quot;):                          B-VOP  \n                                                                                \n--- Audio Information ---   \nAudio Codec (e.g. &quot;AC3&quot;):                       0x0055(MP3, ISO) MPEG-1 Layer 3             \nAudio Sample Rate (Hz):                         48000             \nAudio Bitrate(kbps):                            106                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):            VBR         \nAudio Channel Count (e.g. &quot;2&quot; for stereo):      2           \n*********************************** FREAKYFLICKS ************************************\n\nFreakyFlicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n   &lt;a href=&quot; http://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com/&lt;/a&gt;\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;\n","torrent":{"xt":"urn:btih:1e43db83307b59b1262f311ee7a6852635b16b07","amp;dn":"Pascale+Ferran+-+Lady+Chatterley+%282006%29+-+Freakyflicks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e43db83307b59b1262f311ee7a6852635b16b07","infoHashBuffer":{"type":"Buffer","data":[30,67,219,131,48,123,89,177,38,47,49,30,231,166,133,38,53,177,107,7]},"announce":[],"urlList":[]}}