{"title":"Eastern Mediterranean Metallurgy and Metalwork in the 2nd Millen","uid":10043852,"size":29214429,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e51db82d816d5b897b218fdc50027e0063477c0&amp;dn=Eastern+Mediterranean+Metallurgy+and+Metalwork+in+the+2nd+Millen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"STBGD","files":-1,"time":1398508470,"description":"Eastern Mediterranean Metallurgy in the 2nd Millennium BC by V Kassianidou and G Papasavvas\nEnglish | 2012 | ISBN: 1842174533 | ISBN-13: 9781842174531 | 304 pages | PDF | 27,7 MB\n\nJames D. Muhly is a distinguished scholar with a special interest in ancient metallurgy who has dedicated much of his research to Cypriot archaeology. His work on the metallurgy of ancient Cyprus endorses the true importance of the island as a copper producing region, as well as a pioneer in the development and spread of metallurgy and metalwork in the wider eastern and central Mediterranean region. \n\nThis volume contains papers from &quot;Eastern Mediterranean Metallurgy and Metalwork in the Second Millennium BC&quot;, an international conference organised in Muhly's honour by the University of Cyprus. Several archaeologists and archaeometallurgists from around the world whose research focuses on the metallurgy of this period in Cyprus and surrounding regions were invited to participate in the conference to compare and contrast the material culture associated with metallurgical workshops and to discuss technological issues and their cultural and archaeological contexts. Some papers are devoted to the metallurgy and metalwork of Cyprus, presenting material from various sites and discussing the production and use of copper in the eastern Mediterranean. Others are dedicated to the Minoan and Aegean metal industry and the connections between Sardinia and Cyprus. Moving eastwards, from Anatolia through the Syro-palestinian coast and Jordan and south to Egypt, papers are presented that discuss Late Bronze Age metallurgy in Alalakh, Ugarit, Faynan, Timna and Qantir. The volume also includes papers on tin and iron.","torrent":{"xt":"urn:btih:1e51db82d816d5b897b218fdc50027e0063477c0","amp;dn":"Eastern+Mediterranean+Metallurgy+and+Metalwork+in+the+2nd+Millen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e51db82d816d5b897b218fdc50027e0063477c0","infoHashBuffer":{"type":"Buffer","data":[30,81,219,130,216,22,213,184,151,178,24,253,197,0,39,224,6,52,119,192]},"announce":[],"urlList":[]}}