{"title":"Peter May - The Lewis Trilogy (Retail)","uid":10079389,"size":4990442,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e9b69477456072f05e6f84b19faf231e6f95993&amp;dn=Peter+May+-+The+Lewis+Trilogy+%28Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"TheRose88","files":9,"time":1398972181,"description":"Peter May - The Lewis Trilogy - Retail (epub &amp; mobi)\n\n01 The Blackhouse\n02 The Lewis Man\n03 The Chessmen\n\nThe Blackhouse\nWhen a grisly murder occurs on the Isle of Lewis that has the hallmarks of a killing he's investigating on the mainland, Edinburgh detective and native islander Fin Macleod is dispatched to see if the two deaths are connected. His return after nearly two decades not only represents a police investigation, but a voyage into his own troubled past. As Finn reconnects with the places and people of his tortured childhood, he feels the island once again asserting its grip on his psyche. And every step forward in solving the murder takes him closer to a dangerous confrontation with the tragic events of the past that shaped--and nearly destroyed--Fin's life.\n\nThe Blackhouse is a thriller of rare power and vision that explores the darkest recesses of the soul.\n\nThe Lewis Man\nThe male Caucasian corpse - marked by several horrific stab wounds - is initially believed by its finders to be over two-thousand years old. Until they spot the Elvis tattoo on his right arm. The body, it transpires, is not evidence of an ancient ritual killing, but of a murder committed during the latter half of the twentieth century. Meanwhile, Fin Macleod has returned to the island of his birth. Having left his wife, his life in Edinburgh and his career in the police force, the former Detective Inspector is intent on repairing past relationships and restoring his parents derelict croft. But when DNA tests flag a familial match between the bog body and the father of Fin's childhood sweetheart, Marsaili Macdonald, Fin finds his homecoming more turbulent than expected. Tormod Macdonald, now an elderly man in the grip of dementia, had always claimed to be an only child without close family.\n\nThe Chessmen\nFin Macleod, now head of security on a privately owned Lewis estate, is charged with investigating a spate of illegal game-hunting taking place on the island. This mission reunites him with Whistler Macaskill - a local poacher, Fin's teenage intimate, and possessor of a long-buried secret. But when this reunion takes a violent, sinister turn and Fin puts together the fractured pieces of the past, he realizes that revealing the truth could destroy the future.","torrent":{"xt":"urn:btih:1e9b69477456072f05e6f84b19faf231e6f95993","amp;dn":"Peter+May+-+The+Lewis+Trilogy+%28Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e9b69477456072f05e6f84b19faf231e6f95993","infoHashBuffer":{"type":"Buffer","data":[30,155,105,71,116,86,7,47,5,230,248,75,25,250,242,49,230,249,89,147]},"announce":[],"urlList":[]}}