{"title":"Historical Dictionary of Russian and Soviet Cinema [PDF] [StormR","uid":9835929,"size":2582236,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ec888efa42af34504a84eb6d3a0e1981fb2deb7&amp;dn=Historical+Dictionary+of+Russian+and+Soviet+Cinema+%5BPDF%5D+%5BStormR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":-1,"time":1395911056,"description":"Author: Peter Rollberg \nSeries: Historical Dictionaries of Literature and the Arts (Book 30)\nHardcover: 832 pages\nPublisher: Scarecrow Press (November 7, 2008)\nLanguage: English\nISBN-10: 0810860724\nISBN-13: 978-0810860728\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n_________________________________________________________________________________\n\nFilm lovers all over the world are familiar with the masterpieces of Eisenstein and Tarkovsky. These directors' unique achievements were embedded in a powerful process that began under Russia's last tsar and underwent several periods of blossoming: the bourgeois cinema in the 1910s, the revolutionary avant-garde in the 1920s, the Thaw in the 1950s, and the awakening of national cinemas in the 1960s and 1970s.\n\nThe Historical Dictionary of Russian and Soviet Cinema is the first reference work of its kind in the English language devoted entirely to the cinema of the Russian Empire, the Soviet Union, and the post-Soviet period, including both the cinematic highlights and the mainstream. The cinemas of the former Soviet republics, including Ukraine, Belarus, Armenia, Georgia, Lithuania, and Latvia, are also represented with their most influential artists. Through a chronology, an introduction essay, a bibliography, and over 500 cross-referenced dictionary entries on filmmakers, performers, cinematographers, composers, producers, studios, genres, and outstanding films, this reference work covers the history of Russian and Soviet filmmaking from 1896 to 2007.","torrent":{"xt":"urn:btih:1ec888efa42af34504a84eb6d3a0e1981fb2deb7","amp;dn":"Historical+Dictionary+of+Russian+and+Soviet+Cinema+%5BPDF%5D+%5BStormR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ec888efa42af34504a84eb6d3a0e1981fb2deb7","infoHashBuffer":{"type":"Buffer","data":[30,200,136,239,164,42,243,69,4,168,78,182,211,160,225,152,31,178,222,183]},"announce":[],"urlList":[]}}