{"title":"Madness - 1979 - One Step Beyond","uid":10989503,"size":286654128,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1f17383fd7a0631a97056193f2a55fc7e6363193&amp;dn=Madness+-+1979+-+One+Step+Beyond&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Braueqlyn","files":10,"time":1409974261,"description":"Artist...............: Madness\nAlbum................: One Step Beyond\nGenre................: Ska\nSource...............: Cd\nYear.................: 1979\nRipper...............: Exact Audio Copy\nCodec................: Flac\nInformation..........: TntVillage\nCovers...............: Front\nTotal Size...........: 273 Mb\n\nRewiev\n\n\n\nIt's the sheer exuberance of it all that first smacks listeners straight across the head, that and the pure mayhem that careens wildly from the opening shout to the closing note. A musical roller coaster, a tear through a musical house of mirrors, along the way Madness grab streamers of ska and rocksteady and stuff them gleefully into their baggy trousers. Actually the trousers were yet to come, but One Step Beyond dragged listeners kicking and screaming into a wacky world of their own creation, where Prince Buster slams into swan-clad ballerinas and boats on the Nile, where &quot;Chipmunks are Go!&quot; and the sun never set on the &quot;Land of Hope and Glory.&quot; The Nutty Boys was an apt alternate moniker for the band, as they rocket madly through this set, all wicked grins and giggles, smug with their own cleverness and winking slyly at their own goofy musical jokes. Who could be so po-faced as to not join in? The set has lost none of its freshness, appeal or ability to surprise over the years. It still sounds like nothing else on the planet, even though it's influences were waved pennant like from the band's hands -- Buster, of course, and the sheer freneticism of early Jamaican ska and punk's raging fire. And, just as evident, English music hall, Augustus Pablo's Far Eastern sound, Brit Beat pop, the slinkier side of swing and the funnier side of classical ballet, military marches and Dad's Army, funfairs and keyboard riffs on an Oktoberfest tour of the German beerhalls, all this and more were poured straight into the mix and decanted into the Madness brew. There's nary a pause for breath, the wilding never stops, even when they slow the tempos and darken the moods. Amidst this kaleidoscope everyone has their personal faves, be it the trio of Buster tributes of &quot;One Step Beyond,&quot; &quot;The Prince&quot; and &quot;Madness,&quot; the poppier Sixties Brit flavored hat trick of &quot;In the Middle of the Night,&quot; &quot;Bed and Breakfast&quot; and &quot;Mummy's Boy,&quot; the heavy on the atmospheres of &quot;My Girl,&quot; &quot;Nightboat to Cairo&quot; and &quot;Razorblade Alley&quot; or the wacky batch of &quot;Tarzan's Nuts,&quot; &quot;Swan Lake&quot; and &quot;Chipmunks.&quot;\n\nNo matter what your cup of tea, Madness were playing mother and more than happy to pour it out with lashings of cream and sugar. One Step Beyond? More like a giant leap into a brave new world.\n\n\n\nTracklist\n\n01. One Step Beyond\n02. My Girl\n03. Night Boat To Cairo\n04. Believe Me\n05. Land Of Hope And Glory\n06. The Prince\n07. Tarzan's Nuts\n08. In The Middle Of The Night\n09. Bed &amp; Breakfast Man\n10. Razor Blade Alley\n11. Swan Lake\n12. Rockin' In A B\n13. Mummy's Boy\n14. (They Call It) Madness\n15. Chipmunks Are Go!","torrent":{"xt":"urn:btih:1f17383fd7a0631a97056193f2a55fc7e6363193","amp;dn":"Madness+-+1979+-+One+Step+Beyond","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f17383fd7a0631a97056193f2a55fc7e6363193","infoHashBuffer":{"type":"Buffer","data":[31,23,56,63,215,160,99,26,151,5,97,147,242,165,95,199,230,54,49,147]},"announce":[],"urlList":[]}}