{"title":"The Pharaoh's Kitchen: Recipes from Ancient Egypt's Enduring Foo","uid":11474538,"size":4133182,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ff7637e81bf88aaa39ebb905c07459895ea80b6&amp;dn=The+Pharaoh%27s+Kitchen%3A+Recipes+from+Ancient+Egypt%27s+Enduring+Foo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Jallentino","files":-1,"time":1416131155,"description":"Magda Mehdawy and Amr Hussein, &quot;The Pharaoh's Kitchen: Recipes from Ancient Egypt's Enduring Food Traditions&quot; \nEnglish | ISBN: 9774163109 | 2010 | 240 pages | PDF | 4 MB\n\nJudging from the evidence available from depictions of daily life on tombs and in historical texts, the ancient Egyptians were just as enthusiastic about good food and generous hospitality as are their descendants today. Magda Mehdawy and Amr Hussein have done extensive research on the cultivation, gathering, preparation, and presentation of food in ancient Egypt and have developed nearly a hundred recipes that will be perfectly recognizable to anyone familiar with modern Egyptian food. \nBeautifully illustrated with scenes from tomb reliefs, objects and artifacts in museum exhibits, and modern photographs, the recipes are accompanied by explanatory material that describes the ancient home and kitchen, cooking vessels and methods, table manners and etiquette, banquets, beverages, and ingredients. Traditional feasts and religious occasions with their own culinary traditions are described, including some that are still celebrated today. A glossary of ingredients and place names provides a useful guide to unfamiliar terms","torrent":{"xt":"urn:btih:1ff7637e81bf88aaa39ebb905c07459895ea80b6","amp;dn":"The+Pharaoh%27s+Kitchen%3A+Recipes+from+Ancient+Egypt%27s+Enduring+Foo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ff7637e81bf88aaa39ebb905c07459895ea80b6","infoHashBuffer":{"type":"Buffer","data":[31,247,99,126,129,191,136,170,163,158,187,144,92,7,69,152,149,234,128,182]},"announce":[],"urlList":[]}}