{"title":"Bobby Blue Bland ~ Dreamer","uid":3994575,"size":94292862,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:20058a657400c0539307a5728336acb0946bcf78&amp;dn=Bobby+Blue+Bland+%7E+Dreamer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":6,"uploader":"gazzjazz","files":14,"time":1201246598,"description":"This is my favorite Bobby &amp;#039;Blue&amp;#039; Bland album\nSure &quot;Two Steps From The Blues&quot; &amp; many others are brilliant....but for repeated exposure, this is the vocal, blues-soul album for me.....love it!!!\n\n\nI&amp;#039;ve included scanned cover art, disc etc, plus 256 bps mp3&amp;#039;s\n\nhere is Bobby&amp;#039;s AMG bio:\n\nBobby Bland earned his enduring blues superstar status the hard way: without a guitar, harmonica, or any other instrument to fall back upon. All Bland had to offer was his magnificent voice, a tremendously powerful instrument in his early heyday, injected with charisma and melisma to spare. Just ask his legion of female fans, who deemed him a sex symbol late into his career.\n\nFor all his promise, Bland&amp;#039;s musical career ignited slowly. He was a founding member of the Beale Streeters, the fabled Memphis aggregation that also included B.B. King and Johnny Ace. Singles for Chess in 1951 (produced by Sam Phillips) and Modern the next year bombed, but that didn&amp;#039;t stop local DJ David Mattis from cutting Bland on a couple of 1952 singles for his fledgling Duke logo.\n\nBland&amp;#039;s tormented crying style was still pretty rough around the edges before he entered the Army in late 1952. But his progress upon his 1955 return was remarkable; with saxist Bill Harvey&amp;#039;s band (featuring guitarist Roy Gaines and trumpeter Joe Scott) providing sizzling support, Bland&amp;#039;s assured vocal on the swaggering &quot;It&amp;#039;s My Life Baby&quot; sounds like the work of a new man. By now, Duke was headed by hard-boiled Houston entrepreneur Don Robey, who provided top-flight bands for his artists. Scott soon became Bland&amp;#039;s mentor, patiently teaching him the intricacies of phrasing when singing sophisticated fare (by 1962, Bland was credibly crooning &quot;Blue Moon,&quot; a long way from Beale Street).\n\nMost of Bland&amp;#039;s savage Texas blues sides during the mid- to late &amp;#039;50s featured the slashing guitar of Clarence Hollimon, notably &quot;I Smell Trouble,&quot; &quot;I Don&amp;#039;t Believe,&quot; &quot;Don&amp;#039;t Want No Woman,&quot; &quot;You Got Me (Where You Want Me),&quot; and the torrid &quot;Loan a Helping Hand&quot; and &quot;Teach Me (How to Love You).&quot; But the insistent guitar riffs guiding Bland&amp;#039;s first national hit, 1957&amp;#039;s driving &quot;Farther Up the Road,&quot; were contributed by Pat Hare, another vicious picker who would eventually die in prison after murdering his girlfriend and a cop. Later, Wayne Bennett took over on guitar, his elegant fretwork prominent on Bland&amp;#039;s Duke waxings throughout much of the &amp;#039;60s.\n\nThe gospel underpinnings inherent to Bland&amp;#039;s powerhouse delivery were never more apparent than on the 1958 outing &quot;Little Boy Blue,&quot; a vocal tour de force that wrings every ounce of emotion out of the grinding ballad. Scott steered his charge into smoother material as the decade turned: the seminal mixtures of blues, R&amp;B, and primordial soul on &quot;I Pity the Fool,&quot; the Brook Benton-penned &quot;I&amp;#039;ll Take Care of You,&quot; and &quot;Two Steps From the Blues&quot; were tremendously influential to a legion of up-and-coming Southern soulsters.\n\nScott&amp;#039;s blazing brass arrangements upped the excitement ante on Bland&amp;#039;s frantic rockers &quot;Turn on Your Love Light&quot; in 1961 and &quot;Yield Not to Temptation&quot; the next year. But the vocalist was learning his lessons so well that he sounded just as conversant on soulful R&amp;B rhumbas (1963&amp;#039;s &quot;Call on Me&quot;) and polished ballads (&quot;That&amp;#039;s the Way Love Is,&quot; &quot;Share Your Love With Me&quot;) as with an after-hours blues revival of T-Bone Walker&amp;#039;s &quot;Stormy Monday Blues&quot; that proved a most unlikely pop hit for him in 1962. With &quot;Ain&amp;#039;t Nothing You Can Do,&quot; &quot;Ain&amp;#039;t Doing Too Bad,&quot; and &quot;Poverty,&quot; Bland rolled through the mid-&amp;#039;60s, his superstar status diminishing not a whit.\n\nIn 1973, Robey sold his labels to ABC Records, and Bland was part of the deal. Without Scott and his familiar surroundings to lean on, Bland&amp;#039;s releases grew less consistent artistically, though His California Album in 1973 and Dreamer the next year boasted some nice moments (there was even an album&amp;#039;s worth of country standards). The singer re-teamed with his old pal B.B. King for a couple of mid-&amp;#039;70s albums that broke no new ground but further heightened Bland&amp;#039;s profile, while his solo work for MCA teetered closer and closer to MOR (Bland has often expressed his admiration for ultra-mellow pop singer Perry Como).\n\nSince the mid-&amp;#039;80s, Bland has recorded for Jackson, MS&amp;#039;s Malaco Records. His pipes undeniably reflect the ravages of time, and those phlegm-flecked &quot;snorts&quot; he habitually emits become annoying in large doses. But Bobby &quot;Blue&quot; Bland endures as a blues superstar of the loftiest order, resurfacing in 1998 with Memphis Monday Morning.\n\nenjoy &amp; please support me in seeding Pirates\nmany thanks \nGazzJazz","torrent":{"xt":"urn:btih:20058a657400c0539307a5728336acb0946bcf78","amp;dn":"Bobby+Blue+Bland+%7E+Dreamer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20058a657400c0539307a5728336acb0946bcf78","infoHashBuffer":{"type":"Buffer","data":[32,5,138,101,116,0,192,83,147,7,165,114,131,54,172,176,148,107,207,120]},"announce":[],"urlList":[]}}