{"title":"Prison Architect - Alpha 17 - PC","uid":9549085,"size":109175773,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:206a16e916897fea2427452b36045da1a4a1d0ec&amp;dn=Prison+Architect+-+Alpha+17+-+PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"sharpshot94549","files":-1,"time":1391197902,"description":"Prison Architect Alpha 17\n\nBuild and Manage A Maximum Security Prison. Prison Architect is the world's latest Prison Management Sim. Starting with an empty plot of land you must construct a holding cell with basic water and electricity to house your first batch of prisoners, to buy you enough time to create a proper cell block.\n\n\nPrison Architect Alpha 17 changelog follows\n\n= Armed guards\nYou can now hire armed guards to patrol your prison, intimidate your inmates, and put down trouble\nYou must research the Armoury first, and your armoury requires a weapons rack and one locker per armed guard on site\nArmed guards have a strong &quot;Suppression&quot; effect on all prisoners near them, making the prisoners less likely to misbehave\nThey can be instructed to follow a patrol from the Deployment screen\nThey will only use lethal force if you give them permission - by clicking the &quot;Weapons Free&quot; emergency button\nThey will always shout a warning first, unless a Prisoner is attacking a member of staff (guard, armed guard, administrator etc)\nThey will also shoot on site any prisoner who is about to escape, without shouting a warning, so long as they have &quot;Weapons Free&quot;\nNote: Armed guards who genuinely fear for their lives may still shoot, even if you have not given them permission via &quot;Weapons Free&quot;\nNote: The Armoury must be very secure. Your most dangerous prisoners will attempt to raid it during a riot or mass escape event\n= New Forestry zone\nAutomates the process of growing trees for the purposes of felling them and using the wood\nSaplings will be planted automatically by Gardeners\nFully grown trees will be felled, and the logs taken to Storage or your Workshop if you have one\nTrees now take much longer to grow to full size : 5 game-days on average\nTrees no longer scale up as they grow. Instead there are three discreet sizes : Sapling, Young, and Old.\nYou can no longer remove tree stumps. These will vanish over time after a tree has been felled.\nNote: The forestry will spend your money by ordering tree saplings automatically. Be sure you have enough\n= Objects toolbar filtering\nThe objects list was becoming too long to manage, and no longer fitted on a single screen\nA new filtering method hides any &quot;room specific&quot; objects unless you are looking at that type of room. Eg the Cooker, Fridge and Sink will only appear in the list if you are looking at a Kitchen\nNote: You can press the + button to show the full objects list at any time\n= Modding continued\nmaterials.txt is now additively loaded\nThe mod loading screen now looks better and displays the mod name, author, screenshot and description during load\nAdded a &quot;Find more mods (Steam Workshop)&quot; button that opens the steam workshop\nRenamed &quot;Steam Workshop&quot; to &quot;Prison Sharing&quot;, and made it list prisons only (not mods)\nMade Prison Sharing sort prisons by subscribed time (newest subscribed prisons at the top of the list)\nFixed manifest.txt files from being corrupted due to newline breaks in Steam file description. May require people to redownload the mod.\n= Assorted changes and fixes\nYou will now be asked &quot;Are you sure&quot; when purchasing neighbour plots of land (to prevent expensive mis-clicks)\nThe Main Menu screens now scale correctly to high resolution / high DPI screens (eg Retina Mac at 2560x1600)\nGuards now target the nearest misbehaving prisoner during fights, rather than choosing one randomly from those in range\nWhen prisoners urinate or soil their suits (Bowel/Bladder need maxed out) there is now a corresponding particle effect\nFixed : Selling finished license plates or wood manually generated only half the correct sale price\nFixed : Subscribing and unsubscribing to your own mod in Steam Workshop will no longer delete your mod from your hard drive\nFixed : The scrollbar in the Staff and Prisoner list screens now works correctly\nFixed : Prisoners can no longer tunnel under lakes\nFixed : The contraband window sometimes massively overestimated the supply of contraband\nFixed some subtle bugs in the Misconduct System, whereby misconduct attributed to prisoners who had long since left was still recorded\nFixed : Sectorisation of the world could fail if you had a lake covering the top right of the map (All sectors marked as NO ACCESS)","torrent":{"xt":"urn:btih:206a16e916897fea2427452b36045da1a4a1d0ec","amp;dn":"Prison+Architect+-+Alpha+17+-+PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"206a16e916897fea2427452b36045da1a4a1d0ec","infoHashBuffer":{"type":"Buffer","data":[32,106,22,233,22,137,127,234,36,39,69,43,54,4,93,161,164,161,208,236]},"announce":[],"urlList":[]}}