{"title":"Crea v1.0.1","uid":14888700,"size":138952596,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:20de568a657dd2ca9cea17ecda92aa6a1fda0602&amp;dn=Crea+v1.0.1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"dauphong","files":1,"time":1465753355,"description":"\nAbout This Game\r\nEmbark on an adventure with what little you have and discover what the world of Crea has to offer. Through each action, improve your talents and master many skills. Through each victory, grow in strength and shape yourself. Through each inquiry, unlock new items to craft and build. Through each expedition, explore new realms and uncover Crea’s lore.\r\n\r\n\r\n    Level up by defeating enemies\r\n    Learn over 80 skills through the talent system\r\n    Loot and craft powerful gear with unique attributes\r\n    Discover the world’s expansive mythos and history\r\n\r\n\r\n\r\n    Defeat challenging original monsters each with their own attacks\r\n    Survive by timing shield blocks and dodge rolling\r\n    Vanquish by your weapon of choice: Sword, Spear, Bow, or Magic\r\n    Challenge massive bosses and prepare to die\r\n\r\n\r\n\r\n    Research materials to discover their crafting capabilities\r\n    Find old recipe scrolls scattered throughout the world\r\n    Upgrade equipment to carry over their stats\r\n    Use chaos crafting (minigame) to create even more powerful items\r\n\r\n\r\n\r\n    Explore massive procedurally generated worlds\r\n    Quickly teleport through the use of Way Crystals, Way Shards and Rifts\r\n    Delve into dungeons that not only look different but play different every time\r\n    Travel to completely new Realms beyond the bounds of the main world\r\n\r\n\r\n\r\n    Built from the ground up with modding in mind\r\n    All gameplay logic and content exposed in Python\r\n    Easily create new content or entirely new gameplay systems\r\n    Learn from extensive modding tutorials and API documentation\r\n\r\n\r\n\r\n    Join in on the Development Streams\r\n    Track progress and what’s planned on the Roadmap\r\n    Get the latest development news on Twitter","torrent":{"xt":"urn:btih:20de568a657dd2ca9cea17ecda92aa6a1fda0602","amp;dn":"Crea+v1.0.1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20de568a657dd2ca9cea17ecda92aa6a1fda0602","infoHashBuffer":{"type":"Buffer","data":[32,222,86,138,101,125,210,202,156,234,23,236,218,146,170,106,31,218,6,2]},"announce":[],"urlList":[]}}