{"title":"Transformers 2 La Venganza De Los Caidos DVDRip Spanish 2009","uid":5148642,"size":1462580749,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:21707927c4efd44706011eb51031c37fc8e3f743&amp;dn=Transformers+2+La+Venganza+De+Los+Caidos+DVDRip+Spanish+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"Mois20","files":6,"time":1257380001,"description":"Han pasado dos aÃƒÂ±os desde que el joven Sam Witwicky (Shia LaBeouf) salvara al universo de una decisiva batalla entre dos razas de alienÃƒÂ­genas robÃƒÂ³ticos en guerra. Pese a su extrema heroicidad, Sam sigue siendo un adolescente normal con las preocupaciones cotidianas de prepararse para ir a la universidad, dejando atrÃƒÂ¡s a su novia Mikaela (Megan Fox), y separÃƒÂ¡ndose por primera vez de sus padres. Por supuesto, ademÃƒÂ¡s estÃƒÂ¡ la carga adicional de tener que intentar explicar su partida a su amigo mÃƒÂ¡s reciente y robot guardiÃƒÂ¡n suyo, Bumblebee. El objetivo de Sam es llevar una vida universitaria normal, pero para hacerlo, deberÃƒÂ¡ olvidar su destino. Mientras Sam ha hecho todo lo posible por dejar atrÃƒÂ¡s el conflicto de Mission City y volver a su rutina diaria, la batalla entre los Autobots y los Decepticons, aunque haya sido un incidente sÃƒÂºper secreto, ha provocado muchos cambios. El Sector 7 ha sido desmantelado y su soldado mÃƒÂ¡s leal, el agente Simmons (John Turturro), despedido sumariamente. En su lugar se ha creado una nueva agencia, NEST. Empleando mandos con experiencia de campo como Lennox (Josh Duhamel) y Epps (Tyrese Gibson), NEST pretende trabajar codo con codo con los Autobots para evitar otra confrontaciÃƒÂ³n mortal con los Decepticons. Por desgracia, un asesor de seguridad del gobierno, Theodore Galloway (John Benjamin Hickey) tiene muy poca previsiÃƒÂ³n como para comprender totalmente los inexorables peligros que acechan. Dispuesto a hacerse con el control de todas las organizaciones de defensa, junto con su potencial de poder, y al mismo tiempo deshacerse de lo que ÃƒÂ©l considera un frÃƒÂ­volo gabinete gubernamental, Galloway se esfuerza por acabar con NEST, creyendo que toda amenaza de guerra ha desparecido hace tiempo.","torrent":{"xt":"urn:btih:21707927c4efd44706011eb51031c37fc8e3f743","amp;dn":"Transformers+2+La+Venganza+De+Los+Caidos+DVDRip+Spanish+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21707927c4efd44706011eb51031c37fc8e3f743","infoHashBuffer":{"type":"Buffer","data":[33,112,121,39,196,239,212,71,6,1,30,181,16,49,195,127,200,227,247,67]},"announce":[],"urlList":[]}}