{"title":"VeryPDF Document Converter docPrint Pro v5.0 with Key [TorDigger","uid":8342674,"size":16599365,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:21763cc946531b29bd89db0d68d341f96d83d187&amp;dn=VeryPDF+Document+Converter+docPrint+Pro+v5.0+with+Key+%5BTorDigger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"TorDigger","files":9,"time":1365125238,"description":"Document Converter docPrint Pro\n\nThe professional version of Document Printer is named Document Converter that provides two more methods of converting documents than Document Printer. Document Converter has all the functions of Document Printer including the two virtual printers.\n\nKey Features\n\nVirtual printers\nDocument Converter has all the functions that are developed in Document Printer. It has the two virtual printers, docPrint and docPrint PDF Driver. With the two virtual printers, you can convert a printable document to more than fifty formats. Visit Document Printer's page to get more information about the functions.\n\nGraphical User Interface\nDocument Converter provides a graphical user interface (GUI) for converting documents of commonly used formats into popular formats. With the GUI, you can set the conversion options and implement batch conversion operations.\n\nCommand line operations\nAs the professional version of Document Printer, Document Converter has a command line supported executable in the installation directory. With the command line operation, you can get more flexible operation options and use the application in situation, for example, within batch script.\n\nFeatures of Document Converter\n\nDocument Converter has more functions beyond those of Document Printer, a graphical and a command line interface:\n\nGraphical User Interface features:\nConvert Microsoft Word, Excel, PowerPoint, Visio, RTF, TXT, PDF, PS and EPS to PNG, PCX, BMP, JPG, TIFF, EPS, PS and PDF in batches by a GUI.\nDrag and drop to add source files.\nOption to view created files after conversion.\nVarious color depths, 1, 8 and 24 bits, for image conversion.\nCustomize image resolution in DPI for image conversion.\nOption to combine multiple PDF files to one single one for PDF conversion.\nNo need for third-party PDF creator or reader software.\nOption to customize directory for saving converted files.\nOption to edit PDF description, title, subject, author and keywords, for PDF conversion.\nOption to protect PDF with 48 or 128-bit encryption.\nMonitor and process files in specified directories in unattended mode.\n\nCommand line features: \nTo know how to use the CMD version, please click here:\nConvert documents of DOC, DOCX, PPT, PPTX, XLS, XLSX, VSD, PDF, HTML, RTF, TXT, etc. to PDF, PS, EPS, JPEG, TIFF, PCX, PNG, GIF, TGA, BMP, DCX, WMF, EMF, XPS, PCL, TXT, and so on by a command line tool.\nBatch conversion with batch script or wildcard characters.\nOption to edit PDF property like title, subject, author and keywords, for converting to PDF.\nOption to protect created PDF with 48 or 128-bit encryption.\nNo need for third-party PDF maker or viewer software.\nOption to redirect print job to another printer.\nOption to specify a printer for printing.\nOption to set page header and footer in conversion from HTML to PDF.\nOption to set page margins in conversion from HTML to PDF.\nOption to merge multiple PDF to one.\nOption to convert specified pages.\nSupport 1, 8 and 24-bit color depths.\nVarious compression methods for converting to TIFF.\nOption to convert documents to fax compatible TIFF.\nOption to rotate page in conversion.\nOption to change paper orientation.\nOption to set image resolution for image conversion.\nOption to specify page width and height in a unit of pixel for converting to image.\nOption to fit pages to standard paper sizes.\nProvide special options for processing Microsoft Excel sheets.\nOption to delay printing to waiting for rendering HTML webpages.\n\nSystem Requirements:\n\nWindows 2000 / XP / Server 2003 / Vista / Server 2008 / 7 of both 32-bit and 64-bit\n\nHomepage: http://www.verypdf.com/app/document-converter/document-converter.html\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:21763cc946531b29bd89db0d68d341f96d83d187","amp;dn":"VeryPDF+Document+Converter+docPrint+Pro+v5.0+with+Key+%5BTorDigger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21763cc946531b29bd89db0d68d341f96d83d187","infoHashBuffer":{"type":"Buffer","data":[33,118,60,201,70,83,27,41,189,137,219,13,104,211,65,249,109,131,209,135]},"announce":[],"urlList":[]}}