{"title":"Trainsignal - VMware View 5 Essentials Training","uid":7898827,"size":3446617740,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2185164471703f215dd846d39a70d36c8af2a476&amp;dn=Trainsignal+-+VMware+View+5+Essentials+Training&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"NepsterJay","files":511,"time":1354909768,"description":"This course teaches a virtualization starter how to use VMware View 5.0 to set up a virtual desktop infrastructure (VDI). Virtualization experts Brian Knudtson and Lane Leverett guide you from VDI basics, through app virtualization and more. Learn how to get your View environment up and running and reduce costs for your end-user desktops.\nBy Brian Knudtson\nvExpert, Quadruple VCP, VCA-DT, VCP-DT, VCAP-DCA, VCAP-DCD\n\nMy Fellow Administrator,\n\nHave you been tasked with investigating or implementing a VMware View environment? Not quite sure the best way to get it up and running? If so, then I have a great resource for you. I?ve collaborated with Lane Leverett, a VCDX and fellow View expert, to develop the new VMware View 5 Essentials training course.\n\nThis course was designed to walk you through:\n* The concepts of a Virtual Desktop Infrastructure (VDI)\n* The components of VMware View\n* How to install and configure VMware View\n* How to manage desktop pools, user data, printing and applications within VMware View\n* Some basic troubleshooting tips\n\nFor those of you who may already be familiar with View 4.5 (or have seen my previous View 4 course), we will cover the upgrade process from View 4.5 to View 5.0 along with new features like Persona Management and the new PCoIP optimization settings. I hope you?ll check it out and find it useful.","torrent":{"xt":"urn:btih:2185164471703f215dd846d39a70d36c8af2a476","amp;dn":"Trainsignal+-+VMware+View+5+Essentials+Training","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2185164471703f215dd846d39a70d36c8af2a476","infoHashBuffer":{"type":"Buffer","data":[33,133,22,68,113,112,63,33,93,216,70,211,154,112,211,108,138,242,164,118]},"announce":[],"urlList":[]}}