{"title":"DJSoft RadioBOSS Advanced v5.4.7.0","uid":14764028,"size":30488378,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:21871e6527effc40d68c62eb3833be4ef4e0ffa5&amp;dn=DJSoft+RadioBOSS+Advanced+v5.4.7.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ZarkBit","files":1,"time":1464872772,"description":"DJSoft RadioBOSS Advanced v5.4.7.0\r\n\r\nNew features in RadioBOSS\r\nAdded 20kbps streaming bitrate\r\nEnable/Disable right-click menu command for scheduled events\r\nEmail notifications improved\r\nImproved the update checking feature\r\n&quot;download&quot; command now able to download from FTP\r\nProtection from multiple start of jingles (1-9 buttons)\r\nFixed playback queue with embedded playlists\r\nFixed incorrect event startup when playlist was stopped\r\nFixed: freeze check triggered sometimes when virtual sound card was added\r\nImproved the Edit command (playlist right-click menu)\r\nImproved playlist track titles for various special items (embedded playlists, timed pauses etc)\r\nFixed prelisten for jingles\r\nFixed &quot;Import categories&quot; bug in Playlist Generator\r\nBroadcasting encoders: reconnect query on settings change\r\nFixed possible bug in the &quot;Resume playback&quot; feature\r\nFixed: mouse wheel didn't work on some systems\r\nFixed Track Tool sometimes did not update playlist entry\r\nFixed &quot;Do not action event when playlist is stopped&quot; sometimes didn't work properly\r\nOther minor fixes and improvements\r\n\r\nTraditional professional radio programming applications are designed for traditional radio stations that can and expect to pay thousands of dollars for extremely sophisticated and complex software. But what if that's not you?\r\n\r\nIf you need a simple, affordable, reliable solution to automating your broadcasting needs, RadioBOSS radio automation software is the solution you've been looking for.\r\n\r\nWhether it's building and scheduling crossfaded programming for your terrestrial or Internet radio station, creating the right audio atmosphere in your restaurant or store, or broadcasting from live events, RadioBOSS has been the choice of thousands of broadcasters just like you for the past eleven years.\r\n\r\nRadioBOSS makes it easy and fast to convert and manage audio assets, build playlists with advertising support, hourly blocks, rotations, crossfading, automatic leveling and other professional-level features and play your playlists to your local, terrestrial or Internet broadcasting system.\r\n\r\nBenefits:\r\nProduce professional, sophisticated audio programming for a fraction of the cost of other radio programming applications. Robust support for Internet broadcasters. Built-in support for Internet streaming (Shoutcast v1, v2, Icecast, Windows Media Services), automatically sending metadata (upload to FTP, HTTP request, text or XML file) and using streamed Internet audio in playlists.\r\nWork the way you want. RadioBOSS lets you grab, use and work with your preferred audio formats, Winamp and VST plugins, multichannel cards (4.0, 5.1, 7.1 etc), individualized RadioBOSS profiles.\r\nCreate sophisticated professional playlists with crossfade support, automatic volume leveling, timed announcements, block rotations, advertising volume enhancement and more.\r\nRadioBOSS's eleven years of continuous improvement and enhancement means you can trust RadioBOSS to play unattended for days, weeks and months.\r\n     \nhttps://www.djsoft.net/enu/description_radioboss.htm","torrent":{"xt":"urn:btih:21871e6527effc40d68c62eb3833be4ef4e0ffa5","amp;dn":"DJSoft+RadioBOSS+Advanced+v5.4.7.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21871e6527effc40d68c62eb3833be4ef4e0ffa5","infoHashBuffer":{"type":"Buffer","data":[33,135,30,101,39,239,252,64,214,140,98,235,56,51,190,78,244,224,255,165]},"announce":[],"urlList":[]}}