{"title":"My Wife And Kids Season 02 [.x264] DVD Rip","uid":7783663,"size":5035561394,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:21e2694d84e346d78ef4b5c541d8b63556dc99e8&amp;dn=My+Wife+And+Kids+Season+02+%5B.x264%5D+DVD+Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"rambam1776","files":-1,"time":1351838390,"description":"Format                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 165 MiB\nDuration                                 : 21mn 37s\nNominal bit rate                         : 900 Kbps\nWidth                                    : 720 pixels\nHeight                                   : 478 pixels\nDisplay aspect ratio                     : 16:9\nFrame rate                               : 23.976 fps\nBits/(Pixel*Frame)                       : 0.109\nWriting library                          : x264 core 120\n\nMy Wife and Kids is an American television family sitcom that ran on ABC from March 28, 2001 until May 17, 2005. Produced by Touchstone Television (now ABC Studios), it starred Damon Wayans and Tisha Campbell-Martin, and centers on the character of Michael Kyle, a loving husband and modern-day patriarch who rules his household with a unique and distinct parenting style. As he teaches his three children some of life's lessons, he does so with his own brand of humor. Wayans and veteran television writer/producer Don Reo co-created and executive produced the series.\n\nAs of this posting, only seasons 1 and 2 have been released on DVD\n\nThe series revolves around the experiences of a man named Michael Kyle and his family who live in Stamford, Connecticut. After impregnating his wife Jay as a teenager, Michael has grown paranoid of his children eventually spoiling their own virginity, but aside from these concerns he possesses a number of odd, often irritating eccentricities that he virtually never avoids concealing regardless of the severity of the situation. Among his children are Michael Kyle, Jr. (nicknamed &quot;Junior&quot;), Michael's dimwitted eldest son; Claire, his vain, conceited teenage daughter; and Kady, his loveably endearing youngest daughter. Later on in the series, Michael's nightmares come true when Junior impregnates his girlfriend Vanessa, resulting in the addition of a son for Junior in the cast of characters in the series.","torrent":{"xt":"urn:btih:21e2694d84e346d78ef4b5c541d8b63556dc99e8","amp;dn":"My+Wife+And+Kids+Season+02+%5B.x264%5D+DVD+Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21e2694d84e346d78ef4b5c541d8b63556dc99e8","infoHashBuffer":{"type":"Buffer","data":[33,226,105,77,132,227,70,215,142,244,181,197,65,216,182,53,86,220,153,232]},"announce":[],"urlList":[]}}