{"title":"Jeffery Deaver ~ [Lincoln Rhyme 02] - The Coffin Dancer *** Thre","uid":15291627,"size":371821432,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:22d2aff51bbace1fa09f7c97586506465549d602&amp;dn=Jeffery+Deaver+%7E+%5BLincoln+Rhyme+02%5D+-+The+Coffin+Dancer+%2A%2A%2A+Thre&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":null,"files":15,"time":1468426026,"description":"General Information\r\nBook............................The Coffin Dancer\r\nSeries Name................Lincoln Rhyme\r\nSeries No.....................02\r\nAuthor.........................Jeffery Deaver\r\nNarrator.......................Alexander Adams\r\nUnabridged..................Yes\r\nGenre..........................Psychology Crime Mystery Thriller\r\nPublisher......................Books On Tape\r\n\r\nFile Information\r\nSource.........................11 CDs\r\n# of MP3 files...............11\r\nTotal Runtime..............12 Hours 52 Minutes\r\nEncoder.......................Lame 3.97\r\nConverted to................64 Kb | CBR | 44,100 Hz | Mono\r\nTotal Size.....................354 MB\r\nConverted By...............OldScotsman\r\nDate Converted............03-May-2009\r\nID3 Tags......................Includes Image and all info shown on this page (Smart Phone Ready)\r\n\r\nABOUT THE BOOK\r\nThis return engagement for quadriplegic criminologist Lincoln Rhyme is strong on forensic details as Rhyme tracks an elusive assassin known only by the tattoo that gives this fast-paced thriller its title.\r\nThree witnesses to a murder could put a millionaire arms dealer behind bars for good. When one of them, the co-owner of Hudson Air, is blown up in a plane bombing with the Dancer's fingerprints all over it, the FBI takes the other witnesses into protective custody. Only Rhyme can decipher a crime scene, read the residue of a bombing, or identify a handful of dirt well enough to keep up with the killer. Helped by Amelia Sachs, his brilliant and able-bodied assistant, Rhyme traces the Dancer through Manhattan streets, airports, and subways. The psychological tension builds rapidly from page one all the way to the stunning and unexpected denouement. At the same time, Jeffery Deaver slowly develops the against-all-odds love affair between Rhyme and Sachs.\r\n\r\nimage\r\nABOUT THE AUTHOR\r\nJeffery Deaver was born outside of Chicago in 1950. His father was an advertising copywriter and his mother was a homemaker. Deaver worked as a magazine writer, then, to gain the background needed to become a legal correspondent for The New York Times or Wall Street Journal, he enrolled at Fordham Law School. In 1990 he started to write full time. Deaver has been nominated for six Edgar Awards from the Mystery Writers of America, an Anthony award, a Gumshoe Award, and is a three-time recipient of the Ellery Queen Reader's Award for Best Short Story of the Year. In 2001, he won the W.H. Smith Thumping Good Read Award for his Lincoln Rhyme novel The Empty Chair. In 2004, he was awarded the Crime Writers Association of Great Britain's Ian Fleming Steel Dagger Award for Garden Of Beasts and the Short Story Dagger for &quot;The Weekender.&quot;\r\n\r\nimage\r\nABOUT THE READER\r\nAlexander Adams is a pseudonym for talented narrator Grover Gardner. Working alone in the small basement studio of his home in Maryland, he delivers stories in a voice of sandpaper and velvet. His most high-profile book to date, a career breakthrough, is the special-effects-spiced, unabridged novelization of STAR WARS: THE PHANTOM MENACE, recently recorded in a joint effort by BOT and Random House under the Adams moniker. [/font]\r\n\r\n\r\nAll the above information including the picture are inserted into the ID3 tags on the MP3 files.\r\n\r\nRemember, we have uploaded these books just for you because we wish to SHARE them. It is only right therefore, you SHARE them with others, and the only way you can do this, is to keep SEEDING. In other words, don't stop after you have finished the download. Check and make sure your torrent program is set to continue uploading even after the downloading has been completed. A ratio of 2.0 means you are giving back twice what you have received, the book won't die and all our efforts have not been wasted but 5.0 would be outstanding and shows you have really entered into the spirit of what we are about. WE DO OUR BIT AND YOU DO YOUR BIT, sounds fair, doesn't it. If you are new to this and don't understand, type a message at the bottom and if I can't help, I know someone who can. biggrin\r\n\r\nimage This Audiobook was converted and uploaded by OldScotsmanimage","torrent":{"xt":"urn:btih:22d2aff51bbace1fa09f7c97586506465549d602","amp;dn":"Jeffery+Deaver+%7E+%5BLincoln+Rhyme+02%5D+-+The+Coffin+Dancer+%2A%2A%2A+Thre","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22d2aff51bbace1fa09f7c97586506465549d602","infoHashBuffer":{"type":"Buffer","data":[34,210,175,245,27,186,206,31,160,159,124,151,88,101,6,70,85,73,214,2]},"announce":[],"urlList":[]}}