{"title":"Peter Ackroyd -  London: The Biography  (epub)","uid":6775867,"size":39329968,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22eb3b45566e0e531ae2d612b0b5ebb016438591&amp;dn=Peter+Ackroyd+-++London%3A+The+Biography++%28epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"neil1966hardy","files":6,"time":1319726929,"description":"Peter Ackroyd - 3 non-fiction books\n\n\nLondon: The Biography (2000)\nMuch of Peter Ackroyd's work has been concerned with the life and past of London but here, as a culmination, is his definitive account of the city. For him it is an organism with its own laws of growth and change, so he regards this as a &quot;biography&quot; rather than a history.\n\nAlbion: The Origins of the English Imagination (2002)\n\nNobody is better equipped to write a book about the roots of the English imagination than the award-winning novelist, biographer, poet and critic Peter Ackroyd, and in Albion he has distilled a lifetime's work into a book of monumental proportions. This is a dense, poetic book about the origins of the English literary imagination, stretching from Beowulf through Shakespeare to the novels of Virginia Woolf and the music of Vaughan Williams.\n\nAckroyd confesses that &quot;there is no certain description&quot; of the English imagination. As a result the structure of this massive, learned book shares affinities with his recent bestselling biography of London. Specific themes and preoccupations are repeatedly weaved through short, sometimes allusive chapters as Ackroyd traces &quot;the conflation of biography, or history, and the novel&quot; across the evolution of &quot;a mixed language comprised of many different elements and a mixed culture comprised of many different races&quot;. The result is a rich poetic tapestry that moves from an exploration of the cadences of Old English poetry to the creation of the modern English language in the work of Chaucer, Shakespeare, Milton, Defoe and the great novelists of the 18th century. Ackroyd resists polemical definitions, but repeatedly returns to themes that for him create a quintessentially English imagination. These include a fascination with &quot;the local and the circumstantial&quot;, &quot;the English genius for assimilation and adaptation&quot;, and the recurrent interest in biography and landscape.\n\nAckroyd is at his best when establishing poetic connections and continuities between modern and medieval writers, but at times his reflections on the national spirit uncomfortably evoke the conservative nationalist historians of the 19th century. His inclusive vision of what he sees as the English imagination's &quot;placism, as an antidote to racism&quot; is unconvincing, as are his comments on his awkward formulation &quot;femality and fiction&quot;. It would have been fascinating to see him develop these ideas through late 20th century transformations in the English imagination, but even without this (and at over 500 pages, the book is weighty enough already), Albion will delight many who regard Ackroyd as one of the most quintessentially English writers of his time.\n\nThe Thames (2007)\nThe Thames displays the same qualities as London: The Biography: scholarship, wit, discursiveness, lovely descriptive writing, anecdotes, spirit of place and character. It is hugely enjoyable and sure to be another mammoth bestseller.\n\nThe Thames is about the river from source to sea, from prehistoric times to the present, its flora and fauna, the paintings and photographs inspired by the Thames, its geology, smells and colours, its literature, laws, magic and myths, its architecture, trade and weather.\n\nThe reader learns about the fishes that swim in the river and the boats that ply on its surface, about floods and tides, hauntings and suicides, miasmas and sewers, locks, weirs and embankments.\n\nHere is Shelley floating on the river under poetical beech trees, Hogarth getting roaring drunk on a boat trip to Gravesend, William Morris wondering whether the same Thames water flowed past his windows in Hammersmith as flowed past his house at Kelmscott, 100 miles upriver.\n\nPeter Ackroyd has a genius for digging out the most surprising and entertaining details, and for writing about them in the most magisterial prose.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:22eb3b45566e0e531ae2d612b0b5ebb016438591","amp;dn":"Peter+Ackroyd+-++London%3A+The+Biography++%28epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22eb3b45566e0e531ae2d612b0b5ebb016438591","infoHashBuffer":{"type":"Buffer","data":[34,235,59,69,86,110,14,83,26,226,214,18,176,181,235,176,22,67,133,145]},"announce":[],"urlList":[]}}