{"title":"Secret Wars 3  (Complete)  (In Reading Order)  (No Ads)","uid":7801138,"size":30355826,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:234bade3a697623198639f6ba0432e8560bb6204&amp;dn=Secret+Wars+3++%28Complete%29++%28In+Reading+Order%29++%28No+Ads%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"SplhcbPrime","files":-1,"time":1352246480,"description":"At the edge of The Negative Zone, The Thing, Ms Marvel, Human Torch and Dr. Doom are coming toward a breach that will bring them to the universe where The Beyonder existed prior to his death.  Doom explains to his old foes that it is there, at the Crossroads of Infinity, that they will learn the secret of The Beyonders. \n\nAs the heroes cross through the Crossroads of Infinity, they are hurtled through various universes.  They travel onward and are shocked to pass by a ship containing their old teammates, Reed and Sue, travelling along with the Silver Surfer, who quickly disappear before they can make sense of things.  Before Ben can turn their ship around, Doom tells them to stay on course so as to reach their destination.  They are surprised to find that it is a near duplicate of their own universe, however Doom corrects them by saying it is the universe The Beyonder created before his death.  As they approach The Beyonder's version of Earth, The Beyonder detects their presence and, making himself appear in the face of the sun, tells the invaders to his universe that they are all dead.\n\nOr are they?\n\nPlease download and peruse this torrent (created to honor a request) to find out.\n\nEnjoy, and please seed.\n\n","torrent":{"xt":"urn:btih:234bade3a697623198639f6ba0432e8560bb6204","amp;dn":"Secret+Wars+3++%28Complete%29++%28In+Reading+Order%29++%28No+Ads%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"234bade3a697623198639f6ba0432e8560bb6204","infoHashBuffer":{"type":"Buffer","data":[35,75,173,227,166,151,98,49,152,99,159,107,160,67,46,133,96,187,98,4]},"announce":[],"urlList":[]}}