{"title":"Jon Krakauer - Into Thin Air.","uid":10090750,"size":252757276,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2413a8c60f2967b6e01a410e33044189fcf6376f&amp;dn=Jon+Krakauer+-+Into+Thin+Air.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"SectorVector","files":161,"time":1399190195,"description":"\nInto Thin Air: A Personal Account of the Mt. Everest Disaster \nby Jon Krakauer, read by the author.\n\n# Year: 1997\n# Duration: 5 hours and 58 mins\n# ISBN: 0739343793\n# MP3 85 kbps\n# 243 MB\n\n\nA bank of clouds was assembling on the not-so-distant horizon, but journalist-mountaineer Jon Krakauer, standing on the summit of Mt. Everest, saw nothing that &quot;suggested that a murderous storm was bearing down.&quot; He was wrong. The storm, which claimed five lives and left countless more--including Krakauer's--in guilt-ridden disarray, would also provide the impetus for Into Thin Air, Krakauer's epic account of the May 1996 disaster.\n\n\nInto Thin Air is a riveting first-hand account of a catastrophic expedition up Mount Everest. In March 1996, Outside magazine sent veteran journalist and seasoned climber Jon Krakauer on an expedition led by celebrated Everest guide Rob Hall.\n\nDespite the expertise of Hall and the other leaders, by the end of summit day eight people were dead.\n\nKrakauer's book is at once the story of the ill-fated adventure and an analysis of the factors leading up to its tragic end. Written within months of the events it chronicles, Into Thin Air clearly evokes the majestic Everest landscape.\n\nAs the journey up the mountain progresses, Krakauer puts it in context by recalling the triumphs and perils of other Everest trips throughout history. The author's own anguish over what happened on the mountain is palpable as he leads readers to ponder timeless questions.\n &lt;a href=&quot;\nhttp://www.goodreads.com/book/show/1898.Into_Thin_Air&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.goodreads.com/book/show/1898.Into_Thin_Air&lt;/a&gt; - 4.0/5.0\n\n-_-","torrent":{"xt":"urn:btih:2413a8c60f2967b6e01a410e33044189fcf6376f","amp;dn":"Jon+Krakauer+-+Into+Thin+Air.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2413a8c60f2967b6e01a410e33044189fcf6376f","infoHashBuffer":{"type":"Buffer","data":[36,19,168,198,15,41,103,182,224,26,65,14,51,4,65,137,252,246,55,111]},"announce":[],"urlList":[]}}