{"title":"Bookbinding - A Traditional Technique","uid":4952482,"size":734102785,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2446df99014d81571b28e09daf3d4775817d41cb&amp;dn=Bookbinding+-+A+Traditional+Technique&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Evgeniy88","files":5,"time":1244948768,"description":"I am uploading this to spread the art. If you have any other instructional videos on Bookbinding please upload them. By ALL means please purchase this DVD if you find any value in it. I have included the 3 PDF files on the disc as well.\n\nThis instructional video begins by describing all the parts of a hardbound book, then goes on to demonstrate &quot;case binding,&quot; the method still used by most publishers and binderies today. The film is divided into individual chapters showing each step in the process: folding the individual signatures, sewing signatures into folios, gluing them together, making the cover and end papers, and assembling the complete book. The steps are all clearly and simply explained and very well presented visually. The techniques for the most part make use of easily obtainable supplies found around the home or in craft or art supply stores. After the basics, host Larry Withers gives information on creating a variety of bound cover designs as well as recommendations for crafting several additional pieces of equipment to make the tasks easier. He not only provides clear instruction, but his enthusiasm will encourage the viewer to take up the craft. Downloadable PDF files feature a complete materials list, diagrams for building a book press and sewing frame, and common sewing knots. Librarians and book lovers will enjoy this video for its revealing information about book construction. A final valuable bit illustrates the proper way to open a new book for the first time so as not to damage the spine. Targeted to teens and adults, this video is highly recommended for arts and crafts collections as well as those covering the books arts.","torrent":{"xt":"urn:btih:2446df99014d81571b28e09daf3d4775817d41cb","amp;dn":"Bookbinding+-+A+Traditional+Technique","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2446df99014d81571b28e09daf3d4775817d41cb","infoHashBuffer":{"type":"Buffer","data":[36,70,223,153,1,77,129,87,27,40,224,157,175,61,71,117,129,125,65,203]},"announce":[],"urlList":[]}}