{"title":"Upstairs, Downstairs - The Complete Series","uid":4476091,"size":25874930380,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:247eaaadad70841ed610c93cbc57f183f89cf70d&amp;dn=Upstairs%2C+Downstairs+-+The+Complete+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":8,"uploader":"rfesu","files":70,"time":1225350512,"description":"------------------------------------------\n\nUpstairs, Downstairs - The Complete BBC Series\n\nEnglish w/ No Subs\n\nCollected by rf90esu and the WhatWarez group, Source unidentified\n\nAppears to be Ripped from the Retail DVD Release, Incl. DVD Intro Sequences, Credits, Interludes as Televised, etc.\n\nVideo Encoded @ GVC-XVid Avg. 1000Kbit 25FPS @ 720x576 YUY2\nAudio Encoded @ MPEG-3 192Kbit Stereo Unfiltered\n\n**See notes below for comments on rip quality.\n\n------------------------------------------\n\n[ : ABOUT THIS SERIES : ]\n\nPossibly one of the most brilliant and famous british TV series ever created.  Award winning and highly sought after by collectors of public media works of art.\n\n&quot;The series follows the lives of both the family and the servants in the London townhouse at 165 Eaton Place. Richard Bellamy, the head of the household, is a member of Parliament, and his wife a member of the titled aristocracy. Belowstairs, Hudson, the Scottish butler directs and guides the other servants about their tasks and (sometimes) their proper place. Real-life events from 1903-1930 are incorporated into the stories of the Bellamy household.&quot;\n\nThis synopsis, or any written synopsis of less size than a novel, for that matter, does not do the series justice.\n\nIt is a masterpeice, one which will have a profound effect on anyone who watches it.\n\n------------------------------------------\n\n[ : RELEASE NOTES : ]\n\nI'd always wanted this series in its entirety, and found it difficult to locate, as i'm sure you know too well.  The first season is everywhere on the good old internet, however the remainder of the series is the best part, and it's almost like it doesn't exist.\n\nI am broke and have been unable to purchase the dvds for myself to rip, so i have downloaded it from people who are not very well known on another network.\n\nIt took me a very long time to get it, over a year to complete the collection, unfortunately.\n\nMy pain is your gain, i am giving you this collection in a heartwarming celebration of me finally completing the last episode, so you do not have to go through the searching, the waiting, and the general bullshit that I did.\n\nI have failed to contact the person who ripped the series to thank him, so i am forced to re-release it with no credit given.  I am not too happy about that.  I thank all responsible, whoever they are.\n\nI've watched every single episode in this collection all the way through, every second has been checked to make sure it's complete and glitch free.  If you've always wanted to add this to your collection, this is what you've been waiting for.\n\nEnjoy!\n\n------------------------------------------\n\n[ : QUALITY : ]\n\nAs with most british TV series from the 70s, the rips released are generally critisized for quality.\n\nAnyone who watches lots of old BBC series (i.e. me), is probably used to poor quality regardless of era or format due to the source quality, and will consider the quality of these rips very much &quot;above average&quot;.\n\nThey are reasonably close to the DVD release, as true to the source as any other common XviD rip of tv series DVDs.\n\nThe original source is, of course, early 70s british master tapes.  If you don't sit a few inches from your screen, you won't notice any encoding flaws or tape flaws over the beauty of the show itself.\n\nThe audio also has a slight hiss from the master tape.  Just EQ to taste if it bothers you, it didn't bother me at all.\n\nThe most important part is; They're great, and they're ALL HERE so you can ACTUALLY WATCH THE ENTIRE SERIES AT LONG LAST.\n\nAnyway, download and enjoy them, or don't, and miss out.  Doesn't bother me.\n\n------------------------------------------\n\nQuestion: Why the hell is some of it in black and white, in the beginning of the first season, but not the first episode???\n\nAnswer: This is normal, color copies do not exist for several of the episodes.\n\nWikipedia: &quot;Due to an industrial dispute over extra payments for using newly-introduced colour equipment [union strike], the first six episodes of the first series were shot in black-and-white, and when [the strike was over], the first episode was remade in colour.  The original black-and-white first episode is believed to be [chucked by the bbc].&quot;\n\nEvery episode from season 2 onward which was shown in color, is of course, in color.  This only affects the first few episodes of season 1.  There ARE no color versions of these episodes.\n\n------------------------------------------\n\nQuestion: Where are the &quot;DVD extras&quot;?\n\nAnswer: I do have them here, but they simply are not as important as the complete set of regular season episodes.\n\nI will release them later under a different torrent if anyone likes?  Let me know if that interests you!  They're neat to watch.\n\n------------------------------------------","torrent":{"xt":"urn:btih:247eaaadad70841ed610c93cbc57f183f89cf70d","amp;dn":"Upstairs%2C+Downstairs+-+The+Complete+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"247eaaadad70841ed610c93cbc57f183f89cf70d","infoHashBuffer":{"type":"Buffer","data":[36,126,170,173,173,112,132,30,214,16,201,60,188,87,241,131,248,156,247,13]},"announce":[],"urlList":[]}}