{"title":"Underwater Acoustics - Analysis, Design and Performance of Sonar","uid":6403761,"size":10762106,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:24d949c912117fdc465dbbd325022d5740d348e5&amp;dn=Underwater+Acoustics+-+Analysis%2C+Design+and+Performance+of+Sonar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1305740119,"description":"\nUnderwater Acoustics: Analysis, Design and Performance of Sonar\nWiley | 2010-08-10 | ISBN: 0470688750 | 366 pages | PDF \n\nOffering complete and comprehensive coverage of modern sonar spectrum system analysis, Underwater Acoustics: Analysis, Design and Performance of Sonar provides a state-of-the-art introduction to the subject and has been carefully structured to offer a much-needed update to the classic text by Urick. Expanded to included computational approaches to the topic, this book treads the line between the highly theoretical and mathematical texts and the more populist, non-mathematical books that characterize the existing literature in the field. The author compares and contrasts different techniques for sonar design, analysis and performance prediction and includes key experimental and theoretical results, pointing the reader towards further detail with extensive references. Practitioners in the field of sonar design, analysis and performance prediction as well as graduate students and researchers will appreciate this new reference as an invaluable and timely contribution to the field.\n\nChapters include the sonar equation, radiated, self and ambient noise, active sonar sources, transmission loss, reverberation, transducers, active target strength, statistical detection theory, false alarms, contacts and targets, variability and uncertainty, modelling detections and tactical decision aids, cumulative probability of detection, tracking target motion analysis and localization, and design and evaluation of sonars","torrent":{"xt":"urn:btih:24d949c912117fdc465dbbd325022d5740d348e5","amp;dn":"Underwater+Acoustics+-+Analysis%2C+Design+and+Performance+of+Sonar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24d949c912117fdc465dbbd325022d5740d348e5","infoHashBuffer":{"type":"Buffer","data":[36,217,73,201,18,17,127,220,70,93,187,211,37,2,45,87,64,211,72,229]},"announce":[],"urlList":[]}}