{"title":"Lego - Legends of Chima 5-8 - Norsk Tale","uid":9686706,"size":1248583102,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:24e0ebe80957086bf6a25a50314723e7430b6ac2&amp;dn=Lego+-+Legends+of+Chima+5-8+-+Norsk+Tale&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"indium_x","files":-1,"time":1393780497,"description":"Chima is a land where anthropomorphic animals lived in peace with one another until a conflict caused a civil war with the 18 animal tribes: Lion, Eagle, Raven, Wolf, Gorilla, Rhino, Bear, Beaver, Crocodile, Scorpion, Spider, Bat, Mammoth, Sabretooth-tiger, Panther, Phoenix, Vulture and Tiger. The members of the factions fiercely battle over a powerful natural resource called Chi, which could allow its possessor to create or destroy.\n\nOnce a pristine, natural paradise, CHIMA has become a battle ground for eight animal tribes. Best friends are now enemies. The animals fight for control of a natural resource called CHI, a powerful element that is both a source of life and potential destruction. Only a few brave heroes in CHIMA understand the true nature of CHI, and the possible downfall of CHIMA that will result from its misuse. Their stories, and the stories of those who seek to destroy them, are known as the legends of CHIMA.\n\nFor a thousand years, animal tribes have ruled the land of CHIMA and lived in peace. They played and worked together, cooperated and prospered until the outbreak of the CHIMA conflicts.","torrent":{"xt":"urn:btih:24e0ebe80957086bf6a25a50314723e7430b6ac2","amp;dn":"Lego+-+Legends+of+Chima+5-8+-+Norsk+Tale","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24e0ebe80957086bf6a25a50314723e7430b6ac2","infoHashBuffer":{"type":"Buffer","data":[36,224,235,232,9,87,8,107,246,162,90,80,49,71,35,231,67,11,106,194]},"announce":[],"urlList":[]}}