{"title":"David McGowan - Programmed to Kill - The Politics of Serial Murd","uid":15514147,"size":1551477,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:257b07b051c88f861adaf627cd21d02e12216110&amp;dn=David+McGowan+-+Programmed+to+Kill+-+The+Politics+of+Serial+Murd&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"roflcopter2110","files":5,"time":1470689720,"description":"https://extraimago.com/images/2016/08/08/01b9add5efc08c0e320aa6f28574f945.jpg\r\n\r\nDavid McGowan - Programmed to Kill - The Politics of Serial Murder\r\n\r\nThe specter of the marauding serial killer has become a relatively common feature on the American landscape. Reactions to these modern-day monsters range from revulsion to morbid fascination-fascination that is either fed by, or a product of, the saturation coverage provided by print and broadcast media, along with a dizzying array of books, documentary films, websites, and &quot;Movies of the Week&quot;. The prevalence in Western culture of images of serial killers (and mass murderers) has created in the public mind a consensus view of what a serial killer is. Most people are aware, to some degree, of the classic serial killer 'profile.' But what if there is a much different 'profile'-one that has not received much media attention? In Programmed to Kill, acclaimed and always controversial author David McGowan takes a fresh look at the lives of many of America's most notorious accused murderers, focusing on the largely hidden patterns that suggest that there may be more to the average serial killer story than meets the eye. Think you know everything there is to know about serial killers? Or is it possible that sometimes what everyone 'knows' to be true isn't really true at all?","torrent":{"xt":"urn:btih:257b07b051c88f861adaf627cd21d02e12216110","amp;dn":"David+McGowan+-+Programmed+to+Kill+-+The+Politics+of+Serial+Murd","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"257b07b051c88f861adaf627cd21d02e12216110","infoHashBuffer":{"type":"Buffer","data":[37,123,7,176,81,200,143,134,26,218,246,39,205,33,208,46,18,33,97,16]},"announce":[],"urlList":[]}}