{"title":"Ultra Baby homebuilt ultralight airplane plans","uid":4175550,"size":62044020,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25b24aac536c797caca19041c853ee07f92610bf&amp;dn=Ultra+Baby+homebuilt+ultralight+airplane+plans&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"nearadyn","files":1,"time":1210104538,"description":"Complete plans for the Ultra Baby. This is a single seat wood frame fabric covered airplane. It does fall under FAA\\&amp;#039;s part 103 ultralight rules so you don\\&amp;#039;t need a pilot\\&amp;#039;s certificate to fly one.\n\nYou can build this plane using common woodworking tools! There are a few small metal parts which you will need to make from stock easily obtained from any hardware store. for these, a hammer, drill, and dremel tool will do the trick.\n\nI have got the chance to fly one of these planes years ago that a friend owned and they fly beautifully! Easy to handle and safe. I haven\\&amp;#039;t built one from these plans though, but I have carefully studied them and I believe that anyone can build this plane from these plans even with no previous experience.\nThat being said, I think it would GREATLY help you along if you have at least SOME woodworking experience. Also this plane is built much like a balsa wood model, only it\\&amp;#039;s full size! So if you\\&amp;#039;re not familiar with building wood airplanes, I suggest that you purchase an R/C model airplane kit and build it and fly it before attempting this. That experience will really help you more than you may realize. Also Talk to other people who have built full sized planes. Get on email lists, ect. From the looks of these plans, i\\&amp;#039;m GUESSING that this plane can be built for around $1000 US engine not included. ANYONE can afford to build and fly this airplane. It can be built in a single car garage.\n\nIf you do decide to attempt this, GET SOME FLIGHT TRAINING BEFORE FLYING IT!!! If you die, it\\&amp;#039;s not my fault. You are responsible for getting proper pilot training. Legally, you don\\&amp;#039;t need any official training in the US to fly this, but it would be smart to at least go to ground school and have at least 10 hours of training with an instructor before flying this or any other ultralight. Just my opinion. I\\&amp;#039;m a licensed Private Pilot.","torrent":{"xt":"urn:btih:25b24aac536c797caca19041c853ee07f92610bf","amp;dn":"Ultra+Baby+homebuilt+ultralight+airplane+plans","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25b24aac536c797caca19041c853ee07f92610bf","infoHashBuffer":{"type":"Buffer","data":[37,178,74,172,83,108,121,124,172,161,144,65,200,83,238,7,249,38,16,191]},"announce":[],"urlList":[]}}