{"title":"Silman's Complete Endgame Course: From Beginner To Maste","uid":5720114,"size":41922617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25b8773fe9554130cea06a199f7e0a5cd7d6e152&amp;dn=Silman%5C%27s+Complete+Endgame+Course%3A+From+Beginner+To+Maste&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Djofullinn","files":1,"time":1280258374,"description":"For more than 100 years, the world's leading chess players and teachers have told their students to study the endgame. Now, for the first time, a revolutionary, richly instructive endgame book has been designed for players of all levels. Silman's Complete Endgame Course, by famed writer and player Jeremy Silman, is the one and only endgame book you'll need as you move up the ladder from beginner to strong tournament player and finally to master.\n\nDesigned to &quot;speak&quot; to a player in a very personal way, Silman's book teaches the student everything he or she needs to know at his or her current rating level, and builds on that knowledge for each subsequent phase of the player's development. Starting at the beginner's level, all basic mates are clearly and painstakingly explained. After that, the critical building blocks that form the endgame foundation for all tournament hopefuls and experienced tournament competitors are explored in detail. Finally, advanced endgame secrets based on concepts rather than memorization are presented in a way that makes them easy to master.\n\nThe basic keys to a well-rounded endgame education--Opposition, the Lucena and Philidor Positions, Cat and Mouse, Trebuchet, Fox in the Chicken Coup, Triangulation, Building a Box, Square of a Pawn, Outflanking, the Principle of Two Weaknesses--are vital. But equally important is creating a love of the endgame, which is addressed at the end of the book with a look at chess tactics, minor piece domination, and a discussion of the five greatest endgame players of all time--all things that every fan of chess at every level can enjoy.\n\nIf you have found the endgame to be a mystery, if you have found that your confidence plummets once you reach an endgame, if you have searched for an instructive endgame book that will turn your weakest link--your endgame--into your personal field of power, your search is over. Silman's Complete Endgame Course is the key to a world of essential ideas, startling beauty, and stunning creativity.\nFrom the Back Cover\nInternational Master Jeremy Silman has a rare talent of seeing chess not only from his perspective, but also from the point of view of a club player. Because of that, I always recommend Jeremy's books to my students and get very positive feedback from them. Now I know what I'll recommend for their endgame work! --Alexander Baburin, International Grandmaster\n\nSuperb and highly instructive--an excellent learning tool for both the novice and expert alike. --Pal Benko, International Grandmaster\n\nOne of the best endgame books I've ever seen. The idea to divide material according to rating group is great! --Gregory Kaidanov, International Grandmaster \n &lt;a href=&quot;\nhttp://www.amazon.com/Silmans-Complete-Endgame-Course-Beginner/dp/1890085103/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1280250013&amp;sr=1-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Silmans-Complete-Endgame-Course-Beginner/dp/1890085103/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1280250013&amp;sr=1-1&lt;/a&gt;","torrent":{"xt":"urn:btih:25b8773fe9554130cea06a199f7e0a5cd7d6e152","amp;dn":"Silman%5C%27s+Complete+Endgame+Course%3A+From+Beginner+To+Maste","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25b8773fe9554130cea06a199f7e0a5cd7d6e152","infoHashBuffer":{"type":"Buffer","data":[37,184,119,63,233,85,65,48,206,160,106,25,159,126,10,92,215,214,225,82]},"announce":[],"urlList":[]}}