{"title":"The Makeup Artist Handbook[BSS]","uid":6616024,"size":13528076,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25c78a16f561ec9836e591d581da13420e3dea8b&amp;dn=The+Makeup+Artist+Handbook%5BBSS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1313783324,"description":"This full-color and amply illustrated book is written for film, television, and theatre makeup artists who need to know the basics on how to accomplish flawless makeup applications. It begins with fundamental practices and continues through more complex techniques usually known only by Hollywood makeup artists. Written by two expert authors who have experience doing makeup for television, commmercials, and blockbuster films, readers will learn about beauty, time periods, black and white film, as well as cutting edge techniques such as air brusshing makeup for computer-generated movies, and makeup effects.\n\nHigh definition (HD) technology has revolutionized the techniques needed by makeup artists--you need to know more, have more talent, and be more detailed than ever before. Because HD emphasizes every detail on screen, it's essential for makeup artists to know how to achieve a desired &quot;look&quot; that fits the director's requirements. This book will help professional and aspiring makeup artists to hone their craft in both conventional and HD techniques.\n\n. Gorgeous full color book shows how makeup artists make Hollywood stars look as good as they do, even in HD! . Get the inside track about how to work with the pros and all about set etiquette . Contains tips and techniques from a number of professional Hollywood makeup artists . Includes a full reference section with useful websites, business listings, and contacts . Award winning advice from co-author Mindy Hall, Academy Award winner for makeup for her work on Star Trek\n\n \nFrom the Back Cover\nFrom makeup effects to high definition, this full-color guide for Film &amp; TV Makeup Artists shows you how it's done!\n\n. Gorgeous full color book shows how makeup artists make Hollywood stars look as good as they do, even in HD!\n. Get the inside track about how to work with the pros and all about set etiquette\n. Contains tips and techniques from a number of professional Hollywood makeup artists\n. Includes a full reference section with useful websites, business listings, and contacts\n\nThis full-color and amply illustrated book was written for film, television, and theatre makeup artists who need to know the basics on how to accomplish flawless makeup applications. It begins with fundamental practices and continues through more complex techniques that are usually known only by Hollywood makeup artists. Written by two expert authors who have experience doing makeup for television, commercials, and huge film blockbusters like Pearl Harbor, Rent, Stuart Little, and the Nanny Diaries and for actors like Hilary Swank, Laura Linney, and Josh Hartnett, readers will learn about beauty, time periods, and black &amp; white film, as well as cutting edge techniques such as air brushing, makeup for computer-generated movies, and makeup effects.\n\nHigh definition technology has revolutionized the techniques needed by makeup artists-you need to know more, have more talent, and be more detailed than ever before. Because HD emphasizes every detail on screen, it is essential for makeup artists to know how to achieve a desired &quot;look&quot; that fits the director's requirements, and this book will help professional or aspiring makeup artists to hone their craft in both conventional and HD techniques. \n\n\n\n\n# Paperback: 296 pages\n# Publisher: Focal Press (February 28, 2008)\n# Language: English","torrent":{"xt":"urn:btih:25c78a16f561ec9836e591d581da13420e3dea8b","amp;dn":"The+Makeup+Artist+Handbook%5BBSS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25c78a16f561ec9836e591d581da13420e3dea8b","infoHashBuffer":{"type":"Buffer","data":[37,199,138,22,245,97,236,152,54,229,145,213,129,218,19,66,14,61,234,139]},"announce":[],"urlList":[]}}