{"title":"Africa, A Biography of the Continent  ^ heliiaruy+hyperlinkedToC","uid":12075299,"size":4384023,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25fe153f38dc20e4fe3b0b0281ac90adc7c6ca19&amp;dn=Africa%2C+A+Biography+of+the+Continent++%5E+heliiaruy%2BhyperlinkedToC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"heliiaruy","files":1,"time":1435623167,"description":"Africa   A Biography of the Continent\n\nby John Reader, published 1998\n\npdf file with a Table of Contents properly linked to the TEXT\n\n\n\n\nIn 1978, paleontologists in East Africa discovered the earliest evidence of our divergence from the apes: three pre-human footprints, striding away from a volcano, were preserved in the petrified surface of a mudpan over three million years ago. Out of Africa, the world's most ancient and stable landmass, Homo sapiens dispersed across the globe.  And yet the continent that gave birth to human history has long been woefully misunderstood and mistreated by the rest of the world.\n\nIn a book as splendid in its wealth of information as it is breathtaking in scope, British writer and photojournalist John Reader brings to light Africa's geology and evolution, the majestic array of its landforms and environments, the rich diversity of its peoples and their ways of life, the devastating legacies of slavery and colonialism as well as recent political troubles and triumphs. Written in simple, elegant prose and illustrated with Reader's own photographs, Africa: A Biography of the Continent is an unforgettable book that will delight the general reader and expert alike. \n\n\nthanks cntrl+c\n\nanywho, there was a version out there with an improperly, malfunctioning linked Table of Contents.  \n\nSo   I   fixed   it  \n\nand here y'all go.   check out my many other magnet links!\n\n\n                hel i  i ar uyy      u r a i      i l             eh","torrent":{"xt":"urn:btih:25fe153f38dc20e4fe3b0b0281ac90adc7c6ca19","amp;dn":"Africa%2C+A+Biography+of+the+Continent++%5E+heliiaruy%2BhyperlinkedToC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25fe153f38dc20e4fe3b0b0281ac90adc7c6ca19","infoHashBuffer":{"type":"Buffer","data":[37,254,21,63,56,220,32,228,254,59,11,2,129,172,144,173,199,198,202,25]},"announce":[],"urlList":[]}}