{"title":"Muscle Meals by Michael Matthews","uid":9748543,"size":3853390,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:260d6bce64501fab16dfd066780f3c5c7f179a7f&amp;dn=Muscle+Meals+by+Michael+Matthews&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"PirateBook","files":2,"time":1394624910,"description":"\nMuscle Meals: 15 Recipes for Building Muscle, Getting Lean, and Staying Healthy (The Build Muscle, Get Lean, and Stay Healthy Series) by Michael Matthews\n\n\nIf you want to know how to build muscle and burn fat by eating healthy, delicious meals that are easy to cook and easy on your wallet, then you want to read this book.\nDo you lack confidence in the kitchen and think that you just can't cook great food?\n\nAre you not sure of how to prepare food that is not only delicious and healthy but also effective in helping you build muscle and lose fat?\nAre you afraid that cooking nutritious, restaurant-quality meals is too time-consuming and expensive?\n\nDo you think that eating healthy means having to force down the same boring, bland food every day?\nIf you answered &quot;yes&quot; to any of those questions, don't worry--you're not alone. And this book is going to help. Inside you'll find 15 fast, healthy, and tasty meals that will help you build muscle or lose weight, regardless of your current skills.\nNot only that, but you're also going to learn how to eat right without having to obsess over every calorie. \n\nThese 9 scientifically proven rules for eating are the foundation of every great physique, and they have nothing to do with following weird diets or depriving yourself of everything that tastes good.\nDownload this book now and learn how to escape the dreadful experience of &quot;dieting&quot; and how to cook nutritious, delicious meals that make burning fat or building muscle easy and enjoyable!\n\nGenre: Non-Fiction | Cooking","torrent":{"xt":"urn:btih:260d6bce64501fab16dfd066780f3c5c7f179a7f","amp;dn":"Muscle+Meals+by+Michael+Matthews","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"260d6bce64501fab16dfd066780f3c5c7f179a7f","infoHashBuffer":{"type":"Buffer","data":[38,13,107,206,100,80,31,171,22,223,208,102,120,15,60,92,127,23,154,127]},"announce":[],"urlList":[]}}