{"title":"BBC Planet Earth HD (English subtitle) E01-E11","uid":4265917,"size":25286547582,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2649d4020cf6ebf51d4850cc5dc091180b1e2a9a&amp;dn=BBC+Planet+Earth+HD+%28English+subtitle%29+E01-E11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"circlensess","files":22,"time":1214687910,"description":"Contents of download:  BBC Planet Earth Added by krapulito\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0795176/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0795176/&lt;/a&gt;\n\n BBC.Planet.Earth.01of11.Pole.to.Pole.avi (2.14 gigabyte)\n BBC.Planet.Earth.01of11.Pole.to.Pole.srt (28.67 kilobyte)\n BBC.Planet.Earth.02of11.Mountains.avi (2.14 gigabyte)\n BBC.Planet.Earth.02of11.Mountains.srt (27.05 kilobyte)\n BBC.Planet.Earth.03of11.Fresh.Water.avi (2.14 gigabyte)\n BBC.Planet.Earth.03of11.Freshwater.srt (22.89 kilobyte)\n BBC.Planet.Earth.04of11.Caves.avi (2.15 gigabyte)\n BBC.Planet.Earth.04of11.Caves.srt (31.3 kilobyte)\n BBC.Planet.Earth.05of11.Deserts.avi (2.12 gigabyte)\n BBC.Planet.Earth.05of11.Deserts.srt (29.37 kilobyte)\n BBC.Planet.Earth.06of11.Ice.Worlds.avi (2.14 gigabyte)\n BBC.Planet.Earth.06of11.Ice.Worlds.srt (28.59 kilobyte)\n BBC.Planet.Earth.07of11.Great.Plains.avi (2.14 gigabyte)\n BBC.Planet.Earth.07of11.Great.Plains.srt (24.25 kilobyte)\n BBC.Planet.Earth.08of11.Jungles.avi (2.14 gigabyte)\n BBC.Planet.Earth.08of11.Jungles.srt (29.53 kilobyte)\n BBC.Planet.Earth.09of11.Shallow.Seas.avi (2.15 gigabyte)\n BBC.Planet.Earth.09of11.Shallow.Seas.srt (27.83 kilobyte)\n BBC.Planet.Earth.10of11.Seasonal.Forests.avi (2.14 gigabyte)\n BBC.Planet.Earth.10of11.Seasonal.Forests.srt (27.25 kilobyte)\n BBC.Planet.Earth.11of11.Ocean.Deep.avi (2.14 gigabyte)\n BBC.Planet.Earth.11of11.Ocean.Deep.srt (29.39 kilobyte)\n\nPlanet Earth HD (english subtitle include)\n\n\n1. &quot;From Pole to Pole&quot;\n\nOriginally transmitted: 5 March 2006 (UK), 25 March 2007 (US)\n\nThe first episode illustrates a &amp;#039;journey&amp;#039; around the globe and reveals the effect of gradual climatic change and seasonal transitions en route. During Antarctica&amp;#039;s winter, emperor penguins endure four months of darkness, with no food, in temperatures of ?70Â°C. Meanwhile, as spring arrives in the Arctic, polar bear cubs take their first steps into a world of rapidly thawing ice. In northern Canada, the longest overland migration of any animal ? over 2000 miles ? is that of three million caribou, which are hunted by wolves, and one such pursuit is shown. The forests of eastern Russia are home to the Amur leopard: with a population of just 40 individuals, it is now the world&amp;#039;s rarest cat. This is primarily because of the destruction of its habitat, and Attenborough states that it &quot;symbolises the fragility of our natural heritage.&quot; However, in the tropics, the jungle that covers 3% of the planet&amp;#039;s surface supports 50% of its animals.\n\n2. &quot;Mountains&quot;\n\nOriginally transmitted: 12 March 2006 (UK), 25 March 2007 (US)\n\nThe second instalment focuses on the mountains. All the main ranges are explored with extensive aerial photography. Ethiopia&amp;#039;s Erta Ale is the longest continually erupting volcano ? for over 100 years. On the nearby highlands, geladas (the only primate whose diet is almost entirely of grass) inhabit precipitous slopes nearly three miles up, in troops that are 800-strong: the most numerous of their kind. Alongside them live the critically endangered walia ibex, and both species take turns to act as lookout for predatory Ethiopian wolves. The Andes have the most volatile weather and guanacos are shown enduring a flash blizzard, along with an exceptional group sighting of the normally solitary puma.\n\n3. &quot;Fresh Water&quot;\n\nOriginally transmitted: 19 March 2006 (UK), 15 April 2007 (US)\n\nBroadcast 19 March 2006, this programme describes the course taken by rivers and some of the species that take advantage of such a habitat. Only 3% of the world&amp;#039;s water is fresh, yet all life is ultimately dependent on it. Its journey begins as a stream in the mountains, illustrated by Venezuela&amp;#039;s Tepui, where there is a tropical downpour almost every day. It then travels hundreds of miles before forming rapids. With the aid of some expansive helicopter photography, one sequence demonstrates the vastness of Angel Falls, the world&amp;#039;s highest free-flowing waterfall.\n\n4. &quot;Caves&quot;\n\nOriginally transmitted: 26 March 2006 (UK), 22 April 2007 (US)\n\nThis episode explores &quot;planet earth&amp;#039;s final frontier&quot;: the world of caves. At a depth of 400 metres, Mexico&amp;#039;s Cave of Swallows is Earth&amp;#039;s deepest pit cave freefall drop, allowing entry by skydivers. Its volume could contain New York City&amp;#039;s Empire State Building. Also featured is Borneo&amp;#039;s Deer Cave and Gomantong Cave. Inhabitants of the former include three million wrinkle-lipped bats, which have deposited guano on to an enormous mound. In Gomantong Cave, guano is many metres high and is blanketed with hundreds of thousands of cockroaches and other invertebrates. Also depicted are eyeless, subterranean creatures, such as the Texas blind salamander and (&quot;bizarrely&quot;) a species of crab. Mexico&amp;#039;s Cueva de Villa Luz is also featured, with its flowing stream of sulphuric acid and snottite formations made of living bacteria.\n\n5. &quot;Deserts&quot;\n\nOriginally transmitted: 2 April 2006 (UK), 1 April 2007 (US)\n\nThis instalment features the harsh environment that covers one third of the Earth: the deserts. Due to Siberian winds, Mongolia&amp;#039;s Gobi Desert reaches extremes of temperature like no other, ranging from ?40Â°C to +50Â°C. It is home to the rare Bactrian camel, which eats snow to maintain its fluid level and must limit itself to 10 litres a day if it is not to prove fatal. Africa&amp;#039;s Sahara is the size of the USA, and just one of its severe dust storms could cover the whole of Great Britain. While some creatures, such as the dromedary, take them in their stride, for others the only escape from such bombardments is to bury themselves in the sand.\n6. &quot;Ice Worlds&quot;\n\nOriginally transmitted: 5 November 2006 (UK), 1 April 2007 (US)\n\nThe sixth programme looks at the regions of the Arctic and Antarctica. The latter contains 90% of the world&amp;#039;s ice, and stays largely deserted until the spring, when visitors arrive to harvest its waters. Snow petrels take their place on nunataks and begin to court, but are preyed on by South Polar skuas. During summer, a pod of humpback whales hunt krill by creating a spiralling net of bubbles. The onset of winter sees the journey of emperor penguins to their breeding grounds, 100 miles inland. Their eggs transferred to the males for safekeeping, the females return to the ocean while their partners huddle into large groups to endure the extreme cold.\n\n7. &quot;Great Plains&quot;\n\nOriginally transmitted: 12 November 2006 (UK), 8 April 2007 (US)\n\nThis episode deals with savanna, steppe, tundra, prairie, and looks at the importance and resilience of grasses in such treeless ecosystems. Their vast expanses contain the largest concentration of animal life. In Outer Mongolia, a herd of Mongolian gazelle flee a bush fire and has to move on to new grazing, but grass can repair itself rapidly and soon reappears. On the Arctic tundra during spring, millions of migratory snow geese arrive to breed and their young are preyed on by Arctic foxes. Meanwhile, time-lapse photography depicts moving herds of caribou as a calf is brought down by a chasing wolf. On the North American prairie, bison engage in the ritual to establish the dominant males. The Tibetan Plateau is the highest of the plains and despite its relative lack of grass, animals do survive there, including yak and wild ass. However, the area&amp;#039;s most numerous resident is the pika, whose nemesis is the Tibetan fox.\n\n8. &quot;Jungles&quot;\n\nOriginally transmitted: 19 November 2006 (UK), 15 April 2007 (US)\n\nThe next instalment examines jungles and tropical rainforests. These environments occupy only 3% of the land yet are home to over half of the world&amp;#039;s species. New Guinea is inhabited by almost 40 kinds of birds of paradise, which avoid conflict with each other by living in different parts of the island. Some of their elaborate courtship displays are shown. Within the dense forest canopy, sunlight is prized, and the death of a tree triggers a race by saplings to fill the vacant space. Figs are a widespread and popular food, and as many as 44 types of bird and monkey have been observed picking from a single tree.\n\n9. &quot;Shallow Seas&quot;\n\nOriginally transmitted: 26 November 2006 (UK), 8 April 2007 (US)\n\nThis programme is devoted to the shallow seas that fringe the world&amp;#039;s continents. Although they constitute 8% of the oceans, they contain most marine life. As humpback whales return to breeding grounds in the tropics, a mother and its calf are followed. While the latter takes in up to 500 litres of milk a day, its parent will starve until it travels back to the poles to feed ? and it must do this while it still has sufficient energy left for the journey. The coral reefs of Indonesia are home to the biggest variety of ocean dwellers. Examples include banded sea kraits, which ally themselves with goatfish and trevally in order to hunt. In Western Australia, dolphins &amp;#039;hydroplane&amp;#039; in the shallowest waters to catch a meal, while in Bahrain, 100,000 Socotra cormorants rely on shamals that blow sand grains into the nearby Persian Gulf, transforming it into a rich fishing ground.\n\n10. &quot;Seasonal Forests&quot;\n\nOriginally transmitted: 3 December 2006 (UK), 22 April 2007 (US)\n\nThe penultimate episode surveys the coniferous and deciduous seasonal woodland habitats ? the most extensive forests on Earth. Conifers begin sparsely in the Arctic but soon dominate the land, and the taiga circles the globe, containing a third of all the Earth&amp;#039;s trees. Few creatures can survive the Arctic climate all year round, but the moose and wolverine are exceptions. 1600 kilometres to the south, on the Pacific coast of North America, conifers have reached their full potential. These include some of the world&amp;#039;s tallest trees: the redwoods. Here, a pine marten is shown stalking a squirrel, and great grey owl chicks take their first flight.\n\n11. &quot;Ocean Deep&quot;\n\nOriginally transmitted: 10 December 2006 (UK), 25 March 2007 (US)\n\nThe final instalment concentrates on the most unexplored area of the planet: the deep ocean. It begins with a whale shark used as a shield by a shoal of bait fish to protect themselves from yellowfin tuna. Also shown is an oceanic whitetip shark trailing rainbow runners. Meanwhile, a 500-strong school of dolphins head for the Azores, where they work together to feast on scad mackerel. Down in the ocean&amp;#039;s furthest reaches, some creatures defy classification. On the sea floor, scavengers such as the spider crab bide their time, awaiting carrion from above. The volcanic mountain chain at the bottom of the Atlantic Ocean also sustains life through the bacteria that surround its sulphide vents. There are thought to be around 30,000 undersea volcanoes, some of them taller than Mount Everest.","torrent":{"xt":"urn:btih:2649d4020cf6ebf51d4850cc5dc091180b1e2a9a","amp;dn":"BBC+Planet+Earth+HD+%28English+subtitle%29+E01-E11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2649d4020cf6ebf51d4850cc5dc091180b1e2a9a","infoHashBuffer":{"type":"Buffer","data":[38,73,212,2,12,246,235,245,29,72,80,204,93,192,145,24,11,30,42,154]},"announce":[],"urlList":[]}}