{"title":"None Dare Call It Education - John Stormer","uid":11717782,"size":8618792,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26c12cb4632575ba5b783380f655aa1cf818f3e5&amp;dn=None+Dare+Call+It+Education+-+John+Stormer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"starxteel","files":1,"time":1424667849,"description":"\nReview:\nThis is an in-depth analysis about the many problems in the public school system in America. While reading it I often thought of Thomas Sowell's damming account of the public school system as detailed in his book &quot;Inside American Education.&quot; John Stormer covers many of the same areas and expresses many of the same concerns, but John Stormer does it from a religious standpoint. Both books are very concerned about the declining academic standards in the public school system, both books are explore how children are being brainwashed in public schools, and both books are very concerned with the political agenda of the NEA.\n\nJohn Stormer starts off by saying that before you can decide on what is the purpose of an education, you have to think about:\n1) What is the nature of man?\n2) What is his purpose?\n\nMost public school officials have a humanist point of view about the nature and purpose of man. John Stormer points out this leads them in fundamentally different directions than most Christian want to go.\n\nJohn Stormer quotes a number of professional educators who over the years have declared their intent to remake society, to &quot;fix it up.&quot; His opposition to this appears to be what drove him to write this book. He is concerned about the declining academic standards, and the first chapter documents how each year students are performing worse and worse in math, spelling, reading, history, and so on. Most of the rest of the book focuses how in different ways public schools are trying to remake society.\n\nThere were a number of interesting points made in the book. For example John Stormer points out that it doesn't take years to teach Sex Education, the basics can be taught in an hour, maybe a couple hours if you really take your time. The reason Sex Education is taught for so long is to wear down the values being taught at home. Many at public schools are looking to have schools replace the family.\n\nIf you are concerned about the decline in American Education over the last fifty years, but you aren't interested in a religious point of view, check out &quot;Inside American Education.&quot; If you are a Christian, and want more information on what is happening in public schools, this book is a good one to check out. &quot;None Dare Call It Education&quot; is well written and well documented.\n\n\nAbout the author:\n In the 1950s, John Stormer became disillusioned with the political candidates and philosophies that he was asked to support. In 1962, he left his career as editor and general manager of a leading electrical magazine to begin an intensive study of communism. With what he learned, he wrote the book None Dare Call It Treason which sold millions of copies. The book argues that the United States is losing the Cold War because it has been heavily infiltrated by Communist subversives. Visiting Vietnam twice, first in 1965, he has toured many other world trouble spots on fact-finding missions.\n John Stormer cast his penetrating spotlight even on the high and mighty. He was, in fact, among the first writers to expose the nefarious goals of the Council on Foreign Relations, and to reveal the funding of subversive leftwing causes and groups by the wealthy tax-exempt foundations. John Stormer's book identified the Council on Foreign Relations as a procommunist threat. Mr Stormer also courageously exposed the un-American character of the United Nations, denouncing in the process the entire spirit of internationalism... with a call to action for all concerned Americans... he also recommended joining some of the &quot;well-established national organizations&quot; devoted to the Americanist cause, such as The John Birch Society...&quot;","torrent":{"xt":"urn:btih:26c12cb4632575ba5b783380f655aa1cf818f3e5","amp;dn":"None+Dare+Call+It+Education+-+John+Stormer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26c12cb4632575ba5b783380f655aa1cf818f3e5","infoHashBuffer":{"type":"Buffer","data":[38,193,44,180,99,37,117,186,91,120,51,128,246,85,170,28,248,24,243,229]},"announce":[],"urlList":[]}}