{"title":"Revenge.S04E01.HDTV.x264-LOL","uid":11126559,"size":300795586,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:26d86dac0fb4b3785465f3eb075ac3baf89d1001&amp;dn=Revenge.S04E01.HDTV.x264-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Thhaque","files":2,"time":1411974239,"description":"[b]Revenge\n\n[IMG]http://i.imgur.com/tkpKK67.jpg[/IMG]\n\nGenre: Drama, Thriller\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Phillip Noyce\nCast: Amber Valletta, Ashley Madekwe, Christa B. Allen, Connor Paolo, Emily VanCamp, Gabriel Mann, Henry Czerny, Joshua Bowman, Madeleine Stowe, Nick Wechsler\n\n.: Plot :.\n&quot;Revenge&quot; is a drama/thriller that takes place in the the Hamptons, a world of rich caviar and lavish living, that follows Emily Thorne (Emily Van Camp) a woman with a past that fuels revenge on the separation of her father and mother years ago. Now that she is older and wiser, but still the plan for revenge on all those who affected her life is fresh on her mind. One by one she plots and takes care of the lose ends that are in her life. Emily focuses the root of her hatred to the Hamptons to Victoria (Madeline Stowe), a rich, cunning woman who knows it all when it comes to Emily's horrible past. &quot;Revenge&quot; flashbacks back and forth to set up the story to what happened to Emily that makes her so hellbent on revenge. She finds her self succeeding in her mission one right after another. Created by Mike Kelley (Jerico, Swingtown), this is going to be a show where you are going to keep guessing who is the next target on Emily's &quot;hit list&quot;. She starts to discover there is more to her past than she had ever dreamed of and things go from happy to sad rather quickly.[/b]","torrent":{"xt":"urn:btih:26d86dac0fb4b3785465f3eb075ac3baf89d1001","amp;dn":"Revenge.S04E01.HDTV.x264-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26d86dac0fb4b3785465f3eb075ac3baf89d1001","infoHashBuffer":{"type":"Buffer","data":[38,216,109,172,15,180,179,120,84,101,243,235,7,90,195,186,248,157,16,1]},"announce":[],"urlList":[]}}