{"title":"Reconstructing Amelia - Kimberly McCreight","uid":9234988,"size":618622,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26ecccd837e62df7a82e2b40b359b2ec1a7b1101&amp;dn=Reconstructing+Amelia+-+Kimberly+McCreight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1385153479,"description":"A stunning debut novel in which a single mother reconstructs her teenaged daughter's life, sifting through her emails, texts, and social media to piece together the shocking truth about the last days of her life.\n\nLitigation lawyer and harried single mother Kate Baron is stunned when her daughter's exclusive private school in Park Slope, Brooklyn, calls with disturbing news: her intelligent, high-achieving fifteen-year-old daughter, Amelia, has been caught cheating.\n\nKate can't believe that Amelia, an ambitious, levelheaded girl who's never been in trouble would do something like that. But by the time she arrives at Grace Hall, Kate's faced with far more devastating news. Amelia is dead.\n\nSeemingly unable to cope with what she'd done, a despondent Amelia has jumped from the school's roof in an act of &quot;spontaneous&quot; suicide. At least that's the story Grace Hall and the police tell Kate. And overwhelmed as she is by her own guilt and shattered by grief, it is the story that Kate believes until she gets the anonymous text:\n\nShe didn't jump.\n\nSifting through Amelia's emails, text messages, social media postings, and cell phone logs, Kate is determined to learn the heartbreaking truth about why Amelia was on Grace Hall's roof that day-and why she died.\n\nTold in alternating voices, Reconstructing Amelia is a story of secrets and lies, of love and betrayal, of trusted friends and vicious bullies. It's about how well a parent ever really knows a child and how far one mother will go to vindicate the memory of a daughter whose life she could not save.","torrent":{"xt":"urn:btih:26ecccd837e62df7a82e2b40b359b2ec1a7b1101","amp;dn":"Reconstructing+Amelia+-+Kimberly+McCreight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26ecccd837e62df7a82e2b40b359b2ec1a7b1101","infoHashBuffer":{"type":"Buffer","data":[38,236,204,216,55,230,45,247,168,46,43,64,179,89,178,236,26,123,17,1]},"announce":[],"urlList":[]}}