{"title":"Ruby Under a Microscope, 2014 [PDF] ~StormRG~","uid":9621641,"size":12477485,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26fcaa051f14d7f388da948a9a1f9c30856fe50f&amp;dn=Ruby+Under+a+Microscope%2C+2014+%5BPDF%5D+%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"steelballz","files":-1,"time":1392507227,"description":"Description\nRuby Under a Microscope: An Illustrated Guide to Ruby Internals\nAuthor: Pat Shaughnessy\nPublished: Nov. 7 2013\nPublisher: No Starch Press; 1 edition\nISBN: 9781593275273\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet.\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\nimage\nCover from actual book file\n\n\nProduct Description\n\nRuby is a powerful programming language with a focus on simplicity, but beneath its elegant syntax it performs countless unseen tasks.\n\nRuby Under a Microscope gives you a hands-on look at Ruby's core, using extensive diagrams and thorough explanations to show you how Ruby is implemented (no C skills required). Author Pat Shaughnessy takes a scientific approach, laying out a series of experiments with Ruby code to take you behind the scenes of how programming languages work. You'll even find information on JRuby and Rubinius (two alternative implementations of Ruby), as well as in-depth explorations of Ruby's garbage collection algorithm.\n\n\nRuby Under a Microscope will teach you:\n\nHow a few computer science concepts underpin Ruby's complex implementation\n\nHow Ruby executes your code using a virtual machine\n\nHow classes and modules are the same inside Ruby\n\nHow Ruby employs algorithms originally developed for Lisp\n\nHow Ruby uses grammar rules to parse and understand your code\n\nHow your Ruby code is translated into a different language by a compiler\n\n\nNo programming language needs to be a black box. Whether you're already intrigued by language implementation or just want to dig deeper into Ruby, you'll find Ruby Under a Microscope a fascinating way to become a better programmer.\n\nCovers Ruby 2.x, 1.9 and 1.8\nAbout the Author\n\nWell known for his coding expertise and passion for the Ruby programming language, Pat Shaughnessy blogs and writes tutorials at https://patshaughnessy.net/. He also develops Ruby applications at management consulting firm McKinsey &amp; Co. Shaughnessy is a regular presenter on the Ruby conference circuit, and his articles and presentations have been featured in the Ruby Weekly newsletter, the Ruby5 podcast, and The Ruby Show.\n\nimage\nScientia est potentia","torrent":{"xt":"urn:btih:26fcaa051f14d7f388da948a9a1f9c30856fe50f","amp;dn":"Ruby+Under+a+Microscope%2C+2014+%5BPDF%5D+%7EStormRG%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26fcaa051f14d7f388da948a9a1f9c30856fe50f","infoHashBuffer":{"type":"Buffer","data":[38,252,170,5,31,20,215,243,136,218,148,138,154,31,156,48,133,111,229,15]},"announce":[],"urlList":[]}}