{"title":"Undocumented Secrets of MATLAB-Java Programming{BBS}","uid":7306549,"size":92770900,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2753c9beab0113754d5e37dc54b25a318c986a5b&amp;dn=Undocumented+Secrets+of+MATLAB-Java+Programming%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1338215549,"description":"For a variety of reasons, the MATLABÂ®-Java interface was never fully documented. This is really quite unfortunate: Java is one of the most widely used programming languages, having many times the number of programmers and programming resources as MATLAB. Also unfortunate is the popular claim that while MATLAB is a fine programming platform for prototyping, it is not suitable for real-world, modern-looking applications. Undocumented Secrets of MATLABÂ®-Java Programming aims to correct this misconception.\n\nThis book shows how using Java can significantly improve MATLAB program appearance and functionality, and that this can be done easily and even without any prior Java knowledge.\n\nReaders are led step-by-step from simple to complex customizations. Code snippets, screenshots, and numerous online references are provided to enable the utilization of this book as both a sequential tutorial and as a random-access reference suited for immediate use. Java-savvy readers will find it easy to tailor code samples for their particular needs; for Java newcomers, an introduction to Java and numerous online references are provided.\n\nThis book demonstrates how\n\n    The MATLAB programming environment relies on Java for numerous tasks, including networking, data-processing algorithms and graphical user-interface (GUI)\n    We can use MATLAB for easy access to external Java functionality, either third-party or user-created\n    Using Java, we can extensively customize the MATLAB environment and application GUI, enabling the creation of visually appealing and usable applications\n\n\n\nHardcover: 701 pages\nPublisher: Chapman and Hall/CRC; 1 edition (December 5, 2011)\nLanguage: English\nISBN-10: 1439869030\nISBN-13: 978-1439869031","torrent":{"xt":"urn:btih:2753c9beab0113754d5e37dc54b25a318c986a5b","amp;dn":"Undocumented+Secrets+of+MATLAB-Java+Programming%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2753c9beab0113754d5e37dc54b25a318c986a5b","infoHashBuffer":{"type":"Buffer","data":[39,83,201,190,171,1,19,117,77,94,55,220,84,178,90,49,140,152,106,91]},"announce":[],"urlList":[]}}