{"title":"Big Night - Soundtrack 1996 Italian Music","uid":9460634,"size":72316366,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2762e74d8b462293b85afb73a22e967188a33ef8&amp;dn=Big+Night+-+Soundtrack+1996+Italian+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1389345991,"description":"Source: 1996 CD\n\n\nBig Night - Music from the Motion Picture OST 320v0 (Big Papi)\n\n\n1. Stornelli Amorisi - Claudio Villa\n\n2. Il Pescivendolo - Matteo Salvatore\n\n3. La Strada Del Bosco - Claudio Villa\n\n4. Art Of Art - Gary DeMichele\n\n5. Oh Marie - Louis Prima\n\n6. Mambo Italiano - Rosemary Clooney\n\n7. Love Of My Life (O Sole Mio) - Louis Prima And Keely Smith With Sam Butera\n\n8. Dinner - Gary DeMichele\n\n9. Tic Ti, Tic Ta - Claudio Villa\n\n10. Five Months, Two Weeks, Two Days - Louis Prima And The Witnesses\n\n11. Don't Take Your Love From Me - Keely Smith\n\n12. Buona Sera - Louis Prima\n\n13. Angular Dissent - Gary DeMichele\n\n14. Mo Ve'la Bella Mia Da La Muntagna - Matteo Salvatore\n\n15. Pascal's Waltz - Gary DeMichele\n\n16. Big Night Theme - Gary DeMichele\n\n\n\ny Victoria\n\nMy husband is a second generation Italian-American and played this CD so much that it started growing on me. Actually, he played the movie from which this sound track was derived until I went nuts and got this CD for him. Although the movie is wonderful until you've seen it more than ten times, then it gets old, this soundtrack is timeless, and all the more so when my husband tells me what it was like growing up in his culture and listening to Louis Prima and other Italian and Italian-American music.\n\nEverything on this CD by Louis Prima is excellent. My favorite track of his is Buona Sera, but I also love the rendition of O Sole Mio with Sam Butera's fantastic saxophone work. Rosemary Clooney's Mambo Italiano is the sort of song that stays in your head even when you wish it would leave. It's delightful, but a tad too catchy. A bit of history: this was a successful hit for her, but she didn't like it, nor did she understand why it became a hit.\n\nClaudio Villa's &quot;Strada del Bosco&quot; (road through the woods) and &quot;Tic-Ti Tic-Ta&quot; are two of my favorite Italian tracks, with &quot;Pescivendolo&quot; (fish monger) a close third. Of course, if you saw the movie, the first track, &quot;Stornelli Amorisi&quot; by Claudio Villa will be immediately recognizable and will stick with you.\n\nI was not keen about the instrumentals (&quot;Art of Art&quot;, &quot;Dinner&quot;, &quot;Pascal's Waltz&quot;, or &quot;Big Night Theme&quot;), but that may be because those tracks were so integrated into the movie that they just didn't sound right on a CD. I was also not too keen about Keely Smith's &quot;Don't Take Your Love from Me&quot;. It just didn't have the same energy as some of the recordings she made on other records with Louis Prima.\nAll in all, this is a well put together set of tracks that capture the very essence of the Italian-American experience of my husband's generation, and that before him. It will also give you an aural reminder of how delightful the movie - The Big Night - was the first time you saw it. And if you haven't seen it, you should\n\n\n\n","torrent":{"xt":"urn:btih:2762e74d8b462293b85afb73a22e967188a33ef8","amp;dn":"Big+Night+-+Soundtrack+1996+Italian+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2762e74d8b462293b85afb73a22e967188a33ef8","infoHashBuffer":{"type":"Buffer","data":[39,98,231,77,139,70,34,147,184,90,251,115,162,46,150,113,136,163,62,248]},"announce":[],"urlList":[]}}