{"title":"Frankie Goes to Hollywood - Welcome to the Pleasuredome (1984)","uid":4380638,"size":61992227,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:277c4c777f7ae45f05638ca1d1597907608f7135&amp;dn=Frankie+Goes+to+Hollywood+-+Welcome+to+the+Pleasuredome+%281984%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"r_monckman","files":16,"time":1220640428,"description":" &lt;a href=&quot;http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:fifwxqy5ldde&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:fifwxqy5ldde&lt;/a&gt;\n\nReview:\n\nStrip away all the hype, controversy, and attendant craziness surrounding Frankie -- most of which never reached American shores, though the equally bombastic &quot;Relax&quot; and &quot;Two Tribes&quot; both charted well -- and Welcome to the Pleasuredome holds up as an outrageously over-the-top, bizarre, but fun release. Less well known but worthwhile cuts include by-definition-camp &quot;Krisco Kisses&quot; and &quot;The Only Star in Heaven,&quot; while U.K. smash &quot;The Power of Love&quot; is a gloriously insincere but still great hyper-ballad with strings from Anne Dudley. In truth, the album's more a testament to Trevor Horn's production skills than anything else. To help out, he roped in a slew of Ian Dury's backing musicians to provide the music, along with a guest appearance from his fellow Yes veteran Steve Howe on acoustic guitar that probably had prog rock fanatics collapsing in apoplexy. The end result was catchy, consciously modern -- almost to a fault -- arena-level synth rock of the early '80s that holds up just fine today, as much an endlessly listenable product of its times as the Chinn/Chapman string of glam rock hits from the early '70s. Certainly the endless series of pronouncements from a Ronald Reagan impersonator throughout automatically date the album while lending it a giddy extra layer of appeal. Even the series of covers on the album at once make no sense and plenty of it all at once. While Edwin Starr's &quot;War&quot; didn't need redoing, Bruce Springsteen's &quot;Born to Run&quot; becomes a ridiculously over-the-top explosion that even outrocks the Boss. As the only member of the band actually doing anything the whole time (Paul Rutherford pipes up on backing vocals here and there), Holly Johnson needs to make a mark and does so with appropriately leering passion. He didn't quite turn out to be the new Freddie Mercury, but he makes a much better claim than most, combining a punk sneer with an ear for hyper-dramatic yelps.\n\nTrack List:\n\n01 - The World Is My Oyster [1:57]\n02 - Welcome to the Pleasuredome [13:38]\n03 - Relax [3:56]\n04 - War [6:12]\n05 - Two Tribes [3:23]\n06 - (Tag) [0:35]\n07 - Fury [1:49]\n08 - Born to Run [3:56]\n09 - San Jose [3:09]\n10 - Wish the Lads Were Here [2:48]\n11 - The Ballad of 32 [4:47]\n12 - Krisco Kisses [2:57]\n13 - Black Night White Light [4:05]\n14 - The Only Star in Heaven [4:16]\n15 - The Power of Love [5:28]\n16 - Bang [1:08]","torrent":{"xt":"urn:btih:277c4c777f7ae45f05638ca1d1597907608f7135","amp;dn":"Frankie+Goes+to+Hollywood+-+Welcome+to+the+Pleasuredome+%281984%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"277c4c777f7ae45f05638ca1d1597907608f7135","infoHashBuffer":{"type":"Buffer","data":[39,124,76,119,127,122,228,95,5,99,140,161,209,89,121,7,96,143,113,53]},"announce":[],"urlList":[]}}