{"title":"Supersuckers - Motherfuckers Be Trippin' (2003) vtwin88cube","uid":6113840,"size":82548197,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2782dd79413da30779eb42cd478a6734c5fe5677&amp;dn=Supersuckers+-+Motherfuckers+Be+Trippin%5C%27+%282003%29+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1295466875,"description":"Supersuckers\nMotherfuckers Be Trippin' (2003)\n\nSomething of an anomaly on the Sub Pop roster, the Supersuckers bore a limited surface resemblance to grunge, but they were a party band at heart, donning cowboy hats and kicking out a gleefully trashy brand of throttling, rockabilly-flavored garage punk. Their lyrics were a raucous, over-the-top celebration of all the attendant evils of rock &amp; roll -- sex, booze, drugs, Satan, and whatever other vices the band could think of, all glorified with tongue planted firmly in cheek. Save for an abrupt and temporary detour into hardcore honky tonk, their approach stayed relatively consistent through the '90s, as did their quality control.\n\nThe Supersuckers were formed in Tucson, AZ, in 1988 by high-school friends Eddie Spaghetti (born Edward Carlyle Daly III, bass, vocals), Ron Heathman (guitar), Dan &quot;Thunder&quot; Bolton (guitar), Dancing Eagle (born Dan Seigal, drums), and Eric Martin (lead vocals). After playing the local scene for about a year under the name the Black Supersuckers (taken from a pornographic novel), the band moved to Seattle, ostensibly in search of a climate more conducive to leather jackets. Martin left the band not long after, and Eddie Spaghetti took his place on lead vocals. Shortening their name to the Supersuckers, the band recorded singles for several indie labels, including eMpTy, Sympathy for the Record Industry, and Lucky; these were collected on the eMpTy compilation The Songs All Sound the Same, which became the band's first CD release in 1992. That year, they signed to Sub Pop and issued their proper debut album, The Smoke of Hell, which was produced by Jack Endino and featured cover art by renowned comic artist Daniel Clowes. Featuring one of the band's best-known songs in &quot;Coattail Rider,&quot; the record also spun off the single &quot;Hell City, Hell,&quot; whose B-side was a fan-favorite cover of Ice Cube's &quot;Dead Homiez.&quot; \n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\n\nFormat:\t\t\tMp3\nGenre:\t\t\tRock\t\t\nM3U Playlist:\t\tYes\n\nThe Supersuckers are the only band in the world that could release an album called Motherfuckers Be Trippin' without sounding hokey or just plain ridiculous. In fact, it sounds kind of cool. Of course, this is possible only because the Supersuckers, and able leader Eddie Spaghetti, don't take themselves too seriously. However, what they do take seriously is rockin' out-- and that's something that they're still doing quite well 13 years into their career.\n\nAlbum opener &quot;Rock-n-Roll Records (Ain't Sellin' This Year)&quot; is classic Supersuckers. Big riffs informed by years of binging on Thin Lizzy and Motorhead albums pull the listeners in as Spaghetti tells the truth about how much it sucks to be a band out there busting ass to make good records and put on rocking shows only to watch as worthless 3rd rate bands go platinum. Ever the optimist, in the end Spaghetti decides to stick to his guns and keep rockin' his way--which sets the tone for the rest of the album quite well. This album sounds like a Supersuckers album, and it will never be mistaken for anything else (especially not any lame flavor-of-the-week) and they wouldn't have it any other way.\n\n01.Rock-N-Roll Records (Ain't Selling This Year) [Explicit]\n02.Rock Your Ass  [Explicit]\n03.Pretty Fucked Up  [Explicit]\n04.The Fight Song  [Explicit]\n05.Bruises To Prove It  [Explicit]\n06.Bubblegum And Beer  [Explicit]\n07.Sleepy Vampire  [Explicit]\n08.A Good Night For My Drinkin'  [Explicit]\n09.Damn My Soul  [Explicit]\n10.Someday I Will Kill You  [Explicit]\n11.The Nowhere Special  [Explicit]\n12.Goodbye  [Explicit]\n\n\nCheers!\n","torrent":{"xt":"urn:btih:2782dd79413da30779eb42cd478a6734c5fe5677","amp;dn":"Supersuckers+-+Motherfuckers+Be+Trippin%5C%27+%282003%29+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2782dd79413da30779eb42cd478a6734c5fe5677","infoHashBuffer":{"type":"Buffer","data":[39,130,221,121,65,61,163,7,121,235,66,205,71,138,103,52,197,254,86,119]},"announce":[],"urlList":[]}}