{"title":"[-MomTeachSex-] Alli Rae, India Summer [-Use What You Got-] --NE","uid":12103416,"size":386076548,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:27a658681b731fb0594e6c0a197cac57b28f1f3d&amp;dn=%5B-MomTeachSex-%5D+Alli+Rae%2C+India+Summer+%5B-Use+What+You+Got-%5D+--NE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":9,"uploader":"Upl0ad3rR","files":1,"time":1436390729,"description":"[-MomTeachSex-] Alli Rae, India Summer [-Use What You Got-] --NEW-- 08-July-2015\n\n---:More From My Torrent's Here:---   &lt;a href=&quot;\nhttps://thepiratebay.se/user/Upl0ad3rR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/Upl0ad3rR&lt;/a&gt;\n\n---:ScreeNshotS:---  &lt;a href=&quot;\nhttp://imgfresh.com/image/9409.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfresh.com/image/9409.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgfresh.com/image/9410.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfresh.com/image/9410.html&lt;/a&gt;\n\nJessy Jones is enjoying some time to himself when his stepmom India Summer walks in on him masturbating to loud porn. When India tries to talk about it, Jessy confesses his concerns about whether size matters and his ability to please his girlfriend Alli Rae. After a bit of discussion, India suggests that maybe Jessy needs to build up his stamina and then offers to give him some insight on his penis size.\n\nIt turns out that Jessy is quite well endowed, and India is in the midst of giving him advice how to use it when Alli arrives! Watching India suck off her boyfriend's cock gets Alli all kinds of turned on, and the two girls decide to work together to help Jessy increase his confidence and get over his problem of cumming too fast.\n\nThe girls put on quite a show for Jessy, with India sucking on Alli's small tits before they both race to get naked. Then it's all about Jessy as the girls take turns wrapping their soft warm lips around his cock for a dual-blowjob. India makes sure to plant her creamy snatch in Jessy's face, making it clear that he should be eating her out while she and Alli go to town on his stiffie.\n\nWhen India switches things up and slides down on Jessy's cock so that he impales her juicy twat, Alli can't contain her excitement. She buries her face between India's legs, licking India's clit with long wet strokes of her tongue while Jessy thrusts.\n\nNext it's Alli's turn to get fucked, and she slides onto her boyfriend's dick with a big smile. Her cowgirl position lets her set the pace and the penetration, which India encourages to help with Jessy's little problem.\n\nWhen Alli gets tired of being on top, she climbs on top of India so that the girls present Jessy with a pussy double stack. Jessy gets to choose who to fuck and how hard, making it easy for him to ensure that both girls have climaxed before he pulls out to jizz all over Alli's smooth soft back","torrent":{"xt":"urn:btih:27a658681b731fb0594e6c0a197cac57b28f1f3d","amp;dn":"%5B-MomTeachSex-%5D+Alli+Rae%2C+India+Summer+%5B-Use+What+You+Got-%5D+--NE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27a658681b731fb0594e6c0a197cac57b28f1f3d","infoHashBuffer":{"type":"Buffer","data":[39,166,88,104,27,115,31,176,89,78,108,10,25,124,172,87,178,143,31,61]},"announce":[],"urlList":[]}}