{"title":"Mating Intelligence Unleashed (2013) ","uid":10662907,"size":16835482,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2800dd22dc0d5491cd6f9d5ae16cf2548891bed7&amp;dn=Mating+Intelligence+Unleashed+%282013%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1406749595,"description":"Title: Mating Intelligence Unleashed - The Role of the Mind in Sex, Dating, and Love \nAuthors: Helen E. Fisher, Glenn Geher, Scott Barry Kaufman\nCategory: Academic/Sexuality/Psychology\nPublisher: Oxford University Press; 1 edition (January 30, 2013)\nLanguage: English\nISBN-10: 0195396855\nISBN-13: 978-0195396850\n\nPromotional info/Publisher's summary - &quot;Psychologists often paint a picture of human mating as visceral, instinctual. But that's not the whole story. In courtship and display, sexual competition and rivalry, we are also guided by what Glenn Geher and Scott Barry Kaufman call Mating Intelligence--a range of mental abilities that have evolved to help us find the right partner. Mating Intelligence is at work in our efforts to form, maintain, and end relationships. It guides us in flirtation, foreplay, copulation, finding and choosing a mate, and many other behaviors.\n\nIn Mating Intelligence Unleashed, psychologists Geher and Kaufman take readers on a fascinating tour of the crossroads of mating and intelligence, drawing on cutting-edge research on evolutionary psychology, intelligence, creativity, personality, social psychology, neuroscience, and more. The authors show that despite what you may read in the latest issue of Maxim, Playboy, Vogue, or GQ, physical attractiveness isn't the whole story. Human mating draws on a range of mental skills and attributes--from the creative use of pick-up lines, to displays of charisma, intelligence, humor, personality, and compassion. Along the way, the authors shed new light on age-old questions, such as: What role does personality play in mating? Which traits are attractive--and which traits repulse? How do people really choose mates? How do men and women deceive each other? How important is emotional intelligence? Why do people create art--and does it have anything to do with sex? Do nice guys really finish last? \n\nSince Glenn Geher coined the term Mating Intelligence in 2006, it has drawn a great deal of media attention, ranging from a Psychology Today cover story to articles in the New Scientist, the Washington Times, the Huffington Post, and elsewhere. Now, in Mating Intelligence Unleashed, readers will have the first full account of this revolutionary new approach to dating, mating, and love.&quot;\n\nReviews:\n&quot;Mating Intelligence Unleashed: The Role of the Mind in Sex, Dating, and Love, by psychologists Glenn Geher and Scott Barry Kaufman, is a compendium of cutting-edge research into what makes people tick, romantically and sexually.&quot; -New York Post \n\n&quot;Recommended to readers interested in evolutionary psychology and human sexuality.&quot; - Library Journal \n\nThis torrent contains the original retail EPUB as well as conversions into MOBI, AZW3, LIT, and large print PDF formats done in Calibre. The front cover image and generated metadata.opf file are also included. Please seed, and enjoy.\n","torrent":{"xt":"urn:btih:2800dd22dc0d5491cd6f9d5ae16cf2548891bed7","amp;dn":"Mating+Intelligence+Unleashed+%282013%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2800dd22dc0d5491cd6f9d5ae16cf2548891bed7","infoHashBuffer":{"type":"Buffer","data":[40,0,221,34,220,13,84,145,205,111,157,90,225,108,242,84,136,145,190,215]},"announce":[],"urlList":[]}}