{"title":"State-Sponsored Terrorism, Crimes, and Lies - Collection 17 (Isr","uid":10641616,"size":104665974,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2802783ef67b633046d5d5493488894d0831e7ad&amp;dn=State-Sponsored+Terrorism%2C+Crimes%2C+and+Lies+-+Collection+17+%28Isr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"moman73","files":34,"time":1406467837,"description":"State-Sponsored Terrorism, Crimes, and Lies - Collection 17 (Israel 4):\n\nAt the time of this upload, Gaza war (version 2014) is entering its 3rd week. It seems that every several years Israel's thirst for blood makes here start a round of destruction and killing on the defenseless people in Gaza. This time the war started because Israel accused the people in Gaza of killing 3 Israeli settlers, even though Gaza is under siege, and the killing took place hundreds of miles north of Gaza in an area that is under the control of Israeli security.\n\nAnyway, so far the war has claimed more than 1100 dead and 6000 injured among the Gazans, most of them women and children, and the displacement of hundreds of thousands as a result to the wide destruction to their homes, schools, mosques, hospitals, ..\n\nWe have 34 titles here:\n\n-  Abunimah - The Battle for Justice in Palestine (2014)\n\n-  Amnesty Int - Occupied Territory Under the Rubble (2004)\n\n-  Amnesty Int. - Starved of Justice; Palestinians Detained Without Trial by Israel (2012)\n\n-  Amnesty Int. - Trigger-Happy; Israel's Use of Excessive Force in the West Bank (2014)\n\n-  Bishara - Back Stories; U.S. News Production &amp; Palestinian Politics (2013)\n\n-  Davis - Palestinian Village Histories; Geographies of the Displaced (2011)\n\n-  Davis &amp; Kirk (Eds.) - Palestine and the Palestinians in the 21st Century (2013)\n\n-  Drummond - Unthinkable Thoughts; Academic Freedom and the One-State Model for Israel and Palestine (2013)\n\n-  Einstein Letter to New York Times, Dec 2, 1948\n\n-  Finkelstein - Goldstone Recants; Richard Goldstone Renews Israel's License to Kill (2011)\n\n-  Freedman - Zionism; the Hidden Tyranny\n\n-  Gilbert - The Routledge Atlas of the Arab-Israeli Conflict, 8e (2005)\n\n-  Great Britain Colonial Office - Palestine; Termination of the Mandate 15th May, 1948\n\n-  Hoffman &amp; Critchley - The Truth about the Talmud; a Documented Expose of Jewish Supremacist Hate Literature (2008)\n\n-  Jews for Justice in the Middle East - The Origin of the Palestine-Israel Conflict\n\n-  John - Behind the Balfour Declaration; Britain's Great War Pledge to Lord Rothschild, The Journal of Historical Review, Vol. 6, No. 4 (Winter, 1985-6)\n\n-  Kumaraswamy - Historical Dictionary of the Arab-Israeli Conflict (2006)\n\n-  Laqueur - A History of Zionism (2003)\n\n-  LeVine - Impossible Peace; Israel &amp; Palestine since 1989 (2009)\n\n-  Mills - Census of Palestine 1931; Population of Villages, Towns and Administrative Areas (1932)\n\n-  Myre &amp; Griffin - This Burning Land; Lessons from the Front Lines of the Transformed Israeli-Palestinian Conflict (2010)\n\n-  Palestinian Child  Prisoners; the Systematic and Institutionalised Ill-Treatment and Torture of Palestinian Children by Israeli Authorities (2009)\n\n-  Roosevelt - Partition of Palestine; a Lesson in Pressure Politics (1948)\n\n-  Sayegh - The Palestinian Refugees (1952)\n\n-  Shahak - Jewish History, Jewish Religion; the Weight of Three Thousand Years (2008)\n\n-  Shahak - The Zionist Plan for the Middle East (1982)\n\n-  Shahak &amp; Mezvinsky - Jewish Fundamentalism in Israel (1999)\n\n-  Simons - A Historical Survey of Proposals to Transfer Arabs from Palestine, 1895-1947 (2004)\n\n-  The Angryindian - When Victims Become Victimisers; Zionism's Angry Xenophobic War Against Itself and the Rest of the World (2010)\n\n-  The Arab National League - Whither Palestine; a Statement of Facts and of Causes of the Arab-Jewish Conflict in the Holy Land\n\n-  The Goldstone Report, Human Rights in Palestine and Other Occupied Arab Territories; Report of the UN Fact-Finding Mission on the Gaza Conflict (2009)\n\n-  The Zionist Organisation - Great Britain, Palestine and the Jews; Jewry's Celebration of Its National Charter (1918)\n\n-  Wright - The Great Zionist Cover-up; a Study and Interpretation (1975)\n\n-  Zertal - From Catastrophe to Power; Holocaust Survivors and the Emergence of Israel (1998)\n\n\n","torrent":{"xt":"urn:btih:2802783ef67b633046d5d5493488894d0831e7ad","amp;dn":"State-Sponsored+Terrorism%2C+Crimes%2C+and+Lies+-+Collection+17+%28Isr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2802783ef67b633046d5d5493488894d0831e7ad","infoHashBuffer":{"type":"Buffer","data":[40,2,120,62,246,123,99,48,70,213,213,73,52,136,137,77,8,49,231,173]},"announce":[],"urlList":[]}}