{"title":"Nile Rodgers Presents - The Chic Organization (Box Set Vol. 1 '","uid":6573082,"size":670188437,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:283f2831a5388d05354818504c0cc8a8b5c35f75&amp;dn=Nile+Rodgers+Presents+-+The+Chic+Organization+%28Box+Set+Vol.+1+%5C%27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":null,"files":-1,"time":1312057905,"description":"Chic: Profile and Biography\n\nThere can be little argument that Chic was disco's greatest band; and, working in a\nheavily producer-dominated field, they were most definitely a band. By the time Chic\nappeared in the late '70s, disco was already slipping into the excess that eventually\ncaused its downfall. Chic bucked the trend by stripping disco's sound down to its\nbasic elements; their funky, stylish grooves had an organic sense of interplay that\nwas missing from many of their overproduced competitors. Chic's sound was anchored\nby the scratchy, James Brown-style rhythm guitar of Nile Rodgers and the indelible,\nwidely imitated (sometimes outright stolen) bass lines of Bernard Edwards; as producers,\nthey used keyboard and string embellishments economically, which kept the emphasis on\nrhythm. Chic's distinctive approach not only resulted in some of the finest dance singles of\ntheir time, but also helped create a template for urban funk, dance-pop, and even hip-hop\nin the post-disco era. Not coincidentally, Rodgers and Edwards wound up as two of the most\nsuccessful producers of the '80s.\n\nRodgers and Edwards first met in 1970, when both were jazz-trained musicians fresh out of\nhigh school. Edwards had attended New York's High School for the Performing Arts and was\nworking in a Bronx post office at the time, while Rodgers' early career also included stints in\nthe folk group New World Rising and the Apollo Theater house orchestra. Around 1972,\nRodgers and Edwards formed a jazz-rock fusion group called the Big Apple Band. This outfit\nmoonlighted as a backup band, touring behind smooth soul vocal group New York City in the\nwake of their 1973 hit &quot;I'm Doin' Fine Now.&quot; After New York City broke up, the Big Apple Band\nhit the road with Carol Douglas for a few months, and Rodgers and Edwards decided to make\na go of it on their own toward the end of 1976. At first they switched their aspirations from\nfusion to new wave, briefly performing as Allah &amp; the Knife Wielding Punks, but quickly settled\ninto dance music. They enlisted onetime LaBelle drummer Tony Thompson and female vocalists\nNorma Jean Wright and Alfa Anderson, and changed their name to Chic in summer\n1977 so as to avoid confusion with Walter Murphy &amp; the Big Apple Band\n(who'd just hit big with &quot;A Fifth of Beethoven&quot;).\n\nAugmented in the studio by keyboardists Raymond Jones and Rob Sabino, Chic recorded\nthe demo single &quot;Dance, Dance, Dance (Yowsah, Yowsah, Yowsah)&quot; and shopped it around\nto several major record companies, all of which declined it. The small Buddah label finally\nreleased it as a 12&quot; in late 1977, and as its club popularity exploded, Atlantic stepped in,\nsigned the group, and re-released the single on a wider basis. &quot;Dance, Dance, Dance&quot;\nhit the Top Ten, peaking at number six, and made Chic one of the hottest new groups in disco.\nChic scrambled to put together their self-titled first album, which spawned a minor follow-up hit,\n&quot;Everybody Dance,&quot; in early 1978. At this point, Wright left to try her hand at a solo career\n(with assistance from Rodgers and Edwards), and was replaced by Luci Martin.\nIt was a good time to come onboard; &quot;Le Freak,&quot; the first single from sophomore album\nC'est Chic, was an out-of-the-box smash, spending five weeks on top of the charts toward\nthe end of 1978 and selling over four-million copies (which made it the biggest-selling single\nin Atlantic's history). Follow-up &quot;I Want Your Love&quot; reached number seven, cementing the\ngroup's new star status, and C'est Chic became one of the rare disco albums to go platinum.\n\n1979's RisquÃƒÂ© was another solidly constructed LP that also went platinum, partly on the\nstrength of Chic's second number one pop hit, &quot;Good Times.&quot; &quot;Good Times&quot; may not have\nequaled the blockbuster sales figures of &quot;Le Freak,&quot; but it was the band's most imitated track:\nQueen's number one hit &quot;Another One Bites the Dust&quot; was a clear rewrite, and the Sugarhill\nGang lifted the instrumental backing track wholesale for the first commercial rap single,\n&quot;Rapper's Delight,&quot; marking the first of many times that Chic grooves would be recycled\ninto hip-hop records. Also in 1979, Rodgers and Edwards took on their first major outside\nproduction assignment, producing and writing the Sister Sledge smashes &quot;We Are Family&quot;\nand the oft-sampled &quot;He's the Greatest Dancer.&quot; This success, in turn, landed them the chance\nto work with Diana Ross on 1980's Diana album, and they wrote and produced &quot;Upside Down,&quot;\nher first number one hit in years, as well as &quot;I'm Coming Out.&quot;\n\nThe disco fad was fading rapidly by that point, however, and 1980's Real People failed to go\ngold despite another solid performance by the band. Changing tastes put an end to Chic's heyday,\nas Rodgers and Edwards' outside production work soon grew far more lucrative, even despite\naborted projects with Aretha Franklin and Johnny Mathis. Several more Chic LPs followed in the\nearly '80s, with diminishing creative and commercial returns, and Rodgers and Edwards disbanded\nthe group after completing the lackluster Believer in 1983. Later that year, both recorded solo LPs\nthat sank without a trace. Hungry for acceptance and respect in the rock mainstream (especially after\naccusations that they had ripped off Queen instead of the other way around), both Rodgers and\nEdwards sought out high-profile production and session work over the rest of the decade. Rodgers\nproduced blockbuster albums like David Bowie's Let's Dance, Madonna's Like a Virgin, and\nMick Jagger's She's the Boss. Edwards wasn't as prolific as a producer, but did join the one-off\nsupergroup the Power Station along with Tony Thompson as well as Robert Palmer and members\nof avowed Chic fans Duran Duran; he later produced Palmer's commercial breakthrough, Riptide.\nEdwards also worked with Rod Stewart (Out of Order), Jody Watley, and Tina Turner, while Rodgers'\nother credits include the Thompson Twins, the Vaughan Brothers, INXS,\nand the B-52's' comeback Cosmic Thing.\n\nRodgers and Edwards re-formed Chic in 1992 with new vocalists Sylver Logan Sharp and\nJenn Thomas, and an assortment of session drummers in Thompson's place; they toured and\nreleased a new album, Chic-ism. In 1996, the reconstituted Chic embarked on a tour of Japan;\nsadly, on April 18, Edwards passed away in his Tokyo hotel room due to a severe bout of pneumonia.\nRodgers continued to tour occasionally with a version of Chic, and, in 1999, his Sumthing Else label\nissued a recording of Edwards' final performance with the band, Live at the Budokan.\n\n\n\n\n\nBox Set Review (c/o Amazon)\n\nIn preparation for over 10 years, but now it's finally here. The offically Chic box set,\nteasingly titled 'volume 1', lives quite easily up to its anticipations it gathered over\nthe last decade. To be more precise; this box set is a dream come true. 4 cd's jam-packed\nwith all the glorious stuff that mrs Edward &amp; Rodgers released upon us from the late 70's\nuntill the early 80's. They are all here in excellent mastered quality and all in their most\nstriking form, appearing at 12&quot; or at album lenght. Mr Rodgers also has thrown in some\nsuprises; unreleased tracks by Fonzi Thornton and Chic, unreleased long version of tracks\nby Norma Jean and Fonzi Thornton and some studio outtakes. All excellent stuff.\n\nAn even bigger treat in this box set, are 5 exclusive remixes by Dimitri from Paris.\nHaving access to the original multi-tracks Dimitri works his magic on Norma Jean's\n'Saturday night' (a 10 minute 'goose- bumping' symphony), Chic's 'I want your love'\nand later days 'I feel your love coming on' and Sister Sledges 'Thinking of you' and\n'Lost in music' (where Kathy Sledges vocal ad libs at the end of the original, appear\nas new vocals in this version; quite brilliant!).And then there are 3 tracks from the\n-as yet- unreleased Johnny Mathis album.\n\nStrangely, this box set is not released internationally(as it most certainly deserves),\nbut only domestically in France. The emphasis on this box set is purely on the music,\nas it should. It is the compilation to end all previous compilations. It's a masterpiece. Period!\n\n\n\n\n\n---------------------------------------------------------------------\nThe Chic Organization - Box Set Vol. 1 / 'Savoir Faire'\n---------------------------------------------------------------------\n\nArtist...................: The Chic Organization\nAlbum......: Box Set Vol. 1 / 'Savoir Faire'\nGenre..............................................: Disco\nSource.................................................: CD\nYear...................................................: 2010\n\nRipper..: Exact Audio Copy V1.0 b1 &amp; HP DVD RW AD-7701H\n\nCodec................................................: LAME 3.98\nVersion....................................: MPEG 1 Layer III\nQuality..............: Insane, (avg. bitrate: 320kbps)\nChannels................................: Stereo / 44100 hz\nTags...................: ID3 v1.1, ID3 v2.3, APE v2,000\nInformation..........: 4 x CD Compilation Box Set\n\nRipped by............: BSW on 7/27/2011\nPosted by............: BSW on 7/27/2011\nNews Server....: news.astraweb.com\n\nNews Group(s)..: alt.binaries.sounds.mp3.metal.full.albums\n\nIncluded............: NFO, SFV, M3U, LOG\nCovers.........................................: Front\n\n\n\n\n\n---------------------------------------------------------------------\nTracklisting - Disc 1\n---------------------------------------------------------------------\n\n\n   1. Chic - Everybody Dance (12' Mix)                             [08:26]\n   2. Norma Jean - Saturday (Dimitri From Paris Remix)             [09:47]\n   3. Chic - Dance, Dance, Dance (Yowsah, Yowsah, Yowsah) (12' Mix)[08:20]\n   4. Chic - Est-Ce Que C'Est Chic                                 [03:53]\n   5. Norma Jean - Sorcerer (12' Mix)                              [07:11]\n   6. Chic - Chic Cheer                                            [04:43]\n   7. Chic - Le Freak                                              [05:28]\n   8. Chic - Savoir Faire                                          [05:01]\n   9. Chic - Happy Man                                             [04:25]\n  10. Chic - At Last I Am Free                                     [07:08]\n  11. Chic - Funny Bone (Previously Unreleased Outtake)            [03:29]\n\n\nPlaying Time.......: 01:07:57\nTotal Size..........: 157.14 MB\n\n\n\n\n\n---------------------------------------------------------------------\nTracklisting - Disc 2\n---------------------------------------------------------------------\n\n\n   1. Chic - I Want Your Love (Dimitri From Paris Remix)                      [08:33]\n   2. Sister Sledge - He's The Greatest Dancer                                [06:14]\n   3. Sister Sledge - We Are Family                                           [08:20]\n   4. Sister Sledge - Lost In Music (Dimitri From Paris Remix)                [07:51]\n   5. Sister Sledge - Thinking Of You (Dimitri From Paris Remix)              [06:29]\n   6. Chic - Good Times                                                       [08:10]\n   7. Chic - My Feet Keep Dancing                                             [06:38]\n   8. Chic - My Forbidden Lover (12' Mix)                                     [06:24]\n   9. Sheila &amp; B. Devotion - Spacer                                           [05:55]\n  10. Norma Jean - Hold Me Lonely Boy (Previously Unreleased Long Version)    [05:16]\n  11. Sheila &amp; B. Devotion - Your Love Is Good (Previously Unreleased Outtake)[02:43]\n\n\nPlaying Time.......: 01:12:38\nTotal Size..........: 167.84 MB\n\n\n\n\n\n---------------------------------------------------------------------\nTracklisting - Disc 3\n---------------------------------------------------------------------\n\n\n   1. Norma Jean - High Society (12' Version)                         [06:06]\n   2. Sister Sledge - Got To Love Somebody                            [06:52]\n   3. Sister Sledge - Reach Your Peak (12' Mix)                       [05:25]\n   4. Chic - Rebels We Are                                            [04:55]\n   5. Chic - Chip Off The Old Block                                   [05:00]\n   6. Diana Ross - Upside Down (Original Chic Mix)                    [04:14]\n   7. Diana Ross - I'm Coming Out (Original Chic Mix)                 [05:59]\n   8. Chic - Stage Fright                                             [03:56]\n   9. Chic - Burn Hard                                                [05:00]\n  10. Debbie Harry - Backfired (12' Version)                          [06:20]\n  11. Fonzi Thornton - I Work For A Living (Nile Rodgers Long Version)[07:03]\n  12. Chic - What About Me (Previously Unreleased Outtake)            [02:47]\n\n\nPlaying Time.......: 01:03:42\nTotal Size..........: 147.56 MB\n\n\n\n\n\n---------------------------------------------------------------------\nTracklisting - Disc 4\n---------------------------------------------------------------------\n\n\n   1. Carly Simon - Why (12' Mix)                                              [08:10]\n   2. Teddy Pendergrass - Dream Girl (Previously Unreleased Nile Rodgers Remix)[04:20]\n   3. Chic - Soup For One (12' Mix)                                            [07:56]\n   4. Fonzi Thornton - I'll Change My Game feat. Chic (Previously Unreleased)  [06:17]\n   5. Chic - Hangin'                                                           [05:13]\n   6. Chic - I Feel Your Love Comin' On (Dimitri From Paris Remix)             [08:16]\n   7. Chic - You Are Beautiful                                                 [04:34]\n   8. Johnny Mathis - I Want To Fall In Love (Previously Unreleased)           [05:55]\n   9. Johnny Mathis - It's Alright To Love Me (Previously Unreleased)          [04:14]\n  10. Johnny Mathis - Something To Sing About (Previously Unreleased)          [04:09]\n  11. Chic - Just Call Me (Previously Unreleased)                              [04:52]\n  12. Chic - Will You Cry (Previously Unreleased Outtake)                      [07:50]\n\n\nPlaying Time.......: 01:11:52\nTotal Size..........: 166.23 MB\n\nNFO generated on.....: 7/27/2011 7:04:32 PM\n\n\n---------------------------------------------------------------------\nCat No: 5249827895\n---------------------------------------------------------------------\n\n:: Generated by Music NFO Builder v1.21a - www.nfobuilder.com ::","torrent":{"xt":"urn:btih:283f2831a5388d05354818504c0cc8a8b5c35f75","amp;dn":"Nile+Rodgers+Presents+-+The+Chic+Organization+%28Box+Set+Vol.+1+%5C%27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"283f2831a5388d05354818504c0cc8a8b5c35f75","infoHashBuffer":{"type":"Buffer","data":[40,63,40,49,165,56,141,5,53,72,24,80,76,12,200,168,181,195,95,117]},"announce":[],"urlList":[]}}