{"title":"The Dead Witness - A Connoisseur's Collection Of Victorian Detec","uid":9576518,"size":614338,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:286b1ac398ccf00619f8f8d895e67c7041ac28f1&amp;dn=The+Dead+Witness+-+A+Connoisseur%27s+Collection+Of+Victorian+Detec&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1391708735,"description":"The greatest ever anthology of Victorian detective stories, The Dead Witness gathers the finest police and private detective adventure stories from the nineteenth and early twentieth centuries, including a wide range of overlooked gems.\n\n'The Dead Witness', the 1866 title story by Australian writer Mary Fortune, is the first known detective story by a woman, a suspenseful clue-strewn manhunt in the Outback. This forgotten treasure sets the tone for the whole anthology as surprises appear from every direction, including more female detectives and authors than you can find in any other anthology of its kind. Pioneer women writers such as Anna Katharine Green and C. L. Pirkis take you from rural America to bustling London, introducing you to female detectives from Loveday Brooke to Dorcas Dene and Violet Strange.\n\nIn other stories, you will meet November Joe, the Canadian half-Native backwoods detective who stars in 'The Crime at Big Tree Portage' and demonstrates that Sherlockian attention to detail works as well in the woods as in the city. Holmes himself is here, too, of course - not in another reprint though - but in the first two chapters of A Study in Scarlet, the first Holmes case, in which the great man meets and dazzles Watson. Authors range from luminaries such as Charles Dickens to the forgotten author who helped inspire Edgar Allan Poe's 'The Murders in the Rue Morgue', the first real detective story. Bret Harte is here as is Mark Twain, with his small-town lawyer detective. Naturally Wilkie Collins couldn't be left behind.\n\nMichael Sims's new collection reveals the fascinating and entertaining youth of what would mature into the most popular genre of the twentieth century.","torrent":{"xt":"urn:btih:286b1ac398ccf00619f8f8d895e67c7041ac28f1","amp;dn":"The+Dead+Witness+-+A+Connoisseur%27s+Collection+Of+Victorian+Detec","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"286b1ac398ccf00619f8f8d895e67c7041ac28f1","infoHashBuffer":{"type":"Buffer","data":[40,107,26,195,152,204,240,6,25,248,248,216,149,230,124,112,65,172,40,241]},"announce":[],"urlList":[]}}