{"title":"Structural Elements for Architects and Builders - (Malestrom)","uid":5901217,"size":5801483,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:287c2485e7b33c0cfe7e69f38bc0fc6b48c611c0&amp;dn=Structural+Elements+for+Architects+and+Builders+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1287678426,"description":"Jonathan Ochshorn, &quot;Structural Elements for Architects and Builders: Design of columns, beams, and tension elements in wood, steel, and reinforced concrete&quot;\nBH | 2009 | ISBN: 1856177718 | 400 pages | PDF \n\nConcise but comprehensive, Structural Elements for Architects and Builders is primarily focused on the design and analysis of structural elements: columns, beams, tension members and their connections. The material is organized into a single, self-sufficient volume, including all necessary data for the preliminary design and analysis of these structural elements in wood, steel, and reinforced concrete.\n\nEvery chapter contains insights developed by the author and generally not found elsewhere. Additionally, the Appendices included at the end of the text contain numerous tables and graphs, based on material contained in industry publications, but reorganized and formatted especially for this text to improve clarity and simplicity, without sacrificing comprehensiveness.\n\nBased on the standards and codes from For timber: The American Institute of Timber Construction's (AITC), The American Institute of Steel Construction's (AISC) The American Concrete Institute's (ACI) Building Code Requirements for Structural Concrete and Commentary (ACI 318 and ACI 318R)and the American Society of Civil Engineers\nContains graphs, charts, and tables to solve basic structural design problems\nStep-by-step illustrative examples\nCover common connectors such as nails, bolts, and welds ","torrent":{"xt":"urn:btih:287c2485e7b33c0cfe7e69f38bc0fc6b48c611c0","amp;dn":"Structural+Elements+for+Architects+and+Builders+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"287c2485e7b33c0cfe7e69f38bc0fc6b48c611c0","infoHashBuffer":{"type":"Buffer","data":[40,124,36,133,231,179,60,12,254,126,105,243,139,192,252,107,72,198,17,192]},"announce":[],"urlList":[]}}