{"title":"The Gun Digest Book of Exploded Gun Drawings - (Malestrom)","uid":5135383,"size":47544221,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:288d60e7142d2964f84427e3e6f385cad9308da8&amp;dn=The+Gun+Digest+Book+of+Exploded+Gun+Drawings+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1256434371,"description":"ht tp://i37.tiny pic.com/243ncc5.jpg\n\nThe Gun Digest Book of Exploded Gun Drawings, By Harold A. Murtz\nPublisher: KP Books 2005 | 1034 Pages | ISBN: 0896891410 | PDF \n\nTaking pictures during disassemble of a firearm with a digital camera can help jog the memory at a later date for reassembly, but sometimes things happen too quickly and unexpectedly to capture the essentials. One minute you're pushing on a little spring loaded widget under a forward barrel band, the next minute you're holding the barrel, six ball bearings and seven of the tiniest springs you've ever seen through your 7x magnifying nerd visor. A good set of exploded drawings, assembly drawings, can really save the day.\n\n The Gun DigestÃ‚Â® Book of Exploded Gun Drawings has done a good job of avoiding both of these limitations. A count of nine hundred and seventy five isometric views means lots of rifle, shotgun and handgun coverage. Some firearms represent older historical pieces, some are new, some are military, some civilian, some are domestic, some originated on foreign soil. I was able to locate all of my firearms, handgun, rifle, shotgun, and milsurp with the exception of Mosin-Nagant models and my CVA muzzle loader. My Thompson Center original Contender model is covered, but not the Encore and or new generation Contender. In all fairness, the author makes no claim to cover all guns, but he does come close to touching upon what most people might encounter.\n\nIf there are weak spots in the book they are minor. The index is a bit odd in arranging model listings. Under U.S. you will find the M-1 Garand and carbine, as well as the M-14. If you want to look at the M-16 drawings you will find it under Mitchell Arms along with the AK-47. The Model 1903 is listed under Springfield. This only means that a little mixed logic searching is sometimes required to find a listing. Still, if you are the owner of even a Zouave, Laurona, Madsen, or Rigarmi you are pretty much covered. The line drawings in 99% of the cases are consistent in arrangement and style. In a handful of cases the drawings are a little thick lined, and the representation of the assembled firearm is a photograph or photo realistic illustration. Even in those cases the drawings are easy to read and cover the detail of arrangement of every piece part with clarity.\n\nA great reference book, a useful tool and an excellent value. ","torrent":{"xt":"urn:btih:288d60e7142d2964f84427e3e6f385cad9308da8","amp;dn":"The+Gun+Digest+Book+of+Exploded+Gun+Drawings+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"288d60e7142d2964f84427e3e6f385cad9308da8","infoHashBuffer":{"type":"Buffer","data":[40,141,96,231,20,45,41,100,248,68,39,227,230,243,133,202,217,48,141,168]},"announce":[],"urlList":[]}}