{"title":"Heat Transfer Applications for the Practicing Engineer","uid":12000647,"size":3242491,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2898aeb995dfb4383ae8cc728a33b802a3cf6213&amp;dn=Heat+Transfer+Applications+for+the+Practicing+Engineer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"clouderone","files":1,"time":1433773781,"description":"ISBN 9780470643723\n\nThis book serves as a training tool for individuals in industry and academia involved with heat transfer applications. Although the literature is inundated with texts emphasizing theory and theoretical derivations, the goal of this book is to present the subject of heat transfer from a strictly pragmatic point of view.\nThe book is divided into four Parts: Introduction, Principles, Equipment Design Procedures and Applications, and ABET-related Topics. The first Part provides a series of chapters concerned with introductory topics that are required when solving most engineering problems, including those in heat transfer. The second Part of the book is concerned with heat transfer principles. Topics that receive treatment include Steady-state Heat Conduction, Unsteady-state Heat Conduction, Forced Convection, Free Convection, Radiation, Boiling and Condensation, and Cryogenics. Part three (considered the heart of the book) addresses heat transfer equipment design procedures and applications. In addition to providing a detailed treatment of the various types of heat exchangers, this part also examines the impact of entropy calculations on exchanger design, and operation, maintenance and inspection (OM&amp;I), plus refractory and insulation effects. The concluding Part of the text examines ABET (Accreditation Board for Engineering and Technology) related topics of concern, including economies and finance, numerical methods, open-ended problems, ethics, environmental management, and safety and accident management","torrent":{"xt":"urn:btih:2898aeb995dfb4383ae8cc728a33b802a3cf6213","amp;dn":"Heat+Transfer+Applications+for+the+Practicing+Engineer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2898aeb995dfb4383ae8cc728a33b802a3cf6213","infoHashBuffer":{"type":"Buffer","data":[40,152,174,185,149,223,180,56,58,232,204,114,138,51,184,2,163,207,98,19]},"announce":[],"urlList":[]}}