{"title":"Bob Dylan - Bootleg Series Vol.10. Another Self Portrait [2CD] (","uid":9991979,"size":701699960,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:28a59547ea0fecfb319b8764c89ffda4916c5e88&amp;dn=Bob+Dylan+-+Bootleg+Series+Vol.10.+Another+Self+Portrait+%5B2CD%5D+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"pucholoco","files":-1,"time":1397861209,"description":"Bob Dylan - The Bootleg Series,Vol. 10.Another Self Portrait(1969-1971)[2CD](2013) \n              EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 684 Mb \n                     Full Artwork @ 300 dpi (jpg) -&gt; 19 Mb \n\n\nAnother Self Portrait, the tenth volume in Bob Dylan's official bootleg series, assembles a slew of unreleased tracks, un-and over-dubbed alternate takes, and demos, mostly from 1970's Self Portrait and New Morning sessions -- they were recorded simultaneously and released within months of one another -- and other material. Dylan restlessly dug into the fakebook of folk, blues, and country tunes that nourished him from the beginning. The few original songs are minor ones. Twenty-six of these 35 selections were recorded between March and June. Dylan is in fine voice and he tries on many: some raspy, others crystal clear, all of them bold. The interconnected nature of these albums is revealed with the opening demo for &quot;Went to See the Gypsy&quot; (used on NM). It's just Dylan and guitarist David Bromberg. (Another take recorded three months later features just Dylan on electric piano).\n\n\nThere are two undubbed takes of &quot;Little Sadie&quot; at different tempos; two of &quot;Time Passes Slowly&quot; -- the first a basic folk-rock read, the latter an aggressive one with Al Kooper's B-3 swelling to a crescendo from the jump. Dylan and Bromberg, with Kooper on piano, deliver a haunted, undubbed &quot;Days of 49.&quot; Many of the unreleased tunes are gems. &quot;Little Saro&quot; -- with Dylan in his cleanest Nashville Skyline croon displaying a real range -- and the vocal and piano read of &quot;Spanish Is the Loving Tongue&quot; are deeply moving love songs. &quot;House Carpenter&quot; is a high lonesome blues. The skeletal &quot;Alberta #3&quot; puts the versions from SP to shame. Eric Anderson's &quot;Thirsty Boots&quot; has Bromberg's spidery guitar weaving a separate lyric through Dylan's vocal. A demo of &quot;When I Paint My Masterpiece&quot; from 1971, contains slightly different (better) lyrics. The stripped-down &quot;Copper Kettle&quot; stands out when contrasted with its released version. Dylan was impatiently experimenting with arrangements on both records, particularly the latter, and some don't work. &quot;If Not for You&quot; features a violin instead of George Harrison's guitar. The unreleased &quot;Working on a Guru&quot; is almost a throwaway, but Harrison's blues-rock guitar playing smokes. The alternate &quot;New Morning,&quot; with a brassy, Stax-style horn arrangement, is great, but the full orchestral overdub on &quot;Sign on a Window&quot; -- complete with harp -- fails, as does the spoken word with female gospel backing chorus on &quot;If Dogs Run Free.&quot; Arguably, of the NM material, Dylan made the right choices for the finished album, which doesn't make what's here less interesting. The remainder of these tracks includes &quot;Minstrel Boy,&quot; an unreleased Basement Tapes number, and two tunes from the Isle of Wight with the Band, some alternates of Nashville Skyline, and others from 1971. Another Self Portrait asks many questions, but there is one that hounds because it's unanswerable, especially in regard to its namesake: why did Dylan record all this material, in this way, and then release something entirely different? It doesn't matter. For fans, this is more than a curiosity, it's an indispensable addition to the catalog.\n\n\n-----------------------------------------------------------------------------------\nTracklist:\n-----------------------------------------------------------------------------------\n\nCD1\n01. Went To See The Gypsy (demo)\n02. In Search Of Little Sadie (without overdubs, Self Portrait)\n03. Pretty Saro (unreleased, Self Portrait)\n04. Alberta #3 (alternate version, Self Portrait)\n05. Spanish Is The Loving Tongue (unreleased, Self Portrait)\n06. Annie's Going To Sing Her Song (unreleased, Self Portrait)\n07. Time Passes Slowly #1 (alternate version, New Morning)\n08. Only A Hobo (unreleased, Greatest Hits II)\n09. Minstrel Boy (unreleased, The Basement Tapes)\n10. I Threw It All Away (alternate version, Nashville Skyline)\n11. Railroad Bill (unreleased, Self Portrait)\n12. Thirsty Boots (unreleased, Self Portrait)\n13. This Evening So Soon (unreleased, Self Portrait)\n14. These Hands (unreleased, Self Portrait)\n15. Little Sadie (without overdubs, Self Portrait)\n16. House Carpenter (unreleased, Self Portrait)\n17. All The Tired Horses (without overdubs, Self Portrait)\n\nCD2\n01. If Not For You (alternate version, New Morning)\n02. Wallflower (alternate version, 1971)\n03. Wigwam (original version without overdubs, Self Portrait)\n04. Days Of '49 (original version without overdubs, Self Portrait)\n05. Working On A Guru (unreleased, New Morning)\n06. Country Pie (alternate version, Nashville Skyline)\n07. I'll Be Your Baby Tonight (Live With The Band, Isle Of Wight 1969)\n08. Highway 61 Revisited (Live With The Band, Isle Of Wight 1969)\n09. Copper Kettle (without overdubs, Self Portrait)\n10. Bring Me A Little Water (unreleased, New Morning)\n11. Sign On The Window (with orchestral overdubs, New Morning)\n12. Tattle O'Day (unreleased, Self Portrait)\n13. If Dogs Run Free (alternate version, New Morning)\n14. New Morning (with horn section overdubs, New Morning)\n15. Went To See The Gypsy (alternate version, New Morning)\n16. Belle Isle (without overdubs, Self Portrait)\n17. Time Passes Slowly #2 (alternate version, New Morning)\n18. When I Paint My Masterpiece (demo)\n\n*2013 Columbia / Legacy / Sony Music | CKA/B - 373488\n\n\n\n\nBob Dylan &amp; The Grateful Dead - Dylan &amp; The Dead (1987) [EAC-FLAC]:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8958547/Bob_Dylan__amp__The_Grateful_Dead_-_Dylan__amp__The_Dead_(1987)_&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8958547/Bob_Dylan__amp__The_Grateful_Dead_-_Dylan__amp__The_Dead_(1987)_&lt;/a&gt;\n\n\n\nBob Dylan - In Concert - Brandeis University 1963 (2011) [EAC-FLAC]:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8947073/Bob_Dylan_-_In_Concert_-_Brandeis_University_1963_(2011)__[EAC-F&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8947073/Bob_Dylan_-_In_Concert_-_Brandeis_University_1963_(2011)__[EAC-F&lt;/a&gt;\n\n\n\n\nEnjoy, SEED and SHARING... Thanks!\n\n\n\n","torrent":{"xt":"urn:btih:28a59547ea0fecfb319b8764c89ffda4916c5e88","amp;dn":"Bob+Dylan+-+Bootleg+Series+Vol.10.+Another+Self+Portrait+%5B2CD%5D+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28a59547ea0fecfb319b8764c89ffda4916c5e88","infoHashBuffer":{"type":"Buffer","data":[40,165,149,71,234,15,236,251,49,155,135,100,200,159,253,164,145,108,94,136]},"announce":[],"urlList":[]}}