{"title":"American photography - A Century of Images (Art Ebook).pdf","uid":10128316,"size":25693908,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2971679b9b35809e15536e2828c50d8e68d3e7fc&amp;dn=American+photography+-+A+Century+of+Images+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"STBGD","files":-1,"time":1399807144,"description":"1999 / pdf / 24.5 MB / English / Chronicle Books / 228 pag\n\nThis companion volume to the marvelous PBS series contends that the still photograph has played a strong role not only in capturing our history but in shaping it. Ranging form Weegee to Warhol, the book shoots with a wide-angle lens, covering the standard pictures used repeatedly in numerous compilations as well as family snapshots, glamour and advertising photos, art and science images, and press pics form the Graflex gods of yore and today's digital image makers. The editors credit the advancement of photography of all kinds to the debut of LIFE magazine; unlike the pictures in previous publication, those in LIFE didn't simply buttress the stories, they often were the stories. The book also describes how the use of photography influenced public opinion, form the man on the street to the man in the White House. The text is excellent, but the pictures speak for themselves and there are shots here that capture history (Bob Capa's GIs in the bloody surf of Omaha Beach) and evoke emotion (Dorothea Lange's heartbreaking portraits of Depression-era poor) better than words possibly could. Recommended.","torrent":{"xt":"urn:btih:2971679b9b35809e15536e2828c50d8e68d3e7fc","amp;dn":"American+photography+-+A+Century+of+Images+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2971679b9b35809e15536e2828c50d8e68d3e7fc","infoHashBuffer":{"type":"Buffer","data":[41,113,103,155,155,53,128,158,21,83,110,40,40,197,13,142,104,211,231,252]},"announce":[],"urlList":[]}}