{"title":"AI RoboForm v7.9.21.5 Enterprise","uid":15692524,"size":17665116,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2983283fb9d3a23d81a25f5662279b50d3f1265c&amp;dn=AI+RoboForm+v7.9.21.5+Enterprise&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"LxByte","files":1,"time":1472419084,"description":"AI RoboForm v7.9.21.5 Enterprise\r\n\r\nVersion 7.9.21 -- Aug 25, 2016\r\n* Form Filler: throw more JS events, to better emulate user form filling in IE, Chrome, Firefox.\r\n* Form Filler: the above fixes form filling at Microsoft account, Apple, Wells Fargo.\r\n* Firefox, Chrome: make RoboForm filler work in Strict JS mode.\r\n* Internet Explrer, Windows 10 Anniversary: make RF fill the new Basic Authentication dialog.\r\n* Firefox: Fix a rare crash during JS callback.\r\n* Firefox: Fix RF extension does not work if Multiprocess mode (aka Electrolysis).\r\n* Firefox: Fix RF saves wrong URL on\n* Firefox: Fix RoboForm does not fill local file pages in Firefox.\r\n* Firefox: Fix RoboForm add-on for FF does not load in Pale Moon.\r\n* RoboForm2Go + Firefox: make it work in Firefox ver 43.\r\n* Login menus: fix incorrect layout in toolbar menus. \r\n\r\nMake Your Life Easier with the Top Rated\r\nPassword Manager\r\nYou'll never need to remember or type\r\nyour passwords again - all for Free.\r\n\r\nPassword Manager\r\nRoboForm remembers your passwords so you don't have to! Just remember your one Master Password and RoboForm remembers the rest- it's that easy! Our bookmark-style Logins automatically log you in to your favorite websites with one click.\r\n\r\nEverywhere\r\nWhether it's on your PC, Mac, phone, tablet, or even USB drive, RoboForm Password Manager gives you secure access to your passwords wherever you go! One license works on all of your devices. You can be confident knowing that our advanced syncing technology always keeps each device up to date.\r\n\r\nSecurity\r\nRoboForm's industry-leading encryption technology securely stores your passwords, with one Master Password serving as your encryption key. Your Master Password is not stored on our servers and you're the only one that knows it, so be sure you don't forget it! Plus, as an extra layer of security, we have multifactor options available.\r\n\r\nForm Filler\r\nDo you shop online? Wouldn't it be great to fill out those long forms instantly? With RoboForm, it's just one click and you're done.\r\n\r\nOfficial Website: http://www.roboform.com/","torrent":{"xt":"urn:btih:2983283fb9d3a23d81a25f5662279b50d3f1265c","amp;dn":"AI+RoboForm+v7.9.21.5+Enterprise","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2983283fb9d3a23d81a25f5662279b50d3f1265c","infoHashBuffer":{"type":"Buffer","data":[41,131,40,63,185,211,162,61,129,162,95,86,98,39,155,80,211,241,38,92]},"announce":[],"urlList":[]}}