{"title":"Lonely Planet Pocket - Dublin - 3rd Edition (2016).epub Gooner","uid":14745566,"size":4316967,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29b31a124bd92949d686fdd5e7255fdaade10f26&amp;dn=Lonely+Planet+Pocket+-+Dublin+-+3rd+Edition+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1464722322,"description":"Lonely Planet Pocket - Dublin (Travel Guide) - 3rd Edition (2016).epub Gooner\r\n\r\nPublisher: Lonely Planet; 3 edition (12 Feb. 2016)\r\nLanguage: English\r\nISBN-10: 1741799406\r\nISBN-13: 978-1741799408\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet Pocket Dublin is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Stroll through the Elizabethan academe of Trinity College, sample a pint of black gold at Guinness Storehouse and explore Dublin Castle; all with your trusted travel companion. Get to the heart of the best of Dublin and begin your journey now!\r\n\r\nInside Lonely Planet Pocket Dublin:\r\n\r\n* Full-colour maps and images throughout\r\n\r\n* Highlights and itineraries help you tailor your trip to your personal needs and interests\r\n\r\n* Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\r\n\r\n* Honest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss\r\n\r\n* Free, convenient pull-out Dublin map (included in print version), plus 15 colour neighbourhood maps\r\n\r\n* User-friendly layout with helpful icons, and organised by neighbourhood to help you pick the best spots to spend your time\r\n\r\n* Covers Grafton St, Merrion Square, Temple Bar, Kilmainham and the Liberties, North of the Liffey, Docklands and more\r\n\r\nThe Perfect Choice: Lonely Planet Pocket Dublin, a colorful, easy-to-use and handy guide that literally fits in your pocket, provides on-the-go assistance for those seeking only the can't-miss experiences to maximise a quick-trip experience.\r\n\r\n* Looking for a comprehensive guide that recommends both popular and offbeat experiences, and extensively covers all of Dublin's neighbourhoods? Check out Lonely Planet Dublin guide.\r\n\r\n* Looking for more extensive coverage? Check out Lonely Planet Ireland guide for a comprehensive look at all the country has to offer.\r\nAuthors: Written and researched by Lonely Planet.\r\n\r\nAbout Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveller community. Lonely Planet covers must-see spots but also enables curious travellers to get off beaten paths to understand more of the culture of the places in which they find themselves","torrent":{"xt":"urn:btih:29b31a124bd92949d686fdd5e7255fdaade10f26","amp;dn":"Lonely+Planet+Pocket+-+Dublin+-+3rd+Edition+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29b31a124bd92949d686fdd5e7255fdaade10f26","infoHashBuffer":{"type":"Buffer","data":[41,179,26,18,75,217,41,73,214,134,253,213,231,37,95,218,173,225,15,38]},"announce":[],"urlList":[]}}