{"title":"Federico Salvatore - Discography 1989-2004 [Mp3 VBR] TNT Village","uid":6445674,"size":645036441,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2a2c16489f765348535a28b2c7ae5df468952b28&amp;dn=Federico+Salvatore+-+Discography+1989-2004+%5BMp3+VBR%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"l.diliberto","files":166,"time":1307280873,"description":"Federico Salvatore - Discography 1989-2004 [Mp3 VBR] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=64854&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=64854&lt;/a&gt;\n\nFederico Salvatore was born in Naples in 1959. He began playing guitar at 8 years as an autodidact. Despite being left-handed does not reverse the order of the strings of the guitar, but studies by reversing the method, namely the manual on the guitar as representing the position of the fingers. During adolescence, he joined the musical groups that are born and die within weeks. In 1980 is the &quot;giuriscoraggio&quot; to leave the university at the second-year law, with the desperation of parents who wanted a lawyer, to throw himself into the world of entertainment as cantattore. Committed artist and author of all his texts, Federico Salvatore, unlike many other artists who have departed from Naples, fighting its own war for his city 'with biting irony and delicate poetry, alternating touching moments in hilarious moments, estimated in all extremely balanced. With that pretty face to go unpunished and the name (real) that seems invented, Federico Salvatore began his career working for the theater. Following starts to cover popular songs, with lyrics adapted funny. But also writes his songs, allowing them to create a regional distribution of the album. The career of the famous person starts winning the &quot;Promoval Bravo Grazie!&quot; 1994, which allowed him to participate in the TV show &quot;Maurizio Costanzo Show&quot;, where he began to propose to his original micro dramatized dialogue between Naples and the Neapolitan noble poor, raising the enthusiasm of the audience and enjoyed the attention of viewers. It happened later, in 1995, the encounter between the Savior and the famous Florentine producer Giancarlo Bigazzi (part of the squalor, the band loved by Federico). 1995 was his golden year, the public record &quot;Azz&quot;, which reached a staggering 500,000 copies sold, followed by the album &quot;Il mago di Azz&quot; with attached book, which reaches 200,000 copies sold, the same year he was a regular guest at Festivalbar Sanremo in 1996 and holds a wonderful song by the committed, &quot;Sulla porta&quot;, but it is not understood by juries and only ends the thirteenth, but the album containing this piece, &quot;Il coyote interrotto&quot; , is once again sample sales. Following a period of neglect from the scene, except for some occasional appearance, as on some regional transmission in Campania (Avanzi people, Pirates), or in broadcasts such as the Festival of Naples, where in 2001 bravely sings &quot;Se io fossi San Gennaro&quot; an all-out attack against those who want to spy on the evil of Naples, without even having his back covered by a label, showing great courage, of course, the piece attracted many criticisms, and the subsequent album, &quot;L'osceno del villaggio&quot;, was almost banned from the market\n\nNato a Napoli, inizia a suonare la chitarra da autodidatta all'etÃƒÂ  di 8 anni. Mancino naturale, non inverte l'ordine delle corde sulla tastiera, come si fa di solito, bensÃƒÂ¬ la posizione delle dita. Lascia gli studi di giurisprudenza dopo due anni, con sommo dispiacere dei genitori che volevano che diventasse un avvocato, per dedicarsi alla carriera di cantautore. Fa le sue prime apparizioni in teatro, dove si esibisce riadattando testi divertenti su musica di canzoni famose. La notorietÃƒÂ  arriva nel 1994 quando vince il concorso BravoGrazie, che gli permette di partecipare alla trasmissione televisiva Maurizio Costanzo Show. Grazie alle numerosissime presenze in questa trasmissione ottiene enorme successo: i suoi album Azz... e Il mago di Azz vendono piÃƒÂ¹ di 500 mila copie, permettendo al cantautore partenopeo di vincere due dischi di platino nel 1995. Federico salvatore nasce a Napoli nel 1959. Inizia a suonare la chitarra ad 8 anni come autodidatta. Pur essendo mancino non inverte l'ordine delle corde della chitarra ma studia invertendo il metodo, cioÃƒÂ¨ il manuale di chitarra sul quale sono rappresentate le posizioni delle dita. Durante l'adolescenza entra a far parte di gruppi musicali che nascono e muoiono nel giro di settimane. Nel 1980 trova il &quot;giuriscoraggio&quot; di lasciare gli studi universitari al secondo anno di giurisprudenza, con la disperazione dei genitori che lo volevano avvocato, per buttarsi nel mondo dello spettacolo come cantattore. Artista impegnato e autore di tutti i suoi testi, Federico Salvatore, al contrario di tanti altri artisti che si sono allontanati da Napoli, combatte la propria guerra per la sua citta' con ironia graffiante e con delicata poesia, alternando momenti commoventi a momenti esilaranti, tutto dosato in modo estremamente equilibrato. Con quella bella faccia da impunito ed il nome (vero) che sembra inventato, Federico Salvatore comincia la sua carriera lavorando per il teatro. In seguito comincia a fare cover di canzoni famose, adattandole con testi divertenti. Scrive perÃƒÂ² anche canzoni sue, riuscendo cosÃƒÂ¬ a creare degli album a diffusione regionale. La carriera da personaggio famoso la comincia vincendo il &quot;Promoval Bravo Grazie!&quot; del 1994 che gli permise di partecipare alla trasmissione televisiva &quot;Maurizio Costanzo Show&quot;, dove cominciÃƒÂ² a proporre le sue originali micro sceneggiate a dialogo fra il partenopeo nobile ed il napoletano povero, suscitando il divertito entusiasmo del pubblico e l'attenzione dei telespettatori. Avvenne in seguito, nel 1995, l'incontro fra Salvatore e il noto produttore fiorentino Giancarlo Bigazzi (componente degli Squallor, band amata da Federico). Il 1995 ÃƒÂ¨ il suo anno d'oro,pubblica il disco &quot;Azz&quot;, che raggiunge l'incredibile cifra di 500000 copie vendute,seguito dall'album &quot;Il mago di Azz&quot; con annesso libro,che raggiunge le 200000 copie vendute;lo stesso anno ÃƒÂ¨ ospite fisso al Festivalbar e a Sanremo nel 1996 partecipa con una splendida canzone dal testo impegnato,&quot;Sulla porta&quot;,che perÃƒÂ² non viene compresa dalle giurie e finisce solo tredicesima;l'album contenente questo pezzo perÃƒÂ²,&quot;Il coyote interrotto&quot;,ÃƒÂ¨ ancora una volta campione di vendite. Segue un periodo di abbandono dalle scene,salvo qualche saltuaria apparizione,come su qualche trasmissione regionale in Campania (Avanzi popolo,I pirati),oppure in trasmissioni quali il Festival di Napoli,dove nel 2001 canta coraggiosamente &quot;Se io fossi San Gennaro&quot;,un attacco a tutto spiano contro coloro che vogliono il male di Napoli,senza nemmeno avere le spalle coperte da una casa discografica,dimostrando grande coraggio;naturalmente il pezzo attira su di sÃƒÂ¨ tantissime critiche,e l'album susseguente,&quot;L'osceno del villaggio&quot;,viene quasi bandito dal mercato \n\n.: Federico Salvatore :.\n &lt;a href=&quot;\nhttp://img159.imageshack.us/img159/4314/eeeeeeeehf2.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img159.imageshack.us/img159/4314/eeeeeeeehf2.png&lt;/a&gt;\n\n.: Albums :.\n\n1989 - Na tazzulella 'e ca.. baret\n1990 - Pappagalli lat(r)ini\n1991 - Incidente al Vomero\n1993 - Storie di un sottosviluppato... sviluppato sotto!!!\n1994 - Superfederico\n1995 - Azz...\n1996 - Il mago di Azz\n1997 - Coiote interrotto\n2000 - L'azz 'e bastone\n2002 - L'osceno del villaggio\n2004 - Cabarettombola\n2004 - Dov'ÃƒÂ¨ l'individuo?","torrent":{"xt":"urn:btih:2a2c16489f765348535a28b2c7ae5df468952b28","amp;dn":"Federico+Salvatore+-+Discography+1989-2004+%5BMp3+VBR%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a2c16489f765348535a28b2c7ae5df468952b28","infoHashBuffer":{"type":"Buffer","data":[42,44,22,72,159,118,83,72,83,90,40,178,199,174,93,244,104,149,43,40]},"announce":[],"urlList":[]}}