{"title":"Elvis Presley, A Southern Life [PDF] [StormRG]","uid":11424626,"size":1246529,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a4bc295b031de9f667cdb0bcfa52c381b1bd68b&amp;dn=Elvis+Presley%2C+A+Southern+Life+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"krystine","files":-1,"time":1415646549,"description":"Elvis Presley: A Southern Life\nAuthor: Joel Williamson\nPublished: 2014\nPublisher: Oxford University Press \nISBN: 9780199863174\nFormat: Retail PDF\n\n\n\nIn Elvis Presley: A Southern Life, one of the most admired Southern historians of our time takes on one of the greatest cultural icons of all time. The result is a masterpiece: a vivid, gripping biography, set against the rich backdrop of Southern society--indeed, American society--in the second half of the twentieth century. \n\nAuthor of The Crucible of Race and William Faulkner and Southern History, Joel Williamson is a renowned historian known for his inimitable and compelling narrative style. In this tour de force biography, he captures the drama of Presley's career set against the popular culture of the post-World War II South. Born in Tupelo, Mississippi, Presley was a contradiction, flamboyant in pegged black pants with pink stripes, yet soft-spoken, respectfully courting a decent girl from church. Then he wandered into Sun Records, and everything changed. &quot;I was scared stiff,&quot; Elvis recalled about his first time performing on stage. &quot;Everyone was hollering and I didn't know what they were hollering at.&quot; Girls did the hollering--at his snarl and swagger. Williamson calls it &quot;the revolution of the Elvis girls.&quot; His fans lived in an intense moment, this generation raised by their mothers while their fathers were away at war, whose lives were transformed by an exodus from the countryside to Southern cities, a postwar culture of consumption, and a striving for upward mobility. They came of age in the era of the 1954 Brown vs. Board of Education ruling, which turned high schools into battlegrounds of race. Explosively, white girls went wild for a white man inspired by and singing black music while &quot;wiggling&quot; erotically. Elvis, Williamson argues, gave his female fans an opportunity to break free from straitlaced Southern society and express themselves sexually, if only for a few hours at a time.\n\nRather than focusing on Elvis's music and the music industry, Elvis Presley: A Southern Life illuminates the zenith of his career, his period of deepest creativity, which captured a legion of fans and kept them fervently loyal for decades. Williamson shows how Elvis himself changed--and didn't. In the latter part of his career, when he performed regular gigs in Las Vegas and toured second-tier cities, he moved beyond the South to a national audience who had bought his albums and watched his movies. Yet the makeup of his fan base did not substantially change, nor did Elvis himself ever move up the Southern class ladder despite his wealth. Even as he aged and his life was cut short, he maintained his iconic status, becoming arguably larger in death than in life as droves of fans continue to pay homage to him at Graceland.\n\nAppreciative and unsparing, culturally attuned and socially revealing, Williamson's Elvis Presley will deepen our understanding of the man and his times","torrent":{"xt":"urn:btih:2a4bc295b031de9f667cdb0bcfa52c381b1bd68b","amp;dn":"Elvis+Presley%2C+A+Southern+Life+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a4bc295b031de9f667cdb0bcfa52c381b1bd68b","infoHashBuffer":{"type":"Buffer","data":[42,75,194,149,176,49,222,159,102,124,219,11,207,165,44,56,27,27,214,139]},"announce":[],"urlList":[]}}