{"title":"Mariah Carey - Merry Christmas + Merry Christmas II You","uid":5959320,"size":170700354,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2ae3f8f12163eb10c5d02a036c2ccf308d3d663a&amp;dn=Mariah+Carey+-+Merry+Christmas+%2B+Merry+Christmas+II+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"piratetorrent1989","files":24,"time":1289893502,"description":"It's getting close to Christmas again already....\n\nAnyway, though that somebody should bundle these 2 albums together in a torrent ;)\n\nMerry Christmas is a holiday album and fourth studio album by American singer Mariah Carey. Released by Columbia Records on November 1, 1994, the album features both cover versions of popular Christmas tunes, including some original material. On the album, Carey worked with Walter Afanasieff, with whom she wrote all of the original tracks, as well as producing Carey's interpretations of many holiday classics. With the release of Merry Christmas, Carey proved herself to be an entertainer, not just a pop-singer, as many began to speculate. The album contained a contemporary holiday theme, as well as featuring &quot;authentic, gospel flavored background vocals.&quot;\n\nThe album features instrumentation from keyboards, bass guitars, drums, percussion and heavy backing vocals. The main reason for the album's use of these instruments was to capture a &quot;real and authentic church vibe,&quot; giving most of the songs a real Christmas and holiday sound. After its release, the album received generally positive reviews and became a worldwide success. Critics praised Carey's uplifting and flavored vocals, as well as her skilled songwriting alongside Afanasieff. Many singles were released from the album, being sent to different radio stations for promotional purposes.\n\nMerry Christmas was released at the peak of the initial stretch of Carey's career, between Music Box (1993) and Daydream (1995). The album produced the worldwide classic single, &quot;All I Want for Christmas Is You,&quot; which became the best-selling holiday ringtone in the U.S. The album was certified five-times platinum by the Recording Industry Association of America (RIAA) for shipments of over five million copies in the U.S. In Japan, Merry Christmas has sold over 2,500,000 copies and is the second best-selling album of all time by a non-Asian artist, behind only Carey's other release Number 1's. Merry Christmas has sold over twelve million copies worldwide and is one of the best-selling Christmas albums of all time.\n\nTrack listing\nNo. \tTitle \tWriter(s) \tProducer(s) \tLength\n1. \t&quot;Silent Night&quot;   \tFr. Josef Mohr, Franz X. Gruber \tMariah Carey, Walter Afanasieff \t3:41\n2. \t&quot;All I Want for Christmas Is You&quot;   \tM. Carey, W. Afanasieff \tM. Carey, W. Afanasieff \t4:01\n3. \t&quot;O Holy Night&quot;   \tAdolphe Adam \tM. Carey, Loris Holland \t4:27\n4. \t&quot;Christmas (Baby Please Come Home)&quot;   \tJeff Barry, Ellie Greenwich, Phil Spector \tM. Carey, W. Afanasieff \t2:35\n5. \t&quot;Miss You Most (At Christmas Time)&quot;   \tM. Carey, W. Afanasieff \tM. Carey, W. Afanasieff \t4:32\n6. \t&quot;Joy to the World&quot;   \tGeorge Frideric Handel, Lowell Mason, Isaac Watts \tM. Carey, W. Afanasieff \t4:21\n7. \t&quot;Jesus Born on This Day&quot;   \tM. Carey, W. Afanasieff \tM. Carey, L. Holland \t3:43\n8. \t&quot;Santa Claus Is Comin' to Town&quot;   \tJohn Frederick Coots, Haven Gillespie \tM. Carey, W. Afanasieff \t3:24\n9. \t&quot;Hark! The Herald Angels Sing&quot; / &quot;Gloria in Excelsis Deo&quot;   \tCharles Wesley, Felix Mendelssohn \tM. Carey, L. Holland \t3:01\n10. \t&quot;Jesus Oh What a Wonderful Child&quot;   \tTraditional \tM. Carey, W. Afanasieff \t4:26\n11. \t&quot;God Rest Ye Merry, Gentlemen&quot;   \tTraditional \tM. Carey, W. Afanasieff \t1:18\n\n----------------------------------------------\n\nMerry Christmas II You is the thirteenth studio album and second Christmas album by American singer Mariah Carey. The album was released on October 29, 2010 and features four original songs, all-time Christmas classics and a re-recorded version of her 1994 Christmas hit &quot;All I Want for Christmas Is You&quot;.\n\nTrack listing\n\n    * Merry Christmas II You CD\n\nNo. \tTitle \tWriter(s) \tProducer(s) \tLength\n1. \t&quot;Santa Claus Is Coming to Town&quot; (Intro) \tJ. Fred Coots, Haven Gillespie \tMariah Carey, Marc Shaiman \t0:23\n2. \t&quot;Oh Santa!&quot;   \tCarey, Bryan Michael Cox, Jermaine Dupri \tCarey, Cox, Dupri \t3:31\n3. \t&quot;O Little Town of Bethlehem&quot; / &quot;Little Drummer Boy&quot; (Medley) \tPhillips Brooks, Lewis H. Redner, Katherine K. Davis, Henry Onorati, Harry Simeone \tCarey, James Wright, Randy Jackson \t3:32\n4. \t&quot;Christmas Time Is in the Air Again&quot;   \tCarey, Shaiman \tCarey, Shaiman \t3:02\n5. \t&quot;The First Noel&quot; / &quot;Born is the King&quot; (Interlude) \tTraditional \tCarey, Wright, Jackson \t4:33\n6. \t&quot;When Christmas Comes&quot;   \tCarey, James Poyser \tCarey, Poyser \t4:46\n7. \t&quot;Here Comes Santa Claus (Right Down Santa Claus Lane)&quot; / &quot;Housetop Celebration&quot;   \tGene Autry, Oakley Haldeman, Benjamin Hanby \tCarey, Cox, Dupri \t3:28\n8. \t&quot;Charlie Brown Christmas&quot;   \tVince Guaraldi, Lee Mendelson \tCarey, Wright, Jackson \t2:49\n9. \t&quot;O Come All Ye Faithful&quot; / &quot;Hallelujah Chorus&quot; (featuring Patricia Carey) \tJohn Francis Wade, George Frideric Handel \tCarey, Wright, Jackson \t3:38\n10. \t&quot;O Holy Night&quot; (Live from WPC in South Central Los Angeles) \tAdolphe Adam \tCarey, Walter Afanasieff \t5:00\n11. \t&quot;One Child&quot;   \tCarey, Shaiman \tCarey, Shaiman \t4:26\n12. \t&quot;All I Want for Christmas Is You&quot; (Extra Festive) \tCarey, Afanasieff \tCarey, Wright, Jackson \t4:02\n13. \t&quot;Auld Lang Syne&quot; (The New Year's Anthem) \tRobert Burns \tCarey, Jackson, Johnny Severin \t3:48","torrent":{"xt":"urn:btih:2ae3f8f12163eb10c5d02a036c2ccf308d3d663a","amp;dn":"Mariah+Carey+-+Merry+Christmas+%2B+Merry+Christmas+II+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ae3f8f12163eb10c5d02a036c2ccf308d3d663a","infoHashBuffer":{"type":"Buffer","data":[42,227,248,241,33,99,235,16,197,208,42,3,108,44,207,48,141,61,102,58]},"announce":[],"urlList":[]}}