{"title":"Where the Iron Crosses Grow: The Crimea 1941-44 ","uid":11163425,"size":15260208,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2af6a360e7b68ec94033accb57d71373be5287ef&amp;dn=Where+the+Iron+Crosses+Grow%3A+The+Crimea+1941-44+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1412595101,"description":"Where the Iron Crosses Grow: The Crimea 1941-44 \nby Robert Forczyk\n\nDESCRIPTION:\n\nNazi and Soviet armies fought over the Crimean Peninsula for three long years using sieges, dozens of amphibious landings, and large scale maneuvers. This definitive English-language work on the savage battle for the Crimea, Where the Iron Crosses Grow sheds new light on this vital aspect of the Eastern Front.\n\nThe Crimea was one of the crucibles of the war on the Eastern Front, where first a Soviet and then a German army were surrounded, fought desperate battles and were eventually destroyed. The fighting in the region was unusual for the Eastern Front in many ways, in that naval supply, amphibious landings and naval evacuation played major roles, while both sides were also conducting ethnic cleansing as part of their strategy - the Germans eliminating the Jews and the Soviets to purging the region of Tartars.\n\nFrom 1941, when the first Soviets first created the Sevastopol fortified region, the Crimea was a focal point of the war in the East. German forces under the noted commander Manstein conquered the area in 1941-42, which was followed by two years of brutal colonization and occupation before the Soviet counteroffensive in 1944 destroyed the German 17th Army.","torrent":{"xt":"urn:btih:2af6a360e7b68ec94033accb57d71373be5287ef","amp;dn":"Where+the+Iron+Crosses+Grow%3A+The+Crimea+1941-44+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2af6a360e7b68ec94033accb57d71373be5287ef","infoHashBuffer":{"type":"Buffer","data":[42,246,163,96,231,182,142,201,64,51,172,203,87,215,19,115,190,82,135,239]},"announce":[],"urlList":[]}}