{"title":"Danish Radio Big Band and Eivor Palsdottir - Trollabundin 2005","uid":6894799,"size":391706386,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2b0cc1d4fab4566393dd2f827471a3bcc8cea42f&amp;dn=Danish+Radio+Big+Band+and+Eivor+Palsdottir+-+Trollabundin+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"barber9","files":-1,"time":1324156558,"description":"EivÃƒÂ¸r Palsdottir (born 21 July 1983 in SydrugÃƒÂ¸ta, Faroe Islands) is a Faroese singer/songwriter with a distinct voice and a wide range of interests in many kinds of music from rock, jazz, folk, pop, to European classical music. Her roots are in the Faroese ballads. (wikipedia)\n\n- - -\n\nEivÃƒÂ¸r Palsdottir    \n\nAt an age of 13 she gave her first performance on Faroese television and won a national song contest in the same year.\n    In 1999, when EivÃƒÂ¸r was 15, she quit school and started performing professionally with rock band Clickhaze and jazz quartet Ivory. When she was not touring or practicing with either of those bands she could usually be found singing with the old purveyors of traditional styles, trying to learn all the melodies, rhymes and stories.\n    In 2000 her first album EivÃƒÂ¸r Palsdottir, was released: a mixture of traditional Faroese ballads and new songs written by EivÃƒÂ¸r and her band, and performed with a folky and jazzy feel.\n    In 2001 EivÃƒÂ¸r and her other band Clickhaze won the national Faroese band contest Prix Foroyar.\n    In 2002, EivÃƒÂ¸r left the Faroes in favor of ReykjavÃƒÂ­k, Iceland to study singing (classical and jazz). At that time she also joined ethno/world/jazz group Yggdrasil, lead by composer and music guru behind the Faroese TUTL label Kristian Blak. She released an album with the group later that year.\n    2002 also saw the release of a rock album with Clickhaze and more touring with the band in the Faroes, Sweden, Denmark, Iceland and Greenland.\n    2003 was the year of her second solo album. Krakan, which won the nomination for an Icelandic Music Award in three categories. Eivor was awarded Best Singer and Best Performer in Iceland, 2003.\n    In 2004 EivÃƒÂ¸r performed concerts with the Faroese Symphony Orchestra and sang solo in Kristian Blaks 2004 opera, Firra.\n    The same year she recorded her third solo album together with award winning Canadian producer Bill Bourne.\n    In 2005, the world famous Danish Radio Big Band released its 40th anniversary album. All the titles on the album are written and sung by EivÃƒÂ¸r. 2005 was also the year where Eivor composed and performed the music for the theatre play Ulfhamssaga, for which she was awarded Best Music Score, 2005 in Iceland.\n    In 2006 EivÃƒÂ¸r moved to Copenhagen and instantly became a darling of the local folk scene - winning six Danish Music Award Folk nominations (bringing home two of them) and grants from several foundations in the country.\n    In 2007 EivÃƒÂ¸r released her 5th solo album Human Child, recorded and produced in Ireland by legendary producer Donal Lunny. The album is released in both Faroese and English. At one point EivÃƒÂ¸r had two entries (Faroese and English versions of the same album) in the Top Five charts in both the Faroes and in Iceland.\n    In 2008 EivÃƒÂ¸r is based in hometown Gota in the Faroes but touring all around the world.\n    2009 EivÃƒÂ¸r is working on her new album Larva and is touring in Scandinavia, Canada &amp; Japan.\n    2010 EivÃƒÂ¸r gets a worldwide record deal with Copenhagen Records for the album Larva. (eivor.sweetgiggles.net)\n\n- - -\n\nDanish Radio Big Band &amp; EivÃƒÂ¸r Palsdottir - TrÃƒÂ¸llabundin 2005\n(KÃƒÂ¸benhavn Cope/DR/12 Tonar)\n\n 1. Nu brennur tu ÃƒÂ­ maer\n 2. Rosufarid\n 3. Om jag vÃƒÂ¥gar\n 4. Prelude to EndurfÃƒÂ¸dd\n 5. EndurfÃƒÂ¸dd\n 6. MÃƒÂ­n modir\n 7. Laer meg gud at liva\n 8. Jeg vil mig Herren love\n 9. Prelude to TrÃƒÂ¸llabundin\n10. TrÃƒÂ¸llabundin\n11. Prelude to FÃƒÂ¥geln\n12. FÃƒÂ¥geln\n13. MÃƒÂ¥ solen alltid skina\n","torrent":{"xt":"urn:btih:2b0cc1d4fab4566393dd2f827471a3bcc8cea42f","amp;dn":"Danish+Radio+Big+Band+and+Eivor+Palsdottir+-+Trollabundin+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b0cc1d4fab4566393dd2f827471a3bcc8cea42f","infoHashBuffer":{"type":"Buffer","data":[43,12,193,212,250,180,86,99,147,221,47,130,116,113,163,188,200,206,164,47]},"announce":[],"urlList":[]}}