{"title":"Red Hot Chili Peppers - By The Way (2002) WMA320","uid":6096441,"size":191975132,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2b0cfcacc17ad743b21f940bd7b67431d68babc4&amp;dn=Red+Hot+Chili+Peppers+-+By+The+Way+%282002%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1294795365,"description":"The Red Hot Chili Peppers are unquestionably the greatest band that has ever lived. Evolving in a storybook-like fashion from having sold roughly 25,000 copies of their debut album, to the 13 million Californication accumulated. The band has experienced countless line-up change, heartbreaks, and tragic upheavals, giving the foursome a bleak future. 20 years ago, not a single person could have foretold this. By the Way came at a time when music begged for originality and uniqueness. It is lush, poignant, and immaculate; By the Way evokes fascination in all, as to what the band has transformed into. \n\nIt begins with &quot;By the Way&quot;, one of the only numbers on the entire album which have preserved the once quintessential funk and rap-driven verses. It is vastly discrepant to those of the other recordings found on the album, and is, thus, misleading. The intricate song structure evolves from mellow, harmonious and humble beginnings to a brazen verse and impeccably bridges into a melodic chorus. &quot;Universally Speaking&quot; follows. It's instantly apparent that this song has very few things relative to that of it's predecessor. The song has a sort of Doo-whop feeling as it bridges expressively from the verse into a 60's-type chorus. \n\n&quot;This Is the Place&quot; has to be one of the most beautiful tracks on the entire album. It begins with a modest base line (which is played throughout the entire song), and gives way to Chad's lustrous drum beat and Anthony's masterful lyrics; it contains some of the best song-writing I have ever seen, though one never knows what he is actually alluding to. John comes in with a seemingly invisible guitar segment; all until the chorus, when it brings through stunning life altering sounds. The most notable segment is the conclusion, when Kiedis sing unwaveringly, and John pounds furiously on his guitar. &quot;Dosed&quot; follows, which is elegant, wispy, and, for some reason, makes me feel as if I were in an Arctic blast. Four guitar lines run luxuriantly through the song. \n\n&quot;Don't Forget Me&quot; has the most intricate and zealous guitar-playing I have ever heard. Like &quot;This Is the Place&quot;, the exact same base-line is played perpetually until the conclusion. Anthony's haunting and ubiquitous voice resonates in your mind, as John picks masterfully at his guitar. Following the first and second choruses, astonishingly intricate solos are given by Frusciante. Each one is an ecstasy of euphoric delirium, executed with impeccable perfection. &quot;The Zephyr Song&quot; comes next, and seems as though it were lifted directly out of the 70's. It's psychedelic nature stands out wondrously. \n\n&quot;Can't Stop&quot; is, without a doubt, my favorite song, ever. It starts fast paced, but somewhat quiet, until it reaches the climax. An amazing bridge to the verse is played by John. The verse is far better than the chorus, as Frusciante provides majestic backing vocals. Amazing song. &quot;I Could Die for You&quot;, the shortest song on the album, is hard to describe. It's elegant and beautiful and gentle in it's nature. The track is quiet, yet perky and alive, as though driven by an enveloping, fervent, fanatical force. &quot;Midnight&quot; is another gem. The sounds which it engages have rarely been seen elsewhere. It is so unique, as each one of the songs are. Melodic and lush, bare and unsparing. &quot;Throw Away Your Television&quot; is the funkiest number on the album, though certain sections imply an innovative sense, and as though one were experiencing a whirlwind of nuance and jet speed illustriousness. \n\n&quot;Cabron&quot; is an experimental track, which has a tang of Latin influences, hence the name, and is played exclusively on an acoustic guitar. It is another vastly dissimilar song which contradicts much of its colleagues. &quot;Tear&quot;, a striking and lethargic (and long) song is an unexpected tribute to the Beach Boys. A magical trumpet solo is performed by Flea, which allows the song to prevent itself from becoming lost on the record. &quot;On Mercury&quot; is, if there had to be one, the weakest track on the entire album. The faux ska sound simply sparks too much turmoil between the songs it surrounds, and does not fit in with the grand message which By the Way is attempting to articulate. \n\nIt is succeeded by an outstanding track, however: &quot;Minor Thing&quot;, which shows, blatantly, how much Kiedis has evolved as both a lyricist and a singer. His compelling and spellbinding voice gives way to the enchanting, enthralling and captivating guitar playing given by John. &quot;Warm Tape&quot; is possibly the most mysterious and inexplicable track the Chili Peppers have ever produced. The sound is difficult to describe, as it seems to squirm in a sensual manner, unlike anything ever created. \n\nThe final and longest song on By the Way, &quot;Venice Queen&quot;, may be the most meaningful. It's mellow and windy intro gives one the sense of walking in a forest, while the bitter cold wind attacks you from all angles. It defines beauty, yet is as unforgiving as an astringent stone. Anthony comes in perfectly and begins singing in a depressed and crestfallen manner. Until, however, the song completely turns around and kicks itself into high gear. Near the halfway mark, it turns from a glum ballad to a driven acoustic melody, alluding to the death of Gloria Scott, a woman who aided Anthony in the fight against drugs. John provides majestic backing vocals, to make this song an amazing stand out. \n\nSo, if you took the time to read why By the Way is the best album ever recorded, you'll purchase it. Carefree. \n\nby Collin L.\n\nTRACKLIST:\n\n01 - By The Way.wma                                         \n02 - Universally Speaking.wma                               \n03 - This Is The Place.wma                                  \n04 - Dosed.wma                                              \n05 - Don't Forget Me.wma                                    \n06 - The Zephyr Song.wma                                    \n07 - Can't Stop.wma                                         \n08 - I Could Die For You.wma                                \n09 - Midnight.wma                                           \n10 - Throw Away Your Television.wma                         \n11 - Cabron.wma                                             \n12 - Tear.wma                                               \n13 - On Mercury.wma                                         \n14 - Minor Thing.wma                                        \n15 - Warm Tape.wma                                          \n16 - Venice Queen.wma \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:2b0cfcacc17ad743b21f940bd7b67431d68babc4","amp;dn":"Red+Hot+Chili+Peppers+-+By+The+Way+%282002%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b0cfcacc17ad743b21f940bd7b67431d68babc4","infoHashBuffer":{"type":"Buffer","data":[43,12,252,172,193,122,215,67,178,31,148,11,215,182,116,49,214,139,171,196]},"announce":[],"urlList":[]}}