{"title":"Green Building - Guidebook for Sustainable Architecture 2009 (Ma","uid":5265628,"size":25010032,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b725d46bc945cd8fec10f72b016367baed425e3&amp;dn=Green+Building+-+Guidebook+for+Sustainable+Architecture+2009+%28Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"malestrom_HH","files":2,"time":1262876939,"description":" &lt;a href=&quot;http://bayimg.com/faJclaaCI&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/faJclaaCI&lt;/a&gt;\n\n\nMichael Bauer, Peter Mosle, Michael Schwarz, &quot;Green Building: Guidebook for Sustainable Architecture&quot;\nSpringer | 2009 | ISBN: 3642006345 | 210 pages | PDF\n\nAn important consideration for energy-efficient buildings is their primary energy requirements over the entire life cycle. How to determine this? What integrative factors influence the performance of a healthy and sustainable building? This, while it may be important for clients and architects to know, is frequently not very transparent.\nThis book has been written to assist with clarifying target criteria and expanding horizons when it comes to ecological buildings. It is meant as a handbook and source of reference for clients, architects, planners and building operators, to provide them with pertinent information about their design, construction and operation: how to do this in the most energy-efficient and economical manner?\nAlso, there is feedback and documentation about prominent buildings like the Hamburg Dockland or the Landesbank Baden-Wuerttemberg in Stuttgart. They provide excellent architectural examples for detailed construction and design solutions. Further, there are insightful interviews with architects and clients about many important buildings, which help turn this book into an integrated source of reference for sustainable architecture.\n\n- A Guideline for Planning, Construction and Operation of sustainable Buildings\n- A source of reference for clients, architects, planners and building operators\n- Innovative architectural examples with sustainable concepts and design\n","torrent":{"xt":"urn:btih:2b725d46bc945cd8fec10f72b016367baed425e3","amp;dn":"Green+Building+-+Guidebook+for+Sustainable+Architecture+2009+%28Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b725d46bc945cd8fec10f72b016367baed425e3","infoHashBuffer":{"type":"Buffer","data":[43,114,93,70,188,148,92,216,254,193,15,114,176,22,54,123,174,212,37,227]},"announce":[],"urlList":[]}}