{"title":"Dirty Dozen Brass Band - Voodoo TQMP","uid":4654231,"size":250308916,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2b9d0127ae636ee7083c378b6eb11445508344d9&amp;dn=Dirty+Dozen+Brass+Band+-+Voodoo+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"zootallure","files":19,"time":1232149122,"description":"A twister in music? The Dirty Dozen brass band!\nThe Dirty Dozen has been up for big challenges in the past with its bracing, innovative blend of traditional New Orleans sounds and modern jazz sensibilities. The ensemble has recorded with artists from Dizzy Gillespie (a hero and inspiration) to Elvis Costello, taken on the music of jazz inventor Jelly Roll Morton for the album Jelly and reinterpreted the hymns and parade songs of the Crescent City second-line bands for 2004's Funeral For A Friend (following the death of co-founding member Tuba Fats). They've mixed intriguing approaches to traditional and familiar material, but in a context emphasizing challenging original music composed by the Dozen members themselves. In the course, the band resurrected, revitalized and put distinctly personal stamps on what was a dying tradition of New Orleans brass bands when the group formed in the late '70s, inspiring a full-on revival that's flourished with several new generations of young brass bands each bringing their own twists to the form.\n\nOn this cd DDBB plays the Jelly Roll Morton pieces, per his own statement. &quot;the inventor of jazz&quot;. take it or leave it, it was Jelly Roll jazz!\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se  (Simply use the TQMP searchtag :)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)\t\t","torrent":{"xt":"urn:btih:2b9d0127ae636ee7083c378b6eb11445508344d9","amp;dn":"Dirty+Dozen+Brass+Band+-+Voodoo+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b9d0127ae636ee7083c378b6eb11445508344d9","infoHashBuffer":{"type":"Buffer","data":[43,157,1,39,174,99,110,231,8,60,55,139,110,177,20,69,80,131,68,217]},"announce":[],"urlList":[]}}