{"title":"Managing Electronic Records - Methods, Best Practices, and Techn","uid":10660324,"size":39135754,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2bddab117f00cc6566fa3ca3e12dec5afc3e01e2&amp;dn=Managing+Electronic+Records+-+Methods%2C+Best+Practices%2C+and+Techn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"gnv65","files":-1,"time":1406715321,"description":"Managing Electronic Records - Methods, Best Practices, and Technologies\nby Robert F. Smallwood and Robert F. Williams\nWiley | April 2013 | ISBN-10: 1118218299 | True PDF | 464 pages | 37.3 mb\n\nThe ultimate guide to electronic records management, featuring a collaboration of expert practitioners including over 400 cited references documenting today's global trends, standards, and best practices\n\nNearly all business records created today are electronic, and are increasing in number at breathtaking rates, yet most organizations do not have the policies and technologies in place to effectively organize, search, protect, preserve, and produce these records. Authored by an internationally recognized expert on e-records in collaboration with leading subject matter experts worldwide, this authoritative text addresses the widest range of in-depth e-records topics available in a single volume.\nUsing guidance from information governance (IG) principles, the book covers methods and best practices for everything from new e-records inventorying techniques and retention schedule development, to taxonomy design, business process improvement, managing vital records, and long term digital preservation. It goes further to include international standards and metadata considerations and then on to proven project planning, system procurement, and implementation methodologies. Managing Electronic Records is filled with current, critical information on e-records management methods, emerging best practices, and key technologies.\n\n-   Thoroughly introduces the fundamentals of electronic records management\n-   Explains the use of ARMA's Generally Accepted Recordkeeping Principles (GARPÂ®)\n-   Distills e-records best practices for email, social media, and cloud computing\n-   Reveals the latest techniques for e-records inventorying and retention scheduling\n-   Covers MS SharePoint governance planning for e-records including policy guidelines\n-   Demonstrates how to optimally apply business process improvement techniques\n-   Makes clear how to implement e-document security strategies and technologies\n-   Fully presents and discusses long term digital preservation strategies and standards\n\nManaging e-records is a critical area, especially for those organizations faced with increasing regulatory compliance requirements, greater litigation demands, and tightened internal governance. Timely and relevant, Managing Electronic Records reveals step-by-step guidance for organizing, managing, protecting, and preserving electronic records.\n\nAbout the Author &lt;a href=&quot;\nhttp://s30.postimg.org/jk3nggssh/robert.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s30.postimg.org/jk3nggssh/robert.jpg&lt;/a&gt;\nRobert F. Smallwood is an American technologist, novelist and playwright, with an outstanding international reputation in the content and records management industry. He has published over 100 articles in computer trade journals, yet his first book was his story about surviving Hurricane Katrina in New Orleans. He completed a 20-city U.S. book tour and was interviewed on NPR, BBC, and C-SPAN/BookTV. He then wrote a theatrical play that was performed as a staged reading in New Orleans, revised, and then published, followed by a novel, and a biz/tech book. Three new biz/tech books are being published by Wiley &amp; Sons on the topic of Information Governance and electronic records management.\nSmallwood is a world traveler always seeking adventure. He's lived in Mexico, sailed the Caribbean, toured Cuba staying with local families, run with the bulls in Pamplona, crossed the Continental Divide in Panama, skydived, and scuba dived. Always an innovator, Robert has an unquenchable thirst for knowledge and exploration, and brings his unique business and technology insights to the table to assist leading organizations and Fortune 500 corporations","torrent":{"xt":"urn:btih:2bddab117f00cc6566fa3ca3e12dec5afc3e01e2","amp;dn":"Managing+Electronic+Records+-+Methods%2C+Best+Practices%2C+and+Techn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bddab117f00cc6566fa3ca3e12dec5afc3e01e2","infoHashBuffer":{"type":"Buffer","data":[43,221,171,17,127,0,204,101,102,250,60,163,225,45,236,90,252,62,1,226]},"announce":[],"urlList":[]}}