{"title":"Born on a Blue Day by Daniel Tammet {PDF, EPUB, MOBI} [MU]","uid":8256021,"size":1328015,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c1b074059d149583e45dc8cb64f0de40a32caae&amp;dn=Born+on+a+Blue+Day+by+Daniel+Tammet+%7BPDF%2C+EPUB%2C+MOBI%7D+%5BMU%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Max-Upload","files":-1,"time":1363267511,"description":"Contains Born on a Blue Day: Inside the Extraordinary Mind of an Autistic Savant by Daniel Tammet (Oct 16, 2007) in PDF, EPUB and MOBI format.  \n\n\nFor ebook devices use an ebook converter like:\nHamster Ebook Converter - http://www.hamstersoft.com/free-ebook-converter \nCalibre - http://calibre-ebook.com/download \nOnline - http://ebook.online-convert.com/  \n\nDaniel has a compulsive need for order and routine -- he eats the same precise amount of cereal for breakfast every morning and cannot leave the house without counting the number of items of clothing he's wearing. When he gets stressed or is unhappy, he closes his eyes and counts. But in one crucial way Daniel is not at all like the Rain Man: he is virtually unique among people who have sev- ere autistic disorders in that he is capable of living a fully independent life. He has emerged from the &quot;other side&quot; of autism with the ability to function successfully -- he is even able to explain what is happening inside his head.\n\nBorn on a Blue Day is a triumphant and uplifting story, starting from early childhood, when Daniel was incapable of making friends and prone to tantrums, to young adulthood, when he learned how to control himself and to live independently, fell in love, experienced a religious conversion to Christianity, and most recently, emerged as a celebrity. The world's leading neuroscientists have been studying Daniel's ability to solve complicated math problems in one fell swoop by seeing shapes rather than making step-by-step calculations. Here he explains how he does it, and how he is able to learn new languages so quickly, simply by absorbing their patterns. Fascinating and inspiring, Born on a Blue Day explores what it's like to be special and gives us an insight into what makes us all human -- our minds.\nISBN: 1416535071\n\n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:2c1b074059d149583e45dc8cb64f0de40a32caae","amp;dn":"Born+on+a+Blue+Day+by+Daniel+Tammet+%7BPDF%2C+EPUB%2C+MOBI%7D+%5BMU%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c1b074059d149583e45dc8cb64f0de40a32caae","infoHashBuffer":{"type":"Buffer","data":[44,27,7,64,89,209,73,88,62,69,220,140,182,79,13,228,10,50,202,174]},"announce":[],"urlList":[]}}