{"title":"Free software - AVS DVD Player","uid":3851404,"size":25072608,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2c22d9c6fa8e8076cb0d9909744e110de6ee6e6c&amp;dn=Free+software+-+AVS+DVD+Player&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"cee415","files":1,"time":1192960310,"description":"Play movie DVDs, video &amp; audio files right on your computer with FREE AVS DVD Player. No spyware or adware. Safe to install!!!\n\nAVS DVD Player  is a compact and easy-to-use program that has a simple user-friendly interface allowing you to start watching DVD movies with no additional software.\n\n\nABSOLUTELY FREE SOFTWARE\n\nIt is absolutely free DVD player software. No trial periods, no feature limitations, no watermarks.\nNo spyware or adware.\n\n\nUNIVERSAL DVD, VIDEO &amp; AUDIO PLAYER\n\nSupport for a very wide variety of video formats: apart from regular DVD (PAL, NTSC, VCD, SVCD) formats, also supported are: the entire range of MPEG4 (including DivX, XviD, etc.), MPEG1, MPEG2, AVI, Real Media video, Quick Time files, WMV files (including WMV-HD), H.263, H.264, mobile video formats (3GP, 3GP2, MP4).\nThis strong compatibility makes AVS DVD Player a universal player.\n\n\nSTEREO TO SURROUND TRANSFORMATION\n\nWith the inbuilt Surround Effect, a unique development of our software engineers, regular stereo movies can be watched with enhanced audio quality and imitated Multichannel surround sound (3.1, 5.1, 7.1 speaker configurations are supported).\n\n\nEASY NAVIGATION BETWEEN SCENES\n\nEasy and fast navigation, using sets of bookmarks, interactive chapter interface, ability to manage bookmarks and adjust access settings.\n\n\nMULTILINGUAL SUPPORT\n\nAbility to select between several audio tracks and subtitle files, support for multiple languages.\n\n\nCOMPLETE SET OF ESSENTIAL FEATURES\n\nTraditionally available set for comfortable viewing - selection of the view angle (if available on a particular DVD), support for various video sources (HDD, portable media, LAN), automatically adjusted Aspect Ratio, one-click switch to full-screen mode, menu options available at a single mouse click, skinable interface etc. \n\n\nThis free software has no evaluation period, no limitations, it is adware and spyware free.\n\n\nWebsite: http://www.avsmedia.com/DVDPlayer/index.aspx","torrent":{"xt":"urn:btih:2c22d9c6fa8e8076cb0d9909744e110de6ee6e6c","amp;dn":"Free+software+-+AVS+DVD+Player","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c22d9c6fa8e8076cb0d9909744e110de6ee6e6c","infoHashBuffer":{"type":"Buffer","data":[44,34,217,198,250,142,128,118,203,13,153,9,116,78,17,13,230,238,110,108]},"announce":[],"urlList":[]}}