{"title":"George Orwell - Diaries (Peter Davison, ed.) [2012]","uid":10971266,"size":4303041,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c4832863785e1fa4048240346c9b03f53c33ac4&amp;dn=George+Orwell+-+Diaries+%28Peter+Davison%2C+ed.%29+%5B2012%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"workerbee","files":-1,"time":1409795207,"description":"\n* George Orwell - DIARIES (Liveright, 2012).  Edited by Peter Davison, with an Introduction by Christopher Hitchens.  624 pp.\n\n\nThis groundbreaking volume introduces the interior life of George Orwell (1903-1950), the writer who defined twentieth-century political thought.  Written as individual books throughout his career, the eleven surviving diaries collected here record Orwell's youthful travels among miners and itinerant laborers, the fearsome rise of totalitarianism, the horrific drama of World War II, and the feverish composition of his great masterpieces &quot;Animal Farm&quot; and &quot;1984&quot; (which have now sold more copies than any two books by any other twentieth-century author).  Personal entries cover the tragic death of his first wife and Orwell's own decline as he battled tuberculosis.\n\nExhibiting great brilliance of prose and composition, these treasured dispatches, edited by the world's leading Orwell scholar, exhibit &quot;the seeds of famous passages to come&quot; (New Statesman) and amount to a volume as penetrating as the autobiography he would never write.\n\nAs Christopher Hitchens writes in his Introduction to this volume: &quot;One cannot help but be struck by the degree to which Orwell became, in Henry James's words, one of those upon whom nothing was lost.  By declining to lie, even as far as possible to himself, and by his determination to seek elusive but verifiable truth, he showed how much can be accomplished by an individual who unites the qualities of intellectual honesty and moral courage.&quot;\n\n\nSEE ALSO:\n\n* George Orwell - Novels, Essays, Journalism (16 books) &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/9910816/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/9910816/&lt;/a&gt;  \n\n\nReviews\n\n&quot;A lushly annotated edition of Orwell's diaries from 1931 to 1949 [that] supplies necessary contextual information and footnotes generously, but stays in the shadows and allows us to truly enjoy Orwell's impressive chronicles.&quot; -- Kirkus Reviews\n\n&quot;Read with care, George Orwell's diaries, from the years 1931 to 1949, can greatly enrich our understanding of how Orwell transmuted the raw material of everyday experience into some of his best-known novels and polemics.  They furnish us with a more intimate picture of a man who, committed to the struggles of the mechanized and modern world, was also drawn by the rhythms of the wild, the rural, and the remote.&quot; -- Christopher Hitchens, Vanity Fair\n\n&quot;Among the vivifying things about his Diaries, issued now in one volume for the first time, is how they restore some first-person flesh and blood to what can seem like his disembodied head.  What's more, they show Orwell to be nearly Jeffersonian in his combined passion for politics and for the natural world, not merely for fishing but also for the enlightened and fervent cultivation of vegetables, fruit trees, animals and flowers. . .  These diaries show him with his hands covered in fresh dirt, hard at work, in sync with the seasons, curious about everything under the sun, tending to what he needed and grateful for beauty as well as sustenance.  They present a man in full.&quot; -- Dwight Garner, New York Times\n\n&quot;Reading the Diaries end-to-end in a single volume offers us a different take on Orwell: less as a thinker, or a figure of political conscience, than as a complex and dimensional human being.&quot; -- David Ulin, Los Angeles Times\n\n&quot;Orwell's achievement grew out of seemingly modest virtues: decency; good, hard sense; and clean, clear prose.  Yet they added up to something monumental. . .  The diaries as a whole do exactly what you would expect: They confirm his greatness.&quot; -- Craig Seligman - Newsday\n\n&quot;It is a blessing to now have the opportunity to read his Diaries, edited meticulously by Peter Davison, who as the editor of the twenty volumes of Orwell's Complete Works has an unequaled knowledge of the material. . .  They throw a revealing light on Orwell the thinker, and offer welcome stimulus to revisit the books and essays in which that mind left its lasting imprint.&quot; -- Brooke Allen, Barnes and Noble Review\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n              &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:2c4832863785e1fa4048240346c9b03f53c33ac4","amp;dn":"George+Orwell+-+Diaries+%28Peter+Davison%2C+ed.%29+%5B2012%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c4832863785e1fa4048240346c9b03f53c33ac4","infoHashBuffer":{"type":"Buffer","data":[44,72,50,134,55,133,225,250,64,72,36,3,70,201,176,63,83,195,58,196]},"announce":[],"urlList":[]}}