{"title":"Shakespeare's Globe The Duchess of Malfi (2014)","uid":11808477,"size":1549307081,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2c7574a4eddc0e601d10c7c09586eb8654657388&amp;dn=Shakespeare%27s+Globe+The+Duchess+of+Malfi+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"loninappleton","files":2,"time":1428693606,"description":"Duchess of Malfi (2014)2014 starring Gemma Atterton\nA BBC production Live from the Sam Wanamaker Jacobean Theatre\nof the play circa 1616 AD by John Webster\n\nRuntime 2 hr 23 minutes\n\nIMDb  tt3773058/\n\nDirector  Dominic Dromgoole\n\nCast\n\nGemma Atterton     The Duchess\nArchie Bradfield   Child (non speaking)\nGiles Cooper       Silvo\nDavid Dawson       Ferdinand\nJames Garnon       Cardinal\nSean Gilder        Bosola\nDenis Gough        Julia\nSara MacRae        Cariola\nAndrew Marr        The BBC narrator- himself\nPaul Rider         Delio\nAlex Waldman       Antonio\n\nIMDb  summary\n\n  *A television version of the Shakespeare's Globe Theatre revival of John \nWebster's Jacobean tragedy, directed by Dominic Dromgoole and with a cast led by \nGemma Arterton.\n   As a televisual piece of drama, this DUCHESS OF MALFI is compelling to watch. \nThe camera focuses tightly on the protagonists' expressions, reminding us of just \nhow much of a domestic tragedy Webster's work actually is. On the other hand, the \nfrequent reaction-shots of the audience encircling the playing area make us aware \nof how this domestic tragedy is being played out in a very public sphere: emotions \nthat are customarily kept private are openly expressed, whether the characters like \nit or not.&quot; (partial)\n\nMy notes\n\n   This presentation of  &quot;The Duchess of Malfi&quot;  first appeared in torrents as a 7 \nplus gigabyte file.  It took perhaps a week to download.  I used the Handbrake \nsoftware to make a more easily obtainable mp4 version suitable for CRT playback.\n\n  This is the first time a presentation from the Sam Wanamaker Playhouse which is on \nthe grounds of the Globe Theatre in London has been on television or screen-capped by a viewer.  I thank the original uploader for it.\n\n  The credits for cast and production are incomplete.  The whole play is here but \nterminates abruptly at the end.  What are we to make of a full IMDb listing with \nno purchaseable DVD for sale anywhere, PAL or NTSC such as the Globe has released \nthrough Opus Arte productions?   It terminates before the credit role gives complete notes on the production.\n\n   I would like to get this for my public library but it only appears as a torrent \nand a listing at IMDb.  To date,  I have watched it multiple times.  The stage is lit with bees wax candles without stage lighting instruments anywhere.\n\n   As  the Globe productions continue, many of the characters are played by \nnow-recognizable actors such as James Garnon, Sarah MacRae, Paul Rider and others.  This adds to the enjoyment as they now have a bit of fan base as well.\n\n   Encourage the Globe or BBC to get this in a boxed format.  The Wanamaker Theatre \nis unique as a playhouse, even though Blackfriars (I think in Carolina,  USA)  used \nthe Jacobean style playhouse.\n\n   For now enjoy the play, perhaps many times over as I have.  There is another \ninterpretation of The Duchess of Malfi in my torrent list, that one from National \nTheatre Live and that is available for purchase.\n\nNotes written  April 8th 2015","torrent":{"xt":"urn:btih:2c7574a4eddc0e601d10c7c09586eb8654657388","amp;dn":"Shakespeare%27s+Globe+The+Duchess+of+Malfi+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c7574a4eddc0e601d10c7c09586eb8654657388","infoHashBuffer":{"type":"Buffer","data":[44,117,116,164,237,220,14,96,29,16,199,192,149,134,235,134,84,101,115,136]},"announce":[],"urlList":[]}}