{"title":"MRI Atlas of Pituitary Pathology, Pantalone [PDF][StormRG]","uid":11732903,"size":2740111,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ca4ae573af0bdda12d840de0807ea9555e2c7f6&amp;dn=MRI+Atlas+of+Pituitary+Pathology%2C+Pantalone+%5BPDF%5D%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"0xmovva","files":2,"time":1425455051,"description":"TITLE/EDITION MRI Atlas of Pituitary Pathology \nBy: Kevin M. Pantalone (Author), Stephen E. Jones (Author), Robert J. Weil (Author), Amir H. Hamrahian (Author)\nHardcover: 60 pages\nPublisher: Academic Press; 1 edition (February 20, 2015)\nLanguage: English\nISBN-10: 0128025778\nISBN-13: 978-0128025772\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nMRI Atlas of Pituitary Imaging focuses on magnetic resonance imaging (MRI), the imaging modality of choice for the evaluation of pituitary disorders, since it provides a detailed anatomy of the pituitary gland and surrounding structures, particularly the soft tissues. A basic understanding and interpretation of MRI is important for many clinicians outside of the field of radiology, especially endocrinologists who may receive limited formal training in such areas.\n\nThis concise Atlas includes a brief review of the principles of magnetic resonance imaging and then reinforces these principles by utilizing a case-based approach to review various pituitary pathologies. The Atlas serves as a strong clinical teaching aid for endocrinologists, radiologists, and neurosurgeons in training. It also serves as a great reference for physicians who are currently in practice.\n\n\n\nProvides readers with a simple, visual approach for the evaluation of pituitary images\nFeatures 160 high-resolution images of the most common to the rarest of disorders affecting the pituitary\nServes an audience of fellows, residents, and clinicians in endocrinology, radiology, neurosurgery, and anyone involved in the multidisciplinary diagnosis of pituitary disease","torrent":{"xt":"urn:btih:2ca4ae573af0bdda12d840de0807ea9555e2c7f6","amp;dn":"MRI+Atlas+of+Pituitary+Pathology%2C+Pantalone+%5BPDF%5D%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ca4ae573af0bdda12d840de0807ea9555e2c7f6","infoHashBuffer":{"type":"Buffer","data":[44,164,174,87,58,240,189,218,18,216,64,222,8,7,234,149,85,226,199,246]},"announce":[],"urlList":[]}}