{"title":"The Complete Far Side","uid":11164530,"size":1757303259,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2cbb2fa524dbcf9288bc1c8ddbf648924dc7e905&amp;dn=The+Complete+Far+Side&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Akure","files":-1,"time":1412610704,"description":"The Complete Far Side\n\nLumpy cows and dinosaurs, nerds wearing glasses and women with big hair abound in this hefty two-volume slipcased compilation of Larson's twisted and beloved single-panel comic. Complete with every syndicated Far Side cartoon arranged chronologically by year of publication, in addition to 19 that were created after Larson's retirement in 1995, this deluxe set features chapter introductions by Larson as well as letters from fans and puzzled readers (&quot;Help!... [This comic] has stumped not only me but the entire office&quot;). Readers will be amused by the insightfully funny and nostalgic chapter introductions that offer a peek into the cartoon genius's mind, such as the intro to 1982 that illustrates what Larson calls the &quot;ohpleaseohplease syndrome&quot; an obsession he shares with biologists and naturalists (and his brother) to acquire a lizard or another creature, if only briefly, and to &quot;drink it in&quot; before it escapes into its own world. Comedian/author Martin provides a foreword that captures the offbeat and candid humor underlying each comic, as he sorrowfully reports that &quot;many of the scenes depicted in this book are actually false.&quot; Readers may not be stunned by this revelation, but they will surely enjoy flipping through the slick, full-colored pages of this mammoth treasury, a lavish (and heavy!) collector's item that is the perfect gift for Far Side fans. Just make sure they say &quot;ohpleaseohplease.&quot; ","torrent":{"xt":"urn:btih:2cbb2fa524dbcf9288bc1c8ddbf648924dc7e905","amp;dn":"The+Complete+Far+Side","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cbb2fa524dbcf9288bc1c8ddbf648924dc7e905","infoHashBuffer":{"type":"Buffer","data":[44,187,47,165,36,219,207,146,136,188,28,141,219,246,72,146,77,199,233,5]},"announce":[],"urlList":[]}}