{"title":"The Mineral Book - David McQueen","uid":11773247,"size":15043565,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d1dc90e135cc429063596f187ab54b86d8a15e8&amp;dn=+The+Mineral+Book+-+David+McQueen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"starxteel","files":1,"time":1427159964,"description":"\nThe Mineral Book is a part of the best-selling Wonders of Creation Series! It has been developed for multi-level teaching, with special color-coding on three skill levels. This educational resource is filled with full-color pictures and illustrations, and can be used in the classroom, for independent study, or homeschool settings.\n\nCreated to make mineralogy accessible to beginners, students, and hobbyists as well as:\n\n-Learn about the order and beauty of minerals shaped by the Creator\n-Find out the properties of minerals, where they can be found, and how they are used, along with fun facts\n-Includes a 24-inch, full-color pull-out poster!\n\nMinerals are a gift of God s grace. Every day we touch them, seeing the diamond in an engagement ring or a copper chain with a cross on it. Minerals are touched on in video games like Minecraft? and Mineral Valley?, making them more a part of our daily experience.\n\nSalt, one vital mineral, helps maintain the fluid in our blood cells and is used to transmit information in our nerves and muscles. Also, Jesus told his followers that we are the salt of the earth (Matthew 5:13), something thus needed for health and flavor. Here is a God-honoring book that reveals the first mention of minerals in the Bible, symbolic usages, their current values in culture and society, and their mention in heaven.\n\n\nAbout the author:\nDavid R. McQueen was trained in mineralogy at the University of Tennessee (BA in geology) and at the University of Michigan (MS in geology). McQueen taught college geology at George Mason University, Virginia State University, East Tennessee State University, and the Institute for Creation Research?s Graduate School","torrent":{"xt":"urn:btih:2d1dc90e135cc429063596f187ab54b86d8a15e8","amp;dn":"+The+Mineral+Book+-+David+McQueen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d1dc90e135cc429063596f187ab54b86d8a15e8","infoHashBuffer":{"type":"Buffer","data":[45,29,201,14,19,92,196,41,6,53,150,241,135,171,84,184,109,138,21,232]},"announce":[],"urlList":[]}}