{"title":"The Allman Brothers Band - Live At The Beacon Theatre 1992 (2014","uid":9630451,"size":339289364,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2d62a558cfe5e40274968ee78c20c8ab4d047252&amp;dn=The+Allman+Brothers+Band+-+Live+At+The+Beacon+Theatre+1992+%282014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Beolab1700","files":17,"time":1392779602,"description":"[center]\n\n[size=4]The Allman Brothers Band - Play All Night: Live At The Beacon Theatre 1992 (2014) MP3@320kbps Beolab1700[/size]\n\n[url=http://postimage.org/][img]http://s30.postimg.org/b0qbi3529/Art.jpg[/img][/url]\n\n---------------------------------------------------------------------\nAllman Brothers Band, The - Play All Night: Live At The Beacon Theatre 1992 CD 1\n---------------------------------------------------------------------\n\nArtist...............: Allman Brothers Band, The\nAlbum................: Play All Night: Live At The Beacon Theatre 1992 CD 1\nGenre................: Blues/Rock\nSource...............: CD\nYear.................: 2014\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.92\nVersion..............: MPEG 1 Layer III\nQuality..............: Insane, (avg. bitrate: 320kbps)\nChannels.............: Joint Stereo / 44100 hz\nTags.................: ID3 v1.1, ID3 v2.3\nInformation..........: \n\nPosted by............: Beolab1700 on 18/02/2014\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n   1. Allman Brothers Band, The - Statesboro Blues            [06:54]\n   2. Allman Brothers Band, The - You Don't Love Me           [06:32]\n   3. Allman Brothers Band, The - End Of The Line             [05:39]\n   4. Allman Brothers Band, The - Blue Sky                    [07:29]\n   5. Allman Brothers Band, The - Nobody Knows                [13:15]\n   6. Allman Brothers Band, The - Low Down Dirty Mean         [07:15]\n   7. Allman Brothers Band, The - Seven Turns                 [04:36]\n   8. Allman Brothers Band, The - Midnight Rider              [03:15]\n   9. Allman Brothers Band, The - Come On In My Kitchen       [05:56]\n\nPlaying Time.........: 01:00:54\nTotal Size...........: 143.15 MB\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n   1. Allman Brothers Band, The - Guitar Intro - Hoochie Koochie Man[09:55]\n   2. Allman Brothers Band, The - Jessica                     [09:55]\n   3. Allman Brothers Band, The - Get On With Your Life       [08:12]\n   4. Allman Brothers Band, The - In Memory Of Elizabeth Reed [20:52]\n   5. Allman Brothers Band, The - Revival                     [05:40]\n   6. Allman Brothers Band, The - Dreams                      [11:14]\n   7. Allman Brothers Band, The - Whipping Post               [11:30]\n\nPlaying Time.........: 01:17:21\nTotal Size...........: 179.96 MB\n\n---------------------------------------------------------------------\n\nThey say you never forget your first time.\n\nFor nearly 25 years, traveling to New York's Beacon Theatre to see The Allman Brothers Band play a stretch of high-spirited live shows has become a rite of passage for fans old and new. What began as a daring ten-night run at the acclaimed venue is now a symbiotic relationship between a band, a venue and a devoted fan base, the likes of which are virtually unprecedented in rock and roll history.\n\nPlay All Night: Live At The Beacon Theatre 1992, is a new two-disc set showcasing The Allman Brothers Band s very first time playing such an extended run at the Beacon.\n\nIn more than four decades together, The Allman Brothers Band have faced personal setbacks and enjoyed monumental reinventions in the studio and on the road. The announcement of a 20th anniversary tour in 1989, after a seven year hiatus from recording or performing, made even the most faithful fans wonder how the band could rise again.\n\nBut the group was doing much more than merely reuniting. Founding members Gregg Allman (vocals/keyboards), Dickey Betts (guitar), Butch Trucks and Jaimoe (drums) were joined by a trio of talented up-and-comers: Allen Woody on bass, Marc Quinones on percussion, and Warren Haynes on guitar. The hiring of Haynes, a then little-known guitarist who'd toured with Betts, was a considerable stroke of genius; his guitar approach heavily evoked the spirit of Duane Allman's playing, drawing a clear line from the band's past to its future.\n\nThat reunion tour saw The Brothers first take the Beacon's stage for an extended run - a residency that s now a tradition for both band and venue. The band would tape two of their 10 shows at the theater in March 1992. Amazingly, material from these electrifying shows has seen virtually no release - until now.\n\nIn the spirit of The Allmans iconic 1971 live album At Fillmore East, Play All Night showcases Allman, Betts, Trucks, Jaimoe, Haynes, Woody and Quinones taking the Beacon's stage by storm. Through their most-requested songs, deep cuts and new favorites, the Allmans expertly showcase that unmistakable raw energy - at once practiced and spontaneous - that still make them one of the most beloved live acts. Play All Night will feature new liner notes by John Lynskey, editor of official ABB magazine Hittin' The Note, and onstage photos by longtime band photographer Kirk West, to further immerse audiences into the story behind these captivating sets.\n\nWhether you've never experienced the magic of The Allman Brothers Band at the Beacon Theatre or you're eagerly planning for next year's shows, Play All Night is a first time you ll want to re-live over and over again. \n\n---------------------------------------------------------------------\n\n\n[/center]","torrent":{"xt":"urn:btih:2d62a558cfe5e40274968ee78c20c8ab4d047252","amp;dn":"The+Allman+Brothers+Band+-+Live+At+The+Beacon+Theatre+1992+%282014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d62a558cfe5e40274968ee78c20c8ab4d047252","infoHashBuffer":{"type":"Buffer","data":[45,98,165,88,207,229,228,2,116,150,142,231,140,32,200,171,77,4,114,82]},"announce":[],"urlList":[]}}