{"title":"Tesla-Colorado Springs Notes 1899-1900(1978)","uid":4533240,"size":11557244,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d7803e2c25439fd0245eef37f4f8b417323ad62&amp;dn=Tesla-Colorado+Springs+Notes+1899-1900%281978%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227638120,"description":"These are Nikola Tesla&amp;#039;s Colorado Springs Notes 1899-1900 (1978) which are the reprint of his lab notebook where this great scientist recorded day to day activities of his breakthrough research conducted at his laboratory in Colorado Springs. This diary is exceptionally important for the history of radio and for better and deeper understanding of Tesla&amp;#039;s experimental work in this field. The diary notes were handwritten day in, day out from June 1, 1899 to January 7, 1900, amounting to 500 pages and almost 200 drawings. There are also full explanations of 63 photographs illustrating the last stage of the experimental work. The importance of Tesla&amp;#039;s diary lies not only in its value for the history of science but also in the evidence it offers of the work and activities of the great scientist. Most of Tesla&amp;#039;s experiments are still relevant for contemporary science, and this probably accounts for the visits of a great many scientists to the Nikola Tesla Museum in Belgrade where most of their time was given to the diary. As you read and study this book, it becomes absolute clear Nikola Tesla was an inventor with the heart and mind of a pure genius. Not to be missed for people doing research on Tesla and his work. One can only wonder what his later diaries might have contained but were unfortunately confiscated by US government officials after he died and are still under lock to this very day. 430 pages, many pictures. A must read for everyone.\n\nFor viewing the djvu book format you need to download the plugin from: http://www.lizardtech.com/download\n","torrent":{"xt":"urn:btih:2d7803e2c25439fd0245eef37f4f8b417323ad62","amp;dn":"Tesla-Colorado+Springs+Notes+1899-1900%281978%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d7803e2c25439fd0245eef37f4f8b417323ad62","infoHashBuffer":{"type":"Buffer","data":[45,120,3,226,194,84,57,253,2,69,238,243,127,79,139,65,115,35,173,98]},"announce":[],"urlList":[]}}