{"title":"Airfoil &amp; Airfoil Speakers 4.7.2","uid":7490861,"size":19821369,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:2d95604c13e55d5463770e0dc6ffbb117d15c73e&amp;dn=Airfoil+%26amp%3B+Airfoil+Speakers+4.7.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"openarena","files":-1,"time":1343695278,"description":"Audio capture of Safari, QuickTime Player, FaceTime, and Messages is now possible on OS X 10.8 Mountain Lion without requiring the Instant On component.\nAn issue where volume control for some third-party AirPlay hardware was not working as expected has been fixed.\nThe Instant On component has been updated to version 6.0.1, which fixes several small issues. The update comes in addition to Instant On 6.0, which including improvements to System Audio capture and support for OS X 10.8 Mountain Lion.\nSeveral fixes for Retina MacBooks Pro have been made, including enabling Netflix's full-screen mode to work.\nThe Factory Reset functionality has been corrected to work properly on Mountain Lion.\nAirfoil Video Player's &quot;Enter Full Screen&quot; menu item has been corrected to work properly on Mac OS X 10.7 Lion.\nApplications are now prevented from incorrectly appearing twice in the Source list.\nThe obsolete &quot;Advanced Source Settings&quot; menu item has been removed.\nThe Welcome Window size on Retina machines has been corrected.\nAirfoil and Airfoil Speakers are now signed as part of Apple's Developer ID program, for compatibility with Gatekeeper.\nSeveral other small bug fixes have been made.","torrent":{"xt":"urn:btih:2d95604c13e55d5463770e0dc6ffbb117d15c73e","amp;dn":"Airfoil+%26amp%3B+Airfoil+Speakers+4.7.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d95604c13e55d5463770e0dc6ffbb117d15c73e","infoHashBuffer":{"type":"Buffer","data":[45,149,96,76,19,229,93,84,99,119,14,13,198,255,187,17,125,21,199,62]},"announce":[],"urlList":[]}}