{"title":"Garmin: Import maps from gmapsupp.img to Mapsource","uid":3944092,"size":2186772,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2dceb8a9f41a493f977fe302ca2409eb40903a1b&amp;dn=Garmin%3A+Import+maps+from+gmapsupp.img+to+Mapsource&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"NightyNinetY","files":1,"time":1198346786,"description":"This info is taken from a forum somewhere credits goes to Popej &amp; Fukor..\nThe Tools required is baked in with this release.\nYou can for exempel import not yet released mapproducts to Mapsource like City Navigator Europe NT 2008 from a gmapsupp.img file.\nThis is not a perfect solution but it works. Somehow =)\n\nYou need some tools to get the work done. Look for cgpsmapper, MapSetToolKit and GmapTool. Unpack and install all this tools. Cgpsmapper and GmapTool are command line programs, you need to start them from command line window or from any Norton Commander clone like Total Commander. \n\nI assume that you have Mapsource installed and that your GPS with preinstalled maps is recognised by Windows as a removable drive, for example as drive I: \n\nBegin with creating an empty directory for your map. Put cgpsmapper and gmaptool in this directory and make it current work directory for subsequent commands. \n\nUnpack your map with gmaptool: \n&gt;gmaptool -S I:garmingmapprom.img\n\nYou will get several different files in your work directory. These are maps and additional files for Mapsource. You need to compile preview map: \n&gt;cgpsmapper mapset00.mp\n\nNow you can use MapSetToolKit. Start it and choose &quot;Install A Existing Mapset&quot;. You have to point to tdb file mapset00.tdb, preview file mapset00.img and invent a registry name. Install and your map should be visible in Mapsource. \n\nYou have to unlock map in Mapsource. Simply input 25-character unlock code from your device. This can be found on papers attached to your GPS, on mygarmin.com after registration, in file garminGarminDevice.xml or garmingmapprom.unl or in a file gmaptool00.unl in map directory on your PC. \n\nAnd as usually: no guarantee, Mapsource may crash, use at your own risk and responsibility. \n\nIf Mapsource crashes use MapSetToolKit to remove new map.\n_________________\npopej \n","torrent":{"xt":"urn:btih:2dceb8a9f41a493f977fe302ca2409eb40903a1b","amp;dn":"Garmin%3A+Import+maps+from+gmapsupp.img+to+Mapsource","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dceb8a9f41a493f977fe302ca2409eb40903a1b","infoHashBuffer":{"type":"Buffer","data":[45,206,184,169,244,26,73,63,151,127,227,2,202,36,9,235,64,144,58,27]},"announce":[],"urlList":[]}}