{"title":"South of Hell - Season 1 - Episodes 1 thru 8","uid":13635110,"size":5803132420,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2e7012a686bdbd1f51747e6c88e2e869ebcf1660&amp;dn=South+of+Hell+-+Season+1+-+Episodes+1+thru+8&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"POtHS11","files":33,"time":1456057912,"description":"South of Hell - Season 1 - Episodes 1 thru 8\r\n\r\nIt seems as though the world just cannot get enough supernatural TV dramas these days, which is both a good and a bad thing. While this is the golden age of speculative television, channel competition often results in unoriginal shows pandering to some other, better program’s target audience. This is sadly the case with Eli Roth’s South of Hell, though the show hints at a huge amount of untapped potential.\r\n\r\nThe series begins as a South Carolina based version of CW’s Supernatural, though it focuses solely on demons for now. The story revolves around Maria Abascal, played by Mena Suvari, a troubled woman that shares her body with the demonic entity Abigail. Aided by her drug-addicted brother, David (played by Zacharry Booth), Maria struggles to make ends meet as a kind of freelance exorcist, using her darker side to her advantage when facing otherworldly adversaries. When Reverend Elijah Bledsoe, played by Lamman Rucker, asks for her help, Maria happens upon larger plans for the forces of hell.\r\n\r\nThe plot here is standard enough for this kind of series, and the execution isn’t anything special either. The budget seems to be way below what is usually considered the minimum to properly convey genuinely scary stories, but it does have a kind of indie charm that’s surprisingly hard to find on modern television. The acting is overall average, but Suvari seems to be genuinely engaged as both Maria and the demon residing within her.\r\n\r\nOf course, first episodes alone can’t be used as a basis to judge an entire series, but the case of the week format with a ‘The Exorcist’ spin on it probably isn’t enough to keep audiences invested for an entire season, though it is a fresh enough idea that it might work within an overarching story. The pilot does hint at an overall larger and scarier world that these characters inhabit, where demons plot against hypocritical preachers and common southern folk alike.\r\n\r\nThough it can be classified as a horror series, there’s not much to South of Hell that a well-versed fan of horror movies and shows would call scary. The sub-par digital effects and occasionally mediocre acting ruin most of the creepy moments. Despite the lack of scares, however, there is a wonderful southern vibe permeating the entire episode and really grounding the story. If better executed in the future, this could be a big reason to revisit the series every week.\r\n\r\nAll in all, South of Hell has a great basic idea but stumbles during execution. The characters aren’t memorable enough yet to warrant viewer investment, but it’s very possible that, with enough time and better writing, the series could evolve into something more. This could be the low-budget Supernatural that audiences would devour while their preferred series is on hiatus, though I’m not sure that we need another one of these right now","torrent":{"xt":"urn:btih:2e7012a686bdbd1f51747e6c88e2e869ebcf1660","amp;dn":"South+of+Hell+-+Season+1+-+Episodes+1+thru+8","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e7012a686bdbd1f51747e6c88e2e869ebcf1660","infoHashBuffer":{"type":"Buffer","data":[46,112,18,166,134,189,189,31,81,116,126,108,136,226,232,105,235,207,22,96]},"announce":[],"urlList":[]}}