{"title":"Complete Do-It-Yourself Manual - Completely Revised and Updated ","uid":4944341,"size":27567913,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e7ab5ab64fbb55bf36278d263a35a292ebe098a&amp;dn=Complete+Do-It-Yourself+Manual+-+Completely+Revised+and+Updated+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"malestrom_HH","files":160,"time":1244583908,"description":"\n\nFamily Handyman Magazine Editors, &quot;Complete Do-It-Yourself Manual: Completely Revised and Updated&quot;\nPublisher: Readers Digest | 2005 | 528 Pages | ISBN: 0762105798 | PDF\n\nThis super-handy manual, first published in 1973, has received a major upgrade. Seventeen chapters' worth of fixer-upper opportunities are enhanced with more than 3,000 photos and illustrations that would look equally at home in an upscale home decorating catalog. The first few chapters cover hand and power tools, fasteners and adhesives, and are enough to incite hardware envy among even dwellers of tiny apartments. There is strange beauty in the cutaway views of five different hollow-wall fasteners and the machinations of nine types of pliers. But homeowners are, of course, the real target audience, and an all-new section on Landscaping reflects this with entries on fences, water gardens and retaining walls. \n\nThe plumbing section offers a mega-view of waste water-treatment systems as well as a micro-exploration of unclogging a toilet. Another new section, Storage Projects, is full of cabinets and shelves that either &quot;Swing-out&quot; or &quot;Fold-away.&quot; New technologies are generally overlooked in favor of meat-and-potatoes projects. \n\nFor instance, a home satellite dish is pictured but not indexed or dwelled upon, while carpeting is charted, graphed and deconstructed in the extreme. Intriguing sidebars on wood re finishers (the fastest drying versus the safest), the financial benefits of renting specialty tools for a large drywall project and other subjects round out this must-have guide.","torrent":{"xt":"urn:btih:2e7ab5ab64fbb55bf36278d263a35a292ebe098a","amp;dn":"Complete+Do-It-Yourself+Manual+-+Completely+Revised+and+Updated+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e7ab5ab64fbb55bf36278d263a35a292ebe098a","infoHashBuffer":{"type":"Buffer","data":[46,122,181,171,100,251,181,91,243,98,120,210,99,163,90,41,46,190,9,138]},"announce":[],"urlList":[]}}