{"title":"Nanomaterials and devices [2014]","uid":11964979,"size":16301044,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e9b83b5a40f2ce40add6fa0ea3bb3249edef112&amp;dn=Nanomaterials+and+devices+%5B2014%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"NoctDeath","files":2,"time":1432649753,"description":"Title: Nanomaterials and devices\nSeries: Micro and Nano Technologies\nAuthor: Donglu Shi\nFormat: PDF\nHardcover: 372 pages\nPublisher: William Andrew; 1 edition (October 10, 2014)\nLanguage: English\nISBN: 9781455777549\n\nIntroducing the fields of nanomaterials and devices, and their applications across a wide range of academic disciplines and industry sectors, Donglu Shi bridges knowledge acquisition and practical work, providing a starting point for the research and development of applications.\n\nThe book describes characterization of nanomaterials, their preparation methods and performance testing techniques; the design and development of nano-scale devices; and the applications of nanomaterials, with examples taken from different industry sectors, such as lighting, energy, bioengineering and medicine / medical devices.\n\nKey nanomaterial types are covered, such as carbon nanotubes, nanobiomaterials, nano-magnetic materials, semiconductor materials and nanocomposites. Shi also provides detailed coverage of key emerging technologies such as DNA nanotechnology and spintronics. The resulting text is equally relevant for advanced students (senior and graduate) and for engineers and scientists from a variety of different academic backgrounds working in the multi-disciplinary field of nanotechnology.\n\n- Provides detailed guidance for the characterization of nanomaterials, their preparation, and performance testing\n- Explains the principles and challenges of the design and development of nano-scale devices\n- Explores applications through cases taken from a range of different sectors, including electronics, energy and medicine","torrent":{"xt":"urn:btih:2e9b83b5a40f2ce40add6fa0ea3bb3249edef112","amp;dn":"Nanomaterials+and+devices+%5B2014%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e9b83b5a40f2ce40add6fa0ea3bb3249edef112","infoHashBuffer":{"type":"Buffer","data":[46,155,131,181,164,15,44,228,10,221,111,160,234,59,179,36,158,222,241,18]},"announce":[],"urlList":[]}}