{"title":"Boardwalk Empire: The Birth, High Times, and Corruption of Atlan","uid":9424101,"size":1470936,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2eab240890e76885f69531fb66ce3ac7b344f135&amp;dn=Boardwalk+Empire%3A+The+Birth%2C+High+Times%2C+and+Corruption+of+Atlan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1388654714,"description":"UMMARY:\n'When I was first approached by HBO to use Nelson Johnson's book as the basis for a TV series, my biggest challenge was choosing a time period in which to set it. Ultimately I settled on the 1920s of Atlantic City's legendary treasurer Nucky Johnson. A place of spectacle, shady politics, fast women and backroom deals' -Terence Winter, Emmy Award-winning writer of The Sopranos and Executive Producer of Boardwalk Empire From its humble beginnings as a fledgling seaside resort, Atlantic City grew to be America's playground - loud, brash, and dedicated to the pursuit of pleasure. In 1920 alcohol was banned across the States under Prohibition, yet, thanks to racketeers and corrupt politicians, the liquor in Atlantic City never stopped flowing. As the brothels, bars and gambling rooms flourished, the reputation of both the city itself and its most famous resident grew. Enoch 'Nucky' Johnson was a powerful political force and leading figure in organised crime. His corrupt alliance created a city where the rules just didn't apply, the dollar ruled and the law could be bought. The book that inspired the HBO series, Boardwalk Empire brings to life Nucky and the whole cast of his shady associates. Recounting the life of this fascinating city and its most colourful residents, it's a brilliantly told story of a city built on cards and dice, booze and broads.","torrent":{"xt":"urn:btih:2eab240890e76885f69531fb66ce3ac7b344f135","amp;dn":"Boardwalk+Empire%3A+The+Birth%2C+High+Times%2C+and+Corruption+of+Atlan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2eab240890e76885f69531fb66ce3ac7b344f135","infoHashBuffer":{"type":"Buffer","data":[46,171,36,8,144,231,104,133,246,149,49,251,102,206,58,199,179,68,241,53]},"announce":[],"urlList":[]}}