{"title":"Once upon a Time in America (Morricone, Ennio)","uid":4428892,"size":145811456,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2efd62cee22b0d2ed12d6d9f8bc127beea18ac2b&amp;dn=Once+upon+a+Time+in+America+%28Morricone%2C+Ennio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"michaelingeorgia","files":19,"time":1223179916,"description":"This is the original motion picture soundtrack to the 1982 film ONCE UPON A TIME IN AMERICA. This is a very difficult recording to find, and was only recently released on CD. The film is considered by some to be one of Sergio Leone's best. His others include THE GOOD THE BAD AND THE UGLY, A FISTFUL OF DOLLARS, ONCE UPON A TIME IN THE WEST, and FOR A FEW DOLLARS MORE. Like those films, it is masterfully scored by long-time Leone collaborator ENNIO MORRICONE, whose other credits include THE UNTOUCHABLES, THE MISSION, WOLF, and many others.\n\nThe film is epic is scope, spanning 60 years and telling the story of four friends who become gangsters during Prohibition. The cast includes James Woods, Robert DeNiro, Treat Williams, Danny Aiello, Burt Young and Tuesday Weld. The film itself is highly recommended, but has gotten relatively little play in the United States, where studio execs edited the film under protest from Leone, putting the film in chronological order (imagine putting PULP FICTION in chronological order, and you get the idea), and cutting more than an hour from its running time. Thus, make sure that you get see the original uncut version, which played to great acclaim outside the US. \n\nThe torrent includes the complete soundtrack ripped from CD at 256kps with the LAME codec at highest quality. \n\nEnjoy!","torrent":{"xt":"urn:btih:2efd62cee22b0d2ed12d6d9f8bc127beea18ac2b","amp;dn":"Once+upon+a+Time+in+America+%28Morricone%2C+Ennio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2efd62cee22b0d2ed12d6d9f8bc127beea18ac2b","infoHashBuffer":{"type":"Buffer","data":[46,253,98,206,226,43,13,46,209,45,109,159,139,193,39,190,234,24,172,43]},"announce":[],"urlList":[]}}