{"title":"Wet Moon Books 1-3","uid":8651128,"size":432240416,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2f0ba3cb1b1027b8b3e454e6f2452a5b369588ec&amp;dn=Wet+Moon+Books+1-3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"LeonardTSpock","files":-1,"time":1373107141,"description":"Written and Illustrated by Ross Campbell\nCleo's diary pages by Jessica Calderwood\n\n'Wet Moon Book 1: Feeble Wanderings'\nOni Press, 2004, 178 pages\n\nAn unusually usual day-to-day story in the Deep South, set in the gothic, swampy southern town of Wet Moon, a place fraught with lousy love lives, teen angst, and shadowy rednecks. As Cleo Lovedrop heads off for college at the local art school, she's haunted by her melancholic past: a lost love, a lost child. Friends and enemies live their lives around her, as trouble and dissent brews amongst them: an unseen social assailant spreads slander about Cleo, she is forced to deal with her two brusque roommates, and discovers unsolved mysteries about the girl who lived in her room previously. Elsewhere, Trilby deals with unsettled emotional and sexual issues, and keeping her secret habits hidden from everyone. And Audrey comes to the realization that, despite all her efforts, she always causes her friends distress, while Fern, a peculiar, deformed girl who lives in an isolated mansion in the bayous, begins to notice Cleo and her friends. As the moon grows full and lunar rays shine down, lunacy and moon-calves run free. Goths, friendship, romance, sex, betrayal, gossip, cats, murder, guilt, a squirrel monkey, and all the terrible and wonderful things people do to each other.\n\n'Wet Moon Book 2: Unseen Feet'\nOni Press, 2006, 188 pages\n\nRoss Campbell returns to the dark and crusty streets of Savannah in this new volume of stories. Chloe and her friends continue to find themselves trapped in the webs of relationships and social scenes that gather in the hidden corners of this strange little college town. But are they really trapped in this clique or is it exactly where they wanted to be?\n\n\n'Wet Moon Book 3: Further Realms Of Fright'\nOni Press, 2007, 268 pages\n\nRoss Campbell returns to the southern college town of Wet Moon! Cleo and her friends continue to navigate the sea of relationships that washes through this strange little burg. But the waters are rarely calm and the waves are unending. Can this little clique make it without sinking or will the weight of their secrets and insecurities leave them drowning?","torrent":{"xt":"urn:btih:2f0ba3cb1b1027b8b3e454e6f2452a5b369588ec","amp;dn":"Wet+Moon+Books+1-3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f0ba3cb1b1027b8b3e454e6f2452a5b369588ec","infoHashBuffer":{"type":"Buffer","data":[47,11,163,203,27,16,39,184,179,228,84,230,242,69,42,91,54,149,136,236]},"announce":[],"urlList":[]}}