{"title":"Samurai Trilogy I II III -Musashi Miyamoto (1954)","uid":4739434,"size":2078734826,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:309bac8eaddeada31d62ba13e84976eb2046560b&amp;dn=Samurai+Trilogy+I+II+III+-Musashi+Miyamoto+%281954%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"jgordon20904","files":4,"time":1235480851,"description":"About six weeks ago I stumbled across this movie on the IDC Comcast TV channel on a Saturday morning. The name of the movie was Samurai Trilogy I - Musashi Miyamoto (1954). I never heard of it before. I've spent eight years in Japan, have a Japanese wife and speak a little Japanese. I have a rack full of the standard swash-and-buckle samurai movies that everyone has heard of. Yet here was a three part technicolor samurai drama that I never heard of. Right away I jumped in and video taped it. I would have captured it on my hard drive if I had had enough time to get things set up.\n\nMy wife and I watched it right away. She understood it and enjoyed it. I watched it and was thoroughly confused. Never mind. It was beautiful for that early a date technicolor. Everything was good to look at: the faces, the costumes and all the scenery. \n\nI taped the other two episodes on the following Saturdays. Then I searched and found several offerings of it on Mininova and Pirate Bay, downloaded them and doctored them up. They were mostly not up to snuff. My plain old VHS picture looked better. \n\nHere it is. But be sure and read the commentary text file first. Then you won't be as confused as I was. For example, Musashi (Toshiro Mifune) is considered a wild guy (neighborhood kid), and he doesn't much care for the girls while they go for him. Starting out they are farm boys up in a tree watching the local army marching through town on the way to one of the most famous battles in Japanese history (Sekigahara). One month later they're slashing their way through the battlefield wielding swords like professionals.\nSurviving that war they stagger into a neighborhood farmhouse of two rather attractive females oblivious to a nearby war zone and roving brigands. \n\nIn other words things didn't add up for me. My wife didn't care. To me things jumped and jerked around without proper build-up in between. But, relax and enjoy, no matter what.\n","torrent":{"xt":"urn:btih:309bac8eaddeada31d62ba13e84976eb2046560b","amp;dn":"Samurai+Trilogy+I+II+III+-Musashi+Miyamoto+%281954%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"309bac8eaddeada31d62ba13e84976eb2046560b","infoHashBuffer":{"type":"Buffer","data":[48,155,172,142,173,222,173,163,29,98,186,19,232,73,118,235,32,70,86,11]},"announce":[],"urlList":[]}}