{"title":"The Best of Steve Martin- SNL (dvdmp4)","uid":7484270,"size":798075323,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:31197e71712e1243a1b09cad5209e7cdae02ec88&amp;dn=The+Best+of+Steve+Martin-+SNL+%28dvdmp4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"russell887","files":1,"time":1343530193,"description":"No other person has been a guest on Saturday Night Live as many times as the inimitable Steve Martin, which is what makes SNL's Best of Steve Martin compilation the finest of the series. This collection gives us not only clips of some of the show's funniest moments, but also a sense of how the show has evolved from the 1970s. Earlier monologues were rougher, less staged, but absolutely out of control in the best way, as Martin is given free rein to unleash his &quot;happy feet,&quot; play the banjo, and generally explore his zaniness. The earliest clip dates from 1976 and the latest from the mid-'90s, showcasing the program's greatest players throughout the seasons--Chevy Chase, Laraine Newman, Dan Aykroyd, Bill Murray, Mike Meyers, Dana Carvey, Nora Dunn, David Spade, Jon Lovitz. The beloved classics are here, from &quot;King Tut,&quot; with complete Egyptian regalia, to the arrow through the head to, of course, a &quot;wild and crazy guy.&quot; Not enough for you? Well, &quot;excuuuuuuse me.&quot; Also included are the Coneheads at home (with Martin playing a hapless IRS agent), &quot;Jeopardy 1999,&quot; &quot;Common Knowledge&quot; (one of the wittiest SNL sketches ever), and ads for &quot;Rise&quot; and for &quot;Steve Martin's Penis Cream.&quot; This collection will satisfy longtime SNL fans and is a great way to show newer fans what comedy is really about. \n\nINFO:  \nResolution- 672x448 \nFrame Rate- 29.97fps  \nPixel Shape- 10:11(NTSC4:3) \nVideo Structure- Progressive \nRun Time: Approx. 1 hr, 20 min.   \nSize: 761MB   \n","torrent":{"xt":"urn:btih:31197e71712e1243a1b09cad5209e7cdae02ec88","amp;dn":"The+Best+of+Steve+Martin-+SNL+%28dvdmp4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31197e71712e1243a1b09cad5209e7cdae02ec88","infoHashBuffer":{"type":"Buffer","data":[49,25,126,113,113,46,18,67,161,176,156,173,82,9,231,205,174,2,236,136]},"announce":[],"urlList":[]}}