{"title":"PS1 Emulator + Games","uid":4426490,"size":4768237456,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:31ba7bdf2e1a22deb02605de7c99b72b27226e87&amp;dn=PS1+Emulator+%2B+Games&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":4,"uploader":"Sephiroth912","files":1,"time":1223060858,"description":"If you like this one, please download and seed my other emulator torrent which contains NES, Super NES, Game Boy, Sega Genesis, and Nintendo 64 emulators and over 100 total games. There is also a clean copy of ePSXe included. Follow the link below. Please seed after downloading. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4444485/Various_Emulators___Games&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4444485/Various_Emulators___Games&lt;/a&gt;\n\n****************\n\nPlaystation One emulator ePSXe (most up to date version) with BIOS and games included. To run, simply run the ePSXe file once the folder has been extracted. The following games are included:\n\n==============================\nSee FAQ below if having issues\n==============================\n\n* Chrono Cross (Disc 1 and 2)\n* Crash Bandicoot\n* Crash Bandicoot 2\n* Crash Bandicoot 3: Warped\n* Crash Bash\n* Crash Team Racing\n* Digimon Digital Card Battle\n* Digimon World\n* Digimon World 2\n* Digimon World 3\n* Final Fantasy Tactics\n* Metal Gear Solid (Disc 1 only. Disc 2 was corrupted when downloaded initially)\n* Myst\n* Silent Hill\n* Tomba!\n* Yu-Gi-Oh! Forbidden Memories\n\n\n\n=====\nFAQS\n=====\n\nQ: Nothing's working, do I need to burn the discs?\nA: No you do not. Use the option &quot;Run ISO&quot; after loading ePSXe and select the game you wish to play. If that still doesn't work then click &quot;Config&quot; -&gt; &quot;Wizard Guide&quot; and follow the instructions.\n\nQ: Can you put ((insert game name here)) up as well?\nA: If I had a bigger hard drive and my computer wasn't shared I would. There are many other sources online, including TPB. The best website I have found so far is Romulation.com but you are limited on your usable points there. You start with a small amount but that number slowly goes up over time. This is how I was able to get most of the games included in this torrent.\n\nQ: Chrono Cross won't let me use disc 2, what should I do?\nA: Unfortunately due to a bug in this current version of ePSXe you won't be able to use disc 2. Please scroll through the comments, as someone has posted a link to a guide to downloading an older version of ePSXe and using it to play Chrono Cross disc 2. This happens because it will not let you save before using disc 2. Other games like Final Fantasy VII and Metal Gear Solid will work fine but you will need to completely restart ePSXe.\n\nQ: My computer crashes when I use this, there's a virus isn't there?\nA: No there is not. Please remember this is a big file. You should also make sure your computer can run the games in the first place. If they can't then it's probably something to do with your computer. Scan this over however many times you want, you will not find a virus in here.\n\nQ: Can I burn these and play them on my Playstation?\nA: No, you cannot use burned discs like this on your Playstation or Playstation 2 unless the systems are modded.\n\nQ: Does ((insert game name here)) work?\nA: While I cannot guarantee all games will work on modded systems (for example the Crash games are PAL and won't play on NTSC systems) but all games do work on the included ePSXe program. However, some are a little glitchy in places or otherwise run slow (Digimon World 3's cutscenes look messed up on the black bars at the top and bottom of the screen for me).","torrent":{"xt":"urn:btih:31ba7bdf2e1a22deb02605de7c99b72b27226e87","amp;dn":"PS1+Emulator+%2B+Games","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31ba7bdf2e1a22deb02605de7c99b72b27226e87","infoHashBuffer":{"type":"Buffer","data":[49,186,123,223,46,26,34,222,176,38,5,222,124,153,183,43,39,34,110,135]},"announce":[],"urlList":[]}}