{"title":"PassMark BurnInTest Professional 8.1.1013 (Install + Portable)","uid":14011500,"size":57585370,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:31f8980d775fb6aae5a74039b71f8f2e0f0a7633&amp;dn=PassMark+BurnInTest+Professional+8.1.1013+%28Install+%2B+Portable%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"jovo_bih","files":1,"time":1458830758,"description":"About this release\r\n\r\nRelease date: 23/03/2016\r\nInstall: run setup file and register with key from text file\r\nPortable: both x86 and x64 versions are registered, just unzip and run executable 'bit.exe' or 'bit32.exe'\r\n\r\nNew in version 8.1 build 1013\r\n\r\n- Removed some unnecessary 2D trace level 2 information from the log\r\n- Stopped an incorrect error being logged for the midi sound test in some cases that was occurring after the tests have been stopped\r\n- Fixed a bug in the raw disk read only test where the test would attempt to read past the end of the disk in some cases (if the total amount of bytes on the disk was exactly divisible by 64MB)\r\n- Changed how the USB3 device handles are opened, they are now created before starting the test threads to prevent the UI locking up once the load on the USB system becomes heavy when starting lots of plugs at 100%\r\n- System information library updates\r\n- Temperature support for NVMe drives\r\n- Added retrieval of Device Info + SMART values for NVMe Samsung and Intel SSD drives\r\n- Fixed an issue with multiple network cards not being displayed in system information\r\n\r\nAbout PassMark BurnInTest Professional 8\r\n\r\nPassMark BurnInTest™ is a software tool that allows all the major sub-systems of a computer to be simultaneously stress tested for endurance, reliability and stability.\r\n\r\n- Assists in PC Troubleshooting and diagnostics.\r\n- Avoid delivering dead on arrival and faulty hardware to your customers.\r\n- Dramatically reduce your test times with simultaneous testing.\r\n- Build your image as a supplier of quality systems.\r\n- Avoid costly downtime, system rebuilds and lost data.\r\n- Test the stability of a system after configuration changes or hardware upgrades (critical for overclocking and system upgrades).\r\n- The hottest, fastest CPU Burn In tool around! (Heat testing)\r\n\r\nThe best value professional Windows hardware test tool on the market!\r\n\r\nAnyone who has used computers for any period of time will understand the importance of having a stable system. The cost of a hardware failure can be enormous. If you are lucky your data will only become inaccessible while faulty components are replaced. If you're unlucky you can lose your files completely or have them permanently corrupted. Even if you have good backups, you can still lose days of work returning the PC to its pre-failure state. In many cases the lost data can never be replaced and businesses can be brought to their knees, with the loss of documentation, customer details and financial records.\r\n\r\nBurnInTest will bring intermittent or hidden problems to the surface so that after a successfully run the computer can be used with a much higher level of confidence. BurnInTest can also be used by overclockers to verify system stability at high clock speeds.\r\n\r\nTesting for hardware problems\r\n\r\nJust press the start button and have BurnInTest test your system hardware.\r\n\r\nBurnInTest thoroughly exercises the hardware in Windows based servers, desktops, laptops and tablets* in a short period of time, in the same way as normal applications use a PC over a long period of time. This takes advantage of the fact that computer hardware tends to fail either very early in its life or after many thousands of hours of use. Typically BurnInTest should be used before a system is put into service or after a system upgrade.\r\n\r\nBurnInTest tests the CPU, hard drives, SSDs, RAM, optical drives (CD, DVD and Blu-ray), sound cards, graphics cards (GPGPU, Video RAM, 2D graphics, 3D graphics and video playback), network ports and printers.\r\n\r\nThe Professional version also has a number of additional tests including microphones, webcams, battery's, tape drives, USB ports (USB 3.0 and 2.0), Serial ports and Parallel ports (with the use of loop back plugs).\r\n\r\nIf you have specialized hardware that BurnInTest does not test out of the box, you can write your own test and integrate it with BurnInTest. For example, PassMark has produced plugin tests for Touchscreens and Keyboards.\r\n\r\nThis can all be done simultaneously as the application is multithreaded, making BurnInTest the fastest test around.\r\n\r\nSystem information\r\n\r\nBurnInTest detects and collects system information and this is displayed in BurnInTest and the test reports. A goal of BurnInTest, unlike some other tools, is to include as much useful detailed information as possible, rather than mountains of information that is easy to collect.\r\n\r\nTest results and reporting\r\n\r\nDuring testing BurnInTest will display and log the number of test cycles, operations and errors for each test; as well as test events, such as critical errors, serious errors, warnings and information. On completion of testing, BurnInTest will display a simple PASS or FAIL.\r\n\r\nBurnInTest can produce a number of reports for a test run, including a text report, HTML report, a customer focused test certificate and a statistics report. These tests may include summarized information. Very detailed debug logging is also possible. These reports are saved to disk and can be printed after testing. Test results can also be stored in a centralized database*.\r\n\r\nInformation about your current testing can also be included in these reports, such as your Customer's name, the testers name, machine type and serial number.\r\n\r\nSupport is provided for copying the system information and results to other applications (e.g. email or MS-Word) via a variety of formats (text, HTML and a number of image formats).\r\n\r\nA customer results certificate is customizable for your companies design style.\r\n\r\nHomepage http://www.passmark.com/products/bit.htm","torrent":{"xt":"urn:btih:31f8980d775fb6aae5a74039b71f8f2e0f0a7633","amp;dn":"PassMark+BurnInTest+Professional+8.1.1013+%28Install+%2B+Portable%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31f8980d775fb6aae5a74039b71f8f2e0f0a7633","infoHashBuffer":{"type":"Buffer","data":[49,248,152,13,119,95,182,170,229,167,64,57,183,31,143,46,15,10,118,51]},"announce":[],"urlList":[]}}