{"title":"Killing Kennedy by Bill O'Reilly and Martin Dugard","uid":7700536,"size":3050085,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3204dcc5e9f20bd26bba332af66a60fd7ab01d75&amp;dn=Killing+Kennedy+by+Bill+O%27Reilly+and+Martin+Dugard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"azizex666","files":-1,"time":1349498631,"description":"\n\nA riveting historical narrative of the shocking events surrounding the assassination of John F. Kennedy, and the follow-up to mega-bestselling author Bill O'Reilly's Killing Lincoln.\n\nMore than a million readers have thrilled to Bill O'Reilly's Killing Lincoln, the page-turning work of nonfiction about the shocking assassination that changed the course of American history. Now the anchor of The O'Reilly Factor; recounts in gripping detail the brutal murder of John Fitzgerald Kennedy--and how a sequence of gunshots on a Dallas afternoon not only killed a beloved president but also sent the nation into the cataclysmic division of the Vietnam War and its culture-changing aftermath.\n\nIn January 1961, as the Cold War escalates, John F. Kennedy struggles to contain the growth of Communism while he learns the hardships, solitude, and temptations of what it means to be president of the United States. Along the way he acquires a number of formidable enemies, among them Soviet leader Nikita Khrushchev, Cuban dictator Fidel Castro, and Alan Dulles, director of the Central Intelligence Agency. In addition, powerful elements of organized crime have begun to talk about targeting the president and his brother, Attorney General Robert Kennedy.\n\nIn the midst of a 1963 campaign trip to Texas, Kennedy is gunned down by an erratic young drifter named Lee Harvey Oswald. The former Marine Corps sharpshooter escapes the scene, only to be caught and shot dead while in police custody.\n\nThe events leading up to the most notorious crime of the twentieth century are almost as shocking as the assassination itself. Killing Kennedy chronicles both the heroism and deceit of Camelot, bringing history to life in ways that will profoundly move the reader. This may well be the most talked about book of the year.\n\n\n\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n\n             **Support Your Favorite Authors By Buying Their Books**\n\n               Check out all my Magazine and ebook uploads here.\n\n                     &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;","torrent":{"xt":"urn:btih:3204dcc5e9f20bd26bba332af66a60fd7ab01d75","amp;dn":"Killing+Kennedy+by+Bill+O%27Reilly+and+Martin+Dugard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3204dcc5e9f20bd26bba332af66a60fd7ab01d75","infoHashBuffer":{"type":"Buffer","data":[50,4,220,197,233,242,11,210,107,186,51,42,246,106,96,253,122,176,29,117]},"announce":[],"urlList":[]}}