{"title":"The Computer Boys Take Over[PDF] [StormRG]","uid":11000436,"size":13941256,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32dda21e39925d3f4ae0802d87e31bd84e3b6d33&amp;dn=The+Computer+Boys+Take+Over%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"steelballz","files":-1,"time":1410130793,"description":"Description\nThe Computer Boys Take Over\nAuthor:Nathan L Ensmenger\nPublisher and Published Date:The MIT Press (Aug. 13 2010)\nISBN-10:0262050935\nISBN-13:9780262050937\nFormat: Retail PDF\nReader Required: Adobe Acrobat\n\n\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\nIt should also be noted that any reference to any dvd, cd, or any other dlc or extra content in this, or any other torrent I upload, is not available in the torrent unless I state otherwise. If you want the extras, buy the product\nThis PDF is encrypted! This encryption will NOT interfere with opening, printing, or copying the PDF. It will only prevent editing of the PDF. I have my reasons for it. If you have questions pm me through my acct on KAT\nIf you do have difficulties opening this file while running a Linux OS, try opening in windows or mac using Adobe Acrobat. If you still can't open, pm me and I'll investigate.\n\n\nimage\nCover from actual book file\n\n\nProduct Description\n\nThis is a book about the computer revolution of the mid-twentieth century and the people who made it possible. Unlike most histories of computing, it is not a book about machines, inventors, or entrepreneurs. Instead, it tells the story of the vast but largely anonymous legions of computer specialists--programmers, systems analysts, and other software developers--who transformed the electronic computer from a scientific curiosity into the defining technology of the modern era. As the systems that they built became increasingly powerful and ubiquitous, these specialists became the focus of a series of critiques of the social and organizational impact of electronic computing. To many of their contemporaries, it seemed the &quot;computer boys&quot; were taking over, not just in the corporate setting, but also in government, politics, and society in general. In The Computer Boys Take Over, Nathan Ensmenger traces the rise to power of the computer expert in modern American society. His rich and nuanced portrayal of the men and women (a surprising number of the &quot;computer boys&quot; were, in fact, female) who built their careers around the novel technology of electronic computing explores issues of power, identity, and expertise that have only become more significant in our increasingly computerized society.\n\nIn his recasting of the drama of the computer revolution through the eyes of its principle revolutionaries, Ensmenger reminds us that the computerization of modern society was not an inevitable process driven by impersonal technological or economic imperatives, but was rather a creative, contentious, and above all, fundamentally human development.\n\n\n\n\nimage\nScientia est potentia","torrent":{"xt":"urn:btih:32dda21e39925d3f4ae0802d87e31bd84e3b6d33","amp;dn":"The+Computer+Boys+Take+Over%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32dda21e39925d3f4ae0802d87e31bd84e3b6d33","infoHashBuffer":{"type":"Buffer","data":[50,221,162,30,57,146,93,63,74,224,128,45,135,227,27,216,78,59,109,51]},"announce":[],"urlList":[]}}