{"title":"Brideshead Revisited - Evelyn Waugh (Unabridged - Jeremy Irons)","uid":5100375,"size":289647824,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:33347a8ae494482e3cb27371931936fa2c213aad&amp;dn=Brideshead+Revisited+-+Evelyn+Waugh+%28Unabridged+-+Jeremy+Irons%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"sheila6","files":-1,"time":1253924803,"description":"Forgive the flippancy of the title, as this is, without a doubt the greatest novel I have ever read. The central theme is that of stringent religious values and breaking away from, or returning to them.\n\nI am an extremely committed atheist and Waugh was a fervent Roman Catholic. This surely proves Waugh's sublime vision, insight and, above all, his splendidly non-preachy way of writing. Beyond that, it is one of the greatest love stories ever written. We may not mention Ryder and Flyte in the same breath as Romeo and Juliet, Tristan and Isolde, or Dido and Aeneas, but as a study in humanity (in my humble opinion) they exceed them all.\n\nThe sheer beauty of Waugh's prose which is, at times, scarcely believable (see 'A blow, expected, repeated, falling on a bruise') is coupled with the outright hilarity of many passages (see the Belgian who feels as if it is his duty to oppose the lower classes everywhere).\n\nJeremy Irons, of course, also starred in the 1981 television adaptation of the novel, which also starred Laurence Olivier and Anthony Andrews, which is highly unusual in that it is faithful to the letter and the spirit of the novel, and is really rather splendid. The novel, however, remains a towering achievement, a heart-rending tale of loss and rejection, as well as acceptance and redemption. The finest novel of the Twentieth Century. You owe it to yourself to read it and to watch the 1981 adaptation. (Though avoid at all costs the 2008 film version as it is an absolute shocker!!)\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:33347a8ae494482e3cb27371931936fa2c213aad","amp;dn":"Brideshead+Revisited+-+Evelyn+Waugh+%28Unabridged+-+Jeremy+Irons%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33347a8ae494482e3cb27371931936fa2c213aad","infoHashBuffer":{"type":"Buffer","data":[51,52,122,138,228,148,72,46,60,178,115,113,147,25,54,250,44,33,58,173]},"announce":[],"urlList":[]}}