{"title":"Strawbs...Hero and Heroine(1974)remastered(1998)[FLAC]","uid":5742455,"size":301024342,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:340635a21189edfc50e35274aac8907a61a84522&amp;dn=Strawbs...Hero+and+Heroine%281974%29remastered%281998%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"dickspic","files":17,"time":1281083965,"description":"1998 Hero and Heroine [Bonus Tracks], [Reissue], [Remastered]    CD  A&amp;M 540 935-2 \n  \n1 Autumn   8:27 \n2 Sad Young Man   4:09 \n3 Just Love   3:41 \n4 Shine on Silver Sun   2:46 \n5 Hero &amp; Heroine   3:29 \n6 Midnight Sun   3:06 \n7 Out in the Cold   3:19 \n8 Round and Round   4:44 \n9 Lay a Little Light on Me   3:27 \n10 Hero's Theme   2:28 \n Bonus Tracks    \n11 Still Small Voice   2:28 \n12 Lay a Little Light on Me [early version]   2:20 \n\nHero and Heroine is the most progressive album from the Strawb's discography, as well as one of the best.  The band's origins as a prog folk outfit are almost entirely forgotten here, apart from a few laid-back acoustic-driven melodies such as &quot;Midnight Sun&quot; and &quot;Out in the Cold&quot;.  Hero and Heroine thus completes the transition that the Strawbs had began two years earlier with the magnificent Grave New World- the only other album in the band's catalogue that surpasses this one in terms of quality.  This record is also a far more cohesive stylistic statement than either the previous Bursting at the Seams or the subsequent Ghosts, and as such may be the most attractive place for the devoted proghead to start with the band. \n\nNearly every track off Hero and Heroine is good, even if the album does lack as many phenomenal songs as Grave New World.  The one track here that does rank amongst the finest of the Strawbs' career is the opening &quot;Autumn&quot;- an eight-plus minute dosage of laid-back symphonic prog goodness with some absolutely gorgeous instrumental passages.  I'm also a big fan of the somewhat quirky title track, which I initially hated but have grown to love.  Unfortunately, as with Bursting at the Seams, Dave Cousins has decided to include another stab at radio success.  Here the offending track is &quot;Just Love&quot; and, although it's a far more substantial tune than Bursting's &quot;Part of the Union&quot; (the atmospheric bridge here is downright proggish), it is no less disruptive to the flow of the album.  I'm also somewhat underwhelmed by &quot;Lay a Little Light on Me&quot;, which has some excellent instrumental breaks but a very forgettable vocal melody.  If it weren't for these minor missteps, I'd be strongly tempted to grant Hero and Heroine a rating of 4.5 stars, but as it stands the record falls a bit short of being a classic.  Still an excellent addition to any progressive rock collection. \n\ncd ripped by dBpoweramp\n\nplease seed","torrent":{"xt":"urn:btih:340635a21189edfc50e35274aac8907a61a84522","amp;dn":"Strawbs...Hero+and+Heroine%281974%29remastered%281998%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"340635a21189edfc50e35274aac8907a61a84522","infoHashBuffer":{"type":"Buffer","data":[52,6,53,162,17,137,237,252,80,227,82,116,170,200,144,122,97,168,69,34]},"announce":[],"urlList":[]}}