{"title":"My Little Pony FiM #1-10 Comic","uid":8874592,"size":199674903,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:34772d997c31c5c32e42318c3d071c789e70a117&amp;dn=My+Little+Pony+FiM+%231-10+Comic+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"flucked","files":10,"time":1378159661,"description":"As of 9/2/2013 This is the complete comic release. See comment section for the micro series torrent. \n\n\nMy Little Pony FIM #1\n\nWelcome to Ponyville, home of Twilight Sparkle, Rainbow Dash, Rarity, Fluttershy, Pinkie Pie, Applejack, and all your other favorite Ponies! Something's not right in the town though, as some of the inhabitants are acting very, very strange! It's up to the Mane Six to find the source of the weirdness before it's too late!\n\nMy Little Pony FIM #2\n\nQueen Chrysalis has returned! Our ponies have no time to horse around, as they set off to rescue their friends from Chrysalis kingdom. What magical adventures await them, and where the heck is Princess Celestia?\n\nMy Little Pony FIM #3\n\nThe Mane 6 enter the heart of the Changeling Kingdom to rescue their friends! Danger lurks everywhere, and each Pony will have to put their best hoof forward if they are to survive the night! Unfortunately that's exactly what the Changeling Queen expects! Will our heroes fall into her trap?\n\nMy Little Pony FIM #4\n\nTheir epic quest nearing its end, the Mane 6 reach the Changeling Kingdom and find themselves at the mercy of Queen Chrysalis! A sinister offer threatens to tear the group apart before they can save the day. Will friendship prevail over the Queen's nefarious plan?\n\nMy Little Pony FIM #5\n\nAttention, everypony! Get ready for another unforgettable adventure in the land of Equestria. Twilight Sparkle and gang are confronted with a perilous new danger in the form of a long-unseen enemy! See how the Magic of Friendship prevails in the start of a brand new story arc!\n\nMy Little Pony FIM #6\n\nNightmare Moon returns! But it's not the same old Nightmare Moon! Someone new, someone close to our heroes, has taken the mantle! What will the Ponies do when the danger hits so close to home? Read it and find out!\n\nMy Little Pony FIM #7\n\nThe new Nightmare Moon has revealed herself... and captured our stunned Ponies! With time running short for Equestria before a full-scale invasion, the only hope lies with... Spike?! And what role will Princess Luna play?\n\nMy Little Pony FIM #8\n\nThe awesome ending to My Little Pony's epic 2nd story arc! The Nightmare forces of the moon descend down on Ponyville! Princess Celestia will try her best to stop the dark forces, but she may be overwhelmed! It'll be up to our favorite ponies to stop the new Nightmare Moon!\n\nMy Little Pony FIM #9\n\nIt's almost Hearth's Warming Eve, and the Apple family is busy at work preparing an array of tasty apple treats for all of Ponyville. But when a mysterious creature starts ruining their crop, Applejack sets out to find out who's behind this tomfoolery! Who, or what, is the SASS SQUASH??\n\nMy Little Pony FIM #10\n\nThe trials and tribulations of Big Mac continue! His epic journey continues, as Big Mac must come face to face with some of the most unique citizens of Ponyville. DRAMA! REVELATIONS! DANCING! This one's got it all!\n\n\nAll files are either .cbr or .cbz","torrent":{"xt":"urn:btih:34772d997c31c5c32e42318c3d071c789e70a117","amp;dn":"My+Little+Pony+FiM+%231-10+Comic+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34772d997c31c5c32e42318c3d071c789e70a117","infoHashBuffer":{"type":"Buffer","data":[52,119,45,153,124,49,197,195,46,66,49,140,61,7,28,120,158,112,161,23]},"announce":[],"urlList":[]}}