{"title":"three 6 mafia's .. dj paul collection","uid":4148340,"size":1402324832,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:34cfb69d3c5d5c7e026fd141ab686851af5161f7&amp;dn=three+6+mafia%5C%27s+..+dj+paul+collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"nikeagogo","files":313,"time":1208824862,"description":"included:\n\ndj paul - vol 02\ndj paul - vol 06 - 1992\ndj paul - vol 08 - 1992\ndj paul - vol 09 - 1992\ndj paul - vol 10 - 1992\ndj paul - vol 11\ndj paul - vol 12 part 1 - 1993\ndj paul - vol 12 part 2 - 1993\ndj paul - vol 14 - 1993\ndj paul - vol 15 - for dem niggas wit anna - 1994\ndj paul - vol 16 - for da summa - 2002\ndj paul - vol 16 - for tha summa of \\'94\ndj paul - vol 16 - dragged n chopped\ndj paul &amp; juicy j - vol 1 - in the beginning\ndj paul &amp; juicy j - vol 2 - da exorcist\ndj paul &amp; juicy j - vol 3 - spring mix\ndj paul &amp; juicy j - graveyard productions - the havoc\ndj paul &amp; lord infamous - the serial killaz - 1993\ndj paul &amp; lord infamous - vol 1 - come with me to hell - 1994\ndj paul &amp; lord infamous - vol 2 - come with me to hell - 1995\ndj paul presents immortal lowlife - lost underground tapes - 1995\n\nabout:\n\nDJ Paul (born Paul Beauregard in 1977 in Memphis, Tennessee) is one of the producers (along with Juicy J) of Memphis rap group Three 6 Mafia and collective Hypnotize Minds. He is the brother of group member Lord Infamous. Three 6 Mafia won an Academy Award for Best Song for \\&quot;It\\'s Hard Out Here for a Pimp.\\&quot;\n\nTogether with production partner Juicy J, DJ Paul played an important role in the South\\'s rise to prominence within the once East and West Coast dominated rap industry. Behind the duo\\'s leadership, Three 6 Mafia rose from an underground phenomenon in Memphis to a nationally recognized rap empire, spinning off numerous solo albums for the collective\\'s many members in the mid- to late 1990s. Like his production partner, DJ Paul specialized in dark, eerie tracks driven by bass-heavy beats and haunting sounds. He also raps as a member of Three 6 Mafia. Moreover, Three 6 Mafia ventured into film making with Choices (2001), a straight-to-video film starring most of the Three 6 Mafia\\'s collective, Hypnotize Minds. Juicy J (born Jordan Houston) and DJ Paul (Paul Beauregard) first came together at the dawn of the 1990s, when they worked as DJs in the Memphis area. The two soon began producing their own tracks and invited numerous Memphis rappers to rap over the beats. They released the resulting tracks locally as Three 6 Mafia; years later these recordings would resurface as re-releases. In 1995, the loose collective Three 6 Mafia began to form and self-released its debut album, Mystic Stylez. The album became an underground success, and Three 6 Mafia, in turn, signed a distribution deal with Relativity for its Hypnotize Minds imprint. Throughout the late 1990s, Juicy J and DJ Paul produced numerous albums a year for Hypnotize Minds and capitalized on the lucrative distribution deal. By the end of the decade, the two producers were at the helm of an empire, having extended their brand to alarming lengths, culminating with their commercial breakthrough album, When the Smoke Clears (2000), which debuted at number six on Billboard\\'s album chart.\n\n","torrent":{"xt":"urn:btih:34cfb69d3c5d5c7e026fd141ab686851af5161f7","amp;dn":"three+6+mafia%5C%27s+..+dj+paul+collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34cfb69d3c5d5c7e026fd141ab686851af5161f7","infoHashBuffer":{"type":"Buffer","data":[52,207,182,157,60,93,92,126,2,111,209,65,171,104,104,81,175,81,97,247]},"announce":[],"urlList":[]}}