{"title":"Marvel NOW! Week 73 (4/9/2014) )darkhomr) [ALL]","uid":9931727,"size":890407003,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:34f139c2a00d8c98205cf34392245476530b1100&amp;dn=Marvel+NOW%21+Week+73+%284%2F9%2F2014%29+%29darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"dadrkhomr","files":18,"time":1397111758,"description":"Welcome to the 2014 version of Marvel NOW!  Week after week I will be bringing you the latest in comics in the Marvel NOW universe as well as the All-New Marvel NOW stories.  Can you believe we are 73 weeks in the Marvel NOW and they are putting out an ALL NEW version of the titles?  What will NOT be included is Disney stuff, TV stuff, and the kids books. Those will be included (when available) in my Total Marvel pack.\n\nThis weeks' release (April 9, 2014) includes 18 issues with 4 new #1's (All New Doop, All New Ultimates, Iron Fist, and Nightcrawler )  \n\nMy release packs are as follows: \n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\n\n\n[IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/doop1_zpse9b559ff.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/anultimates1_zps3c927935.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/daredevil150_zps148698b8.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/ironfist1_zps1d6835f8.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/nightwing1_zps11da3552.jpg[/IMG] \n\n\n\n\n\nAll New Doop #1 (of 5) (CBR 4/9/2014)\n\nLiving in the margins of the X-Men, Doop has freaked out X-Men and readers alike. However, when he gets deeply involved in X-Men business (and in the personal life of Kitty Pryde!), Doop will be thrust into the spotlight. This adventure will prove that Doop is, in fact, the most powerful X-Man! Written by co-creator Peter Milligan (X-FORCE), covers by co-creator Mike Allred (X-FORCE, FF) and innovative interior art by David Lafuente (AVENGERS, ULTIMATE SPIDER-MAN)! \n\nAll New Ghost Rider #2 (CBR 4/9/2014)\n\n&quot;ENGINES OF VENGEANCE&quot; PART 2 ROBBIE REYES has been given a new awesome power but can the teen handle it or will it drive him to a path of destruction? Who owns the HAUNTED RACE CAR and what will they do to get it back? What are the PINK PILLS and who is behind their creation? \n\nAll New Ultimates #1 (CBR 4/9/2014)\n\nTHE NEXT GENERATION OF ULTIMATES IS HERE!!! SPIDER-MAN, BLACK WIDOW, KITTY PRYDE, BOMBSHELL, CLOAK &amp; DAGGER officially unite to tackle the vicious, rampant crime wave overtaking Hell's Kitchen! DIAMONDBACK leads the teen gang, the SERPENT SKULLS, as they run West Midtown's drug and weapons trade &amp; deal in murderous citywide terror! Detective Brigid O'Reilly and her anti-gang unit are on the hunt for a serial mask killer called SCOURGE; they get close but not without some casualties! Written by Michel Fiffe, the creator of the acclaimed indie series COPRA \n\nAll New X-Factor #6 (CBR 4/9/2014)\n\nReunited-and it feels so BAD?!? It's X-Factor and Cypher vs. Warlock! Serval Industries brings you the super team you can count on! \n\nAll New X-Men #25 (CBR 4/9/2014)\n\nOVER-SIZED 25th ISSUE! Artist Stuart Immonen is joined by a practical comic book artist hall of fame for this special landmark issue! \n\nAvengers AI #11 (CBR 4/9/2014)\n\nJourney ten thousand years into the future of the Marvel Universe with the Avengers! Humanity is extinct--and machines battle across the galaxy! What is . . . the Galactus Bomb? \n\nAvengers Undercover #2 (CBR 4/9/2014)\n\nGO INSIDE THE MASTERS OF EVIL! Our teen heroes infiltrate the Avengers' arch nemesis . . . but will they ever get out? Bloodstone + the Son of Satan = Hell on Earth! \n\nCaptain Marvel #2 (CBR 4/9/2014)\n\nHigher, faster, further . . . WAR?! Captain Marvel forges towards the final frontier-and is thrown into the frontlines of battle. Can this half-alien survive in an all alien-world? The breakout hit of 2012 makes a glorious return! \n\nDaredevil #1.50 (CBR 4/9/2014)\n\nCelebrate Daredevil's fiftieth anniversary with a look at the future! A special standalone story that takes place on Matt Murdock's 50th birthday. How has his life changed? Who lives? Who dies? See if you can spot all the clues the Daredevil creative team has planted for the year 2014! Plus: Stories by special guest creators from Murdock's murky past! Fifty years without fear have all lead up to this! \n\nDeadpool #27 (CBR 4/9/2014)\n\nIt's a Deadpool wedding! That's right-the day you never dreamed would come has finally arrived . . . Deadpool is getting MARRIED! First up in this ENORMOUSLY OVERSIZED ISSUE is our the main feature-the biggest wedding since that one guy married that other guy as Deadpool and his mysterious bride tie the knot in a tale by Gerry Duggan, Brian Posehn, &amp; Mike Hawthorne! THEN, we've rounded up EVERY writer to ever pen Wade's series to celebrate this magical occasion! No self-respecting Poolophile can miss this one! It's the most important issue 27 in the history of comics! \n\nIron Fist Living Weapon #1 (CBR 4/9/2014)\n\nHigh above the city, in a multi-million dollar penthouse, Danny Rand, a.k.a. Iron Fist, &quot;The Living Weapon,&quot; is haunted by the consequences of choosing death over life. A message from Iron Fist's mystical homeland of K'un-Lun brings Danny back to his blood soaked origin of betrayal and vengeance! Revenge is a weapon that cuts both ways . . . . Will Danny survive the bloodletting? A one-of-a-kind kung fu action epic directed by the inimitable Kaare Andrews! \n\nIron Man #24 (CBR 4/9/2014)\n\nTHE NEW EPIC CONTINUES, &quot;RINGS OF THE MANDARINS&quot; When the enemy lines is &quot;Svartalfheim, home of the Dark Elves&quot; and MALEKITH THE ACCURSED wants to wear your skin, things get complicated. Will Tony have to resort to a very special IRON MAN suit? \n\nMighty Avengers #9 (CBR 4/9/2014)\n\nThe Blue Marvel faces a nightmare from the depths of the Neutral Zone--and the depths of his past! Meanwhile, Ronin can't hide from the Deathwalkers any longer. . . . . . or from the readers! This ish--the mask comes off! \n\nNightcrawler #1 (CBR 4/9/2014)\n\nNIGHTCRAWLER IS BACK! Newly-returned from the afterlife, veteran X-Man Kurt Wagner finds himself in a world that's a far cry from the one he left: Professor Xavier is dead, Cyclops is on the run, and the X-Men are divided. But determined not to let his new lease on life go to waste, Nightcrawler hits the road alongside Wolverine, eager to right some wrongs and safeguard the future mutantkind... and he's going to do it by the means he loves most: swashbuckling, lady-charming and-of course-BAMFing! \n\nSecret Avengers #2 (CBR 4/9/2014)\n\nEarth is in danger. Massive decommissioned S.H.I.E.L.D. satellites are about to fall on us all. It's a P.R. nightmare in the making! Speaking of things falling from space: Nick Fury and special agent Phil Coulson are about to die painfully Unless Hawkeye, Black Widow and Spider-Woman save them! Maria Hill is wounded. The hitman made it personal. Hill's potential savior? M.O.D.O.K.!\n\nSuperior Foes Of Spider-Man #11 (CBR 4/9/2014)\n\nThey don't get NOW-er than the Superior Foes of Spider-Man! Is there a rat in the Sinister Six?... though there's still only five members. Spencer &amp; Lieber continue the sleeper hit of the NOW-lenium! \n\nThunderbolts #24 (CBR 4/9/2014)\n\nThe Tbolts turn adventurer as they trek into Central America! Thrill, chills, and romance in the heart of the jungle! A mysterious power that's too much for anyone to contain! \n\nWhat If Age Of Ultron #2 (of 5) (CBR 4/9/2014)\n\nTHE SECRET ARMOR WARS! In a world without Iron Man, the Armor Wars are fought without a victor, scorching the Earth! Years later, one of the last remaining superheroes, an aged Amazing Spider-Man, must form a Fantastic Four the likes of which our world has not seen in years! Teaming with Ghost Rider, the Incredible Hulk and Wolverine they are in pursuit of the one weapon that could unite the planet--The Forgotten Iron Man! \n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:34f139c2a00d8c98205cf34392245476530b1100","amp;dn":"Marvel+NOW%21+Week+73+%284%2F9%2F2014%29+%29darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34f139c2a00d8c98205cf34392245476530b1100","infoHashBuffer":{"type":"Buffer","data":[52,241,57,194,160,13,140,152,32,92,243,67,146,36,84,118,83,11,17,0]},"announce":[],"urlList":[]}}