{"title":"-40, The New Generation of International Architecture (Art Book)","uid":15524953,"size":56631231,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:372824dfef48664940dc850e66b33d20cd53bbc7&amp;dn=-40%2C+The+New+Generation+of+International+Architecture+%28Art+Book%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"STBGD","files":1,"time":1470773230,"description":"- 40 : The New Generation of International Architecture By Zone Attive\r\n2002 | 240 Pages | 8884911400 | scanned PDF | 54 MB\r\n\r\nThe finalists for this illustrious prize were chosen by a jury and selection committee whose members rank among the world's leading architects and architectural critics including such prominent figures as Stan Allen, Marco Brizzi, Chyntia C. Davidson, Yves Nacher, Richard Burdett and Manuel Gausa. Each member accurately researched and evaluated the construction site and work of the 50 finalists. The selection of finalists consists of an international group of 50 young architects, who present a variety of unique buildings which include exhibition spaces, schools, public spaces, gardens, offices, hospitals and private dwellings spread across North and South America, Europe, Asia and the Near East. Each construction is an ode to ground-breaking and experimental design, taking into serious consideration the cultural, economic and geographical evolution of the specific site and the needs of the surrounding area and community. These 50 young architects are the forerunners of innovative architectural design, clearly representing the necessities and requirements of tomorrow's world. Each project is highlighted by impressive color photographs of the sight, a short biography of the architect, a concise description of the construction, and the reason for its nomination written by one of the illustrious committee members. This magnificently illustrated collection of top architectural design is a necessity for architecture students, professionals and art lovers alike","torrent":{"xt":"urn:btih:372824dfef48664940dc850e66b33d20cd53bbc7","amp;dn":"-40%2C+The+New+Generation+of+International+Architecture+%28Art+Book%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"372824dfef48664940dc850e66b33d20cd53bbc7","infoHashBuffer":{"type":"Buffer","data":[55,40,36,223,239,72,102,73,64,220,133,14,102,179,61,32,205,83,187,199]},"announce":[],"urlList":[]}}