{"title":"The Medical Interview, 3E [PDF] [StormRG]","uid":10801000,"size":5905389,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:37d7130e99ff9028432f00a8c91d1b53f79d3198&amp;dn=The+Medical+Interview%2C+3E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":2,"time":1408348202,"description":"Author: Steven A. Cole MD MA FAPA (Author), Julian Bird MA (CANTAB) FRCP FRCPSYCH (Author)\nSeries: Cole, Medical Interview\nPaperback: 336 pages\nPublisher: Saunders; 3rd edition (December 31, 2013)\nLanguage: English\nISBN-10: 0323052215\nISBN-13: 978-0323052214\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nThe Medical Interview by Drs. Steven A. Cole and Julian Bird equips you to communicate effectively with your patients so you can provide optimal care! This best-selling, widely adopted resource presents a practical, systematic approach to honing your basic interviewing skills and managing common challenging communicating situations. Its Three-Function Approach - &quot;Build the Relationship,&quot; &quot;Assess and Understand,&quot; and Collaborative Management&quot; offers straightforward tasks, behaviors, and skills that can be easily mastered, making this an ideal learning tool for beginners and a valuable reference for experienced healthcare professionals.\n\nEffectively meet a full range of communication challenges including language and cultural barriers, sexual issues, elderly patients, breaking bad news, and non-adherence.\nEasily apply proven techniques with help from supportive case examples and actual interview questions.\nGet the skills you need now with new chapters covering advanced topics and applications including &quot;Presentation and Documentation,&quot; nonverbal communication, using psychological principles in medical practice, and integrating structure and function.\nQuickly review information with summary tables, boxes and bulleted lists.","torrent":{"xt":"urn:btih:37d7130e99ff9028432f00a8c91d1b53f79d3198","amp;dn":"The+Medical+Interview%2C+3E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37d7130e99ff9028432f00a8c91d1b53f79d3198","infoHashBuffer":{"type":"Buffer","data":[55,215,19,14,153,255,144,40,67,47,0,168,201,29,27,83,247,157,49,152]},"announce":[],"urlList":[]}}