{"title":"Robert Johnson - King Of The Delta Blues Singers [FLAC] TNT Vill","uid":8798873,"size":219250718,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:37daaf455c93f85a5e8cc665c4458366a9121c65&amp;dn=Robert+Johnson+-+King+Of+The+Delta+Blues+Singers+%5BFLAC%5D+TNT+Vill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"l.diliberto","files":17,"time":1376146674,"description":"Robert Johnson - King Of The Delta Blues Singers [FLAC] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=354963&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=354963&lt;/a&gt;\n\nKing of the Delta Blues Singers is a compilation album by American blues musician Robert Johnson, released in 1961 on Columbia Records. It is considered one of the greatest and most influential blues releases ever. In 2003, the album was ranked number 27 on Rolling Stone magazine's list of the 500 greatest albums of all time.\nThe album compiles sixteen mono recordings, thirteen of which were previously available as 78s on the Vocalion label, originally recorded during two sessions in 1936 and 1937. The records sold well in their target market of the American south and southwest, with &quot;Terraplane Blues&quot; something of a regional hit, but their sales figures were never beyond 5000 or so in total.\nBy the time this album appeared, Johnson was mostly rumor, if known at all, except to a small group of collectors and those who had purchased the original 78s. An advance copy of the album was given by its instigator, John Hammond, to his newest signing to Columbia, Bob Dylan, who had never heard of Johnson and became mesmerized by the intensity of the recordings.\nHammond, who had initially searched for Johnson in 1938 to include him on the bill for the first of his From Spirituals to Swing concerts, prodded Columbia to assemble this record during the height of the folk revival. It was the first of the retrospective albums for folk, country, and blues artists of the 1920s and 1930s rediscovered in the wake of that revival, some of whom would be located and invited to appear at events such as the Newport Folk Festival. Nevertheless, Johnson's LP failed to make the charts, but the quality of Johnson's music was recognized and Johnson's reputation grew. The album became a badge of hip taste in the 1960s, evidenced by its appearance in the album cover photo to Bob Dylan's Bringing It All Back Home amid various emblems of bohemian life.\nSongs from the album were repeatedly covered throughout the decade by many artists, notably Eric Clapton who recorded &quot;Ramblin' On My Mind&quot; on John Mayall's 1966 classic Bluesbreakers album, and &quot;Cross Road Blues&quot; with his own power trio Cream on the 1968 album Wheels of Fire. Clapton would later record an entire disc of Johnson's songs, Me and Mr. Johnson.\nThe album was originally released by Columbia Records in 1961 as a mono LP. At the time of its release very little scholarship had been done on Johnson's life, and the album liner notes contain some inaccuracies and false conclusions, and a speculative portrait of Johnson's personality. As the two surviving portraits of him were discovered a decade later, the cover painting depicts a faceless musician in field clothes. The album was followed in 1970 by King of the Delta Blues Singers, Vol. 2, including the remaining recordings at that time available by Johnson not on this record. King of the Delta Blues Singers was reissued on September 15, 1998 by the Legacy Records subsidiary label of the Sony Corporation, with a newly discovered alternate version of &quot;Traveling Riverside Blues&quot; appended as a bonus track. The original recording engineer was Vincent Liebler.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img148.imageshack.us/img148/5814/coverfront1xy7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img148.imageshack.us/img148/5814/coverfront1xy7.jpg&lt;/a&gt;\n\n.: Tracklist :.\n\n01. Crossroads Blues\n02. Terraplane Blues\n03. Come on in My Kitchen\n04. Walkin' Blues\n05. Last Fair Deal Gone Down\n06. 32-20 Blues\n07. Kind Hearted Woman Blues\n08. If I Had Possession Over Judgment Day\n09. Preachin' Blues (Up Jumped the Devil)\n10. When You Got a Good Friend\n11. Ramblin' on My Mind\n12. Stones in My Passway\n13. Traveling Riverside Blues\n14. Milkcow's Calf Blues\n15. Me and the Devil Blues\n16. Hellhound on My Trail\n17. Traveling Riverside Blues ","torrent":{"xt":"urn:btih:37daaf455c93f85a5e8cc665c4458366a9121c65","amp;dn":"Robert+Johnson+-+King+Of+The+Delta+Blues+Singers+%5BFLAC%5D+TNT+Vill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37daaf455c93f85a5e8cc665c4458366a9121c65","infoHashBuffer":{"type":"Buffer","data":[55,218,175,69,92,147,248,90,94,140,198,101,196,69,131,102,169,18,28,101]},"announce":[],"urlList":[]}}