{"title":"Mary Griffith - The Unschooling Handbook (pdf)","uid":8481939,"size":3686534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3830461a3e5a585e2fe468f690589c908a0d7687&amp;dn=Mary+Griffith+-+The+Unschooling+Handbook+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"pharmakate","files":-1,"time":1368758676,"description":"Mary Griffith - The Unschooling Handbook: How to Use the Whole World as Your Child's Classroom (Three Rivers Press, 1998). 230 pages.\n\nThis book was first posted here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8077859&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8077859&lt;/a&gt;\n\nBut the files in that upload were unreadable. I've reprocessed the images and produced a completely new, much smaller pdf ebook. The file is searchable (clearscan) with contents in booksmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nTo Unschoolers, Learning Is As Natural As Breathing\n\nDid you know that a growing percentage of home schoolers are becoming unschoolers? The unschooling movement is founded on the principle that children learn best when they pursue their own natural curiosities and interests. Without bells, schedules, and rules about what to do and when, the knowledge they gain through mindful living and exploration is absorbed more easily and enthusiastically. Learning is a natural, inborn impulse, and the world is rich with lessons to be learned and puzzles to be solved.\n\nSuccessful unschooling parents know how to stimulate and direct their children's learning impulse. Once you read this book, so will you!\n\nReview\n\nUnschooling, a homeschooling method based on the belief that kids learn best when allowed to pursue their natural curiosities and interests, is practiced by 10 to 15 percent of the estimated 1.5 million homeschoolers in the United States. There is no curriculum or master plan for allowing children to decide when, what, and how they will learn, but veteran homeschooler Mary Griffith comes as close as you can get in this slim manual. Written in a conversational, salon-style manner, The Unschooling Handbook is liberally peppered with anecdotes and practical advice from unschoolers, identified by their first names and home states. The book also includes resources such as one teenager's sample &quot;transcript,&quot; a typical weekly log of a third-grader's activities, and helpful lists of magazines, online mailing lists, Web sites, and catalogs. Griffith, a board member of the Homeschool Association of California (and the author of The Homeschooling Handbook), names Margaret Mead and Thomas Edison as two examples of those who have profited from unschooled childhoods, and further claims that research validates support for this controversial form of education. The &quot;evidence&quot; she cites, however, is predominantly theoretical writings from noted educators about the benefits of child-centered learning. The handbook suffers from a mild case of the Lake Wobegone syndrome--every unschooled children is seen as an above-average self-starter on the verge of genius--yet despite this overly rosy approach, the book is a well-organized guide for homeschoolers and other families contemplating the &quot;un&quot; life. \n","torrent":{"xt":"urn:btih:3830461a3e5a585e2fe468f690589c908a0d7687","amp;dn":"Mary+Griffith+-+The+Unschooling+Handbook+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3830461a3e5a585e2fe468f690589c908a0d7687","infoHashBuffer":{"type":"Buffer","data":[56,48,70,26,62,90,88,94,47,228,104,246,144,88,156,144,138,13,118,135]},"announce":[],"urlList":[]}}