{"title":"All My Books 3.7 Build 1213 Multilingual","uid":9168257,"size":16133609,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3856bb1eb6079d4ef90d621eef18874a458c67e6&amp;dn=All+My+Books+3.7+Build+1213+Multilingual&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"s3rgio_md","files":1,"time":1384024923,"description":"All My Books 3.7 Build 1213 Multilingual | 15.4 MB\n\nAll My Books is designed to be an electronic librarian that can help you organize your bookshelves into a convenient library. All My Books is a library and the librarian in one tool. The All My Books application will load all information from online sources in a matter of seconds. Group and browse your collection of books by title, author or publisher, or run a quick search by any field. You can even define your own fields to label the books, such as comments or memos, and search them later. What use would be an electronic book organizer if you had to spend hours to catalogue your entire collection? All My Books does not ask you about every little detail about the book. Instead, it implements a revolutionary way to create and organize your collection. No longer must you type information about every book by hand!\n\nMain features of All My Booksâ„¢\n\nFast downloading of book related information from internet book databases, including plot synopsis, reviews and book cover\nExport book collection to iPhone and iPad with the special apps\nAbility to store details about authors, editors and translators, including their photo\nVisual appearance of a library using various skins (editable HTML templates are used)\nLarge number of standard fields in the book card (author, title, ISBN, genre, publishing house, binding, number of pages, number of copies, location, rating and others)\nSupport for user defined fields - an unlimited number of additional text and boolean fields\nExtended functionality and new online book data import sources using third-party plugins\nStatistical information about the book collection (statistics for genres, binding, authors etc.)\nExport of the digital library into many formats - text, HTML, CHM, PDF, XLS (Microsoft Excel)\nImport of the existing book list in text or MS Excel format\nFast search for book using specified criteria. The search is conducted in all standard and user defined fields\nProtection of the book database by password\nEasy to use book sharing manager - you'll never forget whom and when you gave that book\nStorage for an unlimited amount of additional graphic information for each of the books in the database\nSupport for e-books - you can store a link to the file in the book card and open it directly from All My Booksâ„¢. The program is able to automatically fill the book card for the following e-book formats: FB2, FB2.ZIP, LRF (Sony Reader), LIT, MOBI, PRC, PDB, EPUB, RB (RocketBook), AZW, AZW2. More about Ebook collection support.\nSupport for Audiobooks - you can start playback from the program in just one click. The book card is filled automatically for MP3, WMA, M4B, Audible(AA, AAX), OGG formats. Organize your audio book collection as well.\nNetwork mode, so, you can share your database in your home network and access it from several computers simultaneously.\nAbility to print collection using any existing report. Or you can create your own report with the built-in report editor.\nSkinnable user interface\nAll My Books â„¢ available in several languages: English, Bulgarian, Czech, German, Russian, Slovak, Spanish, Turkish, Ukrainian, Italian, Korean, Polish. All of them are included into the installation file. Help us to translate All My Booksâ„¢ to your native language and get licensed for free!\n\nThanks to original uploader.\n\nEnjoy!","torrent":{"xt":"urn:btih:3856bb1eb6079d4ef90d621eef18874a458c67e6","amp;dn":"All+My+Books+3.7+Build+1213+Multilingual","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3856bb1eb6079d4ef90d621eef18874a458c67e6","infoHashBuffer":{"type":"Buffer","data":[56,86,187,30,182,7,157,78,249,13,98,30,239,24,135,74,69,140,103,230]},"announce":[],"urlList":[]}}