{"title":"(PSX-PSP) Chrono Cross converted properly by KloWn","uid":4469785,"size":1042867782,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:3861083c4b3bb6407309a0df9a5d355e24d30c06&amp;dn=%28PSX-PSP%29+Chrono+Cross+converted+properly+by+KloWn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"toxicjuggalo","files":4,"time":1225070638,"description":"The story begins with the hero, Serge, who is thrust into a parallel world where he died under mysterious circumstances over a decade ago. He teams up with a rowdy adventurer, Kid, and sets out in search of the mysterious Frozen Flame, an artifact that lets the holder reshape time and space on a whim. The enigmatic Lynx, a regal man-cat who hunts the Frozen Flame for his own purposes, opposes them. In his quest to return home, Serge will accrue both allies and foes, and he&amp;#039;ll find himself thrust into an adventure that reveals his heritage, purpose, and ultimate destiny. Only by crossing between the two dimensions can Serge find the answers to his questions. \n\n\nI have also included the latest popsplugin and ALL sony prx which are required to play psx-psp conversions on custom firmware&amp;#039;s... To install the pops simply copy the seplugins folder to the root of your memory stick, turn off your psp, hold down the right trigger button while turning the psp back on to go into recovery mode..Select the plugins option and enable the pops...Everytime you start a new psx game it will ask you which pops you wish to use I recommend using 3.40 pops as I have personally have had no problems with ANY psx game so far.....Drag and drop the folder of the game you wish to play to the PSP--&gt;GAME folder on your memory stick and away you go..ENJOY and don&amp;#039;t forget to say thanx.....\n\n\nOnce again I have changed the Game Save ID&amp;#039;s so there is no problems when you switch discs.....KloWn","torrent":{"xt":"urn:btih:3861083c4b3bb6407309a0df9a5d355e24d30c06","amp;dn":"%28PSX-PSP%29+Chrono+Cross+converted+properly+by+KloWn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3861083c4b3bb6407309a0df9a5d355e24d30c06","infoHashBuffer":{"type":"Buffer","data":[56,97,8,60,75,59,182,64,115,9,160,223,154,93,53,94,36,211,12,6]},"announce":[],"urlList":[]}}