{"title":"Little Failure: A Memoir (2014) Gary Shteyngart (multi)","uid":9505869,"size":11422528,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38b3288a859fc0a9a40e0927bccea6bc21329b4b&amp;dn=Little+Failure%3A+A+Memoir+%282014%29+Gary+Shteyngart+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"7","files":-1,"time":1390316788,"description":"Little Failure: A Memoir by Gary Shteyngart\n\n\nFormat: mobi/epub/azw3\nLength: 368 pages\nGenre: Non-Fiction/Biography\nDate: 7 January 2014\n\nAfter three acclaimed novels, Gary Shteyngart turns to memoir in a candid, witty, deeply poignant account of his life so far. Shteyngart shares his American immigrant experience, moving back and forth through time and memory with self-deprecating humor, moving insights, and literary bravado. The result is a resonant story of family and belonging that feels epic and intimate and distinctly his own.\n\nBorn Igor Shteyngart in Leningrad during the twilight of the Soviet Union, the curious, diminutive, asthmatic boy grew up with a persistent sense of yearning - for food, for acceptance, for words - desires that would follow him into adulthood. At five, Igor wrote his first novel, Lenin and His Magical Goose, and his grandmother paid him a slice of cheese for every page.\n\nIn the late 1970s, world events changed Igor's life. Jimmy Carter and Leonid Brezhnev made a deal: exchange grain for the safe passage of Soviet Jews to America - a country Igor viewed as the enemy. Along the way, Igor became Gary so that he would suffer one or two fewer beatings from other kids. Coming to the United States from the Soviet Union was equivalent to stumbling off a monochromatic cliff and landing in a pool of pure Technicolor.\n\nProvocative, hilarious, and inventive, Little Failure reveals a deeper vein of emotion in Gary Shteyngart's prose. It is a memoir of an immigrant family coming to America, as told by a lifelong misfit who forged from his imagination an essential literary voice and, against all odds, a place in the world.\n\nAuthor:\n\nGary Shteyngart was born in Leningrad in 1972 and came to the United States seven years later. He is the author of the novels Super Sad True Love Story, which won the Bollinger Everyman Wodehouse Prize and was selected as one of the best books of the year by more than forty news journals and magazines around the world; Absurdistan, which was chosen as one of the ten best books of the year by The New York Times Book Review and Time magazine; and The Russian Debutante?s Handbook, winner of the Stephen Crane Award for First Fiction and the National Jewish Book Award for Fiction.\n","torrent":{"xt":"urn:btih:38b3288a859fc0a9a40e0927bccea6bc21329b4b","amp;dn":"Little+Failure%3A+A+Memoir+%282014%29+Gary+Shteyngart+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38b3288a859fc0a9a40e0927bccea6bc21329b4b","infoHashBuffer":{"type":"Buffer","data":[56,179,40,138,133,159,192,169,164,14,9,39,188,206,166,188,33,50,155,75]},"announce":[],"urlList":[]}}