{"title":"Jenika Snow-Deep, Hard, and Rough.epub","uid":9211619,"size":258297,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:39683da5e06b964cf88b0e64d336aba0fdcd3a14&amp;dn=Jenika+Snow-Deep%2C+Hard%2C+and+Rough.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"420weedman","files":1,"time":1384797269,"description":"Luna Riyan dreams of a life without violence, degradation, and vile sex, a life unlike all that she has ever known. She has been planning to escape when she has enough saved, but when she is told her prized virginity will be sold to the highest bidder, she knows she can't wait any longer. After nearly being killed by the man obsessed with her, she finds herself aboard the spacecraft of three very big, very fearsome warriors.\n\nErak, Genet, and Raimi are princes in search of females to carry their future heirs. The brothers fear nothing and expect compliance in all things. But things do not turn out quite as they expected. They never thought for a moment that their mate would be the same female, or that she would be a tiny human. They will show her that killing their enemies isn't the only thing they are good at. The only problem is that their mate is traumatized from her past on an ugly planet where prostitution and slavery are rife. She is afraid and reluctant to give them what they want... to possess her completely.\n","torrent":{"xt":"urn:btih:39683da5e06b964cf88b0e64d336aba0fdcd3a14","amp;dn":"Jenika+Snow-Deep%2C+Hard%2C+and+Rough.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39683da5e06b964cf88b0e64d336aba0fdcd3a14","infoHashBuffer":{"type":"Buffer","data":[57,104,61,165,224,107,150,76,248,139,14,100,211,54,171,160,253,205,58,20]},"announce":[],"urlList":[]}}