{"title":"The Spark Solution- A Complete Two Week Diet Program [Epub &amp;","uid":9968109,"size":8119124,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3986543dfac85b6269ad1327f405b9170bc79785&amp;dn=The+Spark+Solution-+A+Complete+Two+Week+Diet+Program+%5BEpub+%26amp%3B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"krystine","files":-1,"time":1397598662,"description":"Description\nThe Spark Solution: A Complete Two-Week Diet Program to Fast-Track Weight Loss and Total Body Health\nAuthor: Becky Hand &amp; Stepfanie Romine\nPublished: 2013\nPublisher: HarperOne\nISBN: 9780062228352\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\nFrom the experts behind the New York Times bestseller The Spark and the creators of SparkPeople.com comes The Spark Solution, a breakthrough two-week diet program to help you lose weight and optimize your health.\n\nThe Spark Solution is a dynamic, comprehensive, and proven program. With an introduction by Chris Downie, founder and CEO of SparkPeople, this day-by-day guide combines the latest data and strategies on nutrition, incredibly delicious recipes, and essential workouts. The experts at SparkPeople designed this easy-to-follow regimen to deliver effective and sustainable weight loss.??\n\nThousands have already tried it, lost weight, and discovered a path to healthy living. SparkPeople have taken all the questions and bumps in the road out of the equation with The Spark Solution. There is no better way to lose weight and no better time than right now. Let these first two weeks transform your life.\n\nThis enhanced digital edition includes before and after shots of people who have lost weight using The Spark Solution, videos to keep you motivated and thoughtful, and recipe links for tracking recipes on SparkPeople.com.","torrent":{"xt":"urn:btih:3986543dfac85b6269ad1327f405b9170bc79785","amp;dn":"The+Spark+Solution-+A+Complete+Two+Week+Diet+Program+%5BEpub+%26amp%3B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3986543dfac85b6269ad1327f405b9170bc79785","infoHashBuffer":{"type":"Buffer","data":[57,134,84,61,250,200,91,98,105,173,19,39,244,5,185,23,11,199,151,133]},"announce":[],"urlList":[]}}