{"title":"Neil Young - Harvest [Mp3 320] TNT Village","uid":9470231,"size":90152067,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:39fb7a06201daff7c79453684c5331e2484ec350&amp;dn=Neil+Young+-+Harvest+%5BMp3+320%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"l.diliberto","files":10,"time":1389549041,"description":"Neil Young - Harvest [Mp3 320] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=379693&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=379693&lt;/a&gt;\n\nAnno: 1972\nGenere: Rock, Country Rock\n\nNeil Young's most popular album, Harvest benefited from the delay in its release (it took 18 months to complete due to Young's back injury), which whetted his audience's appetite, the disintegration of Crosby, Stills, Nash &amp; Young (Young's three erstwhile partners sang on the album, along with Linda Ronstadt and James Taylor), and most of all, a hit single. &quot;Heart of Gold,&quot; released a month before Harvest, was already in the Top 40 when the LP hit the stores, and it soon topped the charts. It's fair to say, too, that Young simply was all-pervasive by this time: &quot;Heart of Gold&quot; was succeeded at number one by &quot;A Horse with No Name&quot; by America, which was a Young soundalike record. But successful as Harvest was (and it was the best-selling album of 1972), it has suffered critically from reviewers who see it as an uneven album on which Young repeats himself. Certainly, Harvest employs a number of jarringly different styles. Much of it is country-tinged, with Young backed by a new group dubbed the Stray Gators who prominently feature steel guitarist Ben Keith, though there is also an acoustic track, a couple of electric guitar-drenched rock performances, and two songs on which Young is accompanied by the London Symphony Orchestra. But the album does have an overall mood and an overall lyric content, and they conflict with each other: The mood is melancholic, but the songs mostly describe the longing for and fulfillment of new love. Young is perhaps most explicit about this on the controversial &quot;A Man Needs a Maid,&quot; which is often condemned as sexist by people judging it on the basis of its title. In fact, the song contrasts the fears of committing to a relationship with simply living alone and hiring help, and it contains some of Young's most autobiographical writing. Unfortunately, like &quot;There's a World,&quot; the song is engulfed in a portentous orchestration. Over and over, Young sings of the need for love in such songs as &quot;Out on the Weekend,&quot; &quot;Heart of Gold,&quot; and &quot;Old Man&quot; (a Top 40 hit), and the songs are unusually melodic and accessible. The rock numbers, &quot;Are You Ready for the Country&quot; and &quot;Alabama,&quot; are in Young's familiar style and unremarkable, and &quot;There's a World&quot; and &quot;Words (Between the Lines of Age)&quot; are the most ponderous and overdone Young songs since &quot;The Last Trip to Tulsa.&quot; But the love songs and the harrowing portrait of a friend's descent into heroin addiction, &quot;The Needle and the Damage Done,&quot; remain among Young's most affecting and memorable songs. \n\n.: Locandina :.\n &lt;a href=&quot;\nhttp://media.tumblr.com/tumblr_ljyoubRNUd1qzodmx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.tumblr.com/tumblr_ljyoubRNUd1qzodmx.jpg&lt;/a&gt;\n\n.: TrackList :.\n\nOut on the Weekend\nHarvest\nA Man Needs a Maid\nHeart of Gold\nAre You Ready for the Country?\nOld Man\nThere's a World\nAlabama\nThe Needle and the Damage Done\nWords (Between the Lines of Age)\n","torrent":{"xt":"urn:btih:39fb7a06201daff7c79453684c5331e2484ec350","amp;dn":"Neil+Young+-+Harvest+%5BMp3+320%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39fb7a06201daff7c79453684c5331e2484ec350","infoHashBuffer":{"type":"Buffer","data":[57,251,122,6,32,29,175,247,199,148,83,104,76,83,49,226,72,78,195,80]},"announce":[],"urlList":[]}}