{"title":"The Day Today Season 1 And Extras DVDrip [Eng][XViD]","uid":7075567,"size":2327503867,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3a2cc064c2a74020e1ebacbead8395d2cc449670&amp;dn=The+Day+Today+Season+1+And+Extras+DVDrip+%5BEng%5D%5BXViD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"billy_stretcher","files":-1,"time":1330825479,"description":"Fact me till I fart, it's The Day Today, the most outrageously satirical show ever to feature a man called Chris Morris--until Brass Eye, that is. Both savage and surreal, The Day Today heaps great steaming mounds of abuse and scorn upon our self-appointed moral guardians, upon pompous pundits, puerile newspaper headline-writers and vacuous, self-important TV presenters. And they all richly deserve it.\n\nFirst broadcast in 1994, the show's format is Newsnight-meets-Crimewatch in Hell. A ridiculously protracted title sequence and melodramatic headline announcements introduce Morris' demented, Jeremy Paxman-a-like anchorman, who simpers to the viewers while castigating on-air his useless reporter Peter O'Hanraha'hanrahan. The vacant Collatallie Sisters turns financial news into a Dadaist nightmare of meaningless statistics, graphically illustrated by the currency cat or the finance arse; while American journo Barbara Wintergreen's reports from Death Row are just scary and absurd enough to be completely believable. Also making his TV debut here is Steve Coogan's legendary sports caster Alan Partridge, with his appalling sports reporting, his cringe-inducing misunderstandings and his sheer blunt-headed stupidity (many of the same team, sans Morris, would reunite the following year for Knowing Me, Knowing You). Sketches such as the spoof soap &quot;The Bureau&quot; and the spoof docu-soap &quot;The Pool&quot; also betray the writing skills of Graham Linehan and Arthur Matthews, creators of Father Ted.\n\n\nIMDB: http://www.imdb.com/title/tt0108740/\nIMDB Rating: 8.9/10\nSource: Retail DVD 2 Disc Set\n\nAll episodes and extras ripped from DVD and encoded into avi [XViD] format [radio interview in mp3]\n\nDisc 1: The six original broadcast episodes\n0101:&quot;Main News Attack&quot; (19 January 1994) 28:54\n0102:&quot;The Big Report&quot; (26 January 1994) 28:51\n0103: &quot;Meganews&quot; (2 February 1994) 29:06\n0104:&quot;Stretchcast&quot; (9 February 1994) 28:50\n0105:&quot;Magnifivent&quot; (16 February 1994) 28:51\n0106:&quot;Newsatrolysis&quot; a.k.a. &quot;Factgasm&quot; (23 February 1994) 28:48\n\nDisc 2: Extras and bonus material\nPilot: Pilot episode never broadcast\nPost programme Update: Bonus footage from the pilot\nMini News: short mini-episodes featuring original material which were broadcast the night before the original broadcast of each episode\nExtended Scenes: 2 13min plus extended Scenes &quot;The Pool&quot; and &quot;The Office&quot;\nPo Faced Analysis: An Open University programme about news presentation which includes an analysis of how and why parodies such as The Day Today work.\nEaster Egg 1: This is an edited sequence from George Bush's annual Congress address - including lines such as 'Saddam Hussein has tried to purchase four million hydrogen powered doctors, and the western wall of the Pentagon', and 'Our first aim is to show utter contempt for the world'.\nEaster Egg 2: A half-hour interview with Steve Coogan, conducted by Mark Radcliffe on the January 17, 1994 edition of his radio show. Throughout the interview, Steve speaks in a northern accent similar to, but not exactly like his character Paul Calf.\n\nTotal Size: Season 1: 1.05 GiB\nExtras: 1.11 GiB\n\nTotal Running Time: Season 1: 172 minutes\nExtras: 129 minutes\n\nVideo: Xvid/512/384/25.00fps\nAudio: MP3/128kbps/stereo","torrent":{"xt":"urn:btih:3a2cc064c2a74020e1ebacbead8395d2cc449670","amp;dn":"The+Day+Today+Season+1+And+Extras+DVDrip+%5BEng%5D%5BXViD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a2cc064c2a74020e1ebacbead8395d2cc449670","infoHashBuffer":{"type":"Buffer","data":[58,44,192,100,194,167,64,32,225,235,172,190,173,131,149,210,204,68,150,112]},"announce":[],"urlList":[]}}