{"title":"Why are you Not Reading - Empowered? (2007- |Digital|SoU-Emp)","uid":9844071,"size":1871176439,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3ab7076ed6d22f0a05b3005acf86c039ad010aaf&amp;dn=Why+are+you+Not+Reading+-+Empowered%3F+%282007-+%7CDigital%7CSoU-Emp%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":4,"uploader":"VikTSlick","files":-1,"time":1396043165,"description":"Adam Warren's naughty, funny, and heartfelt &quot;Empowered&quot; series is not to be missed. The story is about &quot;Emp&quot; (her full name is revealed in the story), a young and attractive superhero who is a klutz, barely competent, and constantly getting captured. The only thing about her that seems to be of any use is her amazing suit - which displays much more power than she does. However, it quickly becomes apparent that there is more to this girl than meets the eye, and her good nature and general determination are often enough to see her through all the various kidnappings and battles - as well as winning her a group of devoted friends (and a boyfriend) in the process. The series is for adults but never degenerates into pornography, and features a lot of great humor along with ever-more serious themes and meditations on death, hell, love and beyond. You quickly grow to love the cast of characters, which include Emp, her beau Thug Boy (a former henchman), her best friend Ninjette, the hilarious Caged Demonwolf (literally, a powerful villain trapped in a belt, with a penchant for archaic dialogue), Sistah Spooky, the Maidman, and so many more. The situations they encounter range from the mundane - conversations about sex, or Emp's lack of discernible heroic skills - to the insane, such as massacre at an awards banquet or an enemy who literally skullf*cks his victims (with great delight). Warren writes and draws it all himself, in a style that is a mishmash of American sensibilities and Manga-influence. Sometimes the stories are small vignettes and sometimes full-blown epic arcs. They are always awesome, though.\n\nThis torrent includes everything released so far (as of April 2014) - all 8 volumes of the main series and all six specials, as well as the &quot;Extra Sketchiness&quot; sketchbook. All except the sketchbook are the Digital Editions by Son of Ultron-Empire, which look great; &quot;Extra Sketchiness&quot; was scanned by Man-Art-Tee DCP. Thanks to MaskedManatee for that bonus, and all the great scanner groups for their hard work. Please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:3ab7076ed6d22f0a05b3005acf86c039ad010aaf","amp;dn":"Why+are+you+Not+Reading+-+Empowered%3F+%282007-+%7CDigital%7CSoU-Emp%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ab7076ed6d22f0a05b3005acf86c039ad010aaf","infoHashBuffer":{"type":"Buffer","data":[58,183,7,110,214,210,47,10,5,179,0,90,207,134,192,57,173,1,10,175]},"announce":[],"urlList":[]}}