{"title":"[NubilesFilms] Kristina Bell (Ready For Anything / 07.27.2015)","uid":12164170,"size":227044381,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3b78ef5e61d5e6396cda4d13800cbf1ec533dca0&amp;dn=%5BNubilesFilms%5D+Kristina+Bell+%28Ready+For+Anything+%2F+07.27.2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":17,"uploader":"chkm8te","files":1,"time":1437992451,"description":"[NubilesFilms] Kristina Bell (Ready For Anything / 07.27.2015)\n\nLuscious Kristina Bell spends plenty of time primping as she prepares for her date with Ryan Driller. After making sure that her skin has been covered with lotion so that it's nice and soft and that her face is nicely made up, the horny sex kitten pulls her dress into place and heads downstairs to meet her man.\n\nThe couple never makes it out of the kitchen. When Ryan sees Kristina looking hot as hell for him and then discovers that she's not wearing any panties beneath her miniskirt, he pushes her dress down to pool around Kristina's waist so that he can have full access to her perky boobs and her sweet wet pussy.\n\nWhen Ryan dives in to Kristina's snatch, the brunette can barely contain her moans of excitement. She's already nice and moist, making it easy for Ryan to slide a finger into her tight twat while he works her clit with his clever tongue.\n\nWhen Kristina hops off the counter to plant a kiss on Ryan's lips, he takes advantage of her standing position to fully remove her dress. Kristin has other priorities, the first of which is getting Ryan's pants off so that she can get on her knees and take his cock in her eager mouth. She gets her hand in on the act as her lips span the head of his dick so that he can feel her soft tongue and the gentle scrape of her braces.\n\nStanding back up, Kristina turns around and braces herself on the sink so that Ryan can penetrate her from behind. His strokes are gentle at first, but soon it is obvious that Kristina demands something harder and deeper, an unspoken request that Ryan is happy to oblige.\n\nWhen Ryan spins her around and lifts her in his arms, Kristina uses her feet to balance and then proceeds to bounce away. With the help of her lover's hands on her bottom, she brings herself closer to cumming and then lies down on the kitchen island to let Ryan finish the job.\n\nAfter Kristina's throbbing fuck hole has finally calmed down, she drops off the island and falls to her knees. Putting her hot mouth and hands back to work, Kristina is quickly able to coax Ryan into spilling his load all over her waiting face. Ryan turns the tables one last time as he helps Kristina back up onto the island and brings her to a final surprise orgasm to seal their loving encounter.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=yu85bwnf6caxpi63myi1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=yu85bwnf6caxpi63myi1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=honae2i2t8mx2mty5upi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=honae2i2t8mx2mty5upi.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:3b78ef5e61d5e6396cda4d13800cbf1ec533dca0","amp;dn":"%5BNubilesFilms%5D+Kristina+Bell+%28Ready+For+Anything+%2F+07.27.2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b78ef5e61d5e6396cda4d13800cbf1ec533dca0","infoHashBuffer":{"type":"Buffer","data":[59,120,239,94,97,213,230,57,108,218,77,19,128,12,191,30,197,51,220,160]},"announce":[],"urlList":[]}}