{"title":"Ritwik Ghatak - Meghe Dhaka Tara aka The Cloud-Capped Star (1960","uid":4812501,"size":1468778260,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3b8e66a3393908f610e9025c26a1f1fe9fa19136&amp;dn=Ritwik+Ghatak+-+Meghe+Dhaka+Tara+aka+The+Cloud-Capped+Star+%281960&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"theoneleggedrooster","files":3,"time":1238429862,"description":"Meghe Dhaka Tara is considered to be one of the finest Indian films ever made. The Director Ritwik Ghatak was a contemporary of Satyajit Ray &amp; was just as brilliant. But while the latter became the international face of Indian Cinema, the former remained comparatively obscure &amp; under-appreciated. Ghatak led a tragic life- many of films were unsuccessful, some remained unreleased for years &amp; some had to be abandoned altogether. Beginning in the early 1960s, Ghatak suffered from alcoholism and mental illness. He was hospitalized for the first time in late 1965. For the rest of his life he was in and out of mental hospitals and psychiatric treatment. Ghatak's limited body of work was cut short by his untimely death in 1976 at age 51 due to alcoholism &amp; tuberculosis. Meghe Dhaka Tara is regarded as his masterpiece.\n &lt;a href=&quot;\nhttp://i585.photobucket.com/albums/ss292/theoneleggedrooster/t99101qmbjv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i585.photobucket.com/albums/ss292/theoneleggedrooster/t99101qmbjv.jpg&lt;/a&gt;\n\nImdb rating--8.2/10 &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0054073/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0054073/&lt;/a&gt;\n\n\nLanguage--Bengali\nSubtitles--English (.srt)\n\n\n&quot;Meghe Dhaka Tara&quot; tells the tragic story of the beautiful daughter of a middle-class refugee family from East Pakistan, living in the outskirts of Calcutta under modest circumstances. Neeta sacrifices everything for her family, including her personal happiness, her money, and her health, while her achievements are hardly ever recognized by the people around her.\n\n\nA sprawling Bengali masterpiece, 1 March 2005\nAuthor: David (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;fe9a9f88979a9f928dbe938d90d09d9193&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;) from Chapel Hill, NC, USA\nThe visionary Bengali filmmaker Ritwik Ghatak peers into the future, and sees nothing but disintegration - succeeding at multiple levels, CLOUD-CAPPED STAR humanizes this bleak vision, by locating the drama in a Bengali family, but everything occurring is something of a howl of outrage at what had become of his divided homeland.\n\nThe central figure in this sprawling melodrama (with some coincidental resemblances to European new wave and neo-realism) is Nita, the eldest daughter in a once-middle class, intellectual family, driven by partition into refugee status in the slums of Calcutta. Varied family members react in different opportunistic ways to their reduced status, and their need to survive, all of which takes an extreme toll on Nita, who ultimately becomes the family's sole breadwinner. The performances throughout are excellent - Supriya Choudhury as Nita is riveting, and Niranjan Roy is particularly strong as Sanat. \n\nThroughout, Ghatak boils human nature and the survival instinct down to the most ruthless basics: this is a compelling and visionary film, but there is virtually no room for lofty ideals or sentimental altruism in the world created here - mourn what one must, and do what one must do to survive. Sentiment and ideals are - in this film - luxuries, and from the cruelty of such a truism, Ghatak has created one of cinema's great, vital tragedies.\n\nGhatak claimed few Western cinematic influences - like Jean-Luc Godard in France and Nagisa Oshima in Japan, his primary concerns were historical and political, and also technical - how to alter cinema to express those concerns in accessible language? For Ghatak the solution was found in using outdoor locations, natural sound, idiosyncratic editing, and a minimum of the flash seen in Bollywood or Hollywood - CLOUD-CAPPED STAR is bleak, absolutely gripping, tragic and infuriating. As drama, it would definitely rank as one of the more obscure global masterpieces out there (there has yet to be an official US release on VHS or DVD), rarely seen or commented upon. This is highly unfortunate - as a film of moral/social outrage, this rivals Bresson; its' overall feel for the everyday reminds one of Italian neo-realism; it's willingness to experiment boldly evokes Godard or Oshima; in it's concerns with the status of women (another of the many themes explored here), it evokes Naruse, Sirk or Mizoguchi.\n\nGhatak's own biography is one of great tragedy; one could possibly read the discretely enraged hopelessness of this film as an extension of his own, and see this as a drive that would have to produce at least one masterpiece (his later SUBARNA-REKHA is also very much worth a look), even as it brought him to a premature end. For all of its' bleakness, CLOUD-CAPPED STAR is absolutely compelling - any cinephile (or student of history) would do well to see it.\n\n\n\n#400 on TSPDT's 1000 Greatest Films list http://www.theyshootpictures.com/gf1000_all1000films.htm\n\n\n\nVideo\nCodec--DX50\nLength--2:01:39 (182,455 frms)\nResolution--640 x 480\nDar--1.333 (4:3)\nFPS--25.000\nBitrate--1472\nQF--0.192\n\nAudio--0x2000 (Dolby AC3) AC3 48000Hz  128 kb/s tot , stereo (2/0)\n\n &lt;a href=&quot;\nhttp://i585.photobucket.com/albums/ss292/theoneleggedrooster/t99101qmbjv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i585.photobucket.com/albums/ss292/theoneleggedrooster/t99101qmbjv.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i585.photobucket.com/albums/ss292/theoneleggedrooster/vlcsnap-6417382.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i585.photobucket.com/albums/ss292/theoneleggedrooster/vlcsnap-6417382.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i585.photobucket.com/albums/ss292/theoneleggedrooster/vlcsnap-6418491.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i585.photobucket.com/albums/ss292/theoneleggedrooster/vlcsnap-6418491.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i585.photobucket.com/albums/ss292/theoneleggedrooster/vlcsnap-6419249.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i585.photobucket.com/albums/ss292/theoneleggedrooster/vlcsnap-6419249.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i585.photobucket.com/albums/ss292/theoneleggedrooster/vlcsnap-6419642.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i585.photobucket.com/albums/ss292/theoneleggedrooster/vlcsnap-6419642.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i585.photobucket.com/albums/ss292/theoneleggedrooster/vlcsnap-6420093.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i585.photobucket.com/albums/ss292/theoneleggedrooster/vlcsnap-6420093.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i585.photobucket.com/albums/ss292/theoneleggedrooster/vlcsnap-6424013.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i585.photobucket.com/albums/ss292/theoneleggedrooster/vlcsnap-6424013.png&lt;/a&gt;\n\n\n********************************* FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art to the\nwidest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:3b8e66a3393908f610e9025c26a1f1fe9fa19136","amp;dn":"Ritwik+Ghatak+-+Meghe+Dhaka+Tara+aka+The+Cloud-Capped+Star+%281960","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b8e66a3393908f610e9025c26a1f1fe9fa19136","infoHashBuffer":{"type":"Buffer","data":[59,142,102,163,57,57,8,246,16,233,2,92,38,161,241,254,159,161,145,54]},"announce":[],"urlList":[]}}