{"title":"The Illusion of Conscious Will by Daniel M. Wegner","uid":10018471,"size":6734662,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3bc7ab55b43caab41291222190112d103f8c1fec&amp;dn=The+Illusion+of+Conscious+Will+by+Daniel+M.+Wegner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"anmisto","files":3,"time":1398179706,"description":"Title: The Illusion of Conscious Will\nAuthor: Daniel M. Wegner\nFormat:  .PDF\nPublisher: Bradford Books, The MIT Press\n\nDescription:\n\nDo we consciously cause our actions, or do they happen to us? Philosophers, psychologists, neuroscientists, theologians, and lawyers have long debated the existence of free will versus determinism. In this book Daniel Wegner offers a novel understanding of the issue. Like actions, he argues, the feeling of conscious will is created by the mind and brain. Yet if psychological and neural mechanisms are responsible for all human behavior, how could we have conscious will? The feeling of conscious will, Wegner shows, helps us to appreciate and remember our authorship of the things our minds and bodies do. Yes, we feel that we consciously will our actions, Wegner says, but at the same time, our actions happen to us. Although conscious will is an illusion, it serves as a guide to understanding ourselves and to developing a sense of responsibility and morality.\n\nApproaching conscious will as a topic of psychological study, Wegner examines the issue from a variety of angles. He looks at illusions of the will?-those cases where people feel that they are willing an act that they are not doing or, conversely, are not willing an act that they in fact are doing. He explores conscious will in hypnosis, Ouija board spelling, automatic writing, and facilitated communication, as well as in such phenomena as spirit possession, dissociative identity disorder, and trance channeling. The result is a book that sidesteps endless debates to focus, more fruitfully, on the impact on our lives of the illusion of conscious will.\n\nSelected as a Finalist in the category of Psychology/Mental Health in the 2002 Independent Publisher Book Awards (IPPYs) presented by Independent Publisher Magazine., Silver Award Winner for Philosophy in the 2002 ForeWord Magazine Book of the Year Awards. and Selected as an Outstanding Academic Book for 2002 by Choice Magazine","torrent":{"xt":"urn:btih:3bc7ab55b43caab41291222190112d103f8c1fec","amp;dn":"The+Illusion+of+Conscious+Will+by+Daniel+M.+Wegner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bc7ab55b43caab41291222190112d103f8c1fec","infoHashBuffer":{"type":"Buffer","data":[59,199,171,85,180,60,170,180,18,145,34,33,144,17,45,16,63,140,31,236]},"announce":[],"urlList":[]}}