{"title":"Lonely Planet - Germany - 8th Ed (2016) (Pdf and Epub) Gooner","uid":14723043,"size":203099543,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3bc7175f27ed08eccf03cfda6701098d80f7fcaf&amp;dn=Lonely+Planet+-+Germany+-+8th+Ed+%282016%29+%28Pdf+and+Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1464527479,"description":"Lonely Planet - Germany (Travel Guide) - 8th Edition (2016) (Pdf &amp; Epub) Gooner\r\n\r\nPublisher: Lonely Planet; 8 edition (11 Mar. 2016)\r\nLanguage: English\r\nISBN-10: 174321023X\r\nISBN-13: 978-1743210239\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet Germany is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. See storybook castles arise from the Bavarian forest, raise a stein to an oompah band in a Munich beer garden, and take in the vibrant Berlin arts scene; all with your trusted travel companion. Get to the heart of Germany and begin your journey now!\r\n\r\nInside Lonely Planet Germany Travel Guide:\r\n\r\n* Colour maps and images throughout\r\n\r\n* Highlights and itineraries help you tailor your trip to your personal needs and interests\r\n\r\n* Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\r\n\r\n* Honest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss\r\n\r\n* Cultural insights give you a richer, more rewarding travel experience - including history, art, literature, cinema, theatre, music, architecture, landscapes, wildlife, cuisine, drink, and more\r\n\r\n* Free, convenient pull-out Berlin map (included in print version), plus over 98 local maps\r\n\r\n* Covers Hamburg, Saxony, Bremen, Cologne, Rhineland, Berlin, Frankfurt, Stuttgart, Black Forest, Bavaria, Munich, Central Germany, and more\r\n\r\nThe Perfect Choice: Lonely Planet Germany, our most comprehensive guide to Germany, is perfect for both exploring top sights and taking roads less travelled.\r\n\r\n* Looking for just the highlights of Germany? Check out Lonely Planet Discover Germany, a photo-rich guide to the country's most popular attractions.\r\n\r\n* Looking for a guide focused on Berlin or Munich? Check out our Lonely Planet Berlin guideor Lonely Planet Munich, Bavaria &amp; the Black Forest guide for a comprehensive look at all these cities have to offer, or Pocket Berlin, a handy-sized guide focused on the can't-miss sights for a quick trip.\r\n\r\nAuthors: Written and researched by Lonely Planet.\r\n\r\nAbout Lonely Planet:\r\nSince 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveller community. Lonely Planet covers must-see spots but also enables curious travellers to get off beaten paths to understand more of the culture of the places in which they find themselves","torrent":{"xt":"urn:btih:3bc7175f27ed08eccf03cfda6701098d80f7fcaf","amp;dn":"Lonely+Planet+-+Germany+-+8th+Ed+%282016%29+%28Pdf+and+Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bc7175f27ed08eccf03cfda6701098d80f7fcaf","infoHashBuffer":{"type":"Buffer","data":[59,199,23,95,39,237,8,236,207,3,207,218,103,1,9,141,128,247,252,175]},"announce":[],"urlList":[]}}