{"title":"Encyclopedia of Jewish Folklore &amp; Traditions (Bar-Itzhak, ed","uid":9265045,"size":88722427,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3bd84cb0044f3fe6fbdc174c82c80a08d309c510&amp;dn=Encyclopedia+of+Jewish+Folklore+%26amp%3B+Traditions+%28Bar-Itzhak%2C+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"workerbee","files":-1,"time":1385689152,"description":"\nHaya Bar-Itzhak, ed. - Encyclopedia of Jewish Folklore and Traditions (M. E. Sharpe, 2013).\n\nISBN: 9780765620255 | 680 pages | PDF\n\n\nThis multicultural reference work on Jewish folklore, legends, customs, and other elements of folklife is the first of its kind.  It includes over 250 A-Z original, signed articles that cover major themes, beliefs, traditions, and folkways of Jewish groups around the world, both contemporary and historical.  The diverse range of articles covers specific artifacts, rituals, ceremonies, biblical figures, and legends, in addition to broad topics such as humor, folk dance, costumes, and folk narratives.  Also included are biographies of significant personalities in the study of Jewish folklore and literature.  The encyclopedia provides various country articles that highlight evolving traditions and histories of specific Jewish groups.  Extensive bibliographies further enhance the value of each entry.\n\nHappy Hanukkah, everyone!\n\n\nReviews\n\n&quot;Written by international scholars, each entry contains a useful bibliography, while superb color and black-and-white illustrations enhance the text.  The eclectic content covers holidays, material artifacts, and mythical beliefs and offers country studies and biographies of notable Jewish ethnographers, as well as much more.  An outstanding ready-reference source presenting hard-to-find information, this work will interest students, academics, and general readers. Highly recommended.&quot; -- Library Journal\n\n&quot;There are many resources on aspects of Jewish culture and folklore around the world, but this comprehensive, accessible work may be the first to bring together the traditions from many lands and across time. . . The clearly written entries include major themes, beliefs, and traditions from cultures around the world, both contemporary and historical. . . Extensive appendixes, sources, and an accurate index reflect the diversity and richness of the field.&quot; -- Booklist\n","torrent":{"xt":"urn:btih:3bd84cb0044f3fe6fbdc174c82c80a08d309c510","amp;dn":"Encyclopedia+of+Jewish+Folklore+%26amp%3B+Traditions+%28Bar-Itzhak%2C+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bd84cb0044f3fe6fbdc174c82c80a08d309c510","infoHashBuffer":{"type":"Buffer","data":[59,216,76,176,4,79,63,230,251,220,23,76,130,200,10,8,211,9,197,16]},"announce":[],"urlList":[]}}