{"title":"Religion of Peace? - Robert Spencer","uid":11727057,"size":1414827,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c180f165ceee555f5c5671117c7e1252dac2b78&amp;dn=Religion+of+Peace%3F+-+Robert+Spencer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"starxteel","files":1,"time":1425112832,"description":"\nChristianity or Islam: which is the real &quot;religion of peace&quot;?\nAlmost any liberal pundit will tell you that there's a religion bent on destroying our Constitution, stripping us of our liberties, and imposing religious rule on the U.S. And that religion is . . .Christianity! About Islam, however, the Left is silent--except to claim a moral equivalence between the two: if Islam has terrorists today, that's nothing compared to the Crusades, inquisitions, and religious wars in Christianity's past.\n\nBut is this true? Are conservative Christians really more of a threat to free societies than Islamic jihadists? Is the Bible really &quot;just as violent&quot; as the Qur'an? Is Christianity's history really as bloodstained as Islam's? In Religion of Peace? Why Christianity Is and Islam Isn't, New York Times bestselling author Robert Spencer not only refutes such charges, but also explains why Americans and Europeans must regain an appreciation of our Christian heritage if we ever hope to defeat Islamic supremacism. In this eye opening work, Spencer reveals:\n* The fundamental differences between Islamic and Christian teachings about warfare against other religions: &quot;Love your enemies&quot; vs. &quot;Be ruthless to the unbelievers&quot;\n* The myth of Western immorality and Islamic puritanism and why the Islamic world is less moral than the West\n* Why the Islamic world has never developed the distinction between religious and secular law that is inherent in Christianity\n* Why Christianity has always embraced reason--and Islam has always rejected it\n* Why the most determined enemies of Western civilization may not be the jihadists at all, but the leftists who fear their churchgoing neighbors more than Islamic terrorists\n* Why Jews, Christians, and peoples of other faiths (or no faith) are equally at risk from militant Islam\n\nSpencer writes not to proselytize, but to state a fact: Christianity is a true &quot;religion of peace,&quot; and on it Western civilization stands. If we are not to perish under Islam's religion of the sword--with its more than 100 million active jihadists seeking to impose sharia law--we had better defend our own civilization.\n\n\nAbout the author:\nRobert Spencer is the director of Jihad Watch, a program of the David Horowitz Freedom Center, and the author of eight books on Islam and jihad. Spencer is a weekly columnist for Human Events and the website Front-Page Magazine, and has led seminars on Islam and jihad for the United States Central Command, United States Army Command and General Staff College, the Joint Terrorism Task Force, and the U.S. intelligence community","torrent":{"xt":"urn:btih:3c180f165ceee555f5c5671117c7e1252dac2b78","amp;dn":"Religion+of+Peace%3F+-+Robert+Spencer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c180f165ceee555f5c5671117c7e1252dac2b78","infoHashBuffer":{"type":"Buffer","data":[60,24,15,22,92,238,229,85,245,197,103,17,23,199,225,37,45,172,43,120]},"announce":[],"urlList":[]}}