{"title":"Black Tusk-Tend No Wounds (EP) MP3  ak2014","uid":10670681,"size":58587327,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3c609045b8680fa55507a6c1895a21545afeb8e7&amp;dn=Black+Tusk-Tend+No+Wounds+%28EP%29+MP3++ak2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"analogkid6103","files":7,"time":1406865820,"description":"Black Tusk-Tend No Wounds (EP) MP3  ak2014 What we got...Black Tusk (often written as Blacktusk) is an American heavy metal power trio from Savannah, Georgia. The band was formed in 2005, when its members were all living on the same street. With the dissolution of Andrew Fidler (guitar, vocals) and Jonathan Athon (bass, vocals) crust punk band and James May (drums, vocals) street punk band, Andrew and Athon went down the street to James' house and asked him if he wanted to play with them. During the next few days they jammed continuously, and within a few months they had recorded the EP When Kingdoms Fall, which was released on Wrecked Signal. Two years later the band self-released their first full-length studio album, The Fallen Kingdom, followed by another a year later with Passage Through Purgatory, released through the local label Hyperrealist Records. In 2009, Black Tusk released a series of split albums with bands such as ASG, The Holy Mountain, and Fight Amp, before sign to Relapse Records in November. The band released its debut for Relapse, Taste the Sin, in May 2010.\n\nBlack Tusk is mostly associated with Baroness and Kylesa, for their shared hometown of Savannah, as well as for their sludge metal sound. The band is linked to Baroness' guitarist and vocalist John Dyer Baizley, who is also a painter and creates all of Black Tusk's artwork. Black Tusk's members describe their music as &quot;swamp metal,&quot; a term that has been described by Allmusic as &quot;the murkiest, dirtiest sludge [metal] to come out of Savannah since Kylesa&quot;. The term is a reference to the climate of Savannah in relation to the music that the band create. Reviewing the album, Taste the Sin, Pitchfork Media stated that the band's blend of hardcore punk and stoner metal &quot;works to capitalize on the immediacy of its chosen genres and not to bend them into obscurity.&quot; Black Tusk acknowledges its punk rock origins, but prefer not to cite a list of bands that influence them because they feel that it is ineffective since they are not &quot;trying to emulate any one band's style or any one genre's sound.&quot;","torrent":{"xt":"urn:btih:3c609045b8680fa55507a6c1895a21545afeb8e7","amp;dn":"Black+Tusk-Tend+No+Wounds+%28EP%29+MP3++ak2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c609045b8680fa55507a6c1895a21545afeb8e7","infoHashBuffer":{"type":"Buffer","data":[60,96,144,69,184,104,15,165,85,7,166,193,137,90,33,84,90,254,184,231]},"announce":[],"urlList":[]}}