{"title":"Neuropsychological Rehabilitation (Elsevier) [PDF] [StormRG]","uid":11009558,"size":6606021,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c936a2942e44aa0d7bc3b3166cd67db4635f9c1&amp;dn=Neuropsychological+Rehabilitation+%28Elsevier%29+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"0xmovva","files":2,"time":1410327524,"description":"Author: Jamuna Rajeswaran\nSeries: Elsevier Insights\nHardcover: 192 pages\nPublisher: Elsevier; 1 edition (September 15, 2012)\nLanguage: English\nISBN-10: 0124160468\nISBN-13: 978-0124160460\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nTraumatic Brain Injury (TBI) can occur through road traffic incidents, falls, or violence, and is therefore an extremely prevalent type of injury, constituting a significant burden on health care around the world. As more people are able to recover physically from TBI, it is important to consider how to help repair the cognitive functions of the brain. The cognitive functions could be greatly maximized by appropriate Neuropsychological rehabilitation, which occurs within months of the damage. This book discusses both the theoretical and practical applications of Neuropsychological rehabilitation techniques, offering a comprehensive overview of the process. Using several case studies from India, gained over years of clinical practice, research and academic teaching, this book offers an excellent guide to the procedures and tasks needed to respond effectively to patients with TBI. Although focused on the Indian context, this book will appeal to students and practitioners around the world as a useful resource on Neuropsychological rehabilitation techniques in India.\n\nInnovative approach to Neuropsychological Rehabilitation using case vignettes. Theoritical and Clinical subject matter","torrent":{"xt":"urn:btih:3c936a2942e44aa0d7bc3b3166cd67db4635f9c1","amp;dn":"Neuropsychological+Rehabilitation+%28Elsevier%29+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c936a2942e44aa0d7bc3b3166cd67db4635f9c1","infoHashBuffer":{"type":"Buffer","data":[60,147,106,41,66,228,74,160,215,188,59,49,102,205,103,219,70,53,249,193]},"announce":[],"urlList":[]}}