{"title":"The Gods of Guilt By Michael Connelly","uid":9238073,"size":1107462,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3cb960f848aa5bcbd6c628a552a4449d690e69c9&amp;dn=The+Gods+of+Guilt+By+Michael+Connelly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"maxdesolate","files":4,"time":1385216985,"description":"Defense attorney Mickey Haller returns with a haunting case in the gripping new thriller from #1 New York Times bestselling author Michael Connelly.\n\nMickey Haller gets the text, &quot;Call me ASAP - 187,&quot; and the California penal code for murder immediately gets his attention. Murder cases have the highest stakes and the biggest paydays, and they always mean Haller has to be at the top of his game.\n\nWhen Mickey learns that the victim was his own former client, a prostitute he thought he had rescued and put on the straight and narrow path, he knows he is on the hook for this one. He soon finds out that she was back in LA and back in the life. Far from saving her, Mickey may have been the one who put her in danger.\n\nHaunted by the ghosts of his past, Mickey must work tirelessly and bring all his skill to bear on a case that could mean his ultimate redemption or proof of his ultimate guilt. The Gods of Guilt shows once again why &quot;Michael Connelly excels, easily surpassing John Grisham in the building of courtroom suspense&quot; (Los Angeles Times).\n\nEPUB AND MOBI. SPECIAL THANKS TO MY FRIEND FOR THE ZIPPYSHARE LINK :) ","torrent":{"xt":"urn:btih:3cb960f848aa5bcbd6c628a552a4449d690e69c9","amp;dn":"The+Gods+of+Guilt+By+Michael+Connelly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cb960f848aa5bcbd6c628a552a4449d690e69c9","infoHashBuffer":{"type":"Buffer","data":[60,185,96,248,72,170,91,203,214,198,40,165,82,164,68,157,105,14,105,201]},"announce":[],"urlList":[]}}