{"title":"Sans Sec 401 Security Essentials (2011)","uid":10203855,"size":355191938,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d3e5bf4df3113a174990b7ae7f1aa3807686988&amp;dn=Sans+Sec+401+Security+Essentials+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":null,"files":6,"time":1400811895,"description":"\n\n\nSans Sec 401 Security Essentials (2011)\n\n\n\nDescription:\n\n\nIt seems wherever you turn organizations are being broken into and the fundamental question that everyone wants to know is Why? Why do some organizations get broken into and others do not. SEC401 Security Essentials is focused on teaching you the right things that need to be done to keep an organization secure. Organizations are spending millions of dollars on security and are still compromised. The problem is they are doing good things but not the right things. Good things will lay a solid foundation but the right things will stop your organization from being headline news in the Wall Street Journal. SEC401's focus is to teach individuals the essential skills and techniques needed to protect and secure an organization's critical information assets and business systems. We also understand that security is a journey and not a destination. Therefore we will teach you how to build a security roadmap that can scale today and into the future. When you leave our training we promise that you will be given techniques that you can implement today and tomorrow to keep your organization at the cutting edge of cyber security. Most importantly, your organization will be secure.\n\nWith the APT (advanced persistent threat) organizations are going to be targeted. Whether the attacker is successful penetrating an organization's network depends on how well they are at the defense. While defending against attacks is an ongoing challenge with new threats emerging all of the time, including the next generation of threats, organizations need to understand what works in cyber security. What has worked and will always work is taking a risk-based approach to cyber defense. Before your organization spends a dollar of its IT budget or allocates any resources or time on anything in the name of cyber security, three questions must be answered:\n\n1. What is the risk?\n\n2. Is it the highest priority risk?\n\n3. Is it the most cost-effective way of reducing the risk?\n\nSecurity is all about making sure you are focusing on the right areas of defense. By attending SEC401 you will learn the language and underlying theory of computer security. Since all jobs today require an understanding of security, this course will help you understand why security is important and how it applies to your job. In addition, you will gain the essential, up-to-the-minute knowledge and skills required for effective security if you are given the responsibility for securing systems and/or organizations. This course meets both of the key promises SANS makes to our students: (1) You will gain up-to-the-minute knowledge you can put into practice immediately upon returning to work; and, (2) You will be taught by the best security instructors in the industry.\n\nView Dr. Cole's security videos\n\nLearn even more about security in the SANS Reading Room. Over 1600 free White Papers authored by real industry professionals.\n\nSampling of Topics:\n\n    Network fundamentals\n    Core security design principles for networks\n    Protocol behavior\n    Analysis and decoding of packets\n    Physical Security\n    Information assurance foundations\n    Computer security policies\n    Contingency and continuity planning\n    Password management and access control\n    Incident handling\n    Offensive and defensive information warfare\n    Host-based intrusion detection and prevention\n    Network-based intrusion detection and prevention\n    Offensive methods of attack\n    Firewall and perimeters\n    Risk assessment and auditing\n    Cryptography\n    Steganography\n    Wireless security\n    Operations security\n    Windows and Unix security\n\n\n","torrent":{"xt":"urn:btih:3d3e5bf4df3113a174990b7ae7f1aa3807686988","amp;dn":"Sans+Sec+401+Security+Essentials+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d3e5bf4df3113a174990b7ae7f1aa3807686988","infoHashBuffer":{"type":"Buffer","data":[61,62,91,244,223,49,19,161,116,153,11,122,231,241,170,56,7,104,105,136]},"announce":[],"urlList":[]}}