{"title":"David Sedaris - Three ebooks (Epub and Mobi)","uid":7710271,"size":2428116,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d68687a9b2b69d3f69308501c343aeac4a80f60&amp;dn=David+Sedaris+-+Three+ebooks+%28Epub+and+Mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"showpirateslove","files":-1,"time":1349790437,"description":"The Books (Epub and Mobi format):\n\nHolidays on Ice \nNaked \nWhen You Are Engulfed in Flames \n\nBio on David Sedaris: \n\nWith sardonic wit and incisive social critiques, David Sedaris has become one of America 's pre-eminent humor writers. The great skill with which he slices through cultural euphemisms and political correctness proves that Sedaris is a master of satire and one of the most observant writers addressing the human condition today.David Sedaris is the author of the bestsellers Barrel Fever and Holidays on Ice, as well as collections of personal essays, Naked, Me Talk Pretty One Day, and Dress Your Family in Corduroy and Denim, each of which became immediate bestsellers. There are a total of seven million copies of his books in print and they have been translated into 25 languages. He is the editor of an anthology of stories, , Children Playing Before a Statue of Hercules: An Anthology of Outstanding Stories. His essays appear regularly in Esquire and The New Yorker. Sedaris and his sister, Amy Sedaris, have collaborated under the name &quot;The Talent Family&quot; and have written several plays which have been produced at La Mama, Lincoln Center , and The Drama Department in New York City . These plays include Stump the Host, Stitches, One Woman Shoe, which received an Obie Award, Incident at Cobbler's Knob, and The Book of Liz, which was published in book form by Dramatist's Play Service. David Sedaris's original radio pieces can often be heard on This American Life, distributed nationally by Public Radio International and produced by WBEZ. In 2001, David Sedaris became the third recipient of the Thurber Prize for American Humor. He was named by Time magazine as &quot;Humorist of the Year&quot; in 2001. David Sedaris was nominated for two Grammy Awards for Best Spoken Word Album (&quot;Dress Your Family in Corduroy &amp; Denim&quot;) and Best Comedy Album (&quot;David Sedaris: Live at Carnegie Hall&quot;). In 2008 the audio version of When You Are Engulfed in Flames was nominated for a Grammy in the Best Spoken Word category.","torrent":{"xt":"urn:btih:3d68687a9b2b69d3f69308501c343aeac4a80f60","amp;dn":"David+Sedaris+-+Three+ebooks+%28Epub+and+Mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d68687a9b2b69d3f69308501c343aeac4a80f60","infoHashBuffer":{"type":"Buffer","data":[61,104,104,122,155,43,105,211,246,147,8,80,28,52,58,234,196,168,15,96]},"announce":[],"urlList":[]}}