{"title":"Mott The Hoople - All The Young Dudes (1972)","uid":3365802,"size":99085437,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3d7598eac799eae59ba01ada341476939839f437&amp;dn=Mott+The+Hoople+-+All+The+Young+Dudes+%281972%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"hubahuba","files":11,"time":1123261293,"description":"Review by - Bud Scoppa, Rolling Stone, 12/7/72. \n\nTaking what does not belong to you is a crucial part of the process of creating rock &amp; roll: Exploiting proven riffs, phrases and hooks, then adding a few twists of your own -- that's how it works and that's how it's always worked. Only nobody made a big thing about it until Mott the Hoople came along. They've never made any attempt to camouflage the sources of their music; on the contrary, they have glorified the practice of musical thievery. Mott's first album, on which the group introduced its felonious approach with furious, shameless abandon, is a genuine tour de force. The group took specifics that the Stones used to create and that Procol Harum used to get that thunder and flamboyantly superimposed these over a style that bore every plane and angle to be found in Dylan's &quot;Like a Rolling Stone.&quot; And their song choices: Hearing some irreverent English punk doing a startlingly well-executed deadpan Dylan over a surging Highway 61 instrumental track on an old Sonny and Cher novelty tune is an experience as ironically apt -- and as oddly touching -- as the whole idea is ironically comic.\n\nAnd if Mott the Hoople let its high-spirited plays on middle Dylan degenerate into heavy-handed near-obsession over the course of albums two or three, the group made up for it early this year with the rip-roaring Brain Capers. There was still a definite Dylanesque aspect in singer Ian Hunter's vocals and in the keyboard-cascade crescendos, but for the first time it was doled out with care rather than with the usual unchecked fury. Just as important, the group regained its sense of humor about itself and about its sources (the pairing of Dylan and the Tijuana Brass was especially nice).\n\nBut after four albums, the Hooples still hadn't gained much of an audience: Their label, Atlantic, unloaded them, and morale was so low that there was serious talk of calling it quits. At the critical moment, along came David Bowie, who liked the group very much and wanted to produce its next album. Bowie, who is as smart in the studio as he is flamboyant on stage, endeavored to help Mott tie up its few remaining musical loose ends with a much-needed commercial boost by supplying them with a finely written, brilliantly arranged single, &quot;All the Young Dudes,&quot; which seems likely to become Mott's first hit, adding to their image a modicum of trendiness they never would've been able to cultivate on their own.\n\nFor the album, producer Bowie has taken thinning shears to Mott's wild, thick sound and given it a smoother, more streamlined shape. On All the Young Dudes, you won't find any more of those tracks that build unremittingly to full roars and so remain. The tracks here are of moderate length, and you can distinctly hear the individual elements throughout each. The first time through, I was surprised to find the group's treatment of the Velvet Underground classic, &quot;Sweet Jane,&quot; with its obvious powerhouse potential, subdued to the point of understatement. It doesn't hit you over the head and flail you as you'd expect it to in Mott's hammy hands -- it practically beguiles. By using a muted setting as he does here, Bowie lets heretofore unnoticed aspects of the band's approach come to the surface: Hunter is no longer just a clever impersonator -- he's turned into a convincing singer, a fact that didn't register earlier because his voice was rarely separable from the group's enveloping sound. Hunter offhandedly strolls his way through &quot;Sweet Jane,&quot; with more than a trace of mannered Bowie inflection and Lou Reed Talky Dylan-ness added to his own thoroughly Dylanized style.\n\nMick Ralphs, who along with Hunter has been responsible for most of the group's material, is finally given some space to play his guitar apart from the rest of the group; his usually double-tracked guitar work is one of the album's strongest facets. Ralphs' high, clean backing vocals, juxtaposed with Hunter's crude, personal singing, form a balanced, compelling vocal sound, and Ralphs' lead vocal on his own &quot;Ready for Love&quot; is the best he's ever done.\n\nFortunately, Bowie has chosen not to tamper with the two most endearing qualities of Mott the Hoople: The group's irreverent, seemingly unconscious punk humor, and the closely related sense of knowing just what to rip off from whom and where to use it. The intro to Hunter's &quot;Jerkin' Crocus&quot; will trick the inattentive into thinking they're hearing the Stones launch into &quot;Brown Sugar&quot; (although it develops into a crisp, appealing song on its own terms, featuring a just-right whhoo-oo-oo vocal embellishment following Hunter into the choruses, a nice touch the group would never have thought of without Bowie's help). The Stones steal gets your attention, as does the playing off of a Keith Richards-style tense, ringing guitar against a power-chorded Led Zeppelin guitar-bass boom in &quot;One of the Boys.&quot; And what Hoople album would be complete without Hunter, back in full Dylan regalia, badmouthing some not-so-sweet young thing (&quot;Mama's Little Jewel,&quot; by Hunter and bass player Overend Watts). The new element of sexual ambiguity may be in deference to the producer or in quest of attention, but whatever the reason it's almost as funny to hear this pseudo-Dylan struggle with sexual identity as it is to hear that other one hawking &quot;Golden Protest&quot; on the National Lampoon album.\n\nBetween the Bowie and Reed tunes, the two bows to the Stones, the latest variation on Highway 61 and the irresistible &quot;Ready for Love&quot; (there's also the haunting, sad Hunter ballad, &quot;Sea Diver,&quot; giving the album a somber, mystic ending), there's an extravagant amount of power-driven, hook-laden rock &amp; roll on All the Young Dudes. Bowie deserves plenty of credit for cleaning and refining, but he had plenty to work with. Now they've got everything, and they're bound to make it on the strength of this record. I just hope they can take what Bowie's given them and move off in a direction of their own, rather than staying in his shadow. I also hope they never get so pleased with themselves that they try to be overtly ambitious or original. When it comes right down to it, you are what you steal, and Mott the Hoople has stolen extremely well.\n\nTrack Listings\n\n1. Sweet Jane\n2. Momma's little jewel\n3. All the young dudes\n4. Sucker\n5. Jerkin' crocus\n6. One of the boys\n7. Soft ground\n8. Ready for love/After lights\n9. Sea diver\n\nAll lyrics are added in the tags, click the button on your player and go for it!!\n\nEnjoy..","torrent":{"xt":"urn:btih:3d7598eac799eae59ba01ada341476939839f437","amp;dn":"Mott+The+Hoople+-+All+The+Young+Dudes+%281972%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d7598eac799eae59ba01ada341476939839f437","infoHashBuffer":{"type":"Buffer","data":[61,117,152,234,199,153,234,229,155,160,26,218,52,20,118,147,152,57,244,55]},"announce":[],"urlList":[]}}