{"title":"RealtimeBondage--Pushing Boundaries Part 1  London River Bugged","uid":15759535,"size":2147745385,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3dcbe822190d485ec099437d8d0fcf456cf6ff1c&amp;dn=RealtimeBondage--Pushing+Boundaries+Part+1++London+River+Bugged+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"merzedes","files":1,"time":1473096409,"description":"Pushing Boundaries Part 1 | London River\r\n\r\n\r\n\r\nNOTE: This is a bugged version that stops playback at 37 min 45 sec. When fixed version i out we will upload that. Most of this video is watchable except for the last few minutes.\r\n\r\n\r\n\r\nAugust 27, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nDominatrix Beaten at Her Own Game \r\n\r\nLondon River is one of the most intense and intimidating handlers we have on our staff. She is probably the most feared among our models and even some of the staff. That's why when she agreed to be the model for today's live show she had some special terms for the agreement, namely that she would be involved in the planning of her own on-screen experience. So along with some of our other handlers and loyal viewers, she came up with a series of the worst torments that could be devised to put any person through, and then she handed the list back to our crew. Now it is time to find out if all that is enough to break the bossiest bitch in BDSM.\r\n\r\nO.T. says it best at the beginning of our feed, &quot;London doesn't submit.&quot; So the first thing we decide to have her do is put on a show for us to prove that all she is there for is our entertainment. And she does a good job. London slowly strips down as she does an impressively acrobatic pole dance for our audience until she is in nothing more than a shiny gold bra and silver thong.\r\n\r\nStill, it's tough for her to get into the mindset of a submissive even when she finds herself on her tip toes with a rope around her neck and a bucket on the other end that keeps getting more weighed down. She has so much criticism to give in her compromised state. She tells O.T. to move her handcuffed wrists from her front to her back and to shift where the rope is pulling on her neck. She chokes out commands with what little breath she can manage.London quickly stops barking directions when the whip comes out. It cracks harder and louder against London than it does against our other models because we know she is tough and she can take it. She holds it together until just like we knew she could, up until O.T. comes over and slaps her across the face. Then the tears come.  \r\n\r\nScreens \nhttp://www.realtimebondage.com/live/bondage/trailer.php?y=2016&amp;p=08_27lriver12&amp;u=RealTimeBondage-London-River-Pushing-Boundaries-Part-1\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:3dcbe822190d485ec099437d8d0fcf456cf6ff1c","amp;dn":"RealtimeBondage--Pushing+Boundaries+Part+1++London+River+Bugged+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dcbe822190d485ec099437d8d0fcf456cf6ff1c","infoHashBuffer":{"type":"Buffer","data":[61,203,232,34,25,13,72,94,192,153,67,125,141,15,207,69,108,246,255,28]},"announce":[],"urlList":[]}}