{"title":"Cryptography and Network Security Principles and Practices, 4th","uid":9121399,"size":55490623,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e2063e09a073cbee70c0d7804745ac210c07ce6&amp;dn=Cryptography+and+Network+Security+Principles+and+Practices%2C+4th+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Bellatrix231","files":1,"time":1383139890,"description":"[color=orange][size=200][b]Cryptography and Network Security Principles and Practices, Fourth Edition-William Stallings[/b][/size][/color]\n\n[img]http://img585.imageshack.us/img585/4240/99un.jpg[/img]\n\nPublisher: Prentice Hall\n\nPub Date: November 16, 2005\n\nPrint ISBN-10: 0-13-187316-4\n\nPrint ISBN-13: 978-0-13-187316-2\n\neText ISBN-10: 0-13-187319-9\n\neText ISBN-13: 978-0-13-187319-3\n\nPages: 592\n\n[color=orange][u]Book Description[/u][/color]\n\nPublication Date: November 26, 2005 | ISBN-10: 0131873164 | ISBN-13: 978-0131873162 | Edition: 4\n\nIn this age of viruses and hackers, of electronic eavesdropping and electronic fraud, security is paramount. This solid, up-to-date tutorial is a comprehensive treatment of cryptography and network security is ideal for self-study. Explores the basic issues to be addressed by a network security capability through a tutorial and survey of cryptography and network security technology. Examines the practice of network security via practical applications that have been implemented and are in use today. Provides a simplified AES (Advanced Encryption Standard) that enables readers to grasp the essentials of AES more easily. Features block cipher modes of operation, including the CMAC mode for authentication and the CCM mode for authenticated encryption. Includes an expanded, updated treatment of intruders and malicious software. A useful reference for system engineers, programmers, system managers, network managers, product marketing personnel, and system support specialists.\n\n[u][b][color=purple]About the Autho[/color]r[/b][/u]\n\nWilliam Stallings has made a unique contribution to understanding the broad sweep of technical developments in computer networking and computer architecture. He has authored 18 titles, and counting revised editions, a total of 35 books on various aspects of these subjects. In over 20 years in the field, he has been a technical contributor, technical manager, and an executive with several high-technology firms. Currently he is an independent consultant whose clients have included computer and networking manufacturers and customers, software development firms, and leading-edge government research institutions.\n\nHe has received the prize for best Computer Science and Engineering textbook of the year from the Textbook and Academic Authors Association six times.\n\nBill has designed and implemented both TCP/IP-based and OSI-based protocol suites on a variety of computers and operating systems, ranging from microcomputers to mainframes. As a consultant, he has advised government agencies, computer and software vendors, and major users on the design, selection, and use of networking software and products.\n\nDr. Stallings holds a Ph.D. from M.I.T. in Computer Science and a B.S. from Notre Dame in Electrical Engineering.\nProduct Details","torrent":{"xt":"urn:btih:3e2063e09a073cbee70c0d7804745ac210c07ce6","amp;dn":"Cryptography+and+Network+Security+Principles+and+Practices%2C+4th+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e2063e09a073cbee70c0d7804745ac210c07ce6","infoHashBuffer":{"type":"Buffer","data":[62,32,99,224,154,7,60,190,231,12,13,120,4,116,90,194,16,192,124,230]},"announce":[],"urlList":[]}}