{"title":"Ghost in the Wires: My Adventures as the World's Most Wanted Ha","uid":6644091,"size":403904394,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3e7df81ad94a0e955665e5433045edc74aa1ad69&amp;dn=Ghost+in+the+Wires%3A+My+Adventures+as+the+World%5C%27s+Most+Wanted+Ha&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"scuba-doo","files":-1,"time":1314835392,"description":"- Audible Audio Edition\n- Listening Length: 14 hour(s) and 5 min.\n- Program Type: Audiobook\n- Version: Unabridged\n- Publisher: Blackstone Audio, Inc. (August 15, 2011)\n- Language: English\n- ASIN: B005HBO3BY\n\n\n\nProduct Description:\n\nKevin Mitnick was the most elusive computer break-in artist in history. He accessed computers and networks at the world's biggest companies--and however fast the authorities were, Mitnick was faster, sprinting through phone switches, computer systems, and cellular networks. He spent years skipping through cyberspace, always three steps ahead and labeled unstoppable. But for Kevin, hacking wasn't just about technological feats-it was an old fashioned confidence game that required guile and deception to trick the unwitting out of valuable information.\n\nDriven by a powerful urge to accomplish the impossible, Mitnick bypassed security systems and blazed into major organizations including Motorola, Sun Microsystems, and Pacific Bell. But as the FBI's net began to tighten, Kevin went on the run, engaging in an increasingly sophisticated cat and mouse game that led through false identities, a host of cities, plenty of close shaves, and an ultimate showdown with the Feds, who would stop at nothing to bring him down. \n\nGhost in the Wires is a thrilling true story of intrigue, suspense, and unbelievable escape, and a portrait of a visionary whose creativity, skills, and persistence forced the authorities to rethink the way they pursued him, inspiring ripples that brought permanent changes in the way people and companies protect their most sensitive information.\n\n\n\nHASH:     3E7DF81AD94A0E955665E5433045EDC74AA1AD69\n\n\n\nscanned with eScan ISS 11  + SuperAntiSpyware = Malware FREE\n\nENJOY\n       scuba-doo\n\n\nshare the wealth and seed, comments are more then welcome","torrent":{"xt":"urn:btih:3e7df81ad94a0e955665e5433045edc74aa1ad69","amp;dn":"Ghost+in+the+Wires%3A+My+Adventures+as+the+World%5C%27s+Most+Wanted+Ha","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e7df81ad94a0e955665e5433045edc74aa1ad69","infoHashBuffer":{"type":"Buffer","data":[62,125,248,26,217,74,14,149,86,101,229,67,48,69,237,199,74,161,173,105]},"announce":[],"urlList":[]}}