{"title":"Frank Zappa - Sheik Yerbouti TQMP","uid":5115395,"size":496368652,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3f5da6f85f573c1a592a2dfe3a94e43db53b3349&amp;dn=Frank+Zappa+-+Sheik+Yerbouti+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"zootallure","files":37,"time":1255034254,"description":"In order to finance his artier excursions, which increasingly required more expensive technology, Frank Zappa recorded several collections of guitar- and song-oriented material in the late '70s and early '80s, which generally concentrated on the bawdy lyrical themes many fans had come to expect and enjoy in concert. Sheik Yerbouti (two LPs, one CD) was one of the first and most successful of these albums, garnering attention for such tracks as the Grammy-nominated disco satire &quot;Dancin' Fool,&quot; the controversial &quot;Jewish Princess,&quot; and the equally controversial &quot;Bobby Brown Goes Down,&quot; a song about gay S&amp;M that became a substantial hit in European clubs. While Zappa's attitude on the latter two tracks was even more politically incorrect than usual for him, it didn't stop the album from becoming his second-highest charting ever. Social satire, leering sexual preoccupations, and tight, melodic songs dominated the rest of the record as well, as Zappa stuck to what had been commercially successful for him in the past. The &quot;dumb entertainment&quot; (as Zappa liked to describe this style) on Sheik Yerbouti was some of his dumbest, for better or worse, and the music was undeniably good -- easily some of his best since Apostrophe, and certainly the most accessible. Even if it sometimes drifts a bit, fans of Zappa's '70s work will find Sheik Yerbouti on nearly an equal level with Apostrophe and Over-Nite Sensation, both in terms of humor and musical quality. \n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:            &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)\t\t\t","torrent":{"xt":"urn:btih:3f5da6f85f573c1a592a2dfe3a94e43db53b3349","amp;dn":"Frank+Zappa+-+Sheik+Yerbouti+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f5da6f85f573c1a592a2dfe3a94e43db53b3349","infoHashBuffer":{"type":"Buffer","data":[63,93,166,248,95,87,60,26,89,42,45,254,58,148,228,61,181,59,51,73]},"announce":[],"urlList":[]}}