{"title":"The Offshoring of Engineering","uid":12013675,"size":3346569,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3fec23ae3b9695a54a1f73db47dae9ebbabe1d20&amp;dn=The+Offshoring+of+Engineering&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"clouderone","files":1,"time":1434270007,"description":"ISBN 9780309114837\n\nThe engineering enterprise is a pillar of U.S. national and homeland security, economic vitality, and innovation. But many engineering tasks can now be performed anywhere in the world. The emergence of &quot;offshoring&quot;- the transfer of work from the United States to affiliated and unaffiliated entities abroad - has raised concerns about the impacts of globalization.\n\nThe Offshoring of Engineering helps to answer many questions about the scope, composition, and motivation for offshoring and considers the implications for the future of U.S. engineering practice, labor markets, education, and research. This book examines trends and impacts from a broad perspective and in six specific industries - software, semiconductors, personal computer manufacturing, construction engineering and services, automobiles, and pharmaceuticals.\n\nThe Offshoring of Engineering will be of great interest to engineers, engineering professors and deans, and policy makers, as well as people outside the engineering community who are concerned with sustaining and strengthening U.S. engineering capabilities in support of homeland security, economic vitality, and innovation","torrent":{"xt":"urn:btih:3fec23ae3b9695a54a1f73db47dae9ebbabe1d20","amp;dn":"The+Offshoring+of+Engineering","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fec23ae3b9695a54a1f73db47dae9ebbabe1d20","infoHashBuffer":{"type":"Buffer","data":[63,236,35,174,59,150,149,165,74,31,115,219,71,218,233,235,186,190,29,32]},"announce":[],"urlList":[]}}