{"title":"Pocket Companion to Guyton &amp; Hall Textbook of Medical Physio","uid":9638743,"size":8687648,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:401b29362649af9b5a2aa5df0eeda744e7cafa1d&amp;dn=Pocket+Companion+to+Guyton+%26amp%3B+Hall+Textbook+of+Medical+Physio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"0xmovva","files":-1,"time":1392877266,"description":"Series: Guyton Physiology\nPaperback: 736 pages\nPublisher: Saunders; 12 edition (March 16, 2011)\nLanguage: English\nISBN-10: 1416054510\nISBN-13: 978-1416054511\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\nJohn E. Hall's Pocket Companion to Guyton and Hall Textbook of Medical Physiology, 12th Edition offers at-a-glance reference to the most important facts and concepts from one of the world's favorite medical physiology texts, all in a portable, quick-access format. It assembles all of the physiologic data and principles needed for the study of medicine, presents them in a concise, no-nonsense manner, and fits them into your pocket - for convenient access anytime!\n\nEfficiently review key concepts thanks to a concise, at-a-glance format.\nCarry the same authoritative, useful knowledge that readers of Guyton have come to trust - right in your pocket.\nEasily locate more in-depth discussions inside the parent text with abundant cross-references and a parallel chapter organization.\n\nQuickly access all of the most current physiology information on the go.\n\nDelivers the salient points from the parent text in a manner that is ideal for rapid comprehension of the core concepts in Physiology","torrent":{"xt":"urn:btih:401b29362649af9b5a2aa5df0eeda744e7cafa1d","amp;dn":"Pocket+Companion+to+Guyton+%26amp%3B+Hall+Textbook+of+Medical+Physio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"401b29362649af9b5a2aa5df0eeda744e7cafa1d","infoHashBuffer":{"type":"Buffer","data":[64,27,41,54,38,73,175,155,90,42,165,223,14,237,167,68,231,202,250,29]},"announce":[],"urlList":[]}}