{"title":"Death In Vegas - The Contino Sessions","uid":4189792,"size":69832186,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:40570289c389df7c986f3ca36eea0bd069e08e09&amp;dn=Death+In+Vegas+-+The+Contino+Sessions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"billy_stretcher","files":14,"time":1210884439,"description":"Death In Vegas\nThe Contino Sessions\nElectronica/Alt.Rock\n1999\n192Kbps\n\n1. Dirge [Feat.Dot Allison]  \n2. Soul Auctioneer [Feat.Bobby Gillespie]  \n3. Death Threat   \n4. Flying    \n5. Aisha [Feat.Iggy Pop]  \n6. Lever Street   \n7. Aladdin&amp;#039;s story   \n8. Broken Little Sister [Feat.Jim Reid]  \n9. Neptune City  \n\nFront, Back, Inside, CD Covers And Inlay Included.\n\n\nThis eclectic British rock-tronica outfit began life in 1994 as Dead Elvis--a name they were asked to change by the late Presley&amp;#039;s people--around the nucleus of DJ Richard Fearless and producer Steve Hellier--replaced by Tim Holmes after the first album--and a cast of sidemen and stellar guest vocalists. Their debut album impressed clubgoers who liked a bit of punk grit and lysergic fantasia served up with their techno and dub, and along with like-minded acts such as the Chemical Brothers, were instrumental in bridging the worlds of rock and club music. Although the band was not prolific--only four full-length releases in over a decade--they kept busy contributing to popular soundtracks, LOST IN TRANSLATION, commercials, and compilations, as well as DJ-ing and producing other acts.\n\nDeath In Vegas: Tim Holmes (keyboards); Richard Fearless (DJ).\nAdditional personnel: Iggy Pop, Dot Allison, Bobby Gillespie, Jim Reid (vocals); Ian Button (guitar); Seamus Beaghen, Gary Burns (keyboards); Ali Friend (acoustic bass); Matt Flint (bass); Simon Hanson, Will Blanchard (drums); London Community Gospel Choir (background vocals).\nRecorded at The Contino Rooms and The Strongroom, London, England; Electric Lady Studios, New York, New York.\nRichard Fearless and Tim Holmes are the masterminds behind Death in Vegas. They wrote most of the songs on THE CONTINO SESSIONS and laid down loops, beats and electronics, their tracks augmented by a revolving cast of friends. For the most part, the album combines majestic, spacy Britrock a la Spiritualized with the studio techniques of electronica. \nThe opener, &quot;Dirge,&quot; is a near-instrumental that rings electronic variations on an incessant two-chord vamp, in the manner of a modern-day Hawkwind. Several cuts are all-instrumental, leaving Fearless and Holmes to work their subtle magic on harmonically simple but texturally shifting frameworks. A couple of famous guest vocalist pop up--Iggy Pop delivers a tale of murder and mayhem on the ominous, punky &quot;Aisha&quot; and Jesus &amp; Mary Chain&amp;#039;s Jim Reid is on hand for &quot;Broken Little Sister,&quot; a moody rocker not dissimilar to Reid&amp;#039;s previous work. Things close on a celebratory note with the rapturous, elegantly unfolding instrumental &quot;Neptune City.&quot;\n\n\nMojo (10/99, p.95) - &quot;...its vision is resolutely bleak, its atmosphere airless and unsettling....[straying] into new areas previously unexplored in dance music. [DIV] have stopped imitating and begun innovating...&quot;\n\nMojo (1/00, p.31) - Ranked #25 in Mojo Magazine&amp;#039;s &quot;Best of 1999.&quot;\n\nMuzik (10/99, p.95) - 5 stars out of 5 - &quot;...a sepulchral, formidable inner space where the funk is evil, the guitars bittersweet, the vocals plaintive and the basslines beautifully surly. Truth is, a band headed by a dance DJ has just made this year&amp;#039;s best rock album...&quot;\n\nMuzik (1/00, p.69) - Ranked #7 in Muzik&amp;#039;s &quot;Albums Of The Year &amp;#039;99&quot;\n\nRolling Stone (9/30/99, p.84) - 3.5 stars out of 5 - &quot;...rock that feels like techno....Gorgeous and wasted, THE CONTINO SESSIONS sounds like blues for space cowboys.&quot;\n\nQ (10/99, p.117) - 4 stars out of 5 - &quot;...stands as an attention-grabbing, chapter-closing masterpiece of darkling dance-rock psychedelia.&quot;\n\nQ (1/00, p.84) - Included in Q Magazine&amp;#039;s &quot;50 Best Albums of 1999.&quot;\n\nAlternative Press (10/99, p.91) - 4 out of 5 - &quot;...frequently [succeeding] in matching the breadth of its ambitions....THE CONTINO SESSIONS finds DIV evolving into a band who can transcend the divisions between dance and rock cultures.&quot;\n\nEntertainment Weekly (10/1/99, pp.74-5) - &quot;...[their] songs lock into a groove and slowly burrow into your consciousness....With their repetitive guitar riffs echoing against electronics...their appeal doesn&amp;#039;t fade...&quot;\n\nEnjoy!:)\n","torrent":{"xt":"urn:btih:40570289c389df7c986f3ca36eea0bd069e08e09","amp;dn":"Death+In+Vegas+-+The+Contino+Sessions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40570289c389df7c986f3ca36eea0bd069e08e09","infoHashBuffer":{"type":"Buffer","data":[64,87,2,137,195,137,223,124,152,111,60,163,110,234,11,208,105,224,142,9]},"announce":[],"urlList":[]}}