{"title":"Stochastic Global Optimization","uid":12153189,"size":6941175,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4068dd41b9c380b1c3b4a084b0508ee6d92cecf0&amp;dn=Stochastic+Global+Optimization&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"clouderone","files":1,"time":1437689898,"description":"Advances in Process Systems Engineering Vol. 2 - Stochastic Global Optimization - Techniques and Applications in Chemical Engineering (World Scientific, 2010).pdf\n\nISBN 9789814299206\n\nOptimization has played a key role in the design, planning and operation of chemical and related processes, for several decades. Global optimization has been receiving considerable attention in the past two decades. Of the two types of techniques for global optimization, stochastic global optimization is applicable to any type of problems having non-differentiable functions, discrete variables and/or continuous variables. It, thus, shows significant promise and potential for process optimization.\nSo far, there are no books focusing on stochastic global optimization and its applications in chemical engineering. Stochastic Global Optimization a monograph with contributions by leading researchers in the area bridges the gap in this subject, with the aim of highlighting and popularizing stochastic global optimization techniques for chemical engineering applications. The book, with 19 chapters in all, is broadly categorized into two sections that extensively cover the techniques and the chemical engineering applications","torrent":{"xt":"urn:btih:4068dd41b9c380b1c3b4a084b0508ee6d92cecf0","amp;dn":"Stochastic+Global+Optimization","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4068dd41b9c380b1c3b4a084b0508ee6d92cecf0","infoHashBuffer":{"type":"Buffer","data":[64,104,221,65,185,195,128,177,195,180,160,132,176,80,142,230,217,44,236,240]},"announce":[],"urlList":[]}}