{"title":"Lawrence M. Schoen - Barsk - The Elephants Graveyard","uid":15193693,"size":363590669,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:40818a3fbc2521ff6e2b7a16c274bf5e688cd146&amp;dn=Lawrence+M.+Schoen+-+Barsk+-+The+Elephants+Graveyard&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Cybotage","files":52,"time":1467544288,"description":"An historian who speaks with the dead is ensnared by the past. A child who feels no pain and who should not exist sees the future. Between them are truths that will shake worlds.\r\n\r\nIn a distant future, no remnants of human beings remain, but their successors thrive throughout the galaxy. These are the offspring of humanity's genius-animals uplifted into walking, talking, sentient beings. The Fant are one such species: anthropomorphic elephants ostracized by other races, and long ago exiled to the rainy ghetto world of Barsk. There, they develop medicines upon which all species now depend. The most coveted of these drugs is koph, which allows a small number of users to interact with the recently deceased and learn their secrets.\r\n\r\nTo break the Fant's control of koph, an offworld shadow group attempts to force the Fant to surrender their knowledge. Jorl, a Fant Speaker with the dead, is compelled to question his deceased best friend, who years ago mysteriously committed suicide. In so doing, Jorl unearths a secret the powers that be would prefer to keep buried forever. Meanwhile, his dead friend's son, a physically challenged young Fant named Pizlo, is driven by disturbing visions to take his first unsteady steps toward an uncertain future.\r\n\r\nRead by J. G. Hertzler\r\nFormat: MP3\r\nBitrate: 64 Kbps","torrent":{"xt":"urn:btih:40818a3fbc2521ff6e2b7a16c274bf5e688cd146","amp;dn":"Lawrence+M.+Schoen+-+Barsk+-+The+Elephants+Graveyard","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40818a3fbc2521ff6e2b7a16c274bf5e688cd146","infoHashBuffer":{"type":"Buffer","data":[64,129,138,63,188,37,33,255,110,43,122,22,194,116,191,94,104,140,209,70]},"announce":[],"urlList":[]}}