{"title":"First Strike (Dewey Andreas #6) by Ben Coes (ePub)","uid":15129746,"size":491612,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:408bbbe349bccd4cab4072e417d223df77eecb66&amp;dn=First+Strike+%28Dewey+Andreas+%236%29+by+Ben+Coes+%28ePub%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Skyeater","files":2,"time":1467142390,"description":"First Strike (Dewey Andreas #6)\r\nby Ben Coes \r\n\r\n---------\r\n\r\nThe violent terrorist group ISIS has launched a major military campaign to take over Syria. But as they commit more and more public atrocities, their sources for ammunition are drying up. However, their charismatic and tyrannical leader, Tristan Nazir, has a major card left to play, which will get a new secret shipment of arms underway.\r\n\r\nDewey Andreas is sent into the field to meet Mallory, the Milan CIA station chief who has explosive proof about the source of the terrorists group’s original funding. While ISIS operatives take out both Mallory and his source, Dewey escapes with the proof—the group’s original munitions were provided by a black-ops program from deep within the Pentagon itself.\r\n\r\nThe program unravels in time for the arms shipment to be stopped before it reaches its destination. But Isolda isn't finished. He launches a bold strike into the heart of America, sending a team to take over a dorm at Columbia University, capturing nearly 500 college students as hostages. Among those hostages is CIA Director Hector Calibrisi's daughter, Daisy. For every hour that the shipment of weapons is delayed, the radicals will publicly execute one student. A frontal assault will result in untold number of dead students. Sending the shipment will give Isolda and his followers the means to capture Syria and its resources, creating a terrorist run nation.\r\n\r\nIn a situation with no solutions, there remains only one option—Dewey Andreas","torrent":{"xt":"urn:btih:408bbbe349bccd4cab4072e417d223df77eecb66","amp;dn":"First+Strike+%28Dewey+Andreas+%236%29+by+Ben+Coes+%28ePub%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"408bbbe349bccd4cab4072e417d223df77eecb66","infoHashBuffer":{"type":"Buffer","data":[64,139,187,227,73,188,205,76,171,64,114,228,23,210,35,223,119,238,203,102]},"announce":[],"urlList":[]}}