{"title":"Sexually Broken--Allie James locked in automatic blow job machin","uid":8681572,"size":866180743,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:40c25ed97ba2800233fc6a455c58c42bdee89084&amp;dn=Sexually+Broken--Allie+James+locked+in+automatic+blow+job+machin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"merzedes","files":-1,"time":1373674039,"description":"Allie James is locked into a automatic blow job machine, with huge ring gag! Brutal deep throating! | Allie James | Matt Williams\n\nJuly 12, 2013 \n \n\nMP4 only.    \n \n \nWe have Allie James back on the pages of Sexually Broken. This super cute, amazing farm girl is taking the porn world by storm. At 5'8&quot; and a solid frame, this tough farm girl is learning just how much she loves bondage and rough sex.\n\nToday we are at the Farm, our location in the Adirondack mountains of New York, and we are in our barn for today's Sexually Broken offering. We have been working hard on the farm and and it's time for a steller blow job to release the stress of the day. Luckily we have Allie all locked up and ready for when we get primal urges.\n\nMowing is hard work and it's about 100 degree out, our barn however is cool and inviting, especially when you have a hot 20yr old farm girl locked into a custom bondage device. Allie has her head strapped to a modified fucking machine that we turn into a brutal blow job machine (you saw it here first, again). Allies' arms are strappado'd back and locked with custom metal restraints. A huge ring gag keeps her mouth open, her legs bound and opened wide with a powerful vibrator locked directly on her clit. We uncover our beauty who has been in storage, now her only task in life is to satisfy our urges.\n\nWe turn the machine on low to start and the machine moves her head back and forth on the hard cock. The vibrator on her clit is starting to make her cum, and we press forward. Allie is completely helpless as the machine is in control of her head. It pushes her head back and forth on the cock over and over, never getting tired, never stopping. Her mouth is held open by the huge ring gag and the machine uses her throat just like it would a pussy. It doesn't matter if Allie gets tired, it doesn't matter if she thinks she can't suck cock anymore, the machine makes her. We turn the machine up and down, push the cock deeper into her throat. Allie can do nothing but accept the cock in her mouth until we cum, or get bored and walk away.\n\nIt's been a long day, and we want to cum, that's why we came into the barn, that's why we have Allie stored here. We turn up the machine and Allie's head is going at break neck speed, she can sense we are going to cum in her open mouth and there is nothing she can do to stop it. Just that though alone drives Allie to have her own brutal orgasm. We both cum at the same time, Allie getting a mouth full of jiz. We turn off the machine, lower the canvass, and turn out the lights. We will be back after dinner, and Allie will still be there... \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/07_12ajames4/SexuallyBroken-Allie-James-Allie-James-is-locked-into-a-automatic-blow-job-machine-with-huge-ring-gag-Brutal-deep-throating.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/07_12ajames4/SexuallyBroken-Allie-James-Allie-James-is-locked-into-a-automatic-blow-job-machine-with-huge-ring-gag-Brutal-deep-throating.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  ","torrent":{"xt":"urn:btih:40c25ed97ba2800233fc6a455c58c42bdee89084","amp;dn":"Sexually+Broken--Allie+James+locked+in+automatic+blow+job+machin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40c25ed97ba2800233fc6a455c58c42bdee89084","infoHashBuffer":{"type":"Buffer","data":[64,194,94,217,123,162,128,2,51,252,106,69,92,88,196,43,222,232,144,132]},"announce":[],"urlList":[]}}