{"title":"The Great British Sewing Bee - S03E03 - HD-WebDL -- STS","uid":11713255,"size":1068246608,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:421fd715833fab9adb56ee1adeeabe99b6cd44be&amp;dn=The+Great+British+Sewing+Bee+-+S03E03+-+HD-WebDL+--+STS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"uggauga","files":2,"time":1424422448,"description":"\nThe Great British Sewing Bee - Series 3: Episode 3\n\nThe Great British Sewing Bee returns for a six-part series presented by Claudia Winkleman. Some of the country's best home sewers face three challenges to make or alter an item of clothing under intense time pressure. Each week, their creations are judged by Savile Row's Patrick Grant and sewing expert May Martin, until one of them is crowned Britain's best amateur sewer.\n\nClaudia takes the eight sewers back in time to the 50s when home sewing was at its height. Having transformed the sewing room in line with the era, judges Patrick Grant and May Martin have also tracked down one of the biggest-selling dressmaking patterns of the time - dubbed 'the walk-away dress' because you could 'start it after breakfast and walk away in it for luncheon!' Next the sewers enter the world of make do and mend when they are given a vintage gem which they must transform into a wearable garment. Finally they face an ambitious made-to-measure challenge when they are asked to make a 1950s blouse in unforgiving sheer fabric. This delicate and fiddly fabric shows every stitch both inside and out. There is nowhere to hide as the sewers struggle to control the most mobile of materials","torrent":{"xt":"urn:btih:421fd715833fab9adb56ee1adeeabe99b6cd44be","amp;dn":"The+Great+British+Sewing+Bee+-+S03E03+-+HD-WebDL+--+STS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"421fd715833fab9adb56ee1adeeabe99b6cd44be","infoHashBuffer":{"type":"Buffer","data":[66,31,215,21,131,63,171,154,219,86,238,26,222,234,190,153,182,205,68,190]},"announce":[],"urlList":[]}}