{"title":"My Bloody Valentine - Discography 1985-2013 [FLAC]","uid":9708983,"size":3362991918,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:423bdf8ca7dbd9c1c8cc1317d2916163a7726012&amp;dn=My+Bloody+Valentine+-+Discography+1985-2013+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"rudown78","files":286,"time":1394085570,"description":"My Bloody Valentine - Discography 1985-2013 [FLAC]\n\n\nLike the Velvet Underground, Sonic Youth, and the Jesus and Mary Chain before them, My Bloody Valentine redefined what noise meant within the context of pop songwriting. Led by guitarist Kevin Shields, the group released several EPs in the mid-'80s before recording the era-defining Isn't Anything in 1988, a record that merged lilting, ethereal melodies of the Cocteau Twins with crushingly loud, shimmering distortion. Though My Bloody Valentine rejected rock &amp; roll conventions, they didn't subscribe to the precious tendencies of anti-rock art-pop bands. Instead, they rode crashing waves of white noise to unpredictable conclusions, particularly since their noise wasn't paralyzing like the typical avant-garde noise rock band: it was translucent, glimmering, and beautiful. Shields was a perfectionist, especially when it came to recording, as much of My Bloody Valentine's sound was conceived within the studio itself. Nevertheless, the band was known as a formidable live act, even though they rarely moved, or even looked at the audience, while they were on-stage. Their notorious lack of movement was branded &quot;shoegazing&quot; by the British music press, and soon there were legions of other shoegazers -- Ride, Lush, the Boo Radleys, Chapterhouse, Slowdive -- that, along with the rolling dance-influenced Madchester scene, dominated British indie rock of the late '80s and early '90s. As shoegazing reached its peak in 1991, My Bloody Valentine released Loveless, which broke new sonic ground and was hailed as a masterpiece. Though the band was poised for a popular breakthrough, it disappeared into the studio and didn't emerge over the next five years, leaving behind a legacy that proved profoundly influential in the direction of '90s alternative rock.\n\nBorn in Queens, New York, Kevin Shields' family moved to Dublin, Ireland, when he was six years old. In his teens, he became obsessed with pop music, eventually playing in Complex with his childhood friend Colm O'Ciosoig. In 1984, Shields and O'Ciosoig formed My Bloody Valentine with vocalist Dave Conway and keyboardist Tina, taking their name from a slasher horror film. The group relocated to Berlin, where they released the Birthday Party-influenced EP This Is Your Bloody Valentine on the Tycoon label in 1985 to little notice. The following year, the band moved to London, where they added bassist Debbie Googe. By the summer, they had signed to Fever and had released the EP Geek!, which again was ignored. Later that year, the group moved to Kaleidoscope Sound, releasing The New Record by My Bloody Valentine EP, which illustrated a Jesus &amp; Mary Chain influence. The following year, the band moved to the Primitives' Lazy Records, releasing Sunny Sundae Smile early in the year. That EP was the first My Bloody Valentine record to mesh airy melodies with grinding guitars, but the two EPs that followed in 1987 -- Strawberry Wine and Ecstasy -- were more focused and acclaimed. Conway left the band by the end of the year and was replaced by vocalist/guitarist Bilinda Butcher, whose breathy vocals fit the group's evolving sound more appropriately.\n\nMy Bloody Valentine's new sound coalesced with the group's first full-fledged album, 1988's Isn't Anything. Released on Creation Records, Isn't Anything was greeted with enthusiastic reviews in the U.K. music press and the band's following increased dramatically by the end of the year; in fact, their reputation had become large enough to attract the attention of Sire/Warner Bros. in the U.S., who became the group's American label. Two other EPs, Feed Me With Your Kiss and You Made Me Realise, were also quite popular, and by the beginning of 1989, bands that based their sound on My Bloody Valentine's droning swirl began to appear. The group retreated to the studio in 1989 to record its follow-up, which meant that only one EP, Glider, was released during that year. By the spring of 1990, it was becoming clear that the follow-up to Isn't Anything wouldn't be appearing anytime soon, and reports about Shields' growing perfectionism began to circulate in the U.K. weekly music press. Soon, it became apparent that the band's lengthy recording sessions were crippling Creation Records, but the group's audience was still passionate despite the inactivity: the Tremolo EP was released at the end of 1990 to considerable acclaim, and managed to climb into the U.K. Top 40.\n\nWhen My Bloody Valentine's second album, Loveless, finally appeared in late 1991, it was greeted with uniformly excellent reviews and it became a hit within the U.K., reaching number 24 on the charts. In America, the group made significant inroads, particularly by supporting Dinosaur Jr. Despite the band's acclaim and growing audience, Loveless didn't sell in numbers to recoup its reported 500,000 dollar recording cost and Creation dropped the band from their label roster; Creation wouldn't fully recover until 1994, when they signed Oasis. My Bloody Valentine signed with Island and entered the studio at the end of 1992 to record a new album. In 1993, the group contributed a James Bond cover to a charity compilation.\n\nAnd then...nothing happened.\n\nShields built a home studio with his Island advance and reportedly completed two separate albums, but scrapped them both. Often, the studio ran into technological problems. Between 1993 and 1997, both Googe and O'Ciosoig left the band, leaving only Shields and Butcher; after driving a cab for about a year, Googe formed Snowpony in 1996. There were signs that My Bloody Valentine were emerging from hiding in 1996, when the group contributed to the Wire tribute album Whore and Shields played on Experimental Audio Research's Beyond the Pale. In the late 2000s, the band re-formed to play several shows, including a five-night residency at London's Roundhouse venue in June 2008; that summer and autumn, they played the European festival circuit as well as major cities in North America, including the All Tomorrow's Parties festival they curated in Monticello, New York, that September. In 2009 they embarked on a smaller round of dates, with dates in the Netherlands as well as the All Tomorrow's Parties &quot;Nightmare Before Christmas&quot; festival that December. Late in 2012, Shields announced that My Bloody Valentine had completed a new album, but no firm release date was mentioned. The album, mbv, arrived in February 2013.\n\n\n1985 - This Is Your Bloody Valentine\n1988 - Feed Me With Your Kiss [CD Single]\n1988 - Isn't Anything\n1988 - Isn't Anything [2012 Remaster]\n1988 - You Made Me Realise [EP]\n1989 - Ecstasy and Wine\n1990 - Glider [EP]\n1991 - Loveless\n1991 - Loveless [2012 Remaster]\n1991 - Tremolo [EP]\n2012 - EP's 1988-1991\n2013 - M B V\n\n\nAlbum artwork and rip logs are included. Enjoy!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:423bdf8ca7dbd9c1c8cc1317d2916163a7726012","amp;dn":"My+Bloody+Valentine+-+Discography+1985-2013+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"423bdf8ca7dbd9c1c8cc1317d2916163a7726012","infoHashBuffer":{"type":"Buffer","data":[66,59,223,140,167,219,217,193,200,204,19,23,210,145,97,99,167,114,96,18]},"announce":[],"urlList":[]}}