{"title":"Plague Inc: Evolved v0.6.6 (2-click run)","uid":9948020,"size":158769733,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:42b7948f48f484e1e9b76a44c5c7f6b166d174d7&amp;dn=Plague+Inc%3A+Evolved+v0.6.6+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1397343633,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a 'Easy Run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDESCRIPTION:\nPlague Inc. is a simulation game, where the objective is to kill all humans on\nEarth with a disease. It is similar in design to the Pandemic series of browser\ngames. The game offers various types of plagues, such as Bacteria, Virus,\nFungus all with their own characteristics. The disease is not controlled\ndirectly, but can be evolved to desired attributes. At some point the disease\nwill be discovered, and humanity will start working on a cure. The game will\nonly be won if all humans in all countries are dead. It is important to balance\nthe infectivity, severity, and lethality of the plague. The game also contains\na lot of information on different aspects of diseases.\n\nNew additions:\n*French, German and Russian Translations Added\n*Vsync, Frame Per Second and Anisotropic video options added\n*Loading screen with a shiny new Ndemic Logo\n*Splash Screen added\n\nTweaks:\n*Game selects Steam language to use, unless overridden by player in options menu.\n*Dynamic re-scaling of gene menu boxes (for translations).\n*Tooltip updated for translations and video options.\n*Improvements to zombie particle system &amp; dot spreading for all diseases.\n*Zombie hordes go to selected point in country.\n*Necroa Horde controls improved:\n*alt-tabbing memory optimisation.\n*Pass on colour differentiation of disease hexes.\n*When the tech hex is clicked, now resets back to its original view.\n*Credits screen re-starts when you re-enter.\n\nFixes:\n*XML errors in some translations boxes fixed.\n*Fixed gene deselection on Necroa genes.\n*Correct plague speading in Necroa games in Greenland fixed.\n*Fixed a couple of Necroa gameplay event messages.\n*Fixed Z Com forts appeared as destroyed for fraction of a second.\n*Replay of Necroa Virus games Z Com fort issue fixed.\n*Necroa Virus pop-up issue re Z Com forts fixed.\n*Z Com fortify event bug fixed.\n*Necroa Virus game completion bug fixed.\n*Necroa Virus end message issue fixed.\n*Fixed Dead End achievement.\n*Fixed some mis-firing events.\n*Pause game now ensures that the clouds/ocean are also paused.\n*Loss of clouds on pause fixed.\n*Listing dead countries correctly in Cure/World screen fixed.\n*Graph Bug Fixed.\n*Bug displaying bottom bar in Main Game all red fixed.\n*Fixed bug listing some high score tables listing scores at 11th ce.\n*Save game menu error when deleting old save format fixed.\n\nInstallation instructions:\n1. Execute the .exe file.\n2. Follow the instructions.\n3. Enjoy the program.\t","torrent":{"xt":"urn:btih:42b7948f48f484e1e9b76a44c5c7f6b166d174d7","amp;dn":"Plague+Inc%3A+Evolved+v0.6.6+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42b7948f48f484e1e9b76a44c5c7f6b166d174d7","infoHashBuffer":{"type":"Buffer","data":[66,183,148,143,72,244,132,225,233,183,106,68,197,199,246,177,102,209,116,215]},"announce":[],"urlList":[]}}