{"title":"BNF 67-British National Formulary [PDF] [StormRG]","uid":10029745,"size":9528585,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:432aec36c3cee50ab7dae807c53f306baa5b2028&amp;dn=BNF+67-British+National+Formulary+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":-1,"time":1398317943,"description":"Author: Bnf\nSeries: British National Formulary\nPaperback: 1126 pages\nPublisher: Pharmaceutical Press; 67 edition (March 1, 2014)\nLanguage: English\nISBN-10: 0857110861\nISBN-13: 978-0857110862\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple \nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\nNobody working in healthcare can afford to be without the latest edition of the British National Formulary. Compiled with the advice of clinical experts and continually updated to reflect the latest evidence from all credible sources worldwide, this essential reference provides up-to-date guidance on prescribing, dispensing, administering, and monitoring medicines. Not only does the BNF include the widely accepted framework for the drug management of common diseases, it also includes details of medicines prescribed in the UK, with special reference to their uses, cautions, contraindications, side-effects, dosage and relative costs. This allows treatment to be tailored to the individual needs of each patient. The BNF is updated in print every six months by an expert team of pharmacists, with guidance and validation from a network of leading clinicians, overseen by a Joint Formulary Committee with representatives from all spheres of clinical practice. The BNF reflects current best practice as well as legal and professional guidelines relating to the use of medicines. As a result it is used widely as a touchstone reference, and cited in Parliaments and courts as a source of authority.","torrent":{"xt":"urn:btih:432aec36c3cee50ab7dae807c53f306baa5b2028","amp;dn":"BNF+67-British+National+Formulary+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"432aec36c3cee50ab7dae807c53f306baa5b2028","infoHashBuffer":{"type":"Buffer","data":[67,42,236,54,195,206,229,10,183,218,232,7,197,63,48,107,170,91,32,40]},"announce":[],"urlList":[]}}