{"title":"Conducting Polymers - Faris Yilmaz","uid":15979473,"size":59626851,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4333bfecf3862b7779bf8680fb59fc6dea9938c9&amp;dn=Conducting+Polymers+-+Faris+Yilmaz&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"clouderone","files":1,"time":1475880866,"description":"Conducting Polymers - Faris Yilmaz (ExLi4EvA, 2016).pdf\r\n\r\nAn authentic revolution took place in the area of solid-state chemistry and physics just after World War II. The century of solid state started from the modest beginnings of the transistor at Bell Laboratory. Since then, the area of science and technology has been directed primarily toward the study of alloys, ceramics, and inorganic semiconductors. The size of electronic devices became smaller and smaller, while the dimensionality of materials was also reduced just after the invention of the integrated circuit. It is at this point that the advent of the discovery of quasi one-dimensional conductors has opened up a whole new area of ''nonclassical'' solid-state chemistry and physics. In the modern world, plastic and electrical devices are always tightly integrated together. However, it was in 1977 that an electrically conductive, quasi one-dimensional organic polymer, polyacetylene, was discovered. During the past 30 years, a variety of different conducting polymers have been developed. Excitement about these polymeric materials is evidenced by the fact that the field of conducting polymers has attracted scientists from such diverse areas of interest as synthetic chemistry, electrochemistry, solid-state physics, materials science, polymer science, electronics, and electrical engineering","torrent":{"xt":"urn:btih:4333bfecf3862b7779bf8680fb59fc6dea9938c9","amp;dn":"Conducting+Polymers+-+Faris+Yilmaz","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4333bfecf3862b7779bf8680fb59fc6dea9938c9","infoHashBuffer":{"type":"Buffer","data":[67,51,191,236,243,134,43,119,121,191,134,128,251,89,252,109,234,153,56,201]},"announce":[],"urlList":[]}}