{"title":"DAZ3D - Poser Mirandas Ice Cream Parlor","uid":15475645,"size":255156225,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:433ed17ba7634fef7ef92387c38d0933ed762df8&amp;dn=DAZ3D+-+Poser+Mirandas+Ice+Cream+Parlor&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"BeagleBandit","files":3,"time":1470187295,"description":"http://www.daz3d.com/miranda-s-ice-cream-parlor\r\n\r\nDetails\r\n\r\nTake a step back in time to the carefree days of the past when a visit to the soda fountain or ice cream parlor was a popular pasttime for children and families everywhere.\r\n\r\nMiranda's Old Fashioned Ice Cream Parlor is a stand-alone environment lovingly crafted down to the last detail. Featuring checkerboard floors, soft pastel colors, vintage inspired artwork and 50's style diner seating, Miranda's is sure to fill your needs. Whether rendering a modern scene with a nostalgic flair, or a scene straight from the days of yore, this set is the perfect addition to your environment library.\r\n\r\nMiranda's includes textures and materials for rendering in Iray or in 3Delight and comes with preset scenes for either render engine, complete with lighting, materials, and render settings. Additionally, several texture options have been provided to truly customize the look of the ice cream parlor. Choose either checkered, all-black, or all-white floors, pink, green or white walls, and either white-washed, dark brown, or golden maple woodwork. Combine them any way you want, then finish it off with pink, green or white curtains (that open and close) and a choice of pink, aqua or red vinyl seating. Mix a little, or mix a lot, there are many options.\r\n\r\nAdditionally, several ice cream treats are provided, with special ice cream shaders that allow you to choose how your treat will look. Included are banana split, sundae, milkshake, rootbeer float, single dip dish, as well as a single or double scoop waffle cone. Note that the materials for these treats have been optimized to look their best in Miranda's Parlor, so adjustments may be needed to use these props in other scenes.\r\n\r\nFinally, just to make it more universal, the menu board that hangs above the ice cream counter has 5 available languages, each translated by a native speaker. You can choose English (default), German, Spanish, French or Italian.\r\n\r\nSo, take a trip down memory lane. Bring your sweetheart, or your family, to Miranda's for an old-fashioned day of fun","torrent":{"xt":"urn:btih:433ed17ba7634fef7ef92387c38d0933ed762df8","amp;dn":"DAZ3D+-+Poser+Mirandas+Ice+Cream+Parlor","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"433ed17ba7634fef7ef92387c38d0933ed762df8","infoHashBuffer":{"type":"Buffer","data":[67,62,209,123,167,99,79,239,126,249,35,135,195,141,9,51,237,118,45,248]},"announce":[],"urlList":[]}}