{"title":"Donald Barthelme - Sixty Stories (pdf)","uid":8760321,"size":3227029,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4604172ccfdbb657dcb467d8f999af30061b8a1a&amp;dn=Donald+Barthelme+-+Sixty+Stories+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pharmakate","files":-1,"time":1375231308,"description":"Donald Barthelme - Sixty Stories (Dutton, 1982). 457 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nMajor collection by an American author known for his playful, postmodernist style of short fiction.\n\ndescription:\n\nWith these audacious and murderously witty stories, Donald Barthelme threw the preoccupations of our time into the literary equivalent of a Cuisinart and served up a gorgeous salad of American culture, high and low. Here are the urban upheavals reimagined as frontier myth; travelogues through countries that might have been created by Kafka; cryptic dialogues that bore down to the bedrock of our longings, dreams, and angsts. Like all of Barthelme's work, the sixty stories collected in this volume are triumphs of language and perception, at once unsettling and irresistible.\n\nReview\n\nThis excellent collection of Donald Barthelme's literary output during the 1960s and 1970s covers the period when the writer came to prominence--producing the stories, satires, parodies, and other formal experiments that altered fiction as we know it--and wrote many of the most beautiful sentences in the English language. Due to the unfortunate discontinuance of many of Barthelme's titles, 60 Stories now stands as one of the broadest overviews of his work, containing selections from eight previously published books, as well as a number of other short works that had been otherwise uncollected.\n\nReview\n\n&quot;Barthelme can focus our feeling into a bright point that can raise a blister. These 60 stories show him inventing at a fever pitch.&quot;  - The Washington Post\n\n&quot;Donald Barthelme may have influenced the short story in his time as much as Hemingway and O'Hara did in theirs.&quot;  - The New York Times\n\n&quot;The delight he offers to readers is beyond question, his originality is unmatched.&quot;  - Los Angeles Times","torrent":{"xt":"urn:btih:4604172ccfdbb657dcb467d8f999af30061b8a1a","amp;dn":"Donald+Barthelme+-+Sixty+Stories+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4604172ccfdbb657dcb467d8f999af30061b8a1a","infoHashBuffer":{"type":"Buffer","data":[70,4,23,44,207,219,182,87,220,180,103,216,249,153,175,48,6,27,138,26]},"announce":[],"urlList":[]}}