{"title":"CCNA ICND2 Study Guide- Sybex [Epub &amp; PDF]","uid":9176629,"size":36921464,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:46a10f69ce3109e00a8c57ae8aac7789231abc8d&amp;dn=CCNA+ICND2+Study+Guide-+Sybex+%5BEpub+%26amp%3B+PDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"F1restorm","files":-1,"time":1384161282,"description":"CCNA ICND2 Study Guide: Exam 200-101\nAuthor: Todd Lammle\nPublished: September, 2013\nPublisher: Sybex\nISBN: 9781118758137\nFormat: Retail PDF and Retail Epub\nReader Required: PDF- Adobe Reader, Adobe Digital Editions etc\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nConversion: easily convert epub to mobi (Kindle) using Calibre\nTested on the above readers with no problems.\nThe Sybex website (link in book) offers bonus content and study tools, please note that you need to register an email address (free) to access some of the bonus content. The author also offers a free website and forum to further develop your skills (link in book).\nPlease allow a couple of seconds for the seedboxes to engage and then it should be nice and quick.\nEnjoy and good luck with your tests :D\n___________________________________________________________________________\n\nLet Todd Lammle prepare you to ace the CCNA ICND2 exam\n\nIf you already have your CCENT, the ICND2 exam is all you need to earn the CCNA certification. This new study guide from Cisco networking authority Todd Lammle covers 100 percent of the objectives for the exam. Topics include operating IP data networks, understanding switching and routing technologies, working with IPv4 and IPv6 addressing, and troubleshooting. A robust set of study tools, including a network simulator that can be used with the book's hands-on labs and practice exams, gives you added confidence as you prepare.\n\nWritten by leading Cisco expert Todd Lammle, this complete study guide covers all the exam objectives for the new ICND2 exam Cisco certification is the number one certification sought by networking professionals.\n-Covers operating IP data networks, understanding switching and routing technologies, troubleshooting and network security, and working with IPv4 and IPv6 addressing\n-Includes a companion test engine (after free registration with an email address. Link is supplied in book) with hundreds of sample questions, a preassessment test, practice exams, and over 100 electronic flashcards\nFeatures a network simulator for use with the hands-on labs included in the book","torrent":{"xt":"urn:btih:46a10f69ce3109e00a8c57ae8aac7789231abc8d","amp;dn":"CCNA+ICND2+Study+Guide-+Sybex+%5BEpub+%26amp%3B+PDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46a10f69ce3109e00a8c57ae8aac7789231abc8d","infoHashBuffer":{"type":"Buffer","data":[70,161,15,105,206,49,9,224,10,140,87,174,138,172,119,137,35,26,188,141]},"announce":[],"urlList":[]}}