{"title":"Novalis - Philosophical Writings (Stoljar, trans.)","uid":11160903,"size":7371586,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4781185754e44db44b950a5c9d395ee8d2a142dc&amp;dn=Novalis+-+Philosophical+Writings+%28Stoljar%2C+trans.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"workerbee","files":-1,"time":1412538989,"description":"\n* Novalis - Philosophical Writings (SUNY Press, 1997).  Edited and translated by Margaret Mahony Stoljar.  208 pp. -- PDF\n\n\nThis is the first extensive scholarly translation in English from the philosophical work of the late eighteenth-century German Romantic writer Novalis (Friedrich von Hardenberg) [1772-1801].  His original and innovative thought explores many questions that are current today, such as truth and objectivity, reason and the imagination, language and mind, and revolution and the state.\n\nIt includes two collections of fragments published by Novalis in 1798, &quot;Miscellaneous Observations&quot; and &quot;Faith and Love&quot;, and the controversial essay &quot;Christendom or Europe&quot;.  In addition there are substantial selections from his unpublished notebooks, including &quot;Logological Fragments&quot;, the &quot;General Draft&quot; for an encyclopedia, the &quot;Monologue&quot; on language, and the essay on Goethe as scientist.\n\nFor more works by Novalis, see http://thepiratebay.se/torrent/11159387/  \n\n\nReview\n\n&quot;In Stoljar's lucid translation, Novalis's writings come across as fascinating and seminal as they are in the German original; the collection is a veritable eye-opener for anyone concerned with the wide-ranging impact of the best of German Romantic thought on subsequent developments in European literature, philosophy, history, science, psychology, music, the visual arts, etc., in other words, across the entire cultural landscape through the nineteenth century to the present.&quot; -- Steven Paul Scher, Dartmouth College\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                            &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:4781185754e44db44b950a5c9d395ee8d2a142dc","amp;dn":"Novalis+-+Philosophical+Writings+%28Stoljar%2C+trans.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4781185754e44db44b950a5c9d395ee8d2a142dc","infoHashBuffer":{"type":"Buffer","data":[71,129,24,87,84,228,77,180,75,149,10,92,157,57,94,232,210,161,66,220]},"announce":[],"urlList":[]}}