{"title":"La Banda Della Magliana - 1Â° La Nascita [satrip - Ita","uid":6698657,"size":524308480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:47b592c12417e09e9b0dc9f1128c4eb0cb82081c&amp;dn=La+Banda+Della+Magliana+-+1%26Acirc%3B%26deg%3B+La+Nascita+%5Bsatrip+-+Ita&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"proximun","files":1,"time":1316876438,"description":"LA BANDA DELLA MAGLIANA\nAtto I - La Nascita\n\n\n\n.: Scheda del Film :.\n\nTitolo della Serie: La Banda della Magliana\nNazionalitÃƒÂ : ITALIA\nAnno: 2010\nGenere: Documentario\nEmittente: History Channel Italia\nEpisodi: 4\nDurata: 55 min.\n\nSito Ufficiale &lt;a href=&quot;\nhttp://www.historychannel.it/labandadellamagliana/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.historychannel.it/labandadellamagliana/&lt;/a&gt;\n\n.: Info &amp; Curiosity :.\n\nENG\nThe Banda della Magliana was an Italian criminal organization based in Rome, particularly active throughout the late 1970s until the early 1990s. Given by the media, the name refers to the original neighborhood, the Magliana, of most of its members.\n\n\nThe Banda della Magliana was involved in criminal activities during the Italian years of lead (anni di piombo). The Italian justice tied it to other criminal organizations such as the Cosa Nostra, Camorra or 'Ndrangheta, but most importantly also to neofascist activists such as the Nuclei Armati Rivoluzionari (NAR), responsible for the 1980 Bologna massacre, the secret services (SISMI) and political figures such as Licio Gelli, grand-master of the freemasonic lodge Propaganda Due (P2). Along with Gladio, the NATO clandestine anti-communist organization, P2 was involved in a strategy of tension during the years of lead which included false flag terrorist attacks. These ties, underground compared to their standard (i.e. &quot;run-of-the-mill&quot; ) activities (drug dealing, horserace betting, money laundering, etc.), have led the Banda to be related to the political events of the conflict which divided Italy into two during the Cold War, and in particular to events such as the 1979 assassination of journalist Carmine Pecorelli; the 1978 murder of former Prime minister Aldo Moro, also leader of the Christian Democracy who was negotiating the historic compromise with the Italian Communist Party (PCI); the 1982 assassination attempt against Roberto Rosone, vice-president of Banco Ambrosiano; &quot;banker of God&quot; Roberto Calvi's 1982 murder; and also the 1980 Bologna massacre. Finally, the mysterious disappearance of Emanuela Orlandi, a case peripherally linked to former Grey Wolves member Mehmet Ali AÃ„Å¸ca's 1981 assassination attempt on Pope John Paul II, has also been related to the gang, though the Emanuela Orlandi case may not be connected to the &quot;Grey Wolves&quot;, but may have been one of the &quot;run-of-the-mill&quot; Banda della Magliana criminal activities, the Orlandi kidnap designed specifically to persuade the legally immune Vatican Bank to restore inequitably retained funds to Banco Ambrosiano creditors.\n\n\n\nITA\nE' la vera storia della Banda della Magliana raccontata dai veri protagonisti. Intrighi, oscure vicende, rivelazioni. Una pagina unica e irripetibile della storia di Roma e d'Italia, oscure vicende vengono a galla ancora oggi. Interviste esclusive a testimoni e membri della banda.\n\n&quot;La Banda della Magliana ÃƒÂ¨ stata e resterÃƒÂ  sempre un'esperienza criminale irripetibile&quot;. CosÃƒÂ¬ Renzo Danesi, uno dei fondatori, ha definito la Banda della Magliana, il sodalizio criminale attivo a Roma tra la fine degli anni '70 e i primi '90. Giovani, spietati, incoscienti: i ragazzi della Banda sono questo. Amici goliardici un attimo prima e precisi killer subito dopo. La storia della Banda della Magliana passa per i leader che ne hanno segnato gli alti e i bassi, cercando di prendere il sopravvento sugli altri, ma finendo inevitabilmente con l'essere eliminati: dall'ispiratore Franco Giuseppucci fino al discusso &quot;Renatino&quot; De Pedis.\n\nNata nel 1977 e inizialmente dedita alle rapine e ai sequestri di persona, la Banda della Magliana diventa presto una potente e ramificata organizzazione criminale, in un susseguirsi di omicidi locali e oscure vicende della storia d'Italia che vengono a galla ancora oggi. &quot;Solo uno di noi poteva fregarci&quot;, continua Danesi. La Banda della Magliana comincia a scricchiolare nel 1983, quando un affiliato decide di pentirsi e racconta tutto. La lunga agonia che ne segue porta gli amici di un tempo a sterminarsi l'uno con l'altro. Maurizio Abbatino, l'ultimo boss della Banda, subito dopo il suo arresto a Caracas nel 1992, si limitÃƒÂ² ad un semplice e laconico sorriso per commentare la fine di quell'esperienza irripetibile.\n\nIn Questo Episodio...\n\nLa storia di Franco Giuseppucci detto Er Negro, fondatore della spietata e potente Banda della Magliana. Quando nel 1977 Franco Giuseppucci conosce Maurizio Abbatino, delinquente di periferia, ÃƒÂ¨ ancora un giovane criminale di piccola taglia ma grandi ambizioni. I due riuniscono un gruppo di ragazzi di borgata per mettere a segno il sequestro del Duca Massimiliano Grazioli Lante della Rovere. I soldi del riscatto vengono investiti in ogni tipo di traffico illecito. Da questo momento Franco Giuseppucci e la sua Banda compiono un'ascesa criminale che li porta ai vertici della Capitale.\n\n.: Video :.\n\n\n\n\n\n\n.: Report Avinaptic :.\n\n[ Info sul file ]\n\nNome: La banda della Magliana - 01 - La Nascita.avi\nData: 11/12/2010 12:27:16\nDimensione: 524,308,480 bytes (500.02 MB)\n\n[ Info generiche ]\n\nDurata: 00:54:03 (3242.68 s)\nTipo di contenitore: AVI OpenDML\nStreams totali: 2\nTipo stream n. 0: video\nTipo stream n. 1: audio\nAudio streams: 1\nISFT: VirtualDubMod 1.5.4.1 (build 2178/release)\nJUNK: VirtualDubMod build 2178/release\n\n[ Dati rilevanti ]\n\nRisoluzione: ALTA (640 x 368 )\nLarghezza: multipla di 32 (BENE)\nAltezza: multipla di 16 (BENE)\n\n[ Traccia video ]\n\nFourCC: xvid/XVID\nRisoluzione: 640 x 368\nFrame aspect ratio: 40:23 = 1.739130\nPixel aspect ratio: 1:1 = 1\nDisplay aspect ratio: 40:23 = 1.739130\nFramerate: 25 fps\nFrames totali: 81067\nStream size: 469,454,673 bytes\nBitrate: 1158.189332 kbps\nQf: 0.196703\nKey frames: 1192 (0; 125; 126; 127; 149; ... 80983)\nNull frames: 0\nMin key int: 1\nMax key int: 250\nKey int medio: 68.009228\nRitardo: 0 ms\n\n[ Traccia audio ]\n\nAudio tag: 0x55 (MP3)\nBitrate (contenitore): 128 kbps CBR\nCanali (contenitore): 2\nFrequenza (contenitore): 48000 Hz\nChunks: 40529\nStream size: 51,883,008 bytes\nPreload: 504 ms\nMax A/V diff: 560 ms\nTipo: MPEG-1 Layer III\nEncoder: LAME3.98r\nChunk-aligned: SÃƒÂ¬\nEmphasis: none\nMode: joint stereo\nRitardo: 0 ms\n\n[ Info sulla codifica MPEG4 ]\n\nUser data: XviD0050\nQPel: No\nGMC: No\nInterlaced: No\nAspect ratio: Square pixels\nQuant type: MPEG custom (*)\nCustom intra quant matrix:\n8 16 20 23 27 30 32 34\n16 16 23 24 29 31 34 38\n20 23 27 28 30 35 38 40\n23 24 28 29 35 39 40 44\n27 29 30 35 39 42 45 50\n30 31 35 39 42 46 54 59\n32 34 38 40 45 54 62 72\n34 38 40 44 50 59 72 84\nCustom inter quant matrix:\n17 19 21 23 25 27 29 31\n19 21 23 25 27 28 29 33\n21 23 25 27 29 30 32 37\n23 25 27 30 31 34 40 45\n25 27 29 31 38 46 54 60\n27 28 30 34 46 58 72 74\n29 29 32 40 54 72 90 100\n31 33 37 45 60 74 100 124\n\n[ Profile compliancy ]\n\nProfilo da testare: MTK PAL 6000\nRisoluzione: Ok\nFramerate: Ok","torrent":{"xt":"urn:btih:47b592c12417e09e9b0dc9f1128c4eb0cb82081c","amp;dn":"La+Banda+Della+Magliana+-+1%26Acirc%3B%26deg%3B+La+Nascita+%5Bsatrip+-+Ita","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47b592c12417e09e9b0dc9f1128c4eb0cb82081c","infoHashBuffer":{"type":"Buffer","data":[71,181,146,193,36,23,224,158,155,13,201,241,18,140,78,176,203,130,8,28]},"announce":[],"urlList":[]}}