{"title":"Mario Salieri - la Dolce Vita XXX DVDRip","uid":11860084,"size":1633687552,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:47e4c2efdde8e0a26a1f1e56874b239f34d201a6&amp;dn=Mario+Salieri+-+la+Dolce+Vita+XXX+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"feeldabyte","files":1,"time":1430242950,"description":"\nScreens &amp; Info :\n\n----------------------------------\n &lt;a href=&quot;\nhttp://lovechix.com/?p=572427&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://lovechix.com/?p=572427&lt;/a&gt;\n &lt;a href=&quot;\nhttp://lovechix.com/?p=788399&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://lovechix.com/?p=788399&lt;/a&gt;\n\n----------------------------------\n\nStarring: Venere Bianca, Bambola, Uma, Silvia Christian, Katsumi, Alicia Kiss, Simony Diamond, Alexandra Blake, Michelle Wild, Rita Faltoyano, Romana Jess, Michela Torre, Gabriella Zaccaro, Francesco Malcom, Steve Holmes, Ramon, Horst Baron, Richard Lengin, Sebastian Barrio, Remigio Zampa, Riccardo Cafaro, Massimo Cella, Ciro Grano\n\nSummary: As promised, I present the latest film Mario Salieri-la Dolce Vita (The Sweet Life). Before the film there is a small clip telling about shooting the film.\nResubmitted to the description of the film, in the form of reviews, already known to you, connoisseur of Mario Salieri, user Major.\n&quot;Mario Salieri shoots porn on melodramatic plot, and he gets a full two-hour epic drama in the spirit of&quot; the call of the Eternal, &quot;but it is very erotic. A sense of proportion never changes the director, although he boldly enter a long game episodes, and they look quite naturally because the whole film &quot;La Dolce Vita&quot; - with a great deal of irony in the title - it looks like a good feature film. We must pay tribute to a number of artists who exhibit here not only their pornotalanty but excellent acting. This primarily relates to Bambolim, playing the role of a young girl Mary and her partner Francesco Malcom. Mario Salieri introduced into the film a large number of actors with the &quot;non-sexual&quot; roles, and this pattern only won.\nThe end of the 50s, southern Italy. In the small village of peasant families live young Francesco and Maria, who love each other. Russian by birth, but well speak Italian actress Bambolim - blonde slim girl with a simple sweet face and big, adjusted feeding. Parents and Francesco Maria - Maria's mother plays an interesting performer Venere Bianca, to which we will return - live is not easy, because the village controls the local mafia, headed by Don Genero. His henchmen, and he not only rob the peasants, but they are humiliated in every possible way; village girls are at their mercy.\nThe first sex scene mafia Don Marino enjoys the company of two young girls by Simony Diamond and Alessia The Romans. Simony Diamond - beautiful redhead with great Hungarian slender body and large breasts; The Romans Alessia - blonde from Ukraine, thin, too, with big natural breasts. Sex between them and the mafia pretty hard; girls perform deep blowjob and work well in pairs. Particularly energetic Alessia - she licks ass partner, and demonstrates not only anal, but A2M.\nBambolim and Francesco Malcom retire and indulge in amorous games. Bambolim very interesting, original does blowjob in a language. Special erotic scene gives a dialogue that leads Bambolim during sex.\nFrancesco forced to leave the village, and his beloved, because my parents sent him to the city to study. Bambolim inconsolable.\nWith her new boyfriend Francesco is sitting in a cafe, where comes Katsumi, performing roofing popular socialite. Katsumi - extremely elegant and bright Vietnamese girl with small breasts and big ass. Her precipitated photographers; She invites you to dance the first guy who turns out to Francesco. Dancing Katsumi and Francesco get on the cover of fashion magazines.\nKatsumi fun and buys for Francesco prostitute. In the role of a prostitute starred another Ukrainian, Alexandra Black - haired girl with a nice shapely, slightly vulgar person. Alexander quite artistic works in the bed scene, her long legs, round ass and beautiful full body.\nWhile Francesco fun with a prostitute, Katsumi fucks with old pimp who perfectly fulfilled Remigio Zampa. It should be noted that Remigio very large penis, but Katsumi fine with him and controlled with oral and anal with position, while demonstrating a great temperament and sexual greed.\nFrancesco and a friend comes to his village and finds out that Bambolim, distressed his picture in the tabloid magazine, ran away from home, went to Rome, and there is an obscene way of life. Francesco very upset; at the same time his brother, driven to despair bullying mafia leader Don Genero kills &quot;godfather&quot;. Inconsolable Francesco again leaving the city.\nMeanwhile, the mother of Bambolim, Venere Bianca, decided to find her daughter. She goes to the bandit Don Marino to get money for the trip.\nIt should be a sex scene Don Marino and Venus Bianchi. Venus elderly, but interesting performer with good slender body. She is very sensual, passionate and conducts its stage.\nArriving in Rome, Venus meets ex-girlfriend Bambolim, who tells her about the adventures of her daughter. Bambolim participated in a beauty contest, and then began to meet for money with wealthy men. One of these meetings is shown in a scene involving Bambolim, Vanessa and Sylvia Christian. All three performers - very bright and sexy women; they work well not only with a male partner, but also with each other, with the result that they do supererotichnoe action.\nOn the future of Bambolim girlfriend knows nothing.\nDistressed Venus meets with the bearded peasant, who soldered it and leads to the apartment where he and his friends - two men and Rita Faltoyano - arrange an orgy. Venus once again shows his nice body and a stormy temperament.\nRita Faltoyano - very technical performer; but it is more fattening, and it is clearly not enough sensuality, at least in this film.\nWhat follows is a series of plot episodes from which it is clear that Francesco married, returned to his native village, he has a child is born. Francesco's wife - actress Uma - walking on the side and meets with Don Marino. Last sex scene in the movie - &quot;tee&quot; Don Marino, Minds and gorgeous Michelle Wilde. Indeed, I can not imagine a very bright performer, but brunette Michelle - a real star and looks and temperament. Practically, she leads the whole episode, attracting attention for its beautiful slender body with large breasts and big sexual greed.\nAt the end we see Francesco and old-old nun, in which we learn Bambolim. This is the story of love and life of these two men.\nSummary: Mario Salieri except such strong and fair &quot;adult&quot; films no longer removes one. May God grant him health. &quot;\n\nPick another one from my entire collection:\n &lt;a href=&quot;\nhttps://thepiratebay.se/user/feeldabyte/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/feeldabyte/&lt;/a&gt;","torrent":{"xt":"urn:btih:47e4c2efdde8e0a26a1f1e56874b239f34d201a6","amp;dn":"Mario+Salieri+-+la+Dolce+Vita+XXX+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47e4c2efdde8e0a26a1f1e56874b239f34d201a6","infoHashBuffer":{"type":"Buffer","data":[71,228,194,239,221,232,224,162,106,31,30,86,135,75,35,159,52,210,1,166]},"announce":[],"urlList":[]}}