{"title":"Alfie Boe - Onward (2007)","uid":6386148,"size":82974270,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4802f1ad2d199ea54f7b8a072d506e25bb056ed5&amp;dn=Alfie+Boe+-+Onward+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"piratetorrent1989","files":-1,"time":1305205373,"description":"Alfred Giovanni Roncalli Boe, known professionally initially as Alf or Alfred Boe and now as Alfie Boe, (born September 29, 1973 in Blackpool, Lancashire) brought up in nearby Fleetwood, is an English tenor.\n\nBoe, the youngest in a family of 9 children, attended St Wulstan's and St Edmund's School and Cardinal Allen Roman Catholic High School in Fleetwood.[citation needed] His earliest musical memories were of listening to his father's Richard Tauber records and at the age of 11 he discovered Puccini's La bohÃƒÂ¨me for the first time.\n\nAt the age of 17, Boe became an apprentice mechanic at the TVR factory in Bispham, Blackpool. He enjoyed entertaining his colleagues by singing opera arias while he polished the cars, and one day was overheard by a client with connections in the music industry who was so impressed, he suggested Boe should go to London and audition for the D'Oyly Carte Opera Company. His audition was a success and he gave up polishing cars to embark on a singing career. Boe has never been able to trace the customer who suggested he go for the audition, having lost the man's business card.","torrent":{"xt":"urn:btih:4802f1ad2d199ea54f7b8a072d506e25bb056ed5","amp;dn":"Alfie+Boe+-+Onward+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4802f1ad2d199ea54f7b8a072d506e25bb056ed5","infoHashBuffer":{"type":"Buffer","data":[72,2,241,173,45,25,158,165,79,123,138,7,45,80,110,37,187,5,110,213]},"announce":[],"urlList":[]}}