{"title":"Robin Robertson's Vegan Without Borders (gnv64)","uid":11371318,"size":100298650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4813d21cff7267acefa4ce3f42dbe35d89f73a45&amp;dn=Robin+Robertson%27s+Vegan+Without+Borders+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"gnv65","files":-1,"time":1415088042,"description":"Robin Robertson's Vegan Without Borders - Easy Everyday Meals from Around the World\nby Robin Robertson\nAndrews McMeel Publishing | September 2014 | ISBN: 9781449460952 | ePUB | 95.2 mb\n\nVegan Without Borders shares Robin Robertson's favorite dishes from the great cuisines of the world and shows how cooking vegan makes borders disappear. Whether the recipe hails from Ecuador or Ethiopia, these plant-based dishes invite you to travel the culinary world and sample 150 of Robin's all-time favorites. This mini-immersion into global cooking also reveals that many international cuisines are naturally free of the meat-and-potatoes constraints of the typical Standard American Diet (SAD), and food-loving vegans will delight at the dishes Robin places on her table at home.\nThe recipes are healthy and accessible but without compromising on flavor. The pastiche of plant-based delights are organized by country or region of the world, making it easy to prepare a single recipe or to put courses together for a complete meal in a particular cuisine. The recipes include family-style comfort foods, global ethnic favorites, and creative new dishes inspired by the classics, all developed to satisfy a variety of mealtime desires. The result is a bounty of mouthwatering recipes that span the globe, representing the cooking traditions of more than twenty different countries of Europe, the Americas, Africa, the Middle East, India, and Asia. Recipes include:\n\nAbout the Author\nRobin Robertson has written more than twenty cookbooks, including the bestsellers Quick-Fix Vegan, Vegan Planet, Fresh from the Vegan Slow Cooker, and One-Dish Vegan. A longtime vegan and former restaurant chef, she writes the Global Vegan column for VegNews Magazine and has written for Vegetarian Times, Cooking Light, Natural Health, and other magazines. Robin lives in the Shenandoah Valley of Virginia with her husband Jon. Her website is www.robinrobertson.com. \n\nCONTENTS\nAcknowledgments\nIntroduction \nPART I A Vegan Kitchen Without Borders \nChapter 1: The Global Melting Pot \nChapter 2: A Global Vegan Kitchen \nChapter 3: A Pantry Without Borders \nPART II The Recipes \nChapter 4: Europe\n Italy\n France\n Spain and Portugal\n Greece\n Eastern Europe\n British Isles \nChapter 5: The Americas\n United States\n Mexico\n The Caribbean\n South America \nChapter 6: Africa \nChapter 7: The Middle East \nChapter 8: India \nChapter 9: Asia\n China\n Thailand\n Japan\n Korea\n Vietnam\n Southeast Asia Islands \nPART III Recipes by Category, Menus, Resources \nRecipes by Category: Gluten Free, Soy Free, Low Oil/No Oil, Quick and Easy \nMenus \nGlossary of Ingredients \nOnline Resources \nMetric Conversions and Equivalents\nIndex","torrent":{"xt":"urn:btih:4813d21cff7267acefa4ce3f42dbe35d89f73a45","amp;dn":"Robin+Robertson%27s+Vegan+Without+Borders+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4813d21cff7267acefa4ce3f42dbe35d89f73a45","infoHashBuffer":{"type":"Buffer","data":[72,19,210,28,255,114,103,172,239,164,206,63,66,219,227,93,137,247,58,69]},"announce":[],"urlList":[]}}