{"title":"T.G.British.Bake.Off-S07E03.-.Extra.Slice-S03E03--w.subs-540p","uid":15797385,"size":1095451584,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:48168bed3d4b952ee5c790b34c225f432c1adccd&amp;dn=T.G.British.Bake.Off-S07E03.-.Extra.Slice-S03E03--w.subs-540p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":6,"uploader":"uggauga","files":4,"time":1473469040,"description":"\nThe Great British Bake Off - S07E03\r\n&amp;\r\nThe Great British Bake Off: An Extra Slice - S03E03\r\n\r\nBBC (2016)\r\n  \nhttp://www.bbc.co.uk/programmes/b07r2pr0  \nhttp://www.bbc.co.uk/programmes/b07r1ff2\r\n\r\n_______________________________________\r\n\r\n960x540 resolution - MP4 files\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - Enjoy !!\r\n_______________________________________\r\n\r\nBread Week\r\nThe Great British Bake Off, Series 7 Episode 3 of 11\r\nIt is bread week, and Paul Hollywood has put together three of the toughest challenges ever. First up is the signature challenge - a sweet dough with a twist. And with Paul's digits primed for prodding, no dough is safe from scrutiny.\r\nThe bakers then face a steamy technical challenge without an oven, as Paul and Mary step out of the tent to leave the bakers with only a basic set of instructions and ingredients. For the perfect bake they have to avoid a burnt bottom and a soggy top.\r\nMel heads to Germany to discover how one brave baker and a few hundred dumplings saved his small town from the ravages of the Thirty Years' War.\r\nAnd there is a mighty final challenge which requires the use of three different flours to create a huge showstopper centrepiece.\r\n\r\nThe Great British Bake Off: An Extra Slice, Series 3 - Episode 3\r\nIt is week three in the Great British Bake Off tent. Host Jo Brand is joined in the An Extra Slice studio by three celebrity Bake Off fans who give their take on the remaining ten bakers and their bakes and look at exclusive footage from the BBC One show, plus interview the latest baker to leave the tent.\r\nIt is bread week, so Jo and her guests cast their eyes over the baked bread brought in by the studio audience, and look at viewer photos of their bakes from home, be they triumphs or heroic fails.\r\nWhat will Jo's panel make of this week's signature sweet dough and the steamy technical challenge, and whose showstopper of a centrepiece stood out?\r\nAn Extra Slice - when just one helping of Bake Off just isn't enough","torrent":{"xt":"urn:btih:48168bed3d4b952ee5c790b34c225f432c1adccd","amp;dn":"T.G.British.Bake.Off-S07E03.-.Extra.Slice-S03E03--w.subs-540p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48168bed3d4b952ee5c790b34c225f432c1adccd","infoHashBuffer":{"type":"Buffer","data":[72,22,139,237,61,75,149,46,229,199,144,179,76,34,95,67,44,26,220,205]},"announce":[],"urlList":[]}}