{"title":"Everyday Fashions of the 40s as Pictured in Sears Catalogs.pdf","uid":11810991,"size":22778757,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48a66065ba85398bf115d8cf5c43aa0e26eef7b1&amp;dn=Everyday+Fashions+of+the+40s+as+Pictured+in+Sears+Catalogs.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"STBGD","files":1,"time":1428785947,"description":"Everyday Fashions of the Forties as Pictured in Sears Catalogs\nDover Publications | 1992 | ISBN: 0486269183 | English | 132 pages | PDF | 21.7 MB\n\n\nFew publications illustrate so comprehensively what American men, women, and children wore in the 1940s than the Sears catalogs of those years, when the company's fashions typified the tastes of the American mainstream. This book is a compilation of 122 fully illustrated and captioned pages selected and reproduced from rare copies of Sears catalogs of the World War II era.\nOver 120 large-format pages have been carefully reprinted on high-quality glossy stock. They reveal in sharp detail the broad range of clothing fashions available during a period when wartime gasoline rationing made mail-order shopping reach new heights of popularity.\nHundreds of accurately detailed drawings depict articles of clothing and personal accessories, including hats, overcoats, shoes, dresses, sportswear, undergarments, neckties, and more. Styles for children range from play clothes to &quot;Sunday best.&quot; Men's clothing reflects the conservativism in male fashions during the period. Women's wear ranges from slacks, newly popular with women in the workforce, to dresses with plenty of &quot;Oomph.&quot;\nHere is a richly revealing document that historians of costume and readers interested in fashion, social history, and Americana will find endlessly fascinating. JoAnne Olian, curator of the Costume Collection at the Museum of the City of New York, has written an introduction that appraises the fashions of the 1940s and the many ways in which they reflected the times","torrent":{"xt":"urn:btih:48a66065ba85398bf115d8cf5c43aa0e26eef7b1","amp;dn":"Everyday+Fashions+of+the+40s+as+Pictured+in+Sears+Catalogs.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48a66065ba85398bf115d8cf5c43aa0e26eef7b1","infoHashBuffer":{"type":"Buffer","data":[72,166,96,101,186,133,57,139,241,21,216,207,92,67,170,14,38,238,247,177]},"announce":[],"urlList":[]}}