{"title":"JA Social II - Responsive Joomla 3 Social Template","uid":12240089,"size":89593587,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:48de849d6f45b4df4e8441f30223e18355705843&amp;dn=JA+Social+II+-+Responsive+Joomla+3+Social+Template&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":null,"files":1,"time":1439756805,"description":"JA Social II is all new responsive Joomla template to build a social network for your community. Social II derives its name from JA Social, one of our best Joomla social templates for years. Social II is designed to help you create your own social network with Joomla.\n\nSupport both of the best Joomla extensions for social networks JomSocial, EasySocial, and Community Builder. JA Social II is the ultimate ingredient for a successful community project. You can build a full-fledged social media site with both style and functionality.\n\nMoreover, JA Social II is not only a social media Joomla template but also a multipurpose responsive Joomla template. The template's custom styles and layouts allow you to create a beautiful layout with the power of JoomlArt Advanced Custom Modules extension. JA Social II also features Joomla CCK component - K2.\n\nWith T3 Framework and Bootstrap 3 at core, JA Social II is friendly and easy to customize. You can freely design the responsive Joomla template with MagicTheme, and Layout Configuration","torrent":{"xt":"urn:btih:48de849d6f45b4df4e8441f30223e18355705843","amp;dn":"JA+Social+II+-+Responsive+Joomla+3+Social+Template","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48de849d6f45b4df4e8441f30223e18355705843","infoHashBuffer":{"type":"Buffer","data":[72,222,132,157,111,69,180,223,78,132,65,243,2,35,225,131,85,112,88,67]},"announce":[],"urlList":[]}}