{"title":"Knitting Classic Style: 35 Modern Designs Inspired by Fashion's ","uid":10586033,"size":37196406,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:492ff3206cd4d8fcc6df9250f9b39907c7d296b8&amp;dn=Knitting+Classic+Style%3A+35+Modern+Designs+Inspired+by+Fashion%27s+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"KnitLady","files":-1,"time":1405743978,"description":"Classic projects that will maintain their appeal for many years instead of just one or two fashion seasons Elegant yet retro-cool projectsIn fashion, one day you're in, the next day you're out . . . and the day after that, you're back in again. Designers are always referring to fashion's rich history as they imagine its present and future, and retro looks remain ever-fresh as they are renewed?and restyled?for the next generation of wearers.That's precisely what top knitwear designer Vï¿½ronik Avery is up to in Knitting Classic Style. Mining fashion's endless archive, Avery has created 35 smashingly contemporary garments that take their cues from decades and designers past. The collection of clothing and accessories Avery presents is organized into four thematic chapters that highlight women's wear, men's wear (and its influence on women's and children's clothing), traditional ethnic garb, and sportswear. Aimed at both beginning and more advanced knitters, the book's projects range in difficulty from a simple drawstring purse, French beret, and Afghan-inspired slipper-socks to a shawl-collared cardigan, a geometric ski sweater based on a popular 1950s Native American design, and Avery's own reinterpretation of the trimly elegant Chanel jacket. The author introduces each project by explaining its historical/cultural roots; Sara Cameron's moody photos evoke the settings that have inspired Avery's reworkings of the classics.","torrent":{"xt":"urn:btih:492ff3206cd4d8fcc6df9250f9b39907c7d296b8","amp;dn":"Knitting+Classic+Style%3A+35+Modern+Designs+Inspired+by+Fashion%27s+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"492ff3206cd4d8fcc6df9250f9b39907c7d296b8","infoHashBuffer":{"type":"Buffer","data":[73,47,243,32,108,212,216,252,198,223,146,80,249,179,153,7,199,210,150,184]},"announce":[],"urlList":[]}}