{"title":"Het.Meisje.met.het.Rode.Haar.1981.Dvd5.Hollands.Glorie","uid":10518049,"size":4386863476,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:499c7e4761b57ba4c6d2f4252e5e6bc52a3ebdb0&amp;dn=Het.Meisje.met.het.Rode.Haar.1981.Dvd5.Hollands.Glorie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"hendriknld","files":32,"time":1404931333,"description":"Het meisje met het rode haar is een Nederlandse film uit 1981 onder regie van Ben Verbong. De film is gebaseerd op het gelijknamige boek van Theun de Vries over Hannie Schaft. De film werd positief ontvangen. Hij wordt erkend als een publieksfilm en als 'artistiek verantwoord'.\n________________________________________\nAmsterdam tijdens de Tweede Wereldoorlog. Hannie Schaft is een rechtenstudente die vlak voor haar doctoraalexamen stopt met haar studie om zich aan te sluiten bij een verzetsgroep. Wegens haar gebrek aan ervaring als meedogenloze moordenaar krijgt ze geen warm onthaal. Ze heeft de meeste mensen tegen zich als ze voor haar toelatingsproef niet het lef heeft iemand dood te schieten. Ze wil haar vriendin Judith helpen aan een schuilplaats en steelt zelfs een persoonsbewijs voor haar. Ze is echter al gearresteerd voordat ze haar dit kan geven.\nHannie begint met het verrichten van koerierswerk. Als er op een dag een jongen voor haar gezicht wordt doodgeschoten, is dit een keerpunt in haar leven. Ze wil betrokken zijn bij aanslagen en wordt onder de hoede genomen door Hugo. Al na een korte tijd krijgt ze de opdracht een collaborateur dood te schieten. Nadat ze dit heeft gedaan, vertelt ze aan Hugo dat ze er niets bij voelde, niet nerveus was en geen idee meer zou hebben hoe haar slachtoffer eruit zag. Als blijkt dat er willekeurig burgers zijn vermoord door de dood van die man, voelt ze zich schuldig.\nOndertussen bloeit er een liefdesrelatie op tussen Hannie en Hugo. Ze krijgt opdracht een moeder dood te schieten, maar acht zichzelf hiertoe niet in staat. De volgende dag besluit ze toch een poging tot moord te doen. Nadat ze op haar heeft geschoten rijdt ze weg, maar hierna begint ze te twijfelen of ze haar geraakt heeft. De vrouw heeft het echter overleefd en als de verzetsstrijders dit te horen krijgen, besluiten Hannie en Hugo onder te duiken. Ze besluiten hun werk niet stil te leggen en al gauw richten ze zich op de moord van een Duitser.\nAls Hannie haar trekker overhaalt, blijkt haar pistool niet geladen te zijn. De Duitser gaat onmiddellijk in verdediging. Hannie fietst snel door en Hugo blijft achter om met de Duitser af te rekenen. Een vuurgevecht volgt, waarbij Hugo hem neerschiet. Hij houdt er wel ernstige verwondingen aan over en overlijdt niet veel later in het ziekenhuis. Met zijn laatste woorden vraagt hij de dokter de foto in zijn jas te verbergen voor de Duitsers. De dokter blijkt een NSB'er te zijn, Otto Schaaf. Na Hugo's overlijden treft hij in zijn jas een foto van Hannie. Onmiddellijk wordt er een nationale jacht naar 'het meisje met het rode haar' gestart.\nHannie overweegt zichzelf over te geven, omdat haar ouders zijn opgepakt. Mede-verzetsstrijder An raadt dit haar af en helpt haar met een vermomming. Haar lokken worden donker geverfd en ze gaat voortaan door het leven met een bril. Ze barst van de wrokgevoelens en breekt bij Otto in om hem uiteindelijk neer te schieten. Haar collega's raden haar af door te gaan met het vermoorden van collaborateurs, omdat de oorlog volgens hen al bijna afgelopen is. Ze is echter vastberaden haar werk voort te zetten en legt uit dat ze niets te verliezen heeft.\nBij een routine-controle vinden de Duitsers illegale bladen en een pistool bij Hannie. Ze wordt naar de gevangenis gestuurd en weigert te vertellen wie ze werkelijk is. Een bewaakster vermoedt dat ze kleurspoeling heeft en als dit waarheid blijkt te zijn, worden de vermoedens dat ze een terroriste is groter. Uiteindelijk geeft ze toe 'het meisje met het rode haar' te zijn. Ze wordt meegenomen naar de duinen en daar wordt ze gefusilleerd en begraven. Slechts enkele weken later wordt Nederland bevrijd van de Duitsers.\n","torrent":{"xt":"urn:btih:499c7e4761b57ba4c6d2f4252e5e6bc52a3ebdb0","amp;dn":"Het.Meisje.met.het.Rode.Haar.1981.Dvd5.Hollands.Glorie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"499c7e4761b57ba4c6d2f4252e5e6bc52a3ebdb0","infoHashBuffer":{"type":"Buffer","data":[73,156,126,71,97,181,123,164,198,210,244,37,46,94,107,197,42,62,189,176]},"announce":[],"urlList":[]}}