{"title":"Heart's Ease (The Northwomen Sagas 2) by Susan Fanetti [WWRG]","uid":16042419,"size":449936,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ade6d8a218d9317ae2fce079d86c23a00f3bd96&amp;dn=Heart%27s+Ease+%28The+Northwomen+Sagas+2%29+by+Susan+Fanetti+%5BWWRG%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Lion.King","files":3,"time":1476525324,"description":"[center]\r\n\r\n[img]https://extraimago.com/images/2016/07/31/WWRG-Globe-2.png[/img]\r\n\r\n\r\n\r\n[b][color=red]Heart’s ease is the second installment in The Northwomen Sagas, following God’s Eye.\r\n\r\nWhen raiders from the North land in Olga’s world and take it over, she is captured and made a slave. She and her people suffer at the hands of creatures that seem more beasts than men, and not even her talent and skill as a healer can help them.\r\n\r\nBut one barbarian, big and golden, seems different from the others. He doesn’t revel or partake in the suffering of the new slaves, and, when he learns that Olga is a healer who knows some of their words, he releases her from her bonds.\r\n\r\nThe raiders stake claim to Olga’s world and mean to settle it, and she and the rest of her people who survived make a new community with the invaders. The barbarians who destroyed her world and made her a slave grow to be her friends and her equals.\r\n\r\nThe friendship she forms with the one who cut her bonds is the deepest of them all.\r\n\r\nLeif is a valiant and esteemed warrior who’s raided for many summers. As a leader in this new world they mean to settle, he forges deep, close ties with those who’d been only allies, and sometimes enemies, and with the native people of this new land.\r\n\r\nIn particular, he’s drawn to the dark-haired healer, whose tiny body holds the will and spirit of a mighty raider.\r\n\r\nLeif is deeply loyal to the jarl who’s treated him as a son. When the jarl arrives to view their success, Leif struggles to understand the ways his mentor has grown cruel and deceitful and to see the man he’s loved as a father, whose sons he loves as brothers. But he recognizes the brutal lies for what they are.\r\n\r\nTorn between the man to whom he’d long ago sworn his unconditional fealty and the friends to whom he is devoted, Leif makes a devastating choice, trying as best he can to save those he loves, at any cost to himself. Even at the cost of their love for him.\r\n\r\nThe consequences of his choice are severe. Perhaps too severe to allow forgiveness.\r\n\r\nBut until there is forgiveness, there can never be ease.\r\n\r\nNote: explicit sex and violence.[/color][/b]\r\n\r\n\r\n[img]https://cdn.pximg.xyz/3a3bd98915b15dd12d0a14730cfc7128.gif[/img]\r\n[/center]","torrent":{"xt":"urn:btih:4ade6d8a218d9317ae2fce079d86c23a00f3bd96","amp;dn":"Heart%27s+Ease+%28The+Northwomen+Sagas+2%29+by+Susan+Fanetti+%5BWWRG%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ade6d8a218d9317ae2fce079d86c23a00f3bd96","infoHashBuffer":{"type":"Buffer","data":[74,222,109,138,33,141,147,23,174,47,206,7,157,134,194,58,0,243,189,150]},"announce":[],"urlList":[]}}