{"title":"What is Mathematics - An Elementary Approach To Ideas","uid":12743068,"size":6783833,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4aec93f813dd1b08ac0e8fb13e7574d01943590b&amp;dn=What+is+Mathematics+-+An+Elementary+Approach+To+Ideas&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"erapid","files":1,"time":1447265933,"description":"What is Mathematics - An Elementary Approach To Ideas And Methods\r\n \nhttp://i.imgur.com/WgltDAZ.png\r\n\r\nFor more than two thousand years a familiarity with mathematics has been regarded as an indispensable part of the intellectual equipment of every cultured person. Today, unfortunately, the traditional place of mathematics in education is in grave danger. The teaching and learning of mathematics has degenerated into the realm of rote memorization, the outcome of which leads to satisfactory formal ability but does not lead to real understanding or to greater intellectual independence. This new edition of Richard Courant's and Herbert Robbins's classic work seeks to address this problem. Its goal is to put the meaning back into mathematics. Written for beginners and scholars, for students and teachers, for philosophers and engineers, What is Mathematics?, Second Edition is a sparkling collection of mathematical gems that offers an entertaining and accessible portrait of the mathematical world. Covering everything from natural numbers and the number system to geometrical constructions and projective geometry, from topology and calculus to matters of principle and the Continuum Hypothesis, this fascinating survey allows readers to delve into mathematics as an organic whole rather than an empty drill in problem solving","torrent":{"xt":"urn:btih:4aec93f813dd1b08ac0e8fb13e7574d01943590b","amp;dn":"What+is+Mathematics+-+An+Elementary+Approach+To+Ideas","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aec93f813dd1b08ac0e8fb13e7574d01943590b","infoHashBuffer":{"type":"Buffer","data":[74,236,147,248,19,221,27,8,172,14,143,177,62,117,116,208,25,67,89,11]},"announce":[],"urlList":[]}}