{"title":"ArcSoft PhotoImpression Gold v6.5.9.110","uid":5571463,"size":66621089,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4b04cd5db2f23852c730b3c9d3ec6a943b950edd&amp;dn=ArcSoft+PhotoImpression+Gold+v6.5.9.110&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"gencraft","files":1,"time":1274263426,"description":"ArcSoft PhotoImpression is a perfect imaging software application for novice and skilled users alike. This comprehensive photo editor is packed with new and improved tools for enhancing, printing and getting creative with your favorite digital snapshots.\n\n\nFeatures:\n\nNice-n-Easy\nWhether you're new to digital imaging or you're a skilled enthusiast looking for an easier way of doing things, you'll love this amazing new software. Big button controls, auto-enhance capabilities, project wizards, and the customizable workspace are just some of the reasons why you'll be sold on PhotoImpression.\n\nFix'em Up Right\nIn addition to the customary editing tools such as brightness, contrast, crop, resize, and sharpen, PhotoImpression features a bunch of editing-extras including color tone, auto-enhance, and one-click redeye removal. Your pictures never had it so good.\n\nCreativity Included\nPhotoImpression comes packed with loads of creative tools and content for you to use on your photos. With a single click, apply artistic frames, borders, edges and special effects. Customize your photos and projects with humorous bits of clip art, including thought balloons and objects for every occasion (100s included).\n\nNow You're Talkin'!\nA picture may be worth a thousand words, but sometimes that just ain't enough. PhotoImpression includes a powerful text editor for adding custom greetings, captions and titles to your photos. You control the font, size, style, and color. Apply drop shadows, texture and color gradients to make your message really pop off the picture.\n\nCustom Photo Projects\nDesign and print your own personalized photo-calendars in seconds. Design and print unique photobooks complete with custom backgrounds, frames, and clip art. Hang them on your fridge, in your office or give them as gifts.\n\nSharp Prints\nGetting great quality prints has never been so easy. Whether you want multiple photos per page or a single image on each sheet, PhotoImpression includes all the controls you need to arrange, orient and size your photos for optimal print quality.\n\nEmail-Friendly\nTired of receiving email attachments way too big for your inbox? Your friends and family probably don't like it either. PhotoImpression makes emailing pictures as pain-free as ever. The program includes tools for optimizing your photos for email\n","torrent":{"xt":"urn:btih:4b04cd5db2f23852c730b3c9d3ec6a943b950edd","amp;dn":"ArcSoft+PhotoImpression+Gold+v6.5.9.110","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b04cd5db2f23852c730b3c9d3ec6a943b950edd","infoHashBuffer":{"type":"Buffer","data":[75,4,205,93,178,242,56,82,199,48,179,201,211,236,106,148,59,149,14,221]},"announce":[],"urlList":[]}}