{"title":"Barbie as Rapunzel  Dvd rip to avi","uid":4246248,"size":654065678,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4b7047ebb892c18df64f4c752bc157d989523e07&amp;dn=Barbie+as+Rapunzel++Dvd+rip+to+avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"snoodle","files":1,"time":1213802276,"description":"The worst thing about this video is its cover, which looks stiff, commercial and artificial. What&amp;#039;s inside, however, is a very well done original take on a little-dramatized but familiar fairy tale that entertains without overdoing or offending and has an extremely positive subtext. You can tell it&amp;#039;s got its heart in the right place, when at the very beginning in an introductory sequence Barbie, at an easel, encourages her little sister to paint what she wants and express herself rather than telling her what to do. Rapunzel, not immature in this version of the story, though sheltered, also paints when she can to pass the time between chores, and unlike Disney&amp;#039;s Little Mermaid, doesn&amp;#039;t feel the need to forego developing her talent and creativity to chase handsome princes. She discovers and explores her world while always trying, though not usually successfully, to keep peace with her unreasonably demanding and jealous stepmother, whose voice is effectively performed by Angelica Huston, and with feuding royalty in two neighboring kingdoms. The impossible-to-dramatize plot elements of the original fairy tale have been replaced by effective new characters and story ideas, which keep the presentation from being all decoration without substance, and though Rapunzel&amp;#039;s baby dragon friend may be somewhat distractingly big and purple, her own sub-plot does work into the main story well and add interest when we are introduced to her grown up dragon father, the guardian of the tower. Choices made in good taste are all over this DVD, which is refreshingly free of Disney-style smartass humor and sell-out scripting. The original music is nice and very underplayed--Barbie could easily have been made to burst into song at any time here, but wisely the producers just let the perfectly decent story stand on its own instead of trying to make it into a Broadway musical. The whole package here is pretty, original, pleasantly presented, and encourages self-expression without pandering or being heavy handed about its message at all. From start to finish it is refreshing, interesting and positive. Only the packaging is corny, but even the doll it cross-promotes is as pleasant-looking as the movie. ","torrent":{"xt":"urn:btih:4b7047ebb892c18df64f4c752bc157d989523e07","amp;dn":"Barbie+as+Rapunzel++Dvd+rip+to+avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b7047ebb892c18df64f4c752bc157d989523e07","infoHashBuffer":{"type":"Buffer","data":[75,112,71,235,184,146,193,141,246,79,76,117,43,193,87,217,137,82,62,7]},"announce":[],"urlList":[]}}