{"title":"NHSOS 2.2011.Greek movie.","uid":7230058,"size":1492565315,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4be6eb3874fa5ea36abf60cfc868b38c140b08e8&amp;dn=NHSOS+2.2011.Greek+movie.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"marios1975","files":2,"time":1335804707,"description":"NHSOS 2: THE HUNTING OF THE LOST TREASURE\n\nAnthony Angelopoulos\nwith Vladimir Kyriakidis, Michael Marino, D. Tzoumaki, Ulysses Papaspiliopoulos\n\nCase:\nIn December 2009 an entire island to the forefront the four &quot;powers&quot; came at loggerheads for a will. The upshot? Some of the heroes were led to prison, some stayed on the island and took some of the eyelets. And this brings us to today ... supposedly five years later! Babis (Vladimir Kyriakides), Ages (Dimitris Tzoumakis) and Venus (Zeta Duke) are serving their sentences. The first soon released from jail suspended, the second in front of many years, while the widow normally released from jail. At the same time, the priest Lambros (Michael Marino) has not flock anymore. Serving a different kind of punishment, as the Holy Metropolis of penance imposed by the &quot;volunteer&quot; to prisoners. Fate brings them so that just two days before the release, bamboo and Venus are accidentally witnessing a dying confession to the priest Lambros long-term convict. They learn about the existence of a great treasure on the island by the Turkish occupation, whose position is marked on a map divided into two pieces. The dying priest gives Lambros half the map, but before he could reveal the name of the holder of the remaining paper, the &quot;do&quot; for the Elysian fields! Babis and taking the opportunity Lambros blackmails the priest, to become the partner. Agis was learning about the treasure organize his escape. Venus, the story involves the interaction of Eva (Daphne Lamprogianni) and Otto (Nikos Georgakis), a German who is not in any case, the quiet man shows. Without knowing the while for others, will all descend on the island, where he will start a merciless &quot;Treasure Hunt&quot;. In the chaos that will follow will involve all the old familiar, including the ghost of ... Olympia (Helen chestnuts).","torrent":{"xt":"urn:btih:4be6eb3874fa5ea36abf60cfc868b38c140b08e8","amp;dn":"NHSOS+2.2011.Greek+movie.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4be6eb3874fa5ea36abf60cfc868b38c140b08e8","infoHashBuffer":{"type":"Buffer","data":[75,230,235,56,116,250,94,163,106,191,96,207,200,104,179,140,20,11,8,232]},"announce":[],"urlList":[]}}