{"title":"Wonders of The Solar System [720p][Bluray]","uid":12587080,"size":7845708169,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:4c3b5be83bafc7913cfb1e37090aed45a76f674a&amp;dn=Wonders+of+The+Solar+System+%5B720p%5D%5BBluray%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"redback9","files":5,"time":1445039421,"description":"Thanks to tlacatlc6 for providing and ripping the Bluray.\r\n\r\nIn this spellbinding series Professor Brian Cox visits the most extreme locations on Earth to explain how the laws of physics carved natural wonders across the solar system.\r\n\r\nEmpire of the Sun S1, Ep1\r\nProfessor Brian Cox explores the powerhouse of them all, the sun. In India he witnesses a total solar eclipse and in Norway, he watches the battle between the sun's wind and Earth, as the night sky glows with the northern lights. Beyond earth, the solar wind continues, creating dazzling aurora on other planets.\r\n \r\nOrder Out of Chaos S1, Ep2\r\nDiscover how beauty and order in Earth's cosmic backyard was formed from nothing more than a chaotic cloud of gas. Chasing tornados in Oklahoma, Professor Brian Cox explains how the same physics that creates these spinning storms shaped the young solar system. Out of this celestial maelstrom emerged the jewel in the crown, Brian's second wonder - the magnificent rings of Saturn.\r\n \r\nThe Thin Blue Line S1, Ep3\r\nProfessor Brian Cox takes a flight to the top of earth's atmosphere, where he sees the darkness of space above and the thin blue line of our atmosphere below. Against the stunning backdrop of the glaciers of Alaska, Brian reveals his fourth wonder: Saturn's moon Titan, shrouded by a murky, thick atmosphere.\r\n \r\nDead or Alive S1, Ep4\r\nThe worlds that surround our planet are all made of rock, but there the similarity ends. Some have a beating geological heart, others are frozen in time. Professor Brian Cox travels to the tallest mountain on Earth, the volcano Mauna Kea on Hawaii, to show how something as basic as a planet's size can make the difference between life and death.\r\n \r\nAliens S1, Ep5\r\nAll life on Earth needs water so the search for aliens in the solar system has followed the search for water. We examine the patterns in the ice on Jupiter's moon Europa, which reveal an ocean far below with more potentially life-giving water than all the oceans on Earth. But of all the wonders of the solar system forged by the laws of nature, Brian reveals the greatest wonder of them all","torrent":{"xt":"urn:btih:4c3b5be83bafc7913cfb1e37090aed45a76f674a","amp;dn":"Wonders+of+The+Solar+System+%5B720p%5D%5BBluray%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c3b5be83bafc7913cfb1e37090aed45a76f674a","infoHashBuffer":{"type":"Buffer","data":[76,59,91,232,59,175,199,145,60,251,30,55,9,10,237,69,167,111,103,74]},"announce":[],"urlList":[]}}