{"title":"Life's Little Instruction Book - Jackson Brown","uid":5474040,"size":213020,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4c4f2c03c19f15d850db5cad965b97a19c56600c&amp;dn=Life%5C%27s+Little+Instruction+Book+-+Jackson+Brown&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"gkalai12","files":1,"time":1270041246,"description":"Life's Little Instruction Books\n Jackson Brown originally wrote Life's Little Instruction book as a gift for his son who was leaving home to begin his freshman year in college. Brown says, &quot;I read years ago that it was not the responsibility of parents to pave the road for their children but to provide a road map, and I wanted to provide him with what I had learned about living a happy and rewarding life.&quot; Life's Little Instruction Book is a guidebook that gently points the way to happiness and fulfillment. The observations are direct, simple, and as practical as an umbrella.\n\n&quot;Most of us already know how to live a successful and purposeful life,&quot; says Brown. &quot;We know we should be more understanding and thoughtful, more responsible, courageous and appreciative. It's just that we sometimes need reminding.&quot; Life's Little Instruction Book is that reminder and the perfect gift for students, relatives, or a friend who needs encouragement at any time of the year. A New York Times #1 bestseller for 50 weeks, it is translated into 33 languages and continues to inspire readers throughout the world. This title is available in three separate volumes or in one book collection, The Complete Life's Little Instruction Book.\n \n\nSample Entries\n\n1. Never give up on anybody. Miracles happen every day.\n\n2. Be brave. Even if you're not, pretend to be. No one can tell the difference.\n\n3. Think big thoughts, but relish small pleasures.\n\n4. Overtip breakfast waitresses.\n\n5. Never deprive someone of hope; it might be all they have.\n\n6. Never resist a generous impulse.\n\n7. Become the most positive and enthusiastic person you know.\n\n8. Never go to bed with dirty dishes in the sink.\n\n9. Leave everything a little better than you found it.\n\n10. Call your mother. \n\nReader's Comment\n\n    I didn't often write to authors of books, but when I read the introduction of Life's Little Instruction Book it was time the tradition was broken. Thank you for caring enough about your son to write this book. My father and mother were divorced when I was very young. I could see in my friends, in my teenage years, a maturity that I didn't have. I could tell it was from their fathers when they were together, because in lots of ways they acted the same. My father was never close to me in any sense of the word, even geographically. I could not even tell you if I loved the man because I never knew who he was, only what he had become. When I look at your book, it helps fill that void that I've been lacking. I'm in my mid-thirties now. I have worked on multi-million dollar projects, studied at great universities, and somehow your book is better than what I have studied. It truly is how to live a better life. Thank you for giving me a father's advice that I never got.\n\n","torrent":{"xt":"urn:btih:4c4f2c03c19f15d850db5cad965b97a19c56600c","amp;dn":"Life%5C%27s+Little+Instruction+Book+-+Jackson+Brown","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c4f2c03c19f15d850db5cad965b97a19c56600c","infoHashBuffer":{"type":"Buffer","data":[76,79,44,3,193,159,21,216,80,219,92,173,150,91,151,161,156,86,96,12]},"announce":[],"urlList":[]}}