{"title":"America's Next Top Model Cycle 21 Episode 3 S21E03 (The Girl Who","uid":11015148,"size":423235195,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:4c7c2624be99a3f6ff16fee93aa5753b412ab515&amp;dn=America%27s+Next+Top+Model+Cycle+21+Episode+3+S21E03+%28The+Girl+Who&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"magisterjieko","files":1,"time":1410460005,"description":"The Girl Who's a Player\nOriginal Airdate: September 1, 2014\n\nThe episode picks up from the moment where the contestants find out about the silly string fashion show announced the previous episode, which is revealed to be the first challenge. Ms. J. Alexander critiques everyone's walks before the challenge. Before the show starts the models are introduced to the director of NEXT models, Alexis Borges. Alexis Borges will determine the winner of the runway show challenge. Will is nervous about the challenge due to his insecurities about his body, while Adam is overconfident.\n\nAfter the challenge concludes, Alexis points out Adam and Ivy as having been the worst, with Alexis saying he would never book Ivy. He also comments that Adam may not be taking the competition seriously. On the plus side, Chantelle and Keith are singled out as having been the best in the show. Keith is chosen as the challenge winner, and is allowed to stay in the Tyra Suite with any contestant of his choosing until the elimination ceremony. To nobody's surprise, he chooses Kari. Back at home, Ivy and Adam find their names last on the leader board, with a challenge score of 6. Kari and Keith sleep in the same bed, while Matthew and Mirjana do the same. However, Matthew soon finds out that Mirjana has a boyfriend back home, much to his disappointment.\n\nThe next day the models meet Tyra and Yu Tsai for the first photo shoot, where they will be splashed with buckets of water. It is explained that the shoot will consist of two parts: the first is filming for the season's opening titles, and the second is taking still photos that will be used for scoring. After Tyra films her parts, the models take their turns. Will ultimately struggles with his insecurities about his body once again, while Mirjana is chastised for looking too sexy. Raelia has flashbacks of her almost drowning in the past, and Ivy has trouble coping with the cold temperatures of the water. Keith, Romeo, Kari, and Lenox receive praise during their session.\n\nAs the contestants arrive back home, they find elimination mail. Adam begins to drink. Once he is inebriated, Mirjana suggests that he stop, which leads to tensions between Adam and Mirjana. Matthew, still feeling hurt about Mirjana having a boyfriend, defends Adam, much to Mirjana's surprise.\n\nDuring panel, Keith, Mirjana and Lenox receive positive feedback, while most of the other contestants receive mixed feedback. Denzel is told that his body might be too muscular for fashion. Adam receives positive feedback, but is again reprimanded for not taking the competition seriously. Will produces a great photo, despite struggling at the shoot. Keith receives first call out, and receives keys to the Tyra Suite again. Ivy and Will are given the worst scores for their photographs, and land in the bottom two together during elimination. Will manages to remain in the competition with a score of 33.1. Once she is eliminated, Ivy is reminded that the comeback competition is still in place, and that she still has an opportunity to return.","torrent":{"xt":"urn:btih:4c7c2624be99a3f6ff16fee93aa5753b412ab515","amp;dn":"America%27s+Next+Top+Model+Cycle+21+Episode+3+S21E03+%28The+Girl+Who","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c7c2624be99a3f6ff16fee93aa5753b412ab515","infoHashBuffer":{"type":"Buffer","data":[76,124,38,36,190,153,163,246,255,22,254,233,58,165,117,59,65,42,181,21]},"announce":[],"urlList":[]}}