{"title":"On The Trail Of The Nephilim - L. A. Marzulli","uid":11724085,"size":6477452,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4cc3ca69d085472a6d15a14c51fa169835398618&amp;dn=On+The+Trail+Of+The+Nephilim+-+L.+A.+Marzulli&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"starxteel","files":1,"time":1424987140,"description":"L.A. Marzulli has written this latest book. What you are about to read is not the stuff of science fiction. It's not a fantastic fable or the musings of an overzealous archaeologist. It's straight out of the pages of the Bible. The 120+ pictures displayed within this volume have not been altered in any way. What you are about to see is truly ground-breaking revelation--an unparalleled discovery that may leave you in stunned silence. This books is the culmination of a lengthy search for the physical evidence of the Nephilim, the Giants of Old Testament lore. A significant cover-up has taken place over the years, reducing these double digit, gigantic hybrids to the dustbins of history. But make no mistake about it-they were there. Hundreds of excavated graves scattered throughout the would provide evidence of their genetic abomination-the product of the breeding of heavenly angels with the women of Earth during the days of Noah. These ancient builders left behind evidence of their supernatural strength and technological know-how. Their massive, megalithic structures are legendary and evidence of Nephilim architecture abounds worldwide. Marzulli and a team of scientist, archaeologists and scholars traveled to the jungles of a foreign land, perhaps the only place where they could gain access to the unspoiled evidence of this genetic manipulation- PERU-toppling perhaps the greatest cover-up in mankind's bizarre history. \n\n\nAbout the author:\n  L. A. Marzulli is an author, lecturer and film maker.  He has penned eight books including The Nephilim Trilogy which made the CBA best sellers list.  He received an honorary doctorate for the series from his mentor Dr. I. D. E. Thomas, who was the Provost at Pacific International University.   His new series On the Trail of the Nephilim is a full color, over-sized book which uncovers startling evidence that there has been a massive cover up of what he believes are the remains of the Nephilim, the giants mentioned in the Bible!  He is now working on Volume II, in the series which promises to have even more incredible and revealing photographs and interviews!  L. A. is On the Trail!","torrent":{"xt":"urn:btih:4cc3ca69d085472a6d15a14c51fa169835398618","amp;dn":"On+The+Trail+Of+The+Nephilim+-+L.+A.+Marzulli","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cc3ca69d085472a6d15a14c51fa169835398618","infoHashBuffer":{"type":"Buffer","data":[76,195,202,105,208,133,71,42,109,21,161,76,81,250,22,152,53,57,134,24]},"announce":[],"urlList":[]}}