{"title":"Masterminds - CourtTV TruTV Crime - Complete TV Series","uid":9991539,"size":9979410512,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4d2c20ea456cef8219e9f53052ee024399bae5c6&amp;dn=Masterminds+-+CourtTV+TruTV+Crime+-+Complete+TV+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"MaxiDownloads","files":-1,"time":1397854988,"description":"Masterminds CourtTV or TruTV Crime Documentary Television Series - All 61 Episodes\n\nThis is a complete collection of episodes for the television show Masterminds. All episodes are included as listed on Wikipedia's page on &quot;Masterminds (Canadian TV Series),&quot; numbered in exactly the same way in this torrent as they are numbered on Wikipedia. I got rid of the season numbers because they vary from site to site and torrent to torrent, often containing errors, duplicates, or omissions.\n\nI used a combination of the existing torrents on The Pirate Bay to create this collection. To test for file quality, I opened each file in a player, skipped forward and backwards several times all over the file, and took note when a file did not play smoothly. I then replaced these files with files from another torrent and tested again to verify that it could skip and play smoothly and completely. I compared my list of bad files with the comments on the other torrents, and they corroborated: I ensured these were replaced! A small number of episodes appeared to have a slightly lower quality than the others, possibly rips from YouTube or small video files made bigger.\n\nHowever, the main point of this torrent is that ALL episodes are included, and they have ALL have been through basic checks of playback quality. Because I did not watch every second of every episode on every player on every operating system, there may be a few lurking problems I did not detect. Please note any problematic files (and the playback-time the problem occurred) in the comments below. Such notes will help me in the future rebuild a new torrent with any problems fixed. However, I make no guarantee of when or if I can make a new torrent. Of course, if this works flawlessly, please note that too!\n\nMasterminds torrents are notorious for having faulty files and poor playback. Let's make this a thing of the past, so all of our fans can enjoy this wonderful show!\n\n--- ALSO ---\n\nDo you like oldies? Check out MaxiMusic! MaxiMusic is a collection of popular and rare oldies from the 1910-2000's. Either search &quot;MaxiMusic&quot; on The Pirate Bay, or head over to this link:\n   &lt;a href=&quot;\nhttp://thepiratebay.se/user/MaxiMusic/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/MaxiMusic/&lt;/a&gt;\t\n","torrent":{"xt":"urn:btih:4d2c20ea456cef8219e9f53052ee024399bae5c6","amp;dn":"Masterminds+-+CourtTV+TruTV+Crime+-+Complete+TV+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d2c20ea456cef8219e9f53052ee024399bae5c6","infoHashBuffer":{"type":"Buffer","data":[77,44,32,234,69,108,239,130,25,233,245,48,82,238,2,67,153,186,229,198]},"announce":[],"urlList":[]}}