{"title":"The Command: Deep Inside the President's Secret Army","uid":9409215,"size":140201,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d5c0dc407f72ef583e338fc4e4c526830c30f4b&amp;dn=The+Command%3A+Deep+Inside+the+President%27s+Secret+Army&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1388239913,"description":"The Command: Deep Inside the President's Secret Army\nby Marc Ambinder, D. B. Grady,\n\nDESCRIPTION:\n\nThe U.S. Joint Special Operations Command (JSOC) has proven to be the most lethal weapon in the president's arsenal. Shrouded in secrecy, the Command has done more to degrade the capacity of terrorists to attack the United States than any other single entity. And counter-terrorism is only one of its many missions. Because of such high profile missions as Operation Neptune's Spear, which resulted in the death of Osama bin Laden, JSOC has attracted the public's attention. But Americans only know a fraction of the real story.\n\nIn The Command, Ambinder and Grady provide readers with a concise and comprehensive recent history of the special missions units that comprise the most effective weapon against terrorism ever conceived. For the first time, they reveal JSOC's organizational chart and describe some of the secret technologies and methods that catalyze their intelligence and kinetic activities. They describe how JSOC migrated to the center of U.S. military operations, and how they fused intelligence and operations in such a way that proved crucial to beating back the Iraq insurgency. They also disclose previously unreported instances where JSOC's activities may have skirted the law, and question the ability of Congress to oversee units that, by design, must operate with minimum interference.\n\nWith unprecedented access to senior commanders and team leaders, the authors also:\n\nPut the bin Laden raid in the larger context of a transformed secret organization at its operational best.\nExplore other secret missions ordered by the president (and the surprising countries in which JSOC operates).\nTrace the growth of JSOC's operational and support branches and chronicle the command's mastery of the Washington inter-agency bureaucracy.\nBy Marc Ambinder, a contributing editor at the Atlantic, who has has covered politics for CBS News and ABC News, and D.B. Grady, a correspondent for the Atlantic, and former U.S. Army paratrooper and a veteran of Afghanistan.\n\ntitle link:\n","torrent":{"xt":"urn:btih:4d5c0dc407f72ef583e338fc4e4c526830c30f4b","amp;dn":"The+Command%3A+Deep+Inside+the+President%27s+Secret+Army","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d5c0dc407f72ef583e338fc4e4c526830c30f4b","infoHashBuffer":{"type":"Buffer","data":[77,92,13,196,7,247,46,245,131,227,56,252,78,76,82,104,48,195,15,75]},"announce":[],"urlList":[]}}