{"title":"Miss Tushy (2015) SiteRip","uid":15644578,"size":395056446,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:4dbe7972ba6baade7f4db364ab8adf69448f1c9a&amp;dn=Miss+Tushy+%282015%29+SiteRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"distinc","files":1,"time":1472043209,"description":"Miss Tushy (2015) SiteRip\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=6462163403\r\n \nhttp://imagedisco.net/?g=9167724307\r\n\r\n\r\nPlot:\r\n\r\nDirector: Greg Lansky\r\nStarring: Kendra Lust, Mick Blue\r\n\r\nDescription: Wasting no time we lead off with Kendra who arrives at a house walking confidently up with Mick Blue letting her in. Kendra is here for her latest session and she starts laying it out for Mick while he and us size up this busty beauty. Kendra starts to describe a dream she had the other night and Mick tries to listen but his eyes kept being drawn to her legs-- totally understandable after seeing what she was wearing. The dream comes alive for us and hello it's a great take on the True Lies scene where Jamie Lee Curtis does the sexy dance for her client who was actually her husband Arnold. The parallel is the same here as the guy in the shadows turns out to be Mick. Kendra shows off that enticing bod and loved that her arms, torso and ass were wet. The rain falling outside was a nice additional touch and the musical track was not to bad either. Kendra does an excellent job working her bra and thong off leaving just the heels and I do not know about you but I'd be ready to jump in there right now! Our mysterious man comes out from the shadows and the only real difference is Mick was not wearing glasses like in the session. Back to reality and Kendra finishes off her tale and Mick gets the hint and comes over to make the fantasy become reality! Kissing and some fingering which was made easy with no panties on. Still wearing his jacket / shirt and trousers we get Mick going down on Kendra spreading her legs nice 'n' wide to taste both holes. Fingering too from Mr. Blue to that ass with Kendra licking a couple when he pulls them out. There is some good dick sucking too from Miss Lust here and a little titty fucking too. A couple good minutes here on the head before Mick picks her up for a little riding action then onto the couch for mish love. After a pull out and more anal fingering the first insertion happens and that dick eases in like hot knife through butter! Very nice to see A2M from Kendra and really really nice to see her hop on for the ride in cowgirl showing off just how amazing that ass looks with a dick stuffed deep inside it. A strong doggie anal finish yields the open mouth pop and clean up from Kendra. Her fans who have longed to see her do anal get rewarded here with a nearly 50 minute scene. Top notch work here from Miss Lust.\r\n\r\nReleased: 2015\r\nIssued: USA / Tushy (Jules Jordan Video)\r\nDuration: 00:48:18\r\nEnglish language\r\nGenre: Gonzo, Anal, MILF, Big Tits, Deep Throat, Facial, Oral, Blowjob\r\n\r\nFile\r\nFormat: MP4\r\nQuality: SiteRip\r\nVideo Codec: AVC / H.264\r\nVideo: 854x480, 23.976fps, 1024 Kb / s\r\nSound: 48KHz, AAC, 64 Kb / s (2 ch)","torrent":{"xt":"urn:btih:4dbe7972ba6baade7f4db364ab8adf69448f1c9a","amp;dn":"Miss+Tushy+%282015%29+SiteRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dbe7972ba6baade7f4db364ab8adf69448f1c9a","infoHashBuffer":{"type":"Buffer","data":[77,190,121,114,186,107,170,222,127,77,179,100,171,138,223,105,68,143,28,154]},"announce":[],"urlList":[]}}