{"title":"Grand.Theft.Auto.Vice.City.Stories-{MOD}-Repack","uid":8581022,"size":1079978889,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4df0792f2124bdf2183fdb85e9958c825a831913&amp;dn=Grand.Theft.Auto.Vice.City.Stories-%7BMOD%7D-Repack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Taker009","files":2,"time":1371413332,"description":"Grand.Theft.Auto.Vice.City.Stories-{MOD}-Repack\n\n\n\nYear: 2006 PSP - 2013 PC\nGenre: Action / 3D / 3rd Person\nDeveloper: Rockstar Games\nPublisher: Rockstar Leed\nPublication Type: Repack\nLanguage: English\nSound language: English\n\n\n\nSystem Requirements:\n====================\nProcessor Intel Pentium IV or AMD Athlon\n1024 MB RAM\n16-speed DVD drive\n4.7 GB of free hard disk space\nVideo card with 256 MB or more of memory, compatible with DirectX 9.0\nSound Card compatible with DirectX 9.0\n\nGame information:\n=================\n\nWhen she was a soldier Vic Vance is well oriented in life. He had a job, becoming a clear objective - to protect. And he defended as best he could, but the leisurely flow of everyday life has come to an end. Man dismissed from service by throwing out. How to earn a living? How to feed a family? Neither the legal case, no dental or other lucrative professions were not familiar with Vika. He used to rely on muscle power, weapons, and your analytical mind.Few of these qualities for a successful career in business or politics, but just enough to not divide the streets. In 1984, the town of Vice City was living under two laws: the official code and &quot;by the rules.&quot; Ignoring the police, gangs fought for individual areas, hunted racketeering and robberies. In their midst Vic felt more or less familiar: a weapon and there were muscles in the price. But Vance Vance would not, suffice it a place of &quot;six&quot; in the murderous gang. Vic starts to climb to the summit of Mount Olympus\ncriminal, but he needs help - your pomoschmpensiruetsya highest rates of battle and growing anger of the enemy. The variety of enemies, architecture and magnificent landscapes surpass the original.\n\n\nFeatures:\n=========\n\n&quot;Grand Theft Auto: Vice City Stories PC Edition&quot; is a large modification for Grand Theft Auto: San Andreas. Port of the game that Rockstar will never do for you. In this modification, we moved the game map, all the characters, vehicles and weapons from the original game play, as well as porting the game system weather and atmosphere. In this modification, the representation of a certain number of additional storylines and missions, the number of which will increase with each new version of the modification.\n\n\n\nRepack Features:\n================\n\nIt is based on the original GTA SA\nVersion v.1163\nRepack by jeRaff","torrent":{"xt":"urn:btih:4df0792f2124bdf2183fdb85e9958c825a831913","amp;dn":"Grand.Theft.Auto.Vice.City.Stories-%7BMOD%7D-Repack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4df0792f2124bdf2183fdb85e9958c825a831913","infoHashBuffer":{"type":"Buffer","data":[77,240,121,47,33,36,189,242,24,63,219,133,233,149,140,130,90,131,25,19]},"announce":[],"urlList":[]}}