{"title":"Jeb! and the Bush Crime Family - The Inside Story of an American","uid":15914304,"size":172795334,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4e0832bc262bd8fe7a8121ba4032f657f0e78a81&amp;dn=Jeb%21+and+the+Bush+Crime+Family+-+The+Inside+Story+of+an+American&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"roflcopter2110","files":2,"time":1475180375,"description":"https://cdn.pximg.xyz/538bbc3c4facf38e563895ed67bba141.png\r\n \nhttp://boltimg.com/images/frayf.jpg\r\n\r\nJeb! and the Bush Crime Family - The Inside Story of an American Dynasty (MP3 Audio Book) - roflcopter2110 [TKRG]\r\n\r\nWritten by: Roger Stone, Saint John Hunt, Congressman John Leboutillier - foreword\r\nNarrated by: Sean Runnette\r\nLength: 11 hrs and 59 mins\r\n\r\nJeb and the Bush Crime Family is the book that smashes through the layers of lies and secrecy that has surrounded and protected our country's very own political dynasty.\r\n\r\nNew York Times best-selling author and legendary political insider Roger Stone lashes out with a blistering indictment that exposes the true history and monumental hypocrisy of the Bushes. In his usual &quot;go for the jugular&quot; style, Stone collaborates with Saint John Hunt - author, musician, and son of legendary CIA operative E. Howard Hunt - to make this a &quot;no-holds-barred&quot; history of the Bush family.\r\n\r\nThe authors reveal Jeb to be a smug, entitled autocrat who both uses and hides behind his famous name as he mingles with international drug peddlers. They show how Jeb: Received a $4 million taxpayer bailout when his daddy was vice president. Used his insider status to make millions from Obamacare. Avoided criminal prosecution on a fraudulent federal loan. Hypocritically supports the War on Drugs, despite his own shocking drug history.\r\n\r\nAfter detailing the vast litany of Jeb's misdeeds, Stone travels back to Samuel, Prescott, George H. W., and George W. Bush to weave an epic story of privilege, greed, corruption, drug profiteering, assassination, and lies. Jeb and the Bush Crime Family will have you asking, &quot;Why aren't these people in prison?&quot;","torrent":{"xt":"urn:btih:4e0832bc262bd8fe7a8121ba4032f657f0e78a81","amp;dn":"Jeb%21+and+the+Bush+Crime+Family+-+The+Inside+Story+of+an+American","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e0832bc262bd8fe7a8121ba4032f657f0e78a81","infoHashBuffer":{"type":"Buffer","data":[78,8,50,188,38,43,216,254,122,129,33,186,64,50,246,87,240,231,138,129]},"announce":[],"urlList":[]}}