{"title":"WinRAR 5.01 Pre-Registered [Silent Install]","uid":9290894,"size":3825932,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4e2c55bbf506bf0e09de1f9f0a827953ac81fb85&amp;dn=WinRAR+5.01+Pre-Registered+%5BSilent+Install%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"saif_khan","files":2,"time":1386089218,"description":"WinRAR 5.01 - Latest release. December, 2013.\n\nDescription:\nWinRAR is a powerful archive manager. It can backup your data and reduce the size of email attachments, decompress RAR, ZIP and other files downloaded from Internet and create new archives in RAR and ZIP file format. \n\n***\n\nChange Log in Version 5.01:\n\n1. RAR 5.0 archives can include an optional quick open information\ncontrolled with -qo[-|+] switch or &quot;Quick open information&quot; options\ngroup in archiving dialog. It allows to open the archive contents\nin WinRAR faster.\n\nThis version provides better update performance for archives\ncontaining both quick open information and service records,\nsuch as NTFS file security. Also default parameters of quick open\ninformation are optimized to achieve faster open time for such archives.\n\n2. Bugs fixed:\n\na) &quot;Find&quot; command could fail when searching text string in .7z archives;\n\nb) when opening RAR 5.0 archive with encrypted file names stored\nin another such archive, WinRAR could issue an erroneous message\nthat password is incorrect. It happened only if passwords to inner\nand outer archives were different. It did not affect extraction,\nall files could be unpacked regardless of this message;\n\nc) option &quot;Use for all archives&quot; in password dialog did not suppress\nadditional password requests for RAR 5.0 archives with encrypted\nfile names;\n\nd) WinRAR address bar did not process correctly environment variable\nbased paths, such as %temp%;\n\ne) storing NTFS file security and alternate data streams did not work\nfor file pathnames longer than 260 characters;\n\nf) &quot;Test&quot; command could erroneously report damaged data in valid\nrecovery record if only a part of files in RAR 5.0 archive\nwas tested. It did not happen if entire archive contents was tested;\n\ng) &quot;Test&quot; command erroneously reported errors when verifying\nRAR 4.x Unix symbolic links;\n\nh) WinRAR &quot;View&quot; command did not work for files inside of BZIP2 archives;\n\ni) if &quot;High precision modification time&quot; option in archiving dialog\nwas turned off, WinRAR did not store the modification time at all\ninstead of storing a lower precision time;\n\nj) destination paths containing . or .. component did not work\nwhen extracting non-RAR archives in WinRAR command line mode;\n\nk) WinRAR failed to unpack multivolume CAB archives.\n\n\n***\n\nSource 32-bit:\nwrar501.exe\n\nSource 64-bit:\nwinrar-x64-501.exe\n\nTools used:\nWinrar 4.20 for making Silent installer\n\nTweaked:\nIntegrated rarreg.key inside my installer to become Full Version, so you don't need to copy this key after install, because it will auto-copy into Winrar directory during installation.\n\nFile name: \n32-bit: wrar501_Silent.exe\n64-bit: winrar-x64-501_Silent.exe\nCompression method: Rar Normal\nArchive type: Rar SFX\nLanguage: English\n\nCommandline Switch:\nQuiet mode: /S\nExample: winrar-x64-501.exe /S\n\nEnjoy this Winrar, already Full Version for you:D\n\n\nby dianu","torrent":{"xt":"urn:btih:4e2c55bbf506bf0e09de1f9f0a827953ac81fb85","amp;dn":"WinRAR+5.01+Pre-Registered+%5BSilent+Install%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e2c55bbf506bf0e09de1f9f0a827953ac81fb85","infoHashBuffer":{"type":"Buffer","data":[78,44,85,187,245,6,191,14,9,222,31,159,10,130,121,83,172,129,251,133]},"announce":[],"urlList":[]}}