{"title":"Back To The Future Trilogy - The Complete Boxset Part 1, 2 &amp; 3 D","uid":6182598,"size":2213359644,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4eeb0dfed0d923bf400bd2ec493c7e061fa51533&amp;dn=Back+To+The+Future+Trilogy+-+The+Complete+Boxset+Part+1%2C+2+%26+3+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"TSV","files":-1,"time":1298009013,"description":"Back to the Future is a 1985 American science-fiction comedy film. It was directed by Robert Zemeckis, written by Zemeckis and Bob Gale, produced by Steven Spielberg, and starred Michael J. Fox, Christopher Lloyd, Lea Thompson, Crispin Glover and Thomas F. Wilson. The film tells the story of Marty McFly, a teenager who is accidentally sent back in time from 1985 to 1955. He meets his parents in high school and accidentally attracts his mother's romantic interest. Marty must repair the damage to history by causing his parents to fall in love, and with the help of scientist Dr. Emmett &quot;Doc&quot; Brown, he must find a way to return to 1985.\n\nZemeckis and Gale wrote the script after Gale mused upon whether he would have befriended his father if they attended school together. Various film studios rejected the script until the financial success of Zemeckis' Romancing the Stone, after which the project was set up at Universal Pictures with Spielberg as an executive producer. Eric Stoltz was originally cast as Marty McFly when Michael J. Fox was busy filming the TV series Family Ties. However, during filming, Stoltz and the filmmakers decided that Stoltz was miscast, so Fox was approached again and he managed to work out a timetable in which he could give enough time and commitment to both; the subsequent recasting meant the crew had to race through reshoots and post-production to complete the film for its July 3, 1985 release date.\n\nWhen released, Back to the Future became the most successful film of the year, grossing more than $380 million worldwide and receiving critical acclaim. It won the Hugo Award for Best Dramatic Presentation and the Saturn Award for Best Science Fiction Film, as well as Academy Awards, and Golden Globe nominations among others. Ronald Reagan even quoted the film in his 1986 State of the Union Address. In 2007, the Library of Congress selected it for preservation in the National Film Registry, and in June 2008 the American Film Institute's special AFI's 10 Top 10 acknowledged the film as the 10th-best film in the science fiction genre. The film marked the beginning of a franchise, with sequels Back to the Future Part II and Back to the Future Part III released in 1989 and 1990, as well as an animated series, theme park ride, and video game.","torrent":{"xt":"urn:btih:4eeb0dfed0d923bf400bd2ec493c7e061fa51533","amp;dn":"Back+To+The+Future+Trilogy+-+The+Complete+Boxset+Part+1%2C+2+%26+3+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4eeb0dfed0d923bf400bd2ec493c7e061fa51533","infoHashBuffer":{"type":"Buffer","data":[78,235,13,254,208,217,35,191,64,11,210,236,73,60,126,6,31,165,21,51]},"announce":[],"urlList":[]}}