{"title":"The Audio Expert (gnv64)","uid":7293093,"size":26995689,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f39bb12e98a76804e9df89245cfcfdb179684de&amp;dn=The+Audio+Expert+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"gnv65","files":-1,"time":1337801400,"description":"The Audio Expert: Everything You Need to Know About Audio\nby Ethan Winer\nFocal Press | ISBN: 0240821009 | April 2012 | ePUB/PDF | 696 pages | 10 MB/15.7 MB &lt;a href=&quot;\nhttp://www.amazon.com/The-Audio-Expert-Everything-About/dp/0240821009/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/The-Audio-Expert-Everything-About/dp/0240821009/&lt;/a&gt;\n\nGain a deep understanding of audio practice and theory with this easy-to-read book, illustrated with more than 400 figures and photographs. Using common sense, plain-English explanations and minimal math, author Ethan Winer helps you understand audio at the deepest, most technical level-no engineering degree necessary.\nIf you're an intermediate to advanced recording engineer or audiophile, you already know the basic mechanics of how audio &quot;works.&quot; This book will take you beyond that, weaving together audio concepts, theories of aural perception and acoustics, musical instrument physics, and basic electronics and demonstrating their relationships to one another.\nRather than merely showing you how to use audio devices like equalizers and compressors, Winer explains how they work internally and how they are spec'd and tested.\n\nWith The Audio Expert, you get:\n* Videos and audio examples on the companion website (www.TheAudioExpertBook.com) that help you understand complex topics, such as vibration and resonance\n* Platform agnostic explanations, applying to Windows and Mac operating systems, and to most software and hardware\n* Practical tips, tricks, advice, and lots of myth-busting\n* Explains clearly the innermost details of audio hardware and software\n* Contains numerous practical tips, tricks, advice, and lots of myth-busting\n* Provides videos and audio examples on the companion website for comprehensive understanding\n\nAbout the Author\nEthan has, at various times,worked as a studio musician, computer programmer, circuit designer, recording engineer, composer/arranger, technical writer, and college instructor. He's had nearly 100 feature articles published in audio and computer magazines including Mix, PC Magazine, Electronic Musician, EQ Magazine, Audio Media, Sound on Sound, Keyboard, Pro Sound News, and Recording. .\nIn 2002 he started the company RealTraps to manufacture bass traps and other acoustic treatment, which he continues to this day.","torrent":{"xt":"urn:btih:4f39bb12e98a76804e9df89245cfcfdb179684de","amp;dn":"The+Audio+Expert+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f39bb12e98a76804e9df89245cfcfdb179684de","infoHashBuffer":{"type":"Buffer","data":[79,57,187,18,233,138,118,128,78,157,248,146,69,207,207,219,23,150,132,222]},"announce":[],"urlList":[]}}