{"title":"Angry Optimist: The Life and Times of Jon Stewart - Lisa Rogak","uid":11196621,"size":181204357,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4f6b3fe67c6f578ecb79a778b4a5de4a5f2d5e6a&amp;dn=Angry+Optimist%3A+The+Life+and+Times+of+Jon+Stewart+-+Lisa+Rogak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1413099579,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nAngry Optimist: The Life and Times of Jon Stewart\n\nWritten by: Lisa Rogak\nNarrated by: Cassandra Campbell\nLength: 6 hrs and 16 mins\nUnabridged Audiobook\nRelease Date:09-09-14\n\nSince his arrival at The Daily Show in 1999, Jon Stewart has become one of the major players in comedy as well as one of the most significant liberal voices in the media and on television today. In Angry Optimist, Lisa Rogak charts his unlikely rise to political stardom, from his early stand-up days to the short-lived but acclaimed Jon Stewart Show.\n\nDrawing on interviews with current and former colleagues, she reveals how things work behind the scenes at The Daily Show.With speculation simmering about Stewart's possible retirement from The Daily Show and a contentious midterm election in 2014, this biography may come to serve as a capstone for a comedian who has wielded incredible power in American politics.","torrent":{"xt":"urn:btih:4f6b3fe67c6f578ecb79a778b4a5de4a5f2d5e6a","amp;dn":"Angry+Optimist%3A+The+Life+and+Times+of+Jon+Stewart+-+Lisa+Rogak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f6b3fe67c6f578ecb79a778b4a5de4a5f2d5e6a","infoHashBuffer":{"type":"Buffer","data":[79,107,63,230,124,111,87,142,203,121,167,120,180,165,222,74,95,45,94,106]},"announce":[],"urlList":[]}}