{"title":"A Bad Idea I'm About to Do by Chris Gethard","uid":9625158,"size":454112,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f7ac44860527a0f921ea925acf1e3caeea8f21f&amp;dn=A+Bad+Idea+I%27m+About+to+Do+by+Chris+Gethard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"PirateBook","files":1,"time":1392578847,"description":"\n&quot;If you like underdog stories told by a secret comedy superhero, Chris Gethard is your man. Each story is the perfect combination of hilarious and heartbreaking.&quot;-Amy Poehler &quot;Chris Gethard is comedy in a fighter's crouch.&quot;-Seth Meyers &quot;There's truly no poorer judgment than not buying this book. Except maybe diving into a swimming pool full of malaria.\n\n&quot;-Patton Oswalt &quot;Chris Gethard stories are like a roller coaster-at times you are scared, shocked, and ultimately exhilarated by the hilarity each story contains-and once you finish one, you wanna hear another one right away.&quot;-Paul Scheer, FX's The League and Adult Swim's NTSF: SD: SUV &quot;Chris Gethard tells the amazing stories an eccentric old man would tell ...if that man had lived his f#@king life with any balls. His stories are hilarious and riveting-but more importantly, real.\n\n&quot;-Rob Huebel, Adult Swim's Childrens Hospital and MTV's Human Giant Chris Gethard has often found himself in awkward situations most people, including you, probably would have safely avoided. The good news is now, thanks to this book, you can enjoy the painfully funny consequences of his unfortunate decisions at a safe distance. \n\nA Bad Idea I'm About to Do invites readers to join Chris as he navigates an adolescence and adulthood mired in hilariously ill-fated nerdom, and to take comfort in the fact that-as his experiences often prove-things could always be much, much worse.\n\nGenre: Non Fiction , Biography","torrent":{"xt":"urn:btih:4f7ac44860527a0f921ea925acf1e3caeea8f21f","amp;dn":"A+Bad+Idea+I%27m+About+to+Do+by+Chris+Gethard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f7ac44860527a0f921ea925acf1e3caeea8f21f","infoHashBuffer":{"type":"Buffer","data":[79,122,196,72,96,82,122,15,146,30,169,37,172,241,227,202,238,168,242,31]},"announce":[],"urlList":[]}}