{"title":"Antony Cyril Sutton - 1974 - Wall Street And The Bolshevik Revol","uid":11322173,"size":1163590,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ffb8d91f7e8e74a02225ab56c10fc24f88046a0&amp;dn=Antony+Cyril+Sutton+-+1974+-+Wall+Street+And+The+Bolshevik+Revol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Inua1","files":1,"time":1414608931,"description":"Title: Wall Street &amp; the Bolshevik Revolution  \nAuthor: Antony Cyril Sutton\nISBN-10: 089968324X\nISBN-13: 978-0899683249\n\nWhy did the 1917 American Red Cross Mission to Russia include more financiers than medical doctors? Rather than caring for the victims of war and revolution, its members seemed more intent on negotiating contracts with the Kerensky government, and subsequently the Bolshevik regime. \n\nIn a courageous investigation, Antony Sutton establishes tangible historical links between US capitalists and Russian communists. Drawing on State Department files, personal papers of key Wall Street figures, biographies and conventional histories, Sutton reveals: the role of Morgan banking executives in funneling illegal Bolshevik gold into the US; the co-option of the American Red Cross by powerful Wall Street forces; the intervention by Wall Street sources to free the Marxist revolutionary Leon Trotsky, whose aim was to topple the Russian government; the deals made by major corporations to capture the huge Russian market a decade and a half before the US recognized the Soviet regime; and, the secret sponsoring of Communism by leading businessmen, who publicly championed free enterprise. \n\n&quot;Wall Street and the Bolshevik Revolution&quot; traces the foundations of Western funding of the Soviet Union. Dispassionately, and with overwhelming documentation, the author details a crucial phase in the establishment of Communist Russia. This classic study - first published in 1974 and part of a key trilogy - is reproduced here in its original form. (The other volumes in the series include &quot;Wall Street and the Rise of Hitler&quot; and a study of Franklin D. Roosevelt's &quot;1933 Presidential election in the United States&quot;)","torrent":{"xt":"urn:btih:4ffb8d91f7e8e74a02225ab56c10fc24f88046a0","amp;dn":"Antony+Cyril+Sutton+-+1974+-+Wall+Street+And+The+Bolshevik+Revol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ffb8d91f7e8e74a02225ab56c10fc24f88046a0","infoHashBuffer":{"type":"Buffer","data":[79,251,141,145,247,232,231,74,2,34,90,181,108,16,252,36,248,128,70,160]},"announce":[],"urlList":[]}}