{"title":"Henri Nouwen - 4 books (pdf)","uid":8507035,"size":3101879,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50d0b094f6a932608042a7e05351c4168820e3ad&amp;dn=Henri+Nouwen+-+4+books+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"pharmakate","files":-1,"time":1369457210,"description":"Four books by Henri J. M. Nouwen. All are pdf format and have a semi-retail source.\n\n\nBread for the Journey: A Day Book of Wisdom and Faith\nA Letter of Consolation\nLetters to Marc About Jesus: Living a Spiritual Life in a Material World\nOur Greatest Gift: A Meditation on Dying and Caring\n\n\nabout the author:\n\nHenri Nouwen (1932-1996) was a Dutch-born Catholic priest and writer who authored 40 books about spirituality.\n\nOne of Nouwen's major ongoing themes involved his struggle reconciling his depression with his Christian faith. In Return of the Prodigal Son, for example, Nouwen describes love and forgiveness as unconditional. In that book, he invites the reader to follow him in his personal return to the spiritual fountains, and a parallel meditation on all the characters of the parable, and their rendering by Rembrandt, and the painter's personal life.\n\nNouwen also wrote several essays on the necessity of peacemaking. He used God's Love as a justification for the preservation of life, as well as protesting both the Vietnam War and Nuclear weapons.\n\nHis struggle to reconcile his priestly vows of celibacy with his human desire for physical and emotional intimacy was also a theme in his writings.\n\nNouwen's books are still being read today. His books include The Wounded Healer, In the Name of Jesus, Clowning in Rome, The Life of the Beloved and The Way of the Heart. After nearly two decades of teaching at the Menninger Foundation Clinic in Topeka, Kansas, and at the University of Notre Dame, Yale University and Harvard University, he went to work with mentally challenged people at the L'Arche community of Daybreak in Toronto, Canada.\n\nAfter a long period of declining energy, which he chronicled in his final book, Sabbatical Journey, he died in September 1996 from a sudden heart attack.\n\nHis spirituality was influenced notably by his friendship with Jean Vanier. At the invitation of Vanier, Nouwen visited L'Arche in France, the first of over 130 communities around the world where people with developmental disabilities live with those who care for them. In 1986 Nouwen accepted the position of pastor for a L'Arche community called &quot;Daybreak&quot; in Canada, near Toronto. Nouwen wrote about his relationship with Adam, a core member at L'Arche Daybreak with profound developmental disabilities, in a book titled Adam: God's Beloved. Father Nouwen was a good friend of the late Cardinal Joseph Bernardin.\n\nThe results of a Christian Century magazine survey conducted in 2003 indicate that Nouwen's work was a first choice of authors for Catholic and mainline Protestant clergy.\n\n--------------\n\nThe Way of the Heart is available here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8305253&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8305253&lt;/a&gt;\n\n**More books by Nouwen will be posted soon; feel free to request titles and I'll fulfill the requests if I can.**","torrent":{"xt":"urn:btih:50d0b094f6a932608042a7e05351c4168820e3ad","amp;dn":"Henri+Nouwen+-+4+books+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50d0b094f6a932608042a7e05351c4168820e3ad","infoHashBuffer":{"type":"Buffer","data":[80,208,176,148,246,169,50,96,128,66,167,224,83,81,196,22,136,32,227,173]},"announce":[],"urlList":[]}}