{"title":"Black Box Thinking: Why Most People Never Learn from Their Mista","uid":14258721,"size":705885070,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:50e5dbd3fbb04097d6fc8571ea782d9a5de9f2f4&amp;dn=Black+Box+Thinking%3A+Why+Most+People+Never+Learn+from+Their+Mista&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"oinky222","files":121,"time":1460228421,"description":"Nobody wants to fail. But in highly complex organizations, success can happen only when we confront our mistakes, learn from our own version of a black box, and create a climate where it’s safe to fail. \r\n　\r\nWe all have to endure failure from time to time, whether it’s underperforming at a job interview, flunking an exam, or losing a pickup basketball game. But for people working in safety-critical industries, getting it wrong can have deadly consequences. Consider the shocking fact that preventable medical error is the third-biggest killer in the United States, causing more than 400,000 deaths every year. More people die from mistakes made by doctors and hospitals than from traffic accidents. And most of those mistakes are never made public, because of malpractice settlements with nondisclosure clauses.\r\n\r\nFor a dramatically different approach to failure, look at aviation. Every passenger aircraft in the world is equipped with an almost indestructible black box. Whenever there’s any sort of mishap, major or minor, the box is opened, the data is analyzed, and experts figure out exactly what went wrong. Then the facts are published and procedures are changed, so that the same mistakes won’t happen again. By applying this method in recent decades, the industry has created an astonishingly good safety record. \r\n\r\nFew of us put lives at risk in our daily work as surgeons and pilots do, but we all have a strong interest in avoiding predictable and preventable errors. So why don’t we all embrace the aviation approach to failure rather than the health-care approach? As Matthew Syed shows in this eye-opening book, the answer is rooted in human psychology and organizational culture. \r\n\r\nSyed argues that the most important determinant of success in any field is an acknowledgment of failure and a willingness to engage with it. Yet most of us are stuck in a relationship with failure that impedes progress, halts innovation, and damages our careers and personal lives. We rarely acknowledge or learn from failure—even though we often claim the opposite. We think we have 20/20 hindsight, but our vision is usually fuzzy.\r\n\r\nSyed draws on a wide range of sources—from anthropology and psychology to history and complexity theory—to explore the subtle but predictable patterns of human error and our defensive responses to error. He also shares fascinating stories of individuals and organizations that have successfully embraced a black box approach to improvement, such as David Beckham, the Mercedes F1 team, and Dropbox","torrent":{"xt":"urn:btih:50e5dbd3fbb04097d6fc8571ea782d9a5de9f2f4","amp;dn":"Black+Box+Thinking%3A+Why+Most+People+Never+Learn+from+Their+Mista","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50e5dbd3fbb04097d6fc8571ea782d9a5de9f2f4","infoHashBuffer":{"type":"Buffer","data":[80,229,219,211,251,176,64,151,214,252,133,113,234,120,45,154,93,233,242,244]},"announce":[],"urlList":[]}}