{"title":"The Lowland - Jhumpa Lahiri.epub","uid":9026374,"size":2548044,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51fd7ff95c855f31448ba441c882fbcf408c9528&amp;dn=The+Lowland+-+Jhumpa+Lahiri.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1381369774,"description":"Two brothers bound by tragedy; a fiercely brilliant woman haunted by her past; a country torn by revolution. A powerful new novel-set in both India and America-that explores the price of idealism and a love that can last long past death.\n\nGrowing up in Calcutta, born just fifteen months apart, Subhash and Udayan Mitra are inseparable brothers, one often mistaken for the other. But they are also opposites, with gravely different futures ahead of them. It is the 1960s, and Udayan-charismatic and impulsive-finds himself drawn to the Naxalite movement, a rebellion waged to eradicate inequity and poverty: he will give everything, risk all, for what he believes. Subhash, the dutiful son, does not share his brother's political passion; he leaves home to pursue a life of scientific research in a quiet, coastal corner of America. But when Subhash learns what happened to his brother in the lowland outside their family's home, he comes back to India, hoping to pick up the pieces of a shattered family, and to heal the wounds Udayan left behind-including those seared in the heart of his brother's wife.\n\nSuspenseful, sweeping, piercingly intimate, The Lowland expands the range of one of our most dazzling storytellers, seamlessly interweaving the historical and the personal across generations and geographies. This masterly novel of fate and will, exile and return, is a tour de force and an instant classic.","torrent":{"xt":"urn:btih:51fd7ff95c855f31448ba441c882fbcf408c9528","amp;dn":"The+Lowland+-+Jhumpa+Lahiri.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51fd7ff95c855f31448ba441c882fbcf408c9528","infoHashBuffer":{"type":"Buffer","data":[81,253,127,249,92,133,95,49,68,139,164,65,200,130,251,207,64,140,149,40]},"announce":[],"urlList":[]}}