{"title":"The Complete Thor v2 by Fraction + FI, Ex (2008-2012|Dgtl|E+)","uid":9666356,"size":1367934067,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:52242c214f64886e91301571e940bd8e07ceaecf&amp;dn=The+Complete+Thor+v2+by+Fraction+%2B+FI%2C+Ex+%282008-2012%7CDgtl%7CE%2B%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"VikTSlick","files":-1,"time":1393380473,"description":"Time to celebrate yet another Matt Fraction Marvel run, this time on The Mighty Thor. Please also see my other complete Fraction runs (I will add a link list in the comments section below).\n\nThis torrent collects EVERYTHING that Fraction wrote on Thor, including all the main issues of Fear Itself. The only thing technically missing is the Iron Man/Thor FCBD one-shot from 2010, which is in my Invincible Iron Man by Fraction torrent. Otherwise, I have assembled all of the Thor material from his first run (v1 615-621) to the entire run of v2 (01-22), with the addition of FI and many extras. Everything is numbered and organized in reading order, with added material by Keiron Gillen from his concurrent Journey Into Mystery run where appropriate. The extras include all of the Thor one-shots by Fraction, Secret Invasion - Thor 01-03 (also by Matt), and the Annual of this volume (by J.M. Dematteis). The folders are labeled and organized as follows - and incidentally, this time they match the TPB volumes as welll:\n\n-00 Thor - The World Eaters (TMT v1 615-621) - Not part of the main story arc but sets up some ideas for the v2 section.\n-01 The Galactus Seed (TMT v2 01-06)\n-01A Fear Itself (FI 01-07) - The core series, as added material in case you want to read this since it heavily ties into the regular series arcs, but it is not necessary and can be skipped.\n-02 Fear Itself - In The Beginning + The Mighty Tanarus (TMT v2 07-12, FI 7.2)\n-03 Battles Past + The Neverending Nightmare (TMT v2 12.1-17)\n-04 Everything Burns [with Kieron Gillen] (TMT 18-22, JIM 642-645) - This final part of the story alternates between issues of The Mighty Thor and Journey Into Mystery; I have placed it in numerical order for easy reading.\n-05 Bonus Material - the last part contains the 2012 Annual, the Secret Invasion tie-ins, and four one-shots: Ages of Thunder, Reign of Blood, Man of War, and God-Size. Those are co-written with other authors.\n\nWell, there you have it, more Thor! Some great reading and art in this volume as Thor battles Galactus, his own worst demons, literal demons and possibly the destruction of everything he holds dear. Great stuff and worth checking out. All copies of every issue are Digital EXCEPT for the Secret Invasion stuff (by Minutemen) and The Might Thor v2 013, which doesn't have a digital release for some reason. That issue is by Megan Empire. Every other issue is labeled and by various Empire scanners - most notably Zone, Cypher, and The Hand. Massive thanks to all those groups for their efforts, and as always please seed and enjoy! :-)","torrent":{"xt":"urn:btih:52242c214f64886e91301571e940bd8e07ceaecf","amp;dn":"The+Complete+Thor+v2+by+Fraction+%2B+FI%2C+Ex+%282008-2012%7CDgtl%7CE%2B%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52242c214f64886e91301571e940bd8e07ceaecf","infoHashBuffer":{"type":"Buffer","data":[82,36,44,33,79,100,136,110,145,48,21,113,233,64,189,142,7,206,174,207]},"announce":[],"urlList":[]}}