{"title":"Keith Richards - Main Offender (1992) [LOSSLESS FLAC][Tntvillage","uid":5309219,"size":350462923,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:529771d7e184fd46370dc89abb54a58c892852c9&amp;dn=Keith+Richards+-+Main+Offender+%281992%29+%5BLOSSLESS+FLAC%5D%5BTntvillage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"RDaneel20","files":17,"time":1264506962,"description":"Keith Richards - Main Offender (1992) [LOSSLESS FLAC][Tntvillage.Scambioetico]\n\n\n\n\n\nKeith Richards - Main Offender\n\n\nby RDaneel\n\n\n\n\n\n\n\n\n[::Album Information::]\n\nTitle: Main Offender\nYears: 1992\nGenre: Rock\nProduction: Virgin\n\n\n\n[::Tracklist::]\n\n\n1. 999 - 5:50\n2. Wicked As It Seems - 4:45\n3. Eileen - 4:29\n4. Words Of Wonder - 6:35\n5. Yap Yap - 4:43\n6. Bodytalks - 5:20\n7. Hate It When You Leave - 4:59\n8. Runnin' Too Deep - 3:20\n9. Will But You Won't - 5:05\n10. Demon - 4:47\n\n\n\n[::Review::]\n\nKeith Richards (born 18 December 1943) is an English guitarist, songwriter, singer, record producer and a founding member of The Rolling Stones. As a guitarist, Richards is mostly known for his innovative rhythm playing. In 2003 he was ranked 10th on Rolling Stone magazine's &quot;Rolling Stone's 100 Greatest Guitarists of All Time&quot;. With songwriting partner and Rolling Stones lead vocalist Mick Jagger, Richards has written and recorded hundreds of songs, fourteen of which are listed by Rolling Stone magazine among the &quot;500 Greatest Songs of All Time&quot;.\nMain Offender is Keith Richards' second solo studio album and his third overall. Released in 1992 in between The Rolling Stones' Steel Wheels and Voodoo Lounge projects, Main Offender remains to date Richards' most recent offering as a solo artist.\nRegrouping with his group of musician friends known as &quot;The X-Pensive Winos&quot;, Richards teamed up with Talk Is Cheap collaborator Steve Jordan and added Waddy Watchel to the mix both in composing and producing Main Offender.\nSessions took place in California and New York City from March to September 1992, with another round of touring scheduled that fall in Europe and early 1993 in North America.\nWhen Richards would reunite with Mick Jagger (who was recording Wandering Spirit while Richards was making Main Offender) in mid-1993 to start work on Voodoo Lounge, Jagger would compliment Richards on Main Offender, even using lead single &quot;Wicked as It Seems&quot; as inspiration for The Rolling Stones' next single, &quot;Love Is Strong&quot;.\nReleased in October 1992, Main Offender received another round of positive reviews, but failed to match the commercial success of Talk Is Cheap, reaching #45 in the United Kingdom and #99 in the United States. Following the touring commitments in support of Main Offender, Richards would return to recording exclusively with The Rolling Stones and put his solo career on an indefinite hold.","torrent":{"xt":"urn:btih:529771d7e184fd46370dc89abb54a58c892852c9","amp;dn":"Keith+Richards+-+Main+Offender+%281992%29+%5BLOSSLESS+FLAC%5D%5BTntvillage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"529771d7e184fd46370dc89abb54a58c892852c9","infoHashBuffer":{"type":"Buffer","data":[82,151,113,215,225,132,253,70,55,13,200,154,187,84,165,140,137,40,82,201]},"announce":[],"urlList":[]}}