{"title":"Old Man Markley - Down Side Up [2013][WEB,FLAC]","uid":9277035,"size":305845595,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:52ad4bec5a75920bcb5618f6ee176fe7dd7ebb33&amp;dn=Old+Man+Markley+-+Down+Side+Up+%5B2013%5D%5BWEB%2CFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"dickspic","files":14,"time":1385878553,"description":"Artist: Old Man Markley\nRelease: Down Side Up\nReleased: 2013\nLabel: Fat Wreck\nCatalog#:\nFormat: FLAC / Lossless / WEB\nCountry: USA\nStyle: Americana,cowpunk\n\nimage\n\n\n01. Blood On My Hands (4:06)\n02. Rehearsal (3:53)\n03. America's Dreaming (3:01)\n04. Come Around Here (3:27)\n05. Blindfold (2:58)\n06. So Much More (3:15)\n07. Hard To Understand (3:10)\n08. Beyond The Moon (2:57)\n09. Hand Me Down (2:13)\n10. Up Side Down (3:31)\n11. Fastbreak (2:03)\n12. Train Of Thought (3:35)\n13. Too Soon For Goodnight (3:01)\n\n\n\nOld Man Markley are not your run-of-the-mill band. They're not a traditional bluegrass band, nor are they a typical punk band. Instead, the band meld elements of both styles into a cross-pollinated &quot;newgrass&quot; amalgam that has resulted in a boot stomping good time for fans around the world. The seven piece band - rounded out by Johnny Carey (vocals, guitar), Annie DeTemple (autoharp, vocals), Joey Garibaldi (bass, vocals), Jeff Fuller (drums), Ryan Markley (washboard), John Rosen (banjo, vocals) and Katie Weed (fiddle, vocals) - roared onto the scene in 2010. Their unique blend of punk rock sensibilities, ear for pop melodies and deeply rooted love for bluegrass caught the ear of Fat Wreck Chords, who released OMM's debut album, Guts n' Teeth, in 2011. Word quickly spread of the their incredible live shows, and over the next few years the band found themselves scootin boots on stage with the likes of Flogging Molly, Bad Religion, The Reverend Horton Heat, NOFX, The Descendents and Against Me!. Old Man Markley were quickly embraced by the punk rock community with their incendiary live performances, and at the same time the band were also warmly accepted by bluegrass fans, earning them a #8 debut on the Billboard Bluegrass chart with the release of Guts n' Teeth. From rivets to rhinestones, even the world of glossy country music embraced OMM, yielding them a slot at California's country festival mecca, Stagecoach. After two years of relentless touring and winning over thousands of fans, Old Man Markley returned to the little house in Southern California where it all began to record their follow-up album, Down Side Up. &quot;We wrote and recorded the new songs last summer, in a studio we built in the house where we have been practicing since the band started,&quot; states Garibaldi. With Fat Wreck Chords owner and NOFX frontman Fat Mike in the producer's chair alongside singer/guitarist Johnny Carey, Old Man Markley plucked, bowed, and strummed their way through thirteen galloping new songs. &quot;With the support of Fat Mike, we went out on a limb with this album,&quot; says Carey. &quot;We didn't restrict our creativity and can't wait for the world to hear the variety on our album.&quot; A more cohesive unit than ever before, Old Man Markley overflows with a passion for their craft and for each other that is both audible and palpable as their instruments dance between seamless harmonies. &quot;The songs on Down Side Up are the result of touring for two years and waking up together in cities across the world, of discovering new worlds while still missing home, of stories that we've wanted to tell for ages, of melodies that permeated our minds and then soundchecks, and of ideas that took shape truly as a collaboration between all seven of us,&quot; adds Weed","torrent":{"xt":"urn:btih:52ad4bec5a75920bcb5618f6ee176fe7dd7ebb33","amp;dn":"Old+Man+Markley+-+Down+Side+Up+%5B2013%5D%5BWEB%2CFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52ad4bec5a75920bcb5618f6ee176fe7dd7ebb33","infoHashBuffer":{"type":"Buffer","data":[82,173,75,236,90,117,146,11,203,86,24,246,238,23,111,231,221,126,187,51]},"announce":[],"urlList":[]}}