{"title":"Da Vinci's Ghost The Untold Story of The World's Most Famous Dra","uid":9313423,"size":7133052,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52cffe1ddef072d2c97b870d08e4ff021f36c25b&amp;dn=Da+Vinci%27s+Ghost+The+Untold+Story+of+The+World%27s+Most+Famous+Dra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"420weedman","files":4,"time":1386437109,"description":"Vitruvian Man is the world's most famous drawing, by one of the world's most famous artists. The image - named after a Roman architect and engineer, Vitruvius - has become visual shorthand for artistic genius and scientific inquiry, and yet nobody knows anything about it. In Da Vinci's Ghost, critically acclaimed historian Toby Lester examines the forces that converged in 1490 to turn an idea that had been around for centuries into this iconic image, bringing the ghost of an unknown Leonardo da Vinci back to life. Rooted in little-known episodes of the artist's colourful career, and taking in ideas including theories of the cosmos, Roman land-surveying and the relationship between anatomy and architecture, the book tells the story of his evolving, lifelong study of the human body, restoring in vivid detail the intellectual and cultural spheres of fifteenth-century Florence and Milan. Beautifully illustrated with da Vinci's drawings and those of his predecessors, Da Vinci's Ghost is both a personal story and a grand saga of intellectual discovery that brilliantly reconstructs the artistry and scholarship of one of the world's greatest creative minds.","torrent":{"xt":"urn:btih:52cffe1ddef072d2c97b870d08e4ff021f36c25b","amp;dn":"Da+Vinci%27s+Ghost+The+Untold+Story+of+The+World%27s+Most+Famous+Dra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52cffe1ddef072d2c97b870d08e4ff021f36c25b","infoHashBuffer":{"type":"Buffer","data":[82,207,254,29,222,240,114,210,201,123,135,13,8,228,255,2,31,54,194,91]},"announce":[],"urlList":[]}}