{"title":"Daddy Yankee - La Despedida (2nafish)","uid":6071190,"size":98766852,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:52f75a4476132f15373cb356df0a6e953cde61d1&amp;dn=Daddy+Yankee+-+La+Despedida+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"2nafish","files":1,"time":1293581364,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logo and is in Spanish.\n\n\n&quot;La Despedida&quot; (English: Farwell) is a single by Puerto Rican Reggaeton singer Daddy Yankee. It is the third official single released on August 4, 2010 from his album Daddy Yankee Mundial. The official remix of the song features Puerto Rican singer Tony Dize.\n\nThe music video for the song was released in August 23, 2010. It was directed by Georgie Rivera and Juan Esteban SuÃƒÂ¡rez. It shows the artist's wife going to the doctor for a visit and she finds out something shocking, and leaves the artist's home.\n\nMatthew Wilkening from Aol Radio Blog said that the song &quot;combines an infectious mid-tempo dance beat with Latin horns and percussion, as Daddy Yankee bids farewell -- but seemingly refuses to give up a lover who is moving away from him, despite his friends' best advice&quot;.\n\nDaddy Yankee Mundial (English: Daddy Yankee Worldwide) (also known as Mundial) is the name of the ninth studio album by Puerto Rican reggaeton singer Daddy Yankee through El Cartel Records released on April 27, 2010.\n\nUnlike his previous albums, himself describes the album with a mixture of Reggaeton, Merengue, perico ripiao, soca and dance hall. Some recorded tracks with Don Omar, Luis Fonsi, Barrington Levy and Jowell &amp; Randy has been rejected of recycles. Before the release, Daddy Yankee confirmed that the album include 13 tracks plus 3 bonus tracks on the iTunes version. The album doesn't include the tracks recorded with Luis Fonsi and Don Omar since Yankee signed for the album to be released under Sony Music and not Universal Music Group. He had also recorded a new song named &quot;Intenso&quot; which was released on his birthday for his fans, but said that it was not going to be on this material. The album was first set to be released on October 13 2009, then November 17 2009, it was finally released on April 27, 2010.\n\n    * &quot;Grito Mundial&quot; was released as the official first single on October 8, 2009 and digitally on October 20, 2009 the music video was filmed in Argentina &amp; Brazil and was premiered on January 20, 2010, the song peaked on #7 on the Billboard Latin Rhythm Airplay. The song was chosen as the official anthem for the 2010 FIFA World Cup but D.Y. would not owned 100% of the song on profits so he declined to give it to the federation and they went forShakira's Waka Waka (This Time for Africa) instead.\n\n    * &quot;Descontrol&quot; is the second single released airplay on January 12, 2010 and digitally on February 23, 2010 the song topped on the Billboard Latin Rhythm Airplay, a music video was filmed for the song in New York and was released on May 17, 2010.\n\n    * &quot;La Despedida&quot; is the third single released on August 4, 2010. The song has become the most successful of the album, reaching #4 in both Billboard Top Latin Songs and Latin Pop Songs. Also, the song has entered the top 10 in many latin countries due to heavy airplay.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:52f75a4476132f15373cb356df0a6e953cde61d1","amp;dn":"Daddy+Yankee+-+La+Despedida+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52f75a4476132f15373cb356df0a6e953cde61d1","infoHashBuffer":{"type":"Buffer","data":[82,247,90,68,118,19,47,21,55,60,179,86,223,10,110,149,60,222,97,209]},"announce":[],"urlList":[]}}