{"title":"Visual Meetings - Tools to Transform Group Productivity [Epub] [","uid":8011258,"size":6543232,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:531e289cfd12b5ead52f9da978549d9bf3f06f34&amp;dn=Visual+Meetings+-+Tools+to+Transform+Group+Productivity+%5BEpub%5D+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"KatQwerty","files":3,"time":1357999906,"description":"\n \nPublication Date: August 9, 2010\nUse eye-popping visual tools to energize your people!\n\nJust as social networking has reclaimed the Internet for human interactivity and co-creation, the visual meetings movement is reclaiming creativity, productivity, and playful exchange for serious work in groups.\n\nVisual Meetings explains how anyone can implement powerful visual tools, and how these tools are being used in Silicon Valley and elsewhere to facilitate both face-to-face and virtual group work. This dynamic and richly illustrated resource gives meeting leaders, presenters, and consultants a slew of exciting tricks and tools, including\n\nGraphic recording, visual planning, story boarding, graphic templates, idea mapping, etc.\nCreative ways to energize team building, sales presentations, staff meetings, strategy sessions, brainstorming, and more\nGetting beyond paper and whiteboards to engage new media platforms\nUnderstanding emerging visual language for leading groups\nUnlocking formerly untapped creative resources for business success, Visual Meetings will help you and your team communicate ideas more effectively and engagingly.\n \n \n \n \n \n \n ","torrent":{"xt":"urn:btih:531e289cfd12b5ead52f9da978549d9bf3f06f34","amp;dn":"Visual+Meetings+-+Tools+to+Transform+Group+Productivity+%5BEpub%5D+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"531e289cfd12b5ead52f9da978549d9bf3f06f34","infoHashBuffer":{"type":"Buffer","data":[83,30,40,156,253,18,181,234,213,47,157,169,120,84,157,155,243,240,111,52]},"announce":[],"urlList":[]}}