{"title":"Democracy Of Sound - Music Piracy And The Remaking Of American C","uid":9636420,"size":2940534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53816d0a014e3a9cfa2b4c9c0329c64660167659&amp;dn=Democracy+Of+Sound+-+Music+Piracy+And+The+Remaking+Of+American+C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1392851516,"description":"Democracy of Sound: Music Piracy and the Remaking of American Copyright in the Twentieth Century by Alex Sayf Cummings\n\n\nFormat: mobi/epub\nGenre: Music\nPrint Length: 272 pages\nRelease Date: 5 April 2013\n\nIt was a time when music fans copied and traded recordings without permission. An outraged music industry pushed Congress to pass anti-piracy legislation. Yes, that time is now; it was also the era of Napster in the 1990s, of cassette tapes in the 1970s, of reel-to-reel tapes in the 1950s, even the phonograph epoch of the 1930s. Piracy, it turns out, is as old as recorded music itself.\n\nIn Democracy of Sound, Alex Sayf Cummings uncovers the little-known history of music piracy and its sweeping effects on the definition of copyright in the United States. When copyright emerged, only visual material such as books and maps were thought to deserve protection; even musical compositions were not included until 1831. Once a performance could be captured on a wax cylinder or vinyl disc, profound questions arose over the meaning of intellectual property. \n\nIs only a written composition defined as a piece of art? If a singer performs a different interpretation of a song, is it a new and distinct work? Such questions have only grown more pressing with the rise of sampling and other forms of musical pastiche. Indeed, music has become the prime battleground between piracy and copyright. It is compact, making it easy to copy. And it is highly social, shared or traded through social networks - often networks that arise around music itself. But such networks also pose a counter-argument: as channels for copying and sharing sounds, they were instrumental in nourishing hip-hop and other new forms of music central to American culture today. Piracy is not always a bad thing.\n\nAn insightful and often entertaining look at the history of music piracy, Democracy of Sound offers invaluable background to one of the hot-button issues involving creativity and the law.\n\nAuthor:\n\nAlex Sayf Cummings was born in Charleston, WV, the son of a Libyan father and American mother. He grew up in West Virginia, Indiana, and North Carolina and earned a BA at the University of North Carolina at Charlotte, before pursuing a PhD in History at Columbia University, where he studied with Elizabeth Blackmar and Barbara Fields. He now serves as an assistant professor of History at Georgia State University and a co-editor of the blog Tropics of Meta. His work has appeared in the Journal of American History, the Brooklyn Rail, Salon, and Southern Cultures, among other publications, and his first book, Democracy of Sound: Music Piracy and the Remaking of American Copyright in the Twentieth Century, was published by Oxford University Press in 2013.","torrent":{"xt":"urn:btih:53816d0a014e3a9cfa2b4c9c0329c64660167659","amp;dn":"Democracy+Of+Sound+-+Music+Piracy+And+The+Remaking+Of+American+C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53816d0a014e3a9cfa2b4c9c0329c64660167659","infoHashBuffer":{"type":"Buffer","data":[83,129,109,10,1,78,58,156,250,43,76,156,3,41,198,70,96,22,118,89]},"announce":[],"urlList":[]}}