{"title":"ImTOO iPhone Transfer Platinum v4.0.0.0107","uid":6107331,"size":34461011,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:543c021ebbd7f3b6c9cd0af9491425336fa55e7b&amp;dn=ImTOO+iPhone+Transfer+Platinum+v4.0.0.0107&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"locobot12","files":-1,"time":1295213054,"description":"ImTOO iPhone Transfer Platinum makes it easy to transfer and backup videos, music, photos and eBooks from iPhone to computer/iTunes or from computer to iPhone and let you to copy any DVD movie/CD music/audio/video to iPhone, download and convert online videos in one-step, create iPhone ringtones from your favorite music or movies. Works perfectly with iPhone 4, iPhone 3GS, iPhone 3G and even iPod touch, and fully supports multiple devices simultaneously.\n\nManage, Organize and Edit iPhone Multimedia Files\n\nImTOO offers the best solution to manage, organize and edit multimedia files for iPhone. You can establish photo albums and playlists as wish, preview media files within the built-in player, logon the most popular online video websites in embedded web browser and etc. with ImTOO iPhone Transfer Platinum, you can have any video, audio and DVD on your iPhone.\n\n\nKey Features\n\n* Fully support output files for iPhone 4, iPhone 3G, iPhone 3GS, iPod Touch, iPod Touch 3, iPod Nano 5G, iPod Nano Chromatic, iPod Classic, iPod Shuffle, iPod Shuffle 4GB, iPod Video.\n* Fully supports iOS 4.2, iPhone 4 and iTunes 10.\n* Built-in web browser enables you to view top popular online video websites, including YouTube, Metacafe, Dailymotion, Break, Vimeo, Revver, Blip, Vidilife and Stickam with ease.\n* NVIDIA GPU acceleration is enabled to accelerate the processing speed and promote the performance in converting and transferring operations.\n* Simply create new photo albums and playlists or delete existing ones on iPhone easily.\n* Provides a convenient built-in player for preview DVD movies, photos or videos shot by the devices and export them willingly.\n* Optimize the profiles when importing or converting multimedia files into devices.\n* Proxy server configuration allows you to configure the network to your preference.\n* Allows you to edit iPhone audio ID3 tags such as title, artist, album, artwork, rating, genre and other information as you like.\n* Recognize the connecting devices automatically and immediately.\n* Multi-lingual interfaces are offered in language of English, French, Italian, Spanish, German, Japanese, Simplified or Traditional Chinese.\n\n\nHome Page - http://www.imtoo.com/iphone-transfer-platinum.html\n\nSeed and share !! \n\nClick on my username for more!! ","torrent":{"xt":"urn:btih:543c021ebbd7f3b6c9cd0af9491425336fa55e7b","amp;dn":"ImTOO+iPhone+Transfer+Platinum+v4.0.0.0107","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"543c021ebbd7f3b6c9cd0af9491425336fa55e7b","infoHashBuffer":{"type":"Buffer","data":[84,60,2,30,187,215,243,182,201,205,10,249,73,20,37,51,111,165,94,123]},"announce":[],"urlList":[]}}