{"title":"Ermanno OLMI - The Tree of Wooden Clogs (1978) - PALME D'OR","uid":4188982,"size":1471497315,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:543e8e3ef6ef36500835847b92d7078d24d615af&amp;dn=Ermanno+OLMI+-+The+Tree+of+Wooden+Clogs+%281978%29+-+PALME+D%5C%27OR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"zeinabqureshi","files":6,"time":1210839948,"description":"L'Albero degli zoccoli (1978)\nErmanno Olmi\nRip# 12, Palme d'Or (1978)\n\n---=Links=---------------------------------------------------------------------------\nIMDb Link: http://www.imdb.com/title/tt0077138/\nIMBb Rating: 8.1/10\n\n---=Notes=---------------------------------------------------------------------------\nThe only other version available on torrent is probably the full DVD (~ 8 GB) at the piratebay. This is a long and critically acclaimed film, a bit difficult to sit through due to its extremely slow pace. It depicts rustic life in a Lombardy town. The language spoken is not Italian but a Lombard dialect. \n\n---=Wiki=----------------------------------------------------------------------------\nL'Albero degli zoccoli is a 1978 Italian film written and directed by Ermanno Olmi. It was released as The Tree of Wooden Clogs in the USA and as The Tree with the Wooden Clogs in the UK. The film concerns Italian peasant life in the late 19th century. It has some similarities with the earlier Italian neorealist movement, in that it focuses on the lives of the poor, and the parts were played by real farmers and locals, rather than professional actors. It won fourteen awards including the Palme d'or at Cannes and the CÃƒÂ©sar Award for Best Foreign Film. The original version of the movie is spoken in Bergamasque, an Eastern Lombard dialect.\n\nIt includes footage of several real animal killings, including a pig being gutted while still partially alive.\n\n---=IMDb Comment=--------------------------------------------------------------------\nA mosaic of peasant life in Lombardy at the turn of the twentieth century that slowly moves along for three hours but never comes close to losing interest thanks to the wealth of details and (though amateur) moving performances. In the title lies the heartwrenching conclusion abruptly reached after the meandering and soulful journey that is taken into the lives of a group of peasant families, with the butchering of a goose and later a pig, a marriage, a boatride to Milan, and a dinner amongst the sisters of a convent while the stirrings of political change and repression stay mainly in the background but are there to see. While the focus is on the peasants, the world that the movie creates is more like being there than any other film around.\n\n---=Rip Info=------------------------------------------------------------------------\n\t---=Audio=-------------------------------------\n\t0x0055 MPEG-1 Layer 3\n\t48000Hz  128 kb/s tot , Joint Stereo \n\tInterleave: 67 ms, preload 504\n\t\n\t---=Video=-------------------------------------\n\t512 x 384 @ 29.970 fps, XviD\n\t------=CD1=------\n\t1:36:01, 172,641 frames\n\tQf 0.191/965 kbps\n\t------=CD2=------\n\t1:22:36, 148,506 frames\n\tQf 0.178/1046 kbps\n\n\t---=Size=--------------------------------------\n\tCD1: 734,400,512 bytes (172,641 frames)\n\tCD2: 732,876,800 bytes (148,506 frames)\n\n\t---=Subtitles=---------------------------------\n\tEnglish subtitles in SUB/IDX format.\n\t\t\n\t---=Credits=-----------------------------------\n\tThanks to Tansir and friends at DVD World\n\tRip and subtitles by -=:ZEiNAB:=-\n\t\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:543e8e3ef6ef36500835847b92d7078d24d615af","amp;dn":"Ermanno+OLMI+-+The+Tree+of+Wooden+Clogs+%281978%29+-+PALME+D%5C%27OR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"543e8e3ef6ef36500835847b92d7078d24d615af","infoHashBuffer":{"type":"Buffer","data":[84,62,142,62,246,239,54,80,8,53,132,123,146,215,7,141,36,214,21,175]},"announce":[],"urlList":[]}}