{"title":"Computers as Theatre - Prepare Yourself - Brenda Laurel - Mantes","uid":9426358,"size":2787699,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5481a74c4070cb1e82379388eecc8c13063dca76&amp;dn=Computers+as+Theatre+-+Prepare+Yourself+-+Brenda+Laurel+-+Mantes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"MANTESH","files":1,"time":1388705488,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51cKXwhiSfL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51cKXwhiSfL.jpg&lt;/a&gt;\n\n\nComputers as Theatre - Prepare Yourself  Brenda Laurel , 2 edition\n\nPublisher: Addison-Wesley Professional\nBrenda Laurel \n2013\nLanguage: English\nISBN-10: 0321918622\nISBN-13: 978-0321918628 \n272 Pages \nPDF\n2.65 MB\n\nBrenda Laurel's Computers as Theatre revolutionized the field of human-computer interaction, offering ideas that inspired generations of interface and interaction designers-and continue to inspire them. Laurel's insight was that effective interface design, like effective drama, must engage the user directly in an experience involving both thought and emotion. Her practical conclusion was that a user's enjoyment must be a paramount design consideration, and this demands a deep awareness of dramatic theory and technique, both ancient and modern. \n\nNow, two decades later, Laurel has revised and revamped her influential work, reflecting back on enormous change and personal experience and forward toward emerging technologies and ideas that will transform human-computer interaction yet again. Beginning with a clear analysis of classical drama theory, Laurel explores new territory through the lens of dramatic structure and purpose. Computers as Theatre, Second Edition, is directed to a far wider audience, is written more simply and elegantly, is packed with new examples, and is replete with exciting and important new ideas. \n\nThis book\n\nDraws lessons from massively multiplayer online games and systems, social networks, and mobile devices with embedded sensors \n\nIntegrates values-driven design as a key principle \n\nIntegrates key ideas about virtual reality \n\nCovers new frontiers, including augmented reality, distributed and participatory sensing, interactive public installations and venues, and design for emergence\n\nOnce more, Brenda Laurel will help you see the connection between humans and computers as you never have before-and help you build interfaces and interactions that are pleasurably, joyously right!\n\n","torrent":{"xt":"urn:btih:5481a74c4070cb1e82379388eecc8c13063dca76","amp;dn":"Computers+as+Theatre+-+Prepare+Yourself+-+Brenda+Laurel+-+Mantes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5481a74c4070cb1e82379388eecc8c13063dca76","infoHashBuffer":{"type":"Buffer","data":[84,129,167,76,64,112,203,30,130,55,147,136,238,204,140,19,6,61,202,118]},"announce":[],"urlList":[]}}