{"title":"Eric R. Kandel - The Age of Insight (2012)","uid":9060637,"size":78598614,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:54a3c10bb258843edb9bac51809f3b2271274f87&amp;dn=Eric+R.+Kandel+-+The+Age+of+Insight+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"workerbee","files":-1,"time":1382035838,"description":"\nEric R. Kandel - The Age of Insight: The Quest to Understand the Unconscious in Art, Mind, and Brain, from Vienna 1900 to the Present (Random House, 2012).\n\nISBN: 9781400068715 | 656 pages | EPUB &amp; MOBI\n\n\nA brilliant book by Nobel Prize winner Eric R. Kandel, THE AGE OF INSIGHT takes us to Vienna 1900, where leaders in science, medicine, and art began a revolution that changed forever how we think about the human mind -- our conscious and unconscious thoughts and emotions -- and how mind and brain relate to art.\n\nAt the turn of the century, Vienna was the cultural capital of Europe. Artists and scientists met in glittering salons, where they freely exchanged ideas that led to revolutionary breakthroughs in psychology, brain science, literature, and art. Kandel takes us into the world of Vienna to trace, in rich and rewarding detail, the ideas and advances made then, and their enduring influence today.\n\nThe Vienna School of Medicine led the way with its realization that truth lies hidden beneath the surface. That principle infused Viennese culture and strongly influenced the other pioneers of Vienna 1900. Sigmund Freud shocked the world with his insights into how our everyday unconscious aggressive and erotic desires are repressed and disguised in symbols, dreams, and behavior. Arthur Schnitzler revealed women's unconscious sexuality in his novels through his innovative use of the interior monologue. Gustav Klimt, Oscar Kokoschka, and Egon Schiele created startlingly evocative and honest portraits that expressed unconscious lust, desire, anxiety, and the fear of death.\n\nKandel tells the story of how these pioneers -- Freud, Schnitzler, Klimt, Kokoschka, and Schiele -- inspired by the Vienna School of Medicine, in turn influenced the founders of the Vienna School of Art History to ask pivotal questions such as: What does the viewer bring to a work of art? How does the beholder respond to it? These questions prompted new and ongoing discoveries in psychology and brain biology, leading to revelations about how we see and perceive, how we think and feel, and how we respond to and create works of art.\n\nKandel, one of the leading scientific thinkers of our time, places these five innovators in the context of today's cutting-edge science and gives us a new understanding of the modernist art of Klimt, Kokoschka, and Schiele, as well as the school of thought of Freud and Schnitzler. Reinvigorating the intellectual enquiry that began in Vienna 1900, THE AGE OF INSIGHT is a wonderfully written, superbly researched, and beautifully illustrated book that also provides a foundation for future work in neuroscience and the humanities. It is an extraordinary book from an international leader in neuroscience and intellectual history.\n\n\nReviews\n\n&quot;In a polymathic performance, a Nobel laureate weaves together the theories and practices of neuroscience, art and psychology to show how our creative brains perceive and engage art -- and are consequently moved by it. . . A transformative work that joins the hands of Art and Science and makes them acknowledge their close kinship.&quot; -- Kirkus Reviews\n\n&quot;A fascinating synthesis of art, history, and science that is also accessible to the general reader. A distinctive and important title that is also a pleasure to read.&quot; -- Library Journal\n\n&quot;Engrossing. . . Nobel-winning neuroscientist Kandel excavates the hidden workings of the creative mind. Kandel writes perceptively about a range of topics, from art history -- the book's color reproductions alone make it a great browse -- to dyslexia. . . Kandel captures the reader's imagination with intriguing historical syntheses and fascinating scientific insights into how we see -- and feel -- the world.&quot; -- Publisher's Weekly\n\n&quot;A fascinating meditation on the interplay among art, psychology and brain science. The author, who fled Vienna as a child, has remained captivated by Austrian artists Gustav Klimt, Oskar Kokoschka and Egon Schiele, each of whom was profoundly influenced by Sigmund Freud and by the emerging scientific approach to medicine in their day . . . [calls] for a new, interdisciplinary approach to understanding the mind, one that combines the humanities with the natural and social sciences.&quot; -- Scientific American\n\n&quot;Eric Kandel's book is a stunning achievement, remarkable for its scientific, artistic, and historical insights.  No one else could have written this book -- all its readers will be amply rewarded.&quot; -- Howard Gardner, Hobbs Professor of Cognition and Education, Harvard Graduate School of Education\nÂ \n&quot;Eric Kandel's training as a psychiatrist and his vast knowledge of how the brain works enrich this thoroughly original exploration of the relationship between the birth of psychoanalysis, Austrian Expressionism, and Modernism in Vienna.&quot; -- Margaret Livingstone, Professor of Neurobiology, Harvard Medical School\nÂ \n&quot;This is the book that Charles Darwin would have produced, had he chosen to write about art and aesthetics. Kandel, one of the great pioneers of modern neuroscience, has effectively bridged the 'two cultures': science and humanities. This is a task that many philosophers, especially those called 'new mysterians,' had considered impossible.&quot; -- V. S. Ramachandran, author of The Tell-Tale Brain\n\n&quot;Eric Kandel has created a masterpiece, synthesizing brain, mind, and art like no one has before.&quot; -- Joseph LeDoux, NYU, author of The Emotional Brain and Synaptic Self\n","torrent":{"xt":"urn:btih:54a3c10bb258843edb9bac51809f3b2271274f87","amp;dn":"Eric+R.+Kandel+-+The+Age+of+Insight+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54a3c10bb258843edb9bac51809f3b2271274f87","infoHashBuffer":{"type":"Buffer","data":[84,163,193,11,178,88,132,62,219,155,172,81,128,159,59,34,113,39,79,135]},"announce":[],"urlList":[]}}