{"title":"MX vs. ATV Unleashed (GOG)","uid":12667849,"size":575038345,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:54aa8701a325b0fa29659fdea0cbcd96f75a7a71&amp;dn=MX+vs.+ATV+Unleashed+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mercs215","files":4,"time":1446396753,"description":"Install instructions:\r\n- Run &quot;setup_mx_vs_atv_unleashed_2.0.0.3.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: MX VS. ATV UNLEASHED\r\nGenre: Racing - Simulation - Off-road\r\nWorks on: Windows (XP, Vista, 7, 8, 10)\r\nLanguages: Audio and text: English\r\nModes: Single-player\r\nReleased: January 16, 2006\r\nSize: 561 MB\r\nCompany: Rainbow Studios / Nordic Games\r\nRating:\tESRB Rating: Everyone (with Blood, Mild Lyrics)\r\nStore page: http://www.gog.com/game/mx_vs_atv_unleashed\r\n\r\nAbout:\r\nRainbow Studios has mastered ATV’s, conquered motocross, and now redefines the genre they built on the PC. Rainbow Studios isn’t the only one building anymore, as the MX vs ATV Unleashed franchise introduces a track editor for the first time, allowing players to create the ultimate offroad environments.\r\nRace through miles of open terrain and vast environments in a multitude of vehicles vying to own the offroad. Immense freeworld areas boast a variety of specialized SuperMoto, Short track, Hill climb, and Waypoint races. Just when you think you’ve reached the pinnacle of racing, an assortment of freeworld challenges, freestyle competitions, and a variety of mini games await. Take on the racing world in an attempt to knock off motocross and ATV riders in over 50 technical supercross and rugged outdoor tracks. Throughout the season, motocross bikes and ATV’s collide on the same track to determine racing’s best machine. The most complete offroad experience unleashes the power into the players hands on the PC.\r\nTrack editor: create the ultimate off-road environment, take it online and race all challengers\r\nNew off-road vehicles: rip through the sand dunes in two new ATV models, launch off snow-capped mountains with a redesigned monster truck, or show off two new pimped out 4x4 golf karts to country-club friends\r\nNew racing events, mini-games, and freestyle challenges: SuperMoto, Short track, Hill climbs, Way point races, Monster Mash, Gap Jumps, and more\r\nNew outdoor freestyle: check your skills in pulling off over 40 rider stunts in this new game mode\r\nOpen class competition: race numerous off-road vehicles in six-player multiplayer races\r\nUltra-realistic physics: Rainbow's &quot;Rhythm Racing&quot; physics engine perfectly re-creates each vehicle's real-world handling to conquer all dangerous terrain\r\nRainbow Studios: the creators of Motocross Madness return to their PC roots with the ultimate offroad racing game\r\n\r\nRecommended system requirements - Windows: XP / Vista / 7 / 8 32 or 64 bit / 10 \r\nProcessor: 2.4 GHz Intel Pentium 4 or equivalent \r\nMemory: 512 MB RAM \r\nGraphics: nVidia GeForce 3 or ATI Radeon 8500 or equivalent with 64 MB of Video RAM \r\nDirectX: Version 9.0c \r\nHard Drive: 1500 MB available space \r\nSound Card: DirectX compatible card","torrent":{"xt":"urn:btih:54aa8701a325b0fa29659fdea0cbcd96f75a7a71","amp;dn":"MX+vs.+ATV+Unleashed+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54aa8701a325b0fa29659fdea0cbcd96f75a7a71","infoHashBuffer":{"type":"Buffer","data":[84,170,135,1,163,37,176,250,41,101,159,222,160,203,205,150,247,90,122,113]},"announce":[],"urlList":[]}}