{"title":"The Lessons of History","uid":14483448,"size":323188434,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:54ee243d11f590ce25cc9f2067e2e04bc5d8bbf7&amp;dn=The+Lessons+of+History&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"oinky222","files":81,"time":1462045053,"description":"In this illuminating and thoughtful book, Will and Ariel Durant have succeeded in distilling for the reader the accumulated store of knowledge and experience from their four decades of work on the ten monumental volumes of The Story of Civilization. The result is a survey of human history, full of dazzling insights into the nature of human experience, the evolution of civilization, the culture of man. With the completion of their life's work they look back and ask what history has to say about the nature, the conduct and the prospects of man, seeking in the great lives, the great ideas, the great events of the past for the meaning of man's long journey through war, conquest and creation -- and for the great themes that can help us to understand our own era.\r\nTo the Durants, history is &quot;not merely a warning reminder of man's follies and crimes, but also an encouraging remembrance of generative souls...a spacious country of the mind, wherein a thousand saints, statesmen, inventors, scientists, poets, artists, musicians, lovers, and philosophers still live and speak, teach and carve and sing....&quot;\r\nDesigned to accompany the ten-volume set of The Story of Civilization, The Lessons of History is, in its own right, a profound and original work of history and philosophy","torrent":{"xt":"urn:btih:54ee243d11f590ce25cc9f2067e2e04bc5d8bbf7","amp;dn":"The+Lessons+of+History","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54ee243d11f590ce25cc9f2067e2e04bc5d8bbf7","infoHashBuffer":{"type":"Buffer","data":[84,238,36,61,17,245,144,206,37,204,159,32,103,226,224,75,197,216,187,247]},"announce":[],"urlList":[]}}