{"title":"FTV Girls - Sandy &amp; Yana - Naked For All","uid":6105590,"size":236439460,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:550840b36daafbf3bd379649710314933132e78e&amp;dn=FTV+Girls+-+Sandy+%26+Yana+-+Naked+For+All&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"phatwarez","files":-1,"time":1295143920,"description":"FTV Girls - Sandy &amp; Yana - Naked For All\n\t\t\t\nSandy's Comments:  It was so cold in the morning!  I'm not very good in cold weather and I remember in Phoenix when I came it was cold too.  I know its not anything below 70 degrees but I'm much better in hot weather.  The photographer made us run around and that warmed me up a little.  The waves were very big and I wasn't going to try swimming there.  We got naked and ran around which attracted the guys who where hanging around there.  They started following us every time we would get naked again.  Jana loved it but I didn't want them to see us using toys, it would bother me.  We went to a place with a lot of rocks at a cliff and did some photos where they could not see.  When we first came to Hawaii from the airport the photographer took us to a toy store to pick out some toys and together we chose this pink one but I didn't think we were going to use it on the beach!  I was sore from yesterday's fisting so I wore it and I used it on Jana.  She likes the penetration and bigger toys but I prefer smaller vibrators.  The guys found us after a while and so we stopped and went back.  Even Jana seemed upset that they came all this way to watch.  But she is always friendly to people and let them watch us showering naked when we got back.  I didn't mind, because I had got used to being naked in front of people in Hawaii.  We finally washed up and went for lunch and I was very hungry and thirsty.  It was our last day in Hawaii and we were leaving in the afternoon so we took a lot of pictures together.  Looking back I miss Hawaii already and I wish I would have stayed longer and spent time by myself there not just for shoot but for fun and relaxation too.\nYana's Comments:  We got up at 5 in the morning to get ready then left to the beach at 6am.  I'm not a morning person but I was excited to come to this place!  Some really nicely built young surfer guys were watching but none of them were really that cute in the face.  Still I luv to get them all excited about us and so I told the photographer we should get close to them and let them watch us!  They all had smiles on their faces because its not something they see every day!   I'm not sure if they thought maybe they would get lucky with us because they started following us wherever we'd go.  The big fun for me was that strap-on toy which is such a turn-on for me.  Just the thought of Sandy fucking my pussy like she's a guy is so hot.  Doing it at the beach makes it hotter.  I wanted to keep going in different positions but the surfers found us and wouldn't leave.  Oh well so the photographer did video of the sand in my pussy!  Fun!  I did some more pole dancing later and some fat lady high up in one of the balconies shouted insults at us.  Well she's just jealous!  Funny how quickly she started shouting insults, I mean I hadn't even had my butt out yet!  At the marina Sandy got daring and was touching jellyfish in the water.  Bad girl!  I looked for crabs.  They're less dangerous.  So bye for now, I can come back and visit anytime!\n\nScreens (also in torrent):\n &lt;a href=&quot;\nhttp://kopimg.com/images/kopi_930_Sandy_Yana_Naked_For_All.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://kopimg.com/images/kopi_930_Sandy_Yana_Naked_For_All.jpg&lt;/a&gt;\n\nFile Size ------- 225mb\nLength ---------- 29:39\nResolution ------ 640x480\nContainer ------- mkv\nVideo Codec ----- x264\nAudio Codec ----- mp3\nFrame Rate ------ 30\n\np h a t w a r e z . t k\nMade possible by your donations.","torrent":{"xt":"urn:btih:550840b36daafbf3bd379649710314933132e78e","amp;dn":"FTV+Girls+-+Sandy+%26+Yana+-+Naked+For+All","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"550840b36daafbf3bd379649710314933132e78e","infoHashBuffer":{"type":"Buffer","data":[85,8,64,179,109,170,251,243,189,55,150,73,113,3,20,147,49,50,231,142]},"announce":[],"urlList":[]}}