{"title":"Math Kindergarten TLC Millie's Math Homeschool Educational","uid":4751250,"size":482481633,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5539489dea0db0adc00e78a0499a58aa13e8b250&amp;dn=Math+Kindergarten+TLC+Millie%5C%27s+Math+Homeschool+Educational&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"cezen","files":3,"time":1236197739,"description":"********************************************************************************\n*********************************************************************************\n\nSpecializing in Homeschool, educational and early elementary software, books and videos.\n\nYou WON'T find anyone else with my content unless they DL'd it from me and re-loaded it.\n\n\n\nI really need your help.  I cannot seed all these files alone \nand need your help.  Please seed to at least a ratio of 1.5 and much more if possible.\n\nIf you don't like Slow Down Load speeds, then help contribute to the total number of complete copies by seeding to much higher ratios (say 10 or so).\n\n\n\nReport virus, trojans and fakes to http://suprbay.org/forumdisplay.php?f=34\n\nFor MDI files please see http://www.byui.edu/help/outlookhelp/mailing/tif.htm for instructions.  \n\nFor .iso and .bin please follow directions below\n\n******************************************************************************\nTHIS FILE WAS CREATED USING ULTRA ISO. MOUNT OR BURN WITH ULTRA ISO.  IF YOU \n\nCHOOSE TO USE A DIFFERENT PROGRAM I WILL NOT BE ABLE TO ASSIST YOU IN ANY FASHION \n\nIN THE COMMENTS SECTION. HERE IS A LINK TO THE ULTRA ISO I USED.\n         &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4491898/UltraISO_premium_Edition-serial_incl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4491898/UltraISO_premium_Edition-serial_incl&lt;/a&gt;\n\n****************************************************************************\n\n2 CD's and 1 Movie (converted to MP4, TV Size 2)\n\n\nMillie's Math Learning System\n\nMillie's Math House\n\nBeginning Math Super Star Games\n\nTwo wonderful software programs on CD-ROM to help build critical math skills for children ages 3-7.\n\nMillie's Math House Kids, ages 3-7, develop a love of math when they play in Millie's Math House. \n\nThrough 7 fun filled activities that feel like play children learn about numbers, counting, addition, subtraction, patterns, problem solving, size, geometric shapes and much more. \n\nKids count critters, build mouse houses and create crazy-looking bugs while learning early math concepts. Kids learn to identify and compare shapes and sizes, create and complete patterns, learn numbers to 30 and practice addition and subtraction.\n\nHarley the Horse wants some cookies. At the Cookie Factory kids decorate cookies with 0 to 20 jellybeans to make Harley a tasty treat. Kids can make cookies as they choose or play a fun game. Harley will tell players how many jellybeans he wants on his cookies.\n\nDorothy Duck is asking What's My Number? Players must place the same number of objects on the stage as Dorothy has on hers. Kids explore simple addition and subtraction with Dorothy. Problems are illustrated with objects making understanding easy.\n\nLittle, Middle and Big need shoes. There are large, small and medium shoes. Kids have tons of fun choosing just the right shoes for these three crazy characters.\n\nThe Number Machine is lots of fun. Kids click on a number and watch as crazy critters pop-up and are counted out loud. Children can count 9 worms, 23 penguins and more. Kids can also play a fun game where they are asked to find a number.\n\nBuild-A-Bug is a zany game that kids go crazy over. Children choose bug parts, eyes, antennae, ears, feet, tails and spots and then a number to build their bug. In mode two kids are challenged to follow written and verbal directions to build just the right bug.\n\nPlayers will also explore shapes and discover patterns as they build mouse houses and play with Bing and Bong.\n\nActivities have two modes, Explore and Discover and Question and Answer. Kids learn while exploring freely in the first mode and can then play fun games in the second mode to test their knowledge.\n\nLearning math is a blast with Millie and her friends in Millie's Math House.\n\nBeginning Math Super Star Games: Children earn stars as they play fun games that help strengthen math skills. Kids can begin with paint by number and move up to addition and subtraction. Players learn about number recognition and order, counting, adding and subtracting while they play fun games that challenge them to complete problems quickly.\n\nThis set also contains a bonus DVD movie, The Great Alphabet Race (which I converted into MP4 for this UL)\n\nMinimum System Requirements:\n\nWindows 2000 SP4/XP (Home and Pro) SP 2/Vista, 200 MHz Pentium II, 64 MB RAM, 50 MB free disk space, 8X CD-ROM, 256 colors 640X480, sound card. DVD-ROM is needed to view bonus DVD movie.\n\n****************************************************************************\n\n\nI need YOUR help!\n\nPLEASE CHECK OUT MY OTHER HOMESCHOOL AND EDUCATIONAL SOFTWARE TORRENTS\n\n****************************************************************************\n****************************************************************************\n\n","torrent":{"xt":"urn:btih:5539489dea0db0adc00e78a0499a58aa13e8b250","amp;dn":"Math+Kindergarten+TLC+Millie%5C%27s+Math+Homeschool+Educational","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5539489dea0db0adc00e78a0499a58aa13e8b250","infoHashBuffer":{"type":"Buffer","data":[85,57,72,157,234,13,176,173,192,14,120,160,73,154,88,170,19,232,178,80]},"announce":[],"urlList":[]}}