{"title":"The Star Wars Holiday Special SWHS (1978) 480p Rifftrax 2ch v2","uid":11892969,"size":936050816,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:55a46abdb78b885510fc438546f2246130f0291a&amp;dn=The+Star+Wars+Holiday+Special+SWHS+%281978%29+480p+Rifftrax+2ch+v2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"bsg4you","files":3,"time":1431047307,"description":"Star.Wars.Holiday.Special.1978.480p.Rifftrax.2ch.v2.mkv\n\nDEFAULT AUDIO IS TRACK1 MOVIE PLUS RIFFTRAX\nFOR MOVIE ONLY SOUND SWITCH TO TRACK2 FOR 2.0\n\nTHIS IS BASED ON THE ZION HYBRID EDITION AND INCLUDES COMMERCIALS\n\nThe Star Wars Holiday Special (1978)\nvideo: 720x442 AVC\naudio1 (default): tv special plus Rifftrax AAC 2.0\naudio2: just tv special AAC 2.0\nintro1: 1st half of Rifftrax intro at start of riff\nopening and intro2: the opening riff comments about synching and donating along with the 2nd half of the Rifftrax intro are 1s after the last riff\nRifftrax released 2007.12.10 1h58m35s 935,986,656bytes\nRiffers: Bill Corbett, Kevin Murphy, Mike Nelson\nMovie IMDB: http://www.imdb.com/title/tt0193524/\n\nThis version2 has the following changes:\n* v2 has a newly remastered 2.0 Riff track using Chris's Dynamic Compressor on the movie and Level Speech on the riffs\n* v1's riff track was from the Zion Hybrid Edition\n* new 2.0 Riff audio audio track has more balanced and understandable riffs\n* the volume range for the riffs is much, much more consistent so even very quiet riff words are clear\n* v2 2.0 Riff is 196Kbps vs v1 at 160Kbps\n\nThis is a remux with the Rifftrax commentary added as the default audio track. The Rifftrax audio track has been newly remastered to ensure the riff comments are just loud enough to be clear when the movie is loud and not too loud when the movie is quiet. Please leave any feedback regarding the Rifftrax audio remastering.\n\nBig thanks to the Zion Hybrid Edition poster for this fantastic version from a WBBM Chicago 2nd generation VHS tape with commercials taken from the WMAR Baltimore broadcast. This share used the Zion Hybrid Edition (holiday special.iso 4.29GB) source to generate the AVC video track (2-pass, 700Kbps) and for the 2.0 Movie audio track.\n\nHow is this post different from the Zion Hybrid Edition DVD?\n1. smaller, 892MB vs 4.29GB, with equivalent video and audio quality\n2. the riff audio track is the DEFAULT but it can be changed to the non-riff version\n3. the original picture had black bars on the top and bottom that were removed\n4. new chapters with names!\n\nIf this Rifftrax was enjoyable, you haven't paid for it and you have some money to spare, please consider purchasing it via streaming or download (9.99USD) or make a general donation (5USD and up) - they take Bitcoin now too  \n\n[Note, the Star Wars Holiday Special Rifftrax was originally available as an mp3 commentary for 3.99USD but is now 9.99USD for an integrated streaming or integrated file download. Making a 5USD donation is an option now that the mp3 commentary is not sold.]\n\nPlease check out other Rifftrax, Battlestar Galactica, DC Comics, documentaries, Star Trek Enterprise and more at:\n &lt;a href=&quot; https://thepiratebay.se/user/bsg4you/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/bsg4you/&lt;/a&gt;  \n &lt;a href=&quot; https://kickass.so/user/bsg4you/uploads/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://kickass.so/user/bsg4you/uploads/&lt;/a&gt;  \nand leave any corrections, criticism, comments and requests.\n\nThanks, bsg4you\n\nPS - here are the new chapters ... Happy Life Day!\n\nCh01 Episode IV 1/2 The Star Wars Holiday Special\nCh02 Han and Chewie On The Run\nCh03 Opening Credits\nCh04 Chewbacca's Family Home On Kashyyyk\nCh05 Lumpy Watches Computer-Generated Circus Acrobats\nCh06 Malla Searches For Chewbacca But Gets Luke Instead\nCh07 Saun Dann At Trading Post Wookie Planet C\nCh08 Commercials: General Motors, Trailtracker By Kenner\nCh09 Cooking With Gormaanda: Preparing Bantha Rump\nCh10 Itchy's Mind Evaporator &quot;Experience&quot; With A Silver Haired Siren: &quot;This Minut...\nCh11 Leia And C-3PO Doing Something Somewhere\nCh12 Commercials: CBS Shows, Comtrex, ILGWU Union, Bell Phone, The Bible, Reggie!...\nCh13 Empire Troops Visit\nCh14 Holo Jefferson Starship: &quot;Light the Sky on Fire&quot;\nCh15 The Imperials Continue To Search And Be Mean\nCh16 The Animated Adventures Of Boba Fett In The Panna system\nCh17 Commercials: General Motors, Pillsbury, Hungry Jack, CBS News, Contact, Bobb...\nCh18 More Animated Adventures Of Boba Fett\nCh19 Imperials Trash Lumpy's Room\nCh20 A Video Of An Amorphiian Being Helps Lumpy Build A Transmitter\nCh21 Commercials: (All Hail!) Tobor The Robot, Revlon, Whirlpool The Eagle\nCh22 Mandatory Imperial Video &quot;Life on Tatooine&quot;\nCh23 Holey Headed Krelman Puts His Moves On Bartendress Ackmena\nCh24 Closing Time Song: &quot;Good Night, But Not Goodbye&quot;\nCh25 The Imperials Get Fooled By Lumpy's Transmitter Trick\nCh26 Commercials: Anacin, Woolite, Sheer Indulgence, Egg McMuffin, CBS Shows, Mer...\nCh27 The Empire's Only Smart Stormtrooper Figures Out Lumpy's Subterfuge\nCh28 Chewbacca And Han Save The Day!\nCh29 Life Day Holy Crystal Space Teleportation\nCh30 Commercials: FTD Florists, Fruit Of The Looms, Bell System, No Nonsense Pant...\nCh31 Princess Leia Sings The Life Day Song\nCh32 Chewbacca Has Life Day Induced Flashbacks\nCh33 Commercials: Twice Fresh, Star Wars Toys By Kenner, Colony Wine\nCh34 Pre-Feast Family Prayer To The Life Day God/Being/Alien/Concept\nCh35 Closing Credits\nCh36 The End! :)","torrent":{"xt":"urn:btih:55a46abdb78b885510fc438546f2246130f0291a","amp;dn":"The+Star+Wars+Holiday+Special+SWHS+%281978%29+480p+Rifftrax+2ch+v2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55a46abdb78b885510fc438546f2246130f0291a","infoHashBuffer":{"type":"Buffer","data":[85,164,106,189,183,139,136,85,16,252,67,133,70,242,36,97,48,240,41,26]},"announce":[],"urlList":[]}}