{"title":"Prepper's Essential Guide To Surviving a Natural Disaster, Dooms","uid":8196229,"size":325372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:565ae7859739a9fcb08db7beff5fbefc44d6bd6d&amp;dn=Prepper%27s+Essential+Guide+To+Surviving+a+Natural+Disaster%2C+Dooms&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"DaRule762","files":-1,"time":1361918631,"description":"One day a doomsday event will occur. It isn't a case of if; It is simply a case of when. Most of the human population won't survive this event. However, the preppers, as always, will be one step ahead and they will be ready to thrive.\n\nButch S Hardcastle is back; the author of &quot;Survive Doomsday - How to become a prepper and survive after a doomsday event&quot; offers more great guidance on how to prepare for the events that will change the world as we know it.\n\nIn this one hour lunch time read series book Butch looks at a range of specific doomsday events and how you would go about surviving each one.\n\nAmong the doomsday events covered are :\n\nSuper Volcano Eruption - find out how to thrive in zero light conditions, how to grow crops and which animals to start farming.\n\nWorldwide Economic Meltdown - What use is money, gold or silver when people are starving? None! Try trading boxes of ammo for cabbages not gold ingots. In a meltdown situation the prepper is the new billionaire; learn how to protect your assets from those that want to plunder and steal.\n\nFlu Pandemic - One of the more probable doomsday events, one of the scariest and actually one of the easiest to cope with for the prepper. Find out the authors top tips for surviving a pandemic.\n\nHurricane, Earthquake and Tornados - find out how a prepper will survive those critical first 72 hours after these localized doomsday events occurs.\n\nNuclear Attack - the cold war may be over but there are certain states out there that are looking to develop the bomb. What happens when they do?\n\nSolar Storm- a world without electrical devices is what awaits us if we get struck by a heavy solar storm. Don't bother starting the car; it won't work!\n\nAsteroid Strike - our world has been shaped by asteroid strikes, it will continue to be shaped for millions of years to come. How do you survive the aftermath?\n\nBasic prepping skills are essential for anyone who is serious about living a quality life after a doomsday event. Those that don't learn the skills now will starve and be left to fight it out with mob for those valuable resources like food and water. Don't leave it to chance. There will be no second chance.","torrent":{"xt":"urn:btih:565ae7859739a9fcb08db7beff5fbefc44d6bd6d","amp;dn":"Prepper%27s+Essential+Guide+To+Surviving+a+Natural+Disaster%2C+Dooms","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"565ae7859739a9fcb08db7beff5fbefc44d6bd6d","infoHashBuffer":{"type":"Buffer","data":[86,90,231,133,151,57,169,252,176,141,183,190,255,95,190,252,68,214,189,109]},"announce":[],"urlList":[]}}