{"title":"Otis Taylor - My World Is Gone [2013][EAC,log,cue. FLAC]","uid":8175190,"size":405168985,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:568302647f721eed51e872293b84cf914d2d8106&amp;dn=Otis+Taylor+-+My+World+Is+Gone+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"dickspic","files":25,"time":1361513140,"description":"Artist: Release: My World Is Gone\nMusicBrainz: 6bbee0cc-45e1-4055-ae5f-fb10357dcd4d\nReleased: 2013-02-12\nLabel: Telarc\nCountry: US\n\nTracklisting:\n\n01. My World Is Gone (04:27)\n02. Lost My Horse (03:30)\n03. Huckleberry Blues (04:39)\n04. Sand Creek Massacre Mourning (04:32)\n05. The Wind Comes In (05:48)\n06. Blue Rain in Africa (04:14)\n07. Never Been to the Reservation (05:02)\n08. Girl Friend's House (04:35)\n09. Jae Jae Waltz (04:09)\n10. Gangster and Iztatoz Chauffer (05:10)\n11. Coming With Crosses (06:05)\n12. Green Apples (03:52)\n13. Sit Across Your Table (04:29)\n\nOtis Taylor is among the most mercurial of bluesmen. While his signature vocal phrasing and playing -- whether it be on guitar, mandolin, or banjo -- is rooted in several blues traditions -- his music almost never strictly conforms. Taylor's ability to morph his elliptical &quot;trance blues&quot; into any sound he pursues is beguiling. My World Is Gone is no exception. Its title refers to a comment made to him by Native American guitarist Mato Nanji of Indigenous after a concert. Nanji and his guitar are key players on about half the record. Most of these cuts address various issues in Native American history (from the Indian's side), especially the ill treatment of this first world people by the United States government and populace. Yet, in typical Taylor fashion, there are a couple of curveballs too. The title track is introduced by his acoustic guitar and Anne Harris' lonesome fiddle, as he gradually unfolds his tale, Nanji's electric stings the ends of his lines. &quot;Huckleberry Blues&quot; is essentially a one-chord funk vamp, propelled by Todd Edmund's bassline, and equally elusive jazzman Ron Miles' labyrinthine groove-laden cornet. Taylor plays chunky, amplified banjo chords atop Larry Thompson's drum kit. An acoustic banjo and Thompson's military snare, introduce &quot;Sand Creek Massacre,&quot; the most haunting cut here. Nanji uses restraint in painting the margins with an array of guitar sounds and Miles flits and hovers in the mix. A B-3 shimmers in somewhere, and Taylor's voice, moaning and chantlike, brings the listener inside the drama. Americana is utilized in &quot;Blue Rain in Africa,&quot; a story song about the white buffalo, sacred in Native American culture as viewed from the point of view of an Indian protagonist who has only ever seen one on television because the buffalo were almost wiped from the earth in the middle of the 20th century. &quot;Girl Friend's House&quot; is pulsed by banjo, throbbing bass, brushed snare, and Miles' multi-tracked cornet. It's about a &quot;man who catches his wife in bed with a girlfriend and decides he wants to join in.&quot; Taylor's protagonist's pain and desire is evident in his groaning, grainy vocal. &quot;Jae Jae Waltz&quot; is a banjo- and cornet-fueled country waltz, while &quot;The Wind Comes In&quot; is slow blues rock with excellent guitar from Nanji. &quot;Coming with Crosses&quot; uses country and bluegrass to tell its horrific tale in a dramatic droning blues. Harris' fiddle is particularly effective as another voice in the narrative. &quot;Sit Across Your Table,&quot; a love song, is the full-blown electric rocker that closes the recording. The music on My World Is Gone is always seemingly familiar yet impossible to pin down. Taylor's chameleon-like always-hiding-in-plain-sight aesthetic gives us a poignant, compelling recording that warrants repeated listening. In a decade or a century, it will more than likely sound as elliptical and necessary as it does now.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:568302647f721eed51e872293b84cf914d2d8106","amp;dn":"Otis+Taylor+-+My+World+Is+Gone+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"568302647f721eed51e872293b84cf914d2d8106","infoHashBuffer":{"type":"Buffer","data":[86,131,2,100,127,114,30,237,81,232,114,41,59,132,207,145,77,45,129,6]},"announce":[],"urlList":[]}}