{"title":"Alex Ross - The Rest Is Noise: Listening to the 20th Century","uid":9637123,"size":2139277,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:56aaa5fa407d58b7a25788651535af77aa9479d6&amp;dn=Alex+Ross+-+The+Rest+Is+Noise%3A+Listening+to+the+20th+Century&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"workerbee","files":-1,"time":1392860513,"description":"\nAlex Ross - The Rest Is Noise: Listening to the Twentieth Century (Picador, 2007).\n\nISBN: 9780312427719 | 720 pages | ePUB &amp; MOBI\n\n\nTHE REST IS NOISE is a sweeping and dramatic history of the twentieth century as told through its music.  Alex Ross (the music critic for The New Yorker) weaves together the histories of the twentieth century and its music, from Vienna before the First World War to Paris in the twenties; from Hitler's Germany and Stalin's Russia to downtown New York in the sixties and seventies up to the present.   Taking readers into the labyrinth of modern style, Ross draws revelatory connections between the century's most influential composers and the wider culture.\n\nIt is an exhilirating intellectual tour de force and highly recommended.\n\nThe book won the 2007 National Book Critics Circle Award for Criticism and was listed among the top 10 books of 2007 by the New York Times Book Review, Time magazine, and the Washington Post Book World.  It was a finalist for the Pulitzer Prize.\n\n\nReviews\n\n&quot;The Rest Is Noise is a great achievement. Rilke once wrote of how he learned to stand 'more seeingly' in front of certain paintings. Ross enables us to listen more hearingly.&quot; -- Geoff Dyer, The New York Times Book Review\n\n&quot;Brilliant, hugely enjoyable cultural history.&quot; -- The Christian Science Monitor\n\n&quot;Ross is a surpremely gifted writer who brings together the political and technological richness of the world inside the magic circle of the concert hall, so that each illuminates the other.&quot; -- Lev Grossman, Time\n\n&quot;It would be hard to imagine a better guide to the maelstrom of recent music than Mr. Ross, who worked on this book for a decade.  He has an almost uncanny gift for putting music into words.&quot; -- The Economist  \n\n&quot;The Rest Is Noise is a long and thrilling ride. . . [Ross] writes about music in vivid language humming with intelligence.  He tells great stories about musicians' lives and illuminates their work with the light of his own experiences.&quot; -- Kevin Berger, Salon.com\n\n&quot;The best book on what music is about -- really about -- that you or I will ever own.&quot; -- Alan Rich, LA Weekly\n","torrent":{"xt":"urn:btih:56aaa5fa407d58b7a25788651535af77aa9479d6","amp;dn":"Alex+Ross+-+The+Rest+Is+Noise%3A+Listening+to+the+20th+Century","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56aaa5fa407d58b7a25788651535af77aa9479d6","infoHashBuffer":{"type":"Buffer","data":[86,170,165,250,64,125,88,183,162,87,136,101,21,53,175,119,170,148,121,214]},"announce":[],"urlList":[]}}