{"title":"Tchaikovsky: 1812 Festival Overture; Capriccio Italien; Beethove","uid":4690985,"size":158706931,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:570621354028624371003e345c4eb7b8c348d659&amp;dn=Tchaikovsky%3A+1812+Festival+Overture%3B+Capriccio+Italien%3B+Beethove&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Seoulhawk01","files":6,"time":1233398143,"description":"This recording by the Mercury Living Presence label is undoubtedly, definitively, the ultimate 1812 Overture, simply the greatest. There are many fine interpretations of the legendary 1812 Overture, composed by Tchaikovsky, and used ad nauseum during 4th of July celebrations and in concert, but this particular orchestration at the hands of the eminent conductor Antal Dorati is the best. As an added bonus, the digitally remastered late 50's LP recording features spoken commentary by Deems Taylor and behind-the-scenes information on the making of the recording. Antal Dorati and the Minneapolis Orchestra outdid themselves with a vivid orchestration of Tchaikovsky's 1812 Overture. It sounds graphic, springing to life with frenzied strings and the charming Marseilles theme, at variance with the Russian national anthem. It is true battle music, a musical dramatization of the war between Russia and Napoleon's forces in 1812. The conclusion has been used in films, commercials, cellular phones, radio and in live concerts with fireworks during the 4th of July. It is the victory theme. For a dramatic touch, cannon and bells were used for this final section. Deems Taylor tells us how on a sunny morning in the late 50's, a team got together at West Point Academy and rehearsed for the recording time and again to get the perfect sound. They used a 1775 bronze cannon from Douay France, an actual cannon that was fired in Napoleonic wars. The clamor of the bells that herald victory were used by permission of the Bells of Laura Spelman, Rockefeller Memorial Carillon of Riverside Church.\n\nAs a delightful &quot;intermission&quot; between Tchaikovsky's 1812 Overture and Beethoven's Wellington Victory, this recording has the bonus feature of Tchaikovsky's Capricio Italian &quot;Italian Caprice&quot;, a festive Italian-style work that Tchaikovsky composed while vacationing in Italy. There are florid passages- a tarantella, with swirling dance-like themes, the bella ragazza theme and even Spanish-like melody. It provides a nice break between the violence of the two &quot;battle pieces&quot;.\n\nBeethoven's Wellington Victory was the source of inspiration for Tchaikovksy's 1812 Overture. Beethoven lavished the score with muscular trumpets, rapid trills on the strings, exciting, intense accents on the musical lines. Th music begins with drum rolls and with the themes &quot;Rule Britania&quot; and &quot;For He's a Jolly Good Fellow&quot;, followed by climatic battle music that at times feels like we are watching a battle on film accompanied by a terrific musical soundtrack, at one point resembling a Western. For this recording, the London Symphony Orchestra and Antal Dorati's team worked themselves weary to attain perfection. They again returned to West Point, as Deems Taylor comments, and live cannon and musket firing was included by a reactivated Civil War Unit, Battery B, 2nd New Jersey Light Artillery. Deems Taylor takes us back to the making of Wellington's Victory. This is a must for specialized music, especially battle music, and for those who will want to hear the greatest 1812 Overture, complimented by cannon. Finally, it is a remarkable testament to the genius and dramatic flair of Antal Dorati, who was, in my opinion, an equal to Arturo Toscanini. ","torrent":{"xt":"urn:btih:570621354028624371003e345c4eb7b8c348d659","amp;dn":"Tchaikovsky%3A+1812+Festival+Overture%3B+Capriccio+Italien%3B+Beethove","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"570621354028624371003e345c4eb7b8c348d659","infoHashBuffer":{"type":"Buffer","data":[87,6,33,53,64,40,98,67,113,0,62,52,92,78,183,184,195,72,214,89]},"announce":[],"urlList":[]}}