{"title":"The Railway Children [2000].mp4","uid":12170730,"size":1808881480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:57781fac3d55fc01a08bc5ec92d38b3f114ae184&amp;dn=The+Railway+Children+%5B2000%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"claudiatannahill","files":1,"time":1438128987,"description":"The Railway Children [2000]\n\nMasterpiece Classic: Season 30, Episode 5 \n\n\nRoberta (Bobbie), Peter and Phyllis live a comfortable and carefree upper middle-class life in London with their parents. But when their father (Michael Kitchen), a senior civil servant, is arrested on a charge of treason and found guilty, they are forced to move with their mother to Three Chimneys, a cold and run-down country cottage near a railway.\n\nWhilst Mother (Jenny Agutter) tries to make a meagre living writing stories and poems she hopes magazines and newspapers will publish, the children seek amusement by watching the trains on the nearby railway line (the fictional Great Northern and Southern Railway) and waving to the passengers. They become friendly with Perks, the cheerful station porter, but feel the wrath of the stationmaster when Peter is caught trying to steal coal to heat the house.\n\nThey become friends with an old gentleman (whose name is never revealed) who regularly takes the 9:15 down train. They ask him to assist them with food and medicine when their mother falls ill. He is happy to do so, although Mother is angry and embarrassed.\n\nThe children save the lives of passengers on a train by alerting the driver to a landslide; they give shelter to a Russian dissident, Mr Szczepansky, and help to unite him with his family. They rescue Jim (JJ Feild), a boarder at a nearby school, who is injured whilst taking part in a paper chase.\n\nBobbie eventually discovers the truth of her father's absence, despite her mother's efforts to shield the children from it, and appeals to the old gentleman for help. As a director of the railway company with influential friends, he is able to help prove their father's innocence. The family is reunited","torrent":{"xt":"urn:btih:57781fac3d55fc01a08bc5ec92d38b3f114ae184","amp;dn":"The+Railway+Children+%5B2000%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57781fac3d55fc01a08bc5ec92d38b3f114ae184","infoHashBuffer":{"type":"Buffer","data":[87,120,31,172,61,85,252,1,160,139,197,236,146,211,139,63,17,74,225,132]},"announce":[],"urlList":[]}}