{"title":"Criticism of the Bible - Collection 6 (The Uncanonical Gospels &amp;","uid":5734637,"size":219478409,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:57809427bee04d93b995e462ae5ff8359c19bac7&amp;dn=Criticism+of+the+Bible+-+Collection+6+%28The+Uncanonical+Gospels+%26&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"moman73","files":17,"time":1280762619,"description":"Criticism of the Bible - Collection 6 (The Uncanonical Gospels &amp; Scripture):\n\nThis upload contains 17 titles, and it focuses on the uncanonical and apocryphal Gospels and Scripture. It is a known fact that at the time of selecting the books to be included in Bible in the 4th century, there were large number of religious writings, books and Gospels in use among the different Jewish and Christian sects and groups.  \n\nSomeone decided what books to be selected to be part of the Bible, and that four of these early Gospels, and no others, should be accepted as part of the canon. The rest of these writings that were not selected were called uncanonical or apocryphal. Many of these books were collected by the people in power in the Church and destroyed or hidden for they were considered to belong to heretical groups. \n\nFortunately, some of the early writings survived the religious persecution. It is interesting that the reader may find more truths in some of these books. One Gospel that deserves special attention is the Gospel of Barnabas (#8 in the UL). The reader is encouraged to bypass the negative commentaries in the introduction section and go directly to the text of the Gospel.\n\n\n1- Foster - The Apocryphal Gospels; A Very Short Introduction (2009)\n\n2- Ehrman - Lost Christianities; The Battle for Scripture and the Faiths We Never Knew (2003)\n\n3- Schneemelcher - New Testament Apocrypha; I- Gospel and Related Writings (1991)\n\n4- Schneemelcher - New Testament Apocrypha; II- Writings Relating to the Apostles (1992)\n\n5- Ehrman - The Lost Gospel of Judas Iscariot (2006)\n\n6- Meyer - Judas; The Definitive Collection of Gospels and Legends about the Infamous Apostle of Jesus (2007)\n\n7- Valantasis - The Gospel of Thomas (1997)\n\n8- Lonsdale &amp; Ragg - The Gospel of Barnabas (1907)\n\n9- Tuckett - The Gospel of Mary (2007)\n\n10- Mack - The Lost Gospel; The Book of Q &amp; Christian Origins (1993)\n\n11- Hartin - James and the Q Sayings of Jesus (1991)\n\n12- Barnstone &amp; Meyer - The Gnostic Bible (2003)\n\n13- Pagels - The Gnostic Gospels (1979)\n\n14- Robinson - The Nag Hammadi Library\n\n15- Oesterley - An Introduction to the Books of the Apocrypha (1935)\n\n16- Ferrar - The Uncanonical Jewish Books (1918)\n\n17- Dawud - Muhammad in the Bible (1928, 1987)\n\n\nNote that the last title in the UL (Muhammad in the Bible) addresses one line of criticism to the Bible from an Islamic point of view. The book was written by a Muslim convert; David Benjamin Keldani or Dawud Benyamin (1867-1940). He was a Catholic priest, became the Bishop of Uramiah (in Persia), but later  converted to Islam in 1904 and adopted the name Abd ul-Ahad Dawud.","torrent":{"xt":"urn:btih:57809427bee04d93b995e462ae5ff8359c19bac7","amp;dn":"Criticism+of+the+Bible+-+Collection+6+%28The+Uncanonical+Gospels+%26","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57809427bee04d93b995e462ae5ff8359c19bac7","infoHashBuffer":{"type":"Buffer","data":[87,128,148,39,190,224,77,147,185,149,228,98,174,95,248,53,156,25,186,199]},"announce":[],"urlList":[]}}