{"title":"Uproot: Travels in 21st Century Music - Jace Clayton","uid":15602676,"size":5446403,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:579891535d96e1d28eccaf544e0b0560eb26a438&amp;dn=Uproot%3A+Travels+in+21st+Century+Music+-+Jace+Clayton&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"mr_mando","files":2,"time":1471675642,"description":"Uproot: Travels in 21st-Century Music and Digital Culture - Jace Clayton\r\n\r\n\r\nIn 2001, Jace Clayton was an amateur DJ who recorded a three-turntable, sixty-minute mix called Gold Teeth Thiefand put it online to share with his friends. Within months, the mix became an international calling card, whisking Clayton away to a sprawling, multitiered nightclub in Zagreb, a tiny gallery in Osaka, a former brothel in São Paolo, and the atrium of MoMA. And just as the music world made its fitful, uncertain transition from analog to digital, Clayton found himself on the front lines of an education in the creative upheavals of art production in the twenty-first-century globalized world.\r\n\r\nUproot is a guided tour of this newly opened cultural space, mapped with both his own experiences and his relationships with other industry game-changers such as M.I.A. and Pirate Bay. With humor, insight, and expertise, Clayton illuminates the connections between a Congolese hotel band and the indie rock scene, Mexican surfers and Israeli techno, Japanese record collectors and hidden rain-forest treasure, and offers an unparalleled understanding of music in a digital age. Uproot takes readers behind the turntable decks to tell a story that only a DJ--and writer--of this caliber can tell","torrent":{"xt":"urn:btih:579891535d96e1d28eccaf544e0b0560eb26a438","amp;dn":"Uproot%3A+Travels+in+21st+Century+Music+-+Jace+Clayton","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"579891535d96e1d28eccaf544e0b0560eb26a438","infoHashBuffer":{"type":"Buffer","data":[87,152,145,83,93,150,225,210,142,204,175,84,78,11,5,96,235,38,164,56]},"announce":[],"urlList":[]}}