{"title":"Raging Phoenix 2009 DVDrip English Sub [Thai Movie]","uid":5252294,"size":1401142558,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:57cb0822bdf3b111541c8e3fb72b66a33ed2a46d&amp;dn=Raging+Phoenix+2009+DVDrip+English+Sub+%5BThai+Movie%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"poothaijaa","files":-1,"time":1262409965,"description":"Title: Raging Phoenix\nAKA: Jija Deu Suay Du\nYear: 2009\nDirector: Rachen Limtrakool\nGenre: Action / Martial Arts / Romance\nRuntime: 109 mins\nCountry: Thailand\nAudio: Thai\nSubtitle: ENGLISH\nStarring : \nYanin Vismitananda (Jeejaa)......Deu\nKazu Patrick Tang..............Sanim\nNui Sandang....................Kee-Muu, aka &quot;Pigshit&quot;\nSompong Leartvimolkasame.......Kee-Mha, aka &quot;Dogshit&quot;\nBoonprasert Salangam...........Kee-Kwai, aka &quot;Bullshit&quot; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1551621/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1551621/&lt;/a&gt;\nhttp://www.ethaicd.com/show.php?pid=49496\n\nSource: DVD\nFile Format: AVI\nRelease date : 29 October 2009\n\nStory :\n\nRaging Phoenix is the comeback of Jija Yanin, the female action icon, that combines new stunning martial art styles and love story to be the ultimate action-romance film. Focused specifically to Jija''s skills and personality, Raging Phoenix fuses her martial arts skills with hip hop dancing and other elements. The film also introduces a newcomer, Kazu Patrick Tang who teams up with Jija on the big screen.\n\nIn Jija Deu Suay Du (it's been transliterated various ways but that's what I'm going with now; English title Raging Phoenix). Like the literal meaning of the title &quot;stubborn, beautiful and fierce&quot;, she's the spoiled socialite daughter of an absent mother. Left to her own devices, Deu is a drummer in a rock band, though not a very good one. Playing a gig in a club, she sees her supposed boyfriend with another girl and launches off the drum riser after the guy. Later, she's laying in a grassy field, looking up at the clouds and talking to her dead father, asking when she'll join him, because there are no good men left on Earth. (It seems an odd film to release on Mother's Day in Thailand.)\n\nDrinking a mystery liquor from a red bottle, Deu is stumbling around in an abandoned parking garage when she is abducted by a woman and a transvestite in a van. Deu struggles, accidentally kills the woman and is then rescued by a shadowy figure.\n\nThe mystery man turns out to be Sanim, a strong, mostly-silent type who hangs out with a couple of other guys, the Mohawked Kee Moo (Pig Shit) and long-haired Kee Ma (Dog Shit). They are later joined by the enigmatic dreadlocked Kee Kwai (translated as Bull Shit, but it literally means buffalo dung). The Kee &quot;brothers&quot; are all members of the B-Boy Thai martial-arts dance team. Sanim is of course played by French-Vietnamese martial artist &quot;Kazu&quot; Patrick Tang.\n\nIn the first big martial-arts sequence, it's the athletic Kazu who fends off a gang of guys on blade-equipped pogo-stilts. He takes a slice across his gut, but somehow escapes with the unconscious Deu in his arms.\n\n\nShe awakens, hung over, in a warehouse, to find Kee Moo and Kee Ma. They take on a dozen or so opponents with their mix of loose-limbed, breakdancing-inspired martial arts moves. The compact Kee Moo spins and twirls while the lanky Kee Ma pops, locks and kicks, alternatively throwing his knee at assailants while dancing the entire time. Deu for her part, gets a barstool stuck to her rear, and runs around flailing like a chicken.\n\nThe boys, it turns out, all lost their women to the gang of kidnappers, and they think Deu, despite her arrogance, has something special that will help them find their women and take revenge.\n\nAt the abandoned beach resort where they squat, they teach Deu the art of mayraiyuth -- drunken Thai martial arts -- with the first two Kee brothers showing her about the drinking part and Sanim teaching martial arts. After a breezy training sequence, Deu feels she is ready.\n\nShe finds a warehouse where a load of abducted girls are being kept, and unleashes the fury of her drunken hip-hop martial arts.\n\nAnd that's about as fun as Jija Deu Suay Du gets. After that, the drama becomes increasingly serious, with Deu sort of falling for Sanim even though the only woman on his mind is his abducted bride Pie, whom he won't stop mooning over. He wears a necklace as a reminder of the woman he lost on his wedding day. Deu and Sanim don't really share romantic chemistry anyway -- it's when they are sparring in martial arts that they look like a good couple.\n\nIt seems to take forever to get back to the real fight. By way of a long explanation by the Kee guys, the reason the girls are being abducted is revealed, as is just what makes Deu so special.\n\nThe final fight sequences take place in an apparent underground liar of the Jaguar, the kidnapping kingpin.\n\n\nDeu and Sanim face the Jaguar's chief enforcer, played by the imposing-looking female bodybuilder Roongtawan Jindasee. She's so fierce that the only way it seems she can defeated -- or at least held at bay -- is if Deu and Sanim team up. And so there are a lot of cool moves in which Jija and Kazu are dance partners in a hip-hop martial-arts ballet, with him swinging and vaulting her like she's a weapon.\n\nThe fight moves from a flat floor to a set of criss-crossing rope bridges, adding a confusing dimension and making for quite a bit of suspense.\n\nNot much is seen from the Kee brothers during this. They are mostly writhing on the floor in pain after facing another batch of enforcers.\n\nThe look of the film is gorgeous, thanks to director, co-writer and co-editor Rashane Limtrakul, whose 1995 debut Romantic Blue was full of stylish camera angles and framing. I'm not sure why it took him 14 years to make another feature. Aiding him is director of photography Tiwa Moeithaisong, who burnished the city's look in director Poj Arnon's Bangkok Love Story and made blood beautiful in his own Meat Grinder.\n\nThe photography and editing don't get in the way of the fighting. Though hand-held, the camera movement is unobtrusive and the focus stays clear. The framing pulls back just enough to capture the action, which is supervised by stunt guru Panna Rittikrai and his team.\n\nAdding to the overall style is the locations, which are exotic for a Thai film in that there's nothing all that Thai about them. The beachside hangout, for example, has a Mediterranean feel, while the abandoned warehouses and a creepy old amusement park could be anywhere.\n\nBut the rather plodding, clunky plot exposition detracts from the action, despite the best efforts of Jija, whose fierceness explodes in the climactic final battle, and she's screaming with bloody rage.\n\nThe ending is drawn out, with something lingering in the air, perhaps leaving things open-ended for a sequel that if done right should be more stubborn, more beautiful and more fierce. And more mayraiyuth. And hopefully the pace will be quickened.","torrent":{"xt":"urn:btih:57cb0822bdf3b111541c8e3fb72b66a33ed2a46d","amp;dn":"Raging+Phoenix+2009+DVDrip+English+Sub+%5BThai+Movie%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57cb0822bdf3b111541c8e3fb72b66a33ed2a46d","infoHashBuffer":{"type":"Buffer","data":[87,203,8,34,189,243,177,17,84,28,142,63,183,43,102,163,62,210,164,109]},"announce":[],"urlList":[]}}