{"title":"Classic Tales Of Horror - Audio Books - MP3 - Slimoo","uid":6112949,"size":168043998,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5869614ab05a48e9e588d1bf45d17ac31f413e7a&amp;dn=Classic+Tales+Of+Horror+-+Audio+Books+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"_Slimoo_","files":8,"time":1295430141,"description":"Classic Tales Of Horror - Series 01 - Horror Audiobooks - BBC7 via DVB-T  \n8 x 15 to 40 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\nShort Horror Audiobooks:\n\n\nE01: An Englishman spends a chilling night in a spooky bungalow in India. \nRudyard Kipling's haunting tale read by Richard Pasco.\n\nE02: A church bell ringer's trip up to the Belfry has terrifying consequences. \nWE Aytoun's chilling tale read by Patrick Malahide.\n\nE03: A man is terrorised by hideous apparitions in a haunted Italian villa. \nEF Benson's tale is read by Patrick Malahide.\n\nE04: An Alderman leases a property for his family unaware that it's haunted. \nJ Sheridan Le Fanu's tale read by Richard Pasco.\n\nE05: A mysterious print reveals a tragic tale of rural revenge. \nMR James' short story read by Robin Bailey.\n\nE06: A scientist claims to have discovered a Fountain of Youth. \nNathanial Hawthorne's comically creepy yarn, read by Nicky Henson.\n\nE07: This classic Edgar Allen Poe story follows Prince Prospero's eager attempts to avoid the Red Death. \nEdgar Allen Poe story read by Patrick Malahide.\n\nE08: Wilkie Collins' unnerving story of a young man, flushed and foolish with gambling success and champagne. \nWilkie Collins read by Robin Baile\n\n\nClassic Tales Of Horror - S01 - E01 - My Own True Ghost Story\nClassic Tales Of Horror - S01 - E02 - The Man In The Bell\nClassic Tales Of Horror - S01 - E03 - Caterpillars\nClassic Tales Of Horror - S01 - E04 - Narrative Of The Ghost Of A Hand\nClassic Tales Of Horror - S01 - E05 - The Mezzotint\nClassic Tales Of Horror - S01 - E06 - Dr Heidegger's Experiment\nClassic Tales Of Horror - S01 - E07 - The Masque Of The Red Death\nClassic Tales Of Horror - S01 - E08 - A Terribly Strange Bed ( Part 1 &amp; 2 edited together)\n\n\n\n\nAudio Format    : MP3\nDuration Approx : 15 to 40mn\nBit rate mode   : Constant\nBit rate        : 128 Kbps \nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits","torrent":{"xt":"urn:btih:5869614ab05a48e9e588d1bf45d17ac31f413e7a","amp;dn":"Classic+Tales+Of+Horror+-+Audio+Books+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5869614ab05a48e9e588d1bf45d17ac31f413e7a","infoHashBuffer":{"type":"Buffer","data":[88,105,97,74,176,90,72,233,229,136,209,191,69,209,122,195,31,65,62,122]},"announce":[],"urlList":[]}}