{"title":"PrinterShare&amp;trade; Mobile Print v9.0.0 [Premium] [APK]","uid":10031660,"size":3262443,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:58d7a5f7204c891f2bc0dc53d9194aa65f9b792f&amp;dn=PrinterShare%26trade%3B+Mobile+Print+v9.0.0+%5BPremium%5D+%5BAPK%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"AtomTPB","files":4,"time":1398350257,"description":"Description:\nPrint anytime, anywhere from your Android device! Now you can instantly print PDF files, office documents (Word, Excel, PowerPoint), bills, invoices and more directly from your device to a printer right next to you or across the world.\nAlso you will be able to print photos and images (JPG, PNG, GIF), print emails from Gmail (including attachments: PDF, DOC, XSL, PPT, TXT), print contacts, agenda, sms/mms, call log, web pages (HTML) and other digital content from device internal memory, SD card or cloud source such as Google Drive / Google Docs.\nYou may configure many print options including paper size, page orientation, number of copies, page range, one- or two-sided printing (duplex mode), print quality (resolution), printout mode (color or monochrome), output tray and more.\n\n\n\nFeatures:\nFree Features:\n* Print a test page to determine compatibility, as not every printer is supported; \n* Print via Google Cloud Print (including save to Cloud Drive as PDF) at no extra-charge;\n* Print 20 pages in Remote mode over the Internet.\nFor unlimited printing you need to purchase PrinterShare Premium Key, a separate small application that simply needs to be on the device to unlock Premium Features of the free app. Prior to buying the key we highly recommend printing the test page to ensure compatibility with your printer.\nPremium Features:\n* Nearby direct printing (PDFs, documents, photos and more) via Wi-Fi, Bluetooth and even USB without PC;\n* Nearby printing to Windows shared (SMB/CIFS) or Mac shared printers;\n* Unlimited Remote printing. The receiving end (Windows or Mac) would not have to buy pages or subscribe.\nPrinterShare is supporting a wide variety of HP (Officejet, LaserJet, Photosmart, Deskjet and other series), Epson (Artisan, WorkForce, Stylus and other series), Canon (PIXMA MP/MX/MG and other series), Brother, Kodak , Samsung, Dell, Lexmark and other printers including legacy networkable.\n\n\n\nWhat's New:\n*You can print now up to 5 real pages on nearby printers in free version (rather than only test page as it was in previous versions)\n\n\nRequired Android O/S : 1.5+","torrent":{"xt":"urn:btih:58d7a5f7204c891f2bc0dc53d9194aa65f9b792f","amp;dn":"PrinterShare%26trade%3B+Mobile+Print+v9.0.0+%5BPremium%5D+%5BAPK%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58d7a5f7204c891f2bc0dc53d9194aa65f9b792f","infoHashBuffer":{"type":"Buffer","data":[88,215,165,247,32,76,137,31,43,192,220,83,217,25,74,166,95,155,121,47]},"announce":[],"urlList":[]}}