{"title":"Chemistry and the Chemical Industry - A Practical Guide for Non-","uid":16016928,"size":4193482,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:594144888ae154c8ea2dcfee6c7ccc9272826aed&amp;dn=Chemistry+and+the+Chemical+Industry+-+A+Practical+Guide+for+Non-&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"clouderone","files":1,"time":1476304887,"description":"Chemistry and the Chemical Industry - A Practical Guide for Non-Chemists - R.A. Smiley, H.L. Jackson (CRC, 2002).pdf\r\n\r\nAs chemical companies strive to be more competitive in the world economy, it is essential that their employees, including sales and marketing personnel, as well as administrative support groups understand the basic concepts of the science upon which the industry is based. The authors, who have over 100 years of combined experience in the chemical industry, developed this easy-to-read book to provide a fundamental understanding of the chemical industry for non-chemists and those poised to enter the chemical profession. \r\n\r\nDesigned specifically for self-study, Chemistry and the Chemical Industry: A Practical Guide for Non-Chemists reviews the important aspects of industrial chemistry in a way that can be easily understood even if you have not taken any formal chemistry courses. The authors provide a clear, concise presentation of the foremost issues behind the chemical discipline along with key definitions and concepts so you can readily obtain an appreciation of the nature of the industry and its contribution to society. Even though you are not at the lab bench, you can still understand, recognize, and partake in discussions about the work being done at your company. Compiled in a straightforward and accessible manner, this book is unique in that it bridges the gap between nonscientific employees and the scientific world in which they operate.\r\n\r\nThe first chapter begins with a description of the chemical industry. It defines the most common terms used in chemistry, drawing on nonscientific analogies whenever possible. In the following chapters, the authors review the concepts and terminology of organic and inorganic chemistry, polymer chemistry, high volume chemicals, and environmental concerns about chemical production with each subject presented as a graphic representation accompanied by a description. Finally, there is a short compilation of general information sources for further study. Chemistry and the Chemical Industry: A Practical Guide for Non-Chemists will allow you to communicate effectively within your organization and become more familiar with this vital industry","torrent":{"xt":"urn:btih:594144888ae154c8ea2dcfee6c7ccc9272826aed","amp;dn":"Chemistry+and+the+Chemical+Industry+-+A+Practical+Guide+for+Non-","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"594144888ae154c8ea2dcfee6c7ccc9272826aed","infoHashBuffer":{"type":"Buffer","data":[89,65,68,136,138,225,84,200,234,45,207,238,108,124,204,146,114,130,106,237]},"announce":[],"urlList":[]}}