{"title":"Spiral Zone DVD Rips","uid":8315179,"size":12593059840,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:59644aa5fee67417963447c9c2f3919b188de678&amp;dn=Spiral+Zone+DVD+Rips&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":null,"files":65,"time":1364570707,"description":"Spiral Zone is a 1987 American science-fiction animated series produced by Atlantic-Kushner-Locke. Based in part from a toy line made by Japanese company Bandai, the series focused on an international group of soldiers fighting to free the world from a scientist who controls much of the Earth's surface. It only ran for one season, with a total count of 65 episodes.\n\nTonka acquired the license from Bandai and created a different treatment to the series, plus a short-lived toy line. Spiral Zone is known among fans as a series that stood out from other contemporary cartoons of the 80s because of its dark story.[citation needed] The series has not been officially released on DVD by Hasbro, who had acquired Tonka in the 90s, including all the copyrights to their properties.\n\nOn June 18, 2007, a renegade military scientist, Dr. James Bent, uses a hijacked space shuttle to drop his deadly Zone Generators across half of the Earth, a region called the Spiral Zone due to its shape.\n\nMillions of people are trapped in the dark mists of the Spiral Zone and transformed into &quot;Zoners&quot; with lifeless yellow eyes and strange red patches on their faces. Because they have no will to resist, Bent - now known as Overlord - makes them his slave army and controls them from the Chrysler Building in New York City.\n\nHis followers are known as the Black Widows: Bandit, Duchess Dire, Razorback, and Reaper. They are immune to the Zone because of a special device called the Widow Maker. However, due to prolonged exposure to the Zone, they also share the same effects as normal people caught inside the Zone, which has dark skies and Zone spores growing in many places. Bent seeks to conquer the world by bringing everyone under control with the Zone Generators. The Zones feed off human energy, which is why Bent does not kill anyone inside.\n\nWith major cities Zoned, the nations of the world put aside their own differences to fight the Black Widows. However, only five soldiers using special suits to protect themselves from the Zone could do it. While easy to destroy, Zone Generators are impossible to capture because of booby traps. Overlord would drop more generators on remaining military and civilian centers and force the Zone Riders into a standoff.\n","torrent":{"xt":"urn:btih:59644aa5fee67417963447c9c2f3919b188de678","amp;dn":"Spiral+Zone+DVD+Rips","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59644aa5fee67417963447c9c2f3919b188de678","infoHashBuffer":{"type":"Buffer","data":[89,100,74,165,254,230,116,23,150,52,71,201,194,243,145,155,24,141,230,120]},"announce":[],"urlList":[]}}