{"title":"Educator.com - Anatomy and Physiology with Bryan Cardella","uid":10003647,"size":2239801151,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:59a900cd7e6dc0da7b41b6daafbadc3f367daa02&amp;dn=Educator.com+-+Anatomy+and+Physiology+with+Bryan+Cardella&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"indiaman","files":27,"time":1398020894,"description":"Professor Bryan Cardella combines Anatomy and Physiology to help you understand both the structures of the human body and how they work with each other. This course is perfect for both high school and college students, and is more in-depth than standard introductory courses. Every major organ system is covered, with tons of pictures, diagrams, and explanations. Professor Cardella brings both extensive knowledge and engaging delivery with his 5+ years teaching life sciences and stand-up comedy experience.\n\nTotal length - 19:01\n\nThe program i used to download the videos was flashgot (a firefox addon). Two videos will be downloaded, one labeled &quot;cam&quot; at the end and the other labeled with &quot;Tablet&quot;. The tablet is video only with no audio and the cam is video of the professor speaking. I used the program MKVmerge to mix the video of the tablet with the audio of the cam. \n\nThe downloaded files are FLV format which don't work with MKVmerge. So it's necessary to first extract the audio and video streams, which you can do with a program called FLVextract. Once extracted, you'll get AVI files and an MP3 file. These file types do work with MKVmerge.","torrent":{"xt":"urn:btih:59a900cd7e6dc0da7b41b6daafbadc3f367daa02","amp;dn":"Educator.com+-+Anatomy+and+Physiology+with+Bryan+Cardella","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59a900cd7e6dc0da7b41b6daafbadc3f367daa02","infoHashBuffer":{"type":"Buffer","data":[89,169,0,205,126,109,192,218,123,65,182,218,175,186,220,63,54,125,170,2]},"announce":[],"urlList":[]}}