{"title":"Woman Upstairs - Claire Messud.epub","uid":8943965,"size":340141,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59c0cc709c63c441c826b97907b8a45066d51123&amp;dn=Woman+Upstairs+-+Claire+Messud.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1379728176,"description":"Nora Eldridge, a 37-year-old elementary school teacher in Cambridge, Massachusetts, is on the verge of disappearing. Having abandoned her desire to be an artist, she has become the &quot;woman upstairs,&quot; a reliable friend and tidy neighbour always on the fringe of others' achievements. Then into her classroom walks a new pupil, Reza Shahid, a child who enchants as if from a fairy tale. He and his parents--dashing Skandar, a half-Muslim Professor of Ethical History born in Beirut, and Sirena, an effortlessly glamorous Italian artist--have come to America for Skandar to teach at Harvard.\n\nBut one afternoon, Reza is attacked by schoolyard bullies who punch, push and call him a &quot;terrorist,&quot; and Nora is quickly drawn deep into the complex world of the Shahid family. Soon she finds herself falling in love with them, separately and together. Nora's happiness explodes her boundaries--until Sirena's own ambition leads to a shattering betrayal.\n\nWritten with intimacy and piercing emotion, this urgently dispatched story of obsession and artistic fulfillment explores the thrill--and the devastating cost--of giving in to one's passions. The Woman Upstairs is a masterly story of America today, of being a woman and of the exhilarations of love.","torrent":{"xt":"urn:btih:59c0cc709c63c441c826b97907b8a45066d51123","amp;dn":"Woman+Upstairs+-+Claire+Messud.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59c0cc709c63c441c826b97907b8a45066d51123","infoHashBuffer":{"type":"Buffer","data":[89,192,204,112,156,99,196,65,200,38,185,121,7,184,164,80,102,213,17,35]},"announce":[],"urlList":[]}}