{"title":"The Heart of the Beast - A Love Story (2014) (Mr Norrell-Empire)","uid":11658425,"size":79601598,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5b21260be98aff866a2fc7d003bb2da22cc5f04f&amp;dn=The+Heart+of+the+Beast+-+A+Love+Story+%282014%29+%28Mr+Norrell-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"GP67","files":-1,"time":1417911093,"description":"Celebrate the 20th anniversary of this hauntingly evocative graphic novel written by Dean Motter and Judith Dupre, and featuring lavishly painted artwork by superstar Sean (Fatale, Criminal) Philliips! &quot;Science transformed his body, artistry inspired his soul.&quot; The Heart of the Beast explores the timeless themes of classic horror literature, set against the backdrop of New York City's decadent art world of the nineties. Sandra, a beautiful and young bartender, meets the enigmatic Victor, a man with strange scars and stranger secrets. A tale of gothic love and modern horror, this graphic novel drew praise from critics and fans alike, and is long overdue for a 2014 release in an all-new prestige format edition. This newly digitally remastered edition features additional scrapbook material and commentary by the creators. Celebrate the 20th anniversary of this hauntingly evocative graphic novel written by Dean Motter and Judith Dupre, and featuring lavishly painted artwork by superstar Sean (Fatale, Criminal) Philliips! &quot;Science transformed his body, artistry inspired his soul.&quot; The Heart of the Beast explores the timeless themes of classic horror literature, set against the backdrop of New York City's decadent art world of the nineties. Sandra, a beautiful and young bartender, meets the enigmatic Victor, a man with strange scars and stranger secrets. A tale of gothic love and modern horror, this graphic novel drew praise from critics and fans alike, and is long overdue for a 2014 release. This newly digitally remastered edition features additional scrapbook material and commentary by the creators.\n\nenjoy","torrent":{"xt":"urn:btih:5b21260be98aff866a2fc7d003bb2da22cc5f04f","amp;dn":"The+Heart+of+the+Beast+-+A+Love+Story+%282014%29+%28Mr+Norrell-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b21260be98aff866a2fc7d003bb2da22cc5f04f","infoHashBuffer":{"type":"Buffer","data":[91,33,38,11,233,138,255,134,106,47,199,208,3,187,45,162,44,197,240,79]},"announce":[],"urlList":[]}}