{"title":"John Coltrane - Giant Steps [1960] V0","uid":10989486,"size":57552423,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5b43ac760a0d456b517ff2dd7c17da951ac491bb&amp;dn=John+Coltrane+-+Giant+Steps+%5B1960%5D+V0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"rambam1776","files":-1,"time":1409973700,"description":"---------------------------------------------------------------------\n                     John Coltrane - Giant Steps\n---------------------------------------------------------------------\n\nArtist...............: John Coltrane\nAlbum................: Giant Steps\nGenre................: Jazz\nYear.................: 2006\nCodec................: LAME\nVersion..............: MPEG 1 Layer III\nQuality..............: Standard, (avg. bitrate: 202kbps)\nChannels.............: Joint Stereo / 44100 hz\n &lt;a href=&quot;\nhttp://www.discogs.com/John-Coltrane-Giant-Steps/release/1706799&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.discogs.com/John-Coltrane-Giant-Steps/release/1706799&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://image.bayimg.com/6cbca2eafd651166bd49477851a32f02a94fa17d.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/6cbca2eafd651166bd49477851a32f02a94fa17d.jpg&lt;/a&gt;\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n   1. John Coltrane - Giant Steps                             [04:47]\n   2. John Coltrane - Cousin Mary                             [05:49]\n   3. John Coltrane - Countdown                               [02:25]\n   4. John Coltrane - Spiral                                  [06:02]\n   5. John Coltrane - Syeeda's Song Flute                     [07:05]\n   6. John Coltrane - Naima                                   [04:25]\n   7. John Coltrane - Mr. P.C.                                [06:58]\n\nPlaying Time.........: 37:34\nTotal Size...........: 54.84 MB\n\nOriginal album released in 1960. \n\nRhino Replicas Authentic Original LP Packaging. Lovingly Reproduced in a CD Sized Jacket.\n\nRhino Records - R2 74796\n\nHistory will undoubtedly enshrine this disc as a watershed the likes of which may never truly be appreciated. Giant Steps bore the double-edged sword of furthering the cause of the music as well as delivering it to an increasingly mainstream audience. Although this was John Coltrane's debut for Atlantic, he was concurrently performing and recording with Miles Davis. Within the space of less than three weeks, Coltrane would complete his work with Davis and company on another genre-defining disc, Kind of Blue, before commencing his efforts on this one. Coltrane (tenor sax) is flanked by essentially two different trios. Recording commenced in early May of 1959 with a pair of sessions that featured Tommy Flanagan (piano) and Art Taylor (drums), as well as Paul Chambers -- who was the only bandmember other than Coltrane to have performed on every date. When recording resumed in December of that year, Wynton Kelly (piano) and Jimmy Cobb (drums) were instated -- replicating the lineup featured on Kind of Blue, sans Miles Davis of course. At the heart of these recordings, however, is the laser-beam focus of Coltrane's tenor solos. All seven pieces issued on the original Giant Steps are likewise Coltrane compositions. He was, in essence, beginning to rewrite the jazz canon with material that would be centered on solos -- the 180-degree antithesis of the art form up to that point. These arrangements would create a place for the solo to become infinitely more compelling. This would culminate in a frenetic performance style that noted jazz journalist Ira Gitler accurately dubbed &quot;sheets of sound.&quot; Coltrane's polytonal torrents extricate the amicable and otherwise cordial solos that had begun decaying the very exigency of the genre -- turning it into the equivalent of easy listening. He wastes no time as the disc's title track immediately indicates a progression from which there would be no looking back. Line upon line of highly cerebral improvisation snake between the melody and solos, practically fusing the two. The resolute intensity of &quot;Countdown&quot; does more to modernize jazz in 141 seconds than many artists do in their entire careers. Tellingly, the contrasting and ultimately pastoral &quot;Naima&quot; was the last tune to be recorded, and is the only track on the original long-player to feature the Kind of Blue quartet. What is lost in tempo is more than recouped in intrinsic melodic beauty. Both Giant Steps [Deluxe Edition] and the seven-disc Heavyweight Champion: The Complete Atlantic Recordings offer more comprehensive presentations of these sessions.","torrent":{"xt":"urn:btih:5b43ac760a0d456b517ff2dd7c17da951ac491bb","amp;dn":"John+Coltrane+-+Giant+Steps+%5B1960%5D+V0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b43ac760a0d456b517ff2dd7c17da951ac491bb","infoHashBuffer":{"type":"Buffer","data":[91,67,172,118,10,13,69,107,81,127,242,221,124,23,218,149,26,196,145,187]},"announce":[],"urlList":[]}}