{"title":"Vince Guaraldi Trio - A Boy Named Charlie Brown (FLAC)","uid":6696737,"size":235589972,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5b55331656787b107f0ae574a4a40523333b3a93&amp;dn=Vince+Guaraldi+Trio+-+A+Boy+Named+Charlie+Brown+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"tiddler22","files":14,"time":1316807914,"description":"\n\nRecorded 1964.\n\n5 Stars at AMG.\n\nReview by Richard S. Ginell (AMG)\nOriginally entitled Jazz Impressions of a Boy Named Charlie Brown, this is an important album not only because it is Guaraldi's first Peanuts soundtrack, but also because the music heard here probably introduced millions of kids (and their parents) to jazz from the mid-'60s onward. Actually, this music is the score for a documentary on the Peanuts phenomenon called A Boy Named Charlie Brown, which ran before the first Peanuts specials per se appeared on the CBS network. The most remarkable thing, besides the high quality of Guaraldi's whimsically swinging tunes, is that he did not compromise his art one iota for the cartoon world; indeed, he sounds even more engaged, inventive, and lighthearted in his piano work here than ever. It must have been quite a delightful shock back then to hear a straight-ahead jazz trio (Guaraldi, Monty Budwig, bass; Colin Bailey, drums) backing all those cartoon figures and genuine children's voices, a mordant running musical commentary that made its own philosophical points. The music on this album laid the groundwork for much that was to come; here is the first appearance of the well-known bossa nova-influenced &quot;Linus and Lucy,&quot; and fans of the series will recognize such themes from future episodes as &quot;Baseball Theme&quot; and &quot;Oh, Good Grief&quot; (which is a rewrite of the Dixie Belles' hit &quot;Down at Papa Joe's&quot;). The original LP came with 12 bonus lithographs of Charles Schulz's celebrated Peanuts drawings; the only extra thing the CD issue offers is a gratuitous outtake of &quot;Fly Me to the Moon.&quot; \n\n01. Oh, Good Grief \n02. Pebble Beach \n03. Happiness Is  \n04. Schroeder \n05. Charlie Brown Theme \n06. Linus And Lucy  \n07. Blue Charlie Brown  \n08. Baseball Theme   \n09. Freda (With The Naturally Curly Hair) \n10. Fly Me To The Moon \n\n \n","torrent":{"xt":"urn:btih:5b55331656787b107f0ae574a4a40523333b3a93","amp;dn":"Vince+Guaraldi+Trio+-+A+Boy+Named+Charlie+Brown+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b55331656787b107f0ae574a4a40523333b3a93","infoHashBuffer":{"type":"Buffer","data":[91,85,51,22,86,120,123,16,127,10,229,116,164,164,5,35,51,59,58,147]},"announce":[],"urlList":[]}}