{"title":"A History of Modern Europe (3rd Ed.), by John Merriman [PDF]","uid":14551256,"size":847153740,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b76b838f70fc0575c41c734a1d46e319aa8ebbc&amp;dn=A+History+of+Modern+Europe+%283rd+Ed.%29%2C+by+John+Merriman+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bey0nd","files":1,"time":1462662135,"description":"A History of Modern Europe: From the Renaissance to the Present (3rd Edition)\r\nScanned + OCR\r\n\r\nA classic in its field, loved by instructors and students for its narrative flair, humor, authority, and comprehensive coverage. More than 100,000 copies sold!\r\nAvailable in both one-volume and two-volume paperback editions, A History of Modern Europe presents a panoramic survey of modern Europe from the Renaissance to the present day. A single author lends a unified approach and consistent style throughout, with an emphasis on the connections of events and people over time.\r\n\r\nThe Third Edition, like the two before it, is authoritative and up-to-date. New to the Third Edition is the theme of empire. From the imperial rivalries between France and Spain in the sixteenth and seventeenth centuries, through the rise and fall of the Ottoman Turkish empire, and on into the imperial history of the twentieth century―decolonization, the spread of the Soviet empire, and the imperial power of the United States―the theme of empire helps students find commonalities among the events of European history.\r\n\r\n== About the Author ==\r\n\r\nJohn Merriman is the Charles Seymour Professor of History at Yale University. A specialist in nineteenth century French history, Merriman earned his Ph. D at the University of Michigan. He is the author of many books, including The Margins of City Life: Explorations on the French Urban Frontier, 1815–1851; Red City: Limoges and the French Nineteenth Century; The Agony of the Republic: The Repression of the Left in Revolutionary France, 1848–1851; and, most recently, The Stones of Balazuc: A French Village in Time (Norton, 2002). He regularly teaches the survey of modern European history at Yale. \r\n\r\n\r\n=====================\r\nPaperback: 1342 pages\r\nPublisher: W. W. Norton &amp; Company; 3rd edition (September 29, 2009)\r\nLanguage: English\r\nISBN-10: 0393934330\r\nISBN-13: 978-0393934335","torrent":{"xt":"urn:btih:5b76b838f70fc0575c41c734a1d46e319aa8ebbc","amp;dn":"A+History+of+Modern+Europe+%283rd+Ed.%29%2C+by+John+Merriman+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b76b838f70fc0575c41c734a1d46e319aa8ebbc","infoHashBuffer":{"type":"Buffer","data":[91,118,184,56,247,15,192,87,92,65,199,52,161,212,110,49,154,168,235,188]},"announce":[],"urlList":[]}}