{"title":"Oliver Sacks - The Mind's Eye 2010 AUDIO","uid":6351245,"size":232242584,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5ba445e8050172a83f1fcea622f7c9aac826301a&amp;dn=Oliver+Sacks+-+The+Mind%5C%27s+Eye+2010+AUDIO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":null,"files":135,"time":1304006389,"description":"Unabriged. 8 hours, 45 minutes. Read by Oliver Sacks and Richard Davidson\n\nIn The Mind\\'s Eye, Oliver Sacks tells the stories of people who are able to navigate the world and communicate with others despite losing what many of us consider indispensable senses and abilities: the power of speech, the capacity to recognize faces, the sense of three-dimensional space, the ability to read, the sense of sight. For all of these people, the challenge is to adapt to a radically new way of being in the world.\n\nThere is Lilian, a concert pianist who becomes unable to read, and Sue who has never seen in three dimensions, until she suddenly acquires stereoscopic vision. There is Pat, who reinvents herself as an active member of her community, despite the fact that she cannot utter a sentence, and Howard, a prolific novelist who continues his life as a writer even after a stroke destroys his ability to read. And there is Dr. Sacks himself, who tells the story of his own eye cancer and of losing vision to one side.\n\nSacks explores some very strange paradoxes. He also considers more fundamental questions: How do we see? How do we think? How important is internal imagery--or vision, for that matter? The Mind\\'s Eye is a testament to the complexity of vision and the brain and to the power of creativity and adaptation.\n\n\n[img]http://i388.photobucket.com/albums/oo324/RlVERbend/Whatcd%20Album%20Art/01FrontCover.jpg[/img]\n\n[img]http://i388.photobucket.com/albums/oo324/RlVERbend/Whatcd%20Album%20Art/02BackCover.jpg[/img]\n\n\nthanks to original uploader.","torrent":{"xt":"urn:btih:5ba445e8050172a83f1fcea622f7c9aac826301a","amp;dn":"Oliver+Sacks+-+The+Mind%5C%27s+Eye+2010+AUDIO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ba445e8050172a83f1fcea622f7c9aac826301a","infoHashBuffer":{"type":"Buffer","data":[91,164,69,232,5,1,114,168,63,31,206,166,34,247,201,170,200,38,48,26]},"announce":[],"urlList":[]}}