{"title":"Harry Potter And The Deathly Hallows Part 2 [MULTI5][PCDVD]","uid":6532548,"size":8068850656,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5c21e28e4580e6f06fdc2a2217a8e01c2aafc3e4&amp;dn=Harry+Potter+And+The+Deathly+Hallows+Part+2+%5BMULTI5%5D%5BPCDVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":4,"uploader":"rjaa","files":85,"time":1310396757,"description":"#######                         ######        #    #       #    \n    #    ######   ##   #    #    #     #       #   # #     # #   \n    #    #       #  #  ##  ##    #     #       #  #   #   #   #  \n    #    #####  #    # # ## #    ######        # #     # #     # \n    #    #      ###### #    #    #   #   #     # ####### ####### \n    #    #      #    # #    #    #    #  #     # #     # #     # \n    #    ###### #    # #    #    #     #  #####  #     # #     #\n  \n\nPlatform: PC\nlanguage:MULTY 5\nGenre: Action\nQuality: DVD\nFormat: ISO\nSize: 7.51 GB\n\n\n\n10-07-2011........Release Date - Protection.............SecuROM\nAction...............Game Type - Disk(s)..................1 DVD\n\nRELEASE NOTES\n\nStep up and play the parts of your heroes in the epic finale of the\nentertainment event of the decade. Playing as Harry and other key\ncharacters in Harry Potter and the Deathly Hallows - Part 2 videogame,\nyou are on a dangerous and urgent quest to locate and destroy the\nremaining Horcruxes, and with them, Voldemort. Break into the high\nsecurity vaults of Gringotts Bank, escape Fiendfyre in the Room of\nRequirement and battle Voldemort's most powerful allies as you defend\nHogwarts in this action-packed experience. Featuring the most epic\nbattles of any Harry Potter games gone before this is the ultimate\nshowdown against Voldemort and his Dark Forces. The fate of the\nwizarding world rests in your hands in the final battle for Hogwarts.\n\nFeatures:\n\nPlay the Parts of Your Heroes - Take on the role of different\ncharacters as each plays a pivotal role in the battle for Hogwarts.\nPlay as Harry, Hermione, Ron, Ginny, Seamus, Neville, Molly Weasley and\nProfessor McGonagall as they each play their part in the defence of\nHogwarts and the destruction of Voldemort\n\nExperience the power of the Dark Lord - Collect the Dark Mark tokens\nin-game to unlock and play as Voldemort in multiplayer mode.\n\nPair Up - To face the most powerful Dark Forces, you are going to need\nyour friends. Play through all levels as a team, defending each other\nfrom the evil lurking around every corner.\n\nFight the Dark forces - Use your magical skills to defeat Death Eaters,\nSnatchers, and giants intent on destruction.\n\nINSTALL NOTES\n\n2. Mount or burn image\n3. Install with one of the the following serials below:\n\n18P7-2B1Q-119S-SKID-ROW0\n1DZH-KJ19-117S-SKID-ROW1\n1UNE-FP1A-114S-SKID-ROW2\n1GRR-RX1M-11IS-SKID-ROW3\n1MB3-881X-11HS-SKID-ROW4\n\n4. Copy all files from the SKIDROW folder to the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy  \n\n\n\n\nPlay as your favorite heroes in the epic final showdown of the greatest of the decade. Playing as Harry and other key characters in Harry Potter and the Deathly Hallows Part 2 the game, you are in a dangerous and urgent mission to locate and destroy the Horcruxes remaining, and with them, Voldemort.\nBreak the safety barriers from the vaults of Gringotts, and the fight against Voldemort's most powerful allies while defending Hogwarts in this action-packed experience. Recreate the epic battles of any Harry Potter game to date, this is the final battle against Voldemort and his dark forces.\nThe fate of the wizarding world is in your hands in the final battle of Hogwarts.\n","torrent":{"xt":"urn:btih:5c21e28e4580e6f06fdc2a2217a8e01c2aafc3e4","amp;dn":"Harry+Potter+And+The+Deathly+Hallows+Part+2+%5BMULTI5%5D%5BPCDVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c21e28e4580e6f06fdc2a2217a8e01c2aafc3e4","infoHashBuffer":{"type":"Buffer","data":[92,33,226,142,69,128,230,240,111,220,42,34,23,168,224,28,42,175,195,228]},"announce":[],"urlList":[]}}