{"title":"Passmark WirelessMon Professional v4.0.1005 + Crack [ThumperDC]","uid":6945123,"size":7302957,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5c38e7285461eb1c7ff0ba1f6a1fb76d33d2de9e&amp;dn=Passmark+WirelessMon+Professional+v4.0.1005+%2B+Crack+%5BThumperDC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ThumperTM","files":-1,"time":1326196547,"description":"================================================\nFor Cool Downloads Visit: &lt;a href=&quot; http://thumperdc.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thumperdc.com/&lt;/a&gt;\t\n\n================================================\n\n\nPassMark WirelessMon v4.0 build 1005\nWirelessMon is a software tool that allows users to monitor the status of wireless WiFi adapter(s) and gather information about nearby wireless access points and hot spots in real time. WirelessMon can log the information it collects into a file, while also providing comprehensive graphing of signal level and real time IP and 802.11 WiFi statistics.\n\n   * Verify 802.11 network configuration is correct.\n   * Test WiFi hardware and device drivers are functioning correctly.\n   * Check signal levels from your local WiFi network and nearby networks.\n   * Help locate sources of interference to your network.\n   * WirelessMon supports the MetaGeek Wi-Spy (2.4i, 2.4x and DBx) useful for finding interference from non 802.11A/B/G/N\n      devices transmitting on the same frequencies\n   * Scan for hot spots in your local area (wardriving)\n   * Create signal strength maps of an area (also known as heat maps)\n   * GPS support for logging and mapping signal strength\n   * Mapping can be performed with or without a GPS unit\n   * Correctly locate your wireless antenna (especially important for directional antennas).\n   * Verify the security settings for local access points.\n   * Measure network speed &amp; throughput and view available data rates.\n   * Help check Wifi network coverage and range\n   * A feature-rich, value-for-money alternative to NetStumbler.\n\nCompatibility\nAny wireless adapter complies with the NDIS_802.11 should be able to report information to WirelessMon. Note that only Windows XP, 2003, Vista &amp; Win7 support this software. Windows 95, 98 and NT are not supported. Windows 2000 (Service pack 4 and above) may work but is not actively supported.\n\nAll the various IEEE 802.11 standards are supported, including 802.11a, 802.11b and 802.11g. 802.11N is supported to the extent provided by Windows, as the draft becomes a completed standard more 802.11N support should become available. Some features may not be supported by some wireless adapters, typically they will report only partial information in this case. It has been also been noted that several wireless adapter manufacturers are not providing device drivers that are fully Windows compliant.\n\nFrom version 4 Garmin USB GPS devices are supported via USB connection.\n\nWireless LAN information\nThe following wireless LAN information is displayed by WirelessMon (when available, as not all wireless adapters will support all of these features).\n* Current connection information: SSID; Connected access point MAC address; Signal strength; Tx Power; Authentication type; RTS Threshold; Fragmentation Threshold; Channel in use; Frequency being used; Number of Antennas; Beacon Period; ATIM Window; Dwell Time; Hop Pattern; Hop Set.\n* Statistics information: More than 30 parameters are reported. Including a detailed break down of frames sent and received, error counts, transmission retry counters and related low level data.\n* IP information: Information about the current TCP/IP connection is reported. Including the adapter MAC address; Adapter device driver name; the IP Address; Subnet Mask; if DHCP is enabled; the Gateway Address and the DHCP server IP address.\n* IP counter information: Network throughput is monitored and displayed. This includes the maximum bandwidth available from the network adapter hardware, the current send and receive data rates in bytes per second and packets per second, plus error counters.\n\nSystem Requirements\n- Windows XP, 2003, 2008, Vista and Windows 7 32bit and 64bit.\n- Windows 95, 98, 2000 and NT are not supported. \n- 64 MB RAM, 15 MB of disk space, compatible 802.11 wireless adapter(s).\n\nInstall Notes\n1. Install the program and do not run.\n2. Copy the crack &quot;WirelessMon.exe&quot; to prog dor, i.e. &quot;D:\\Program Files\\WirelessMon\\&quot;, and replace the original.\n3. DONE!\n\n\n\n====================================================================================\n=Note: If You Have Problem With Any Of my Torrents Register To My Site And PM Me About Your  Problem. You Can Also Download Ton Of Releases Here: &lt;a href=&quot; http://thumperdc.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thumperdc.com/&lt;/a&gt;\n====================================================================================\t\t\t\t\t","torrent":{"xt":"urn:btih:5c38e7285461eb1c7ff0ba1f6a1fb76d33d2de9e","amp;dn":"Passmark+WirelessMon+Professional+v4.0.1005+%2B+Crack+%5BThumperDC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c38e7285461eb1c7ff0ba1f6a1fb76d33d2de9e","infoHashBuffer":{"type":"Buffer","data":[92,56,231,40,84,97,235,28,127,240,186,31,106,31,183,109,51,210,222,158]},"announce":[],"urlList":[]}}