{"title":"Dave Brubeck and Tony Bennett - 2013 - Bennett &amp; Brubeck The","uid":8633601,"size":354046946,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5c473f9696f3831097393af04ad5fc2b25fac714&amp;dn=Dave+Brubeck+and+Tony+Bennett+-+2013+-+Bennett+%26amp%3B+Brubeck+The&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"eika256","files":-1,"time":1372696364,"description":"Dave Brubeck and Tony Bennett - 2013 - Bennett &amp; Brubeck The White House Sessions, Live 1962\n\nSince both were performing their own sets at the White House Seminar American Jazz Concert on the Sylvan Theater grounds on August 28, 1962, Tony Bennett and Dave Brubeck decided to perform an impromptu collaborative set together that day, and although one song from it was eventually released, a version of &quot;That Old Black Magic,&quot; the rest of the hour-or-so-long tape ended up lost in the vast Sony catalog vault, filed, as it turned out, with several classical tapes, until it surfaced again shortly after Brubeck's death in 2012. Now finally available, it reveals two master performers at the very top of their respective games. Bennett's signature song, &quot;I Left My Heart in San Francisco,&quot; had been released only a couple of weeks before the concert, while Brubeck's &quot;Take Five&quot; had just begun to take on its iconic significance. Brubeck and his quartet, Paul Desmond on alto sax, Eugene Wright on bass, and Joe Morello on drums, played a four-song set, followed by a six-song set from Bennett and his band, with Ralph Sharon on piano, Hal Gaylor on bass, and Billy Exiner on drums. Then came an unrehearsed and impromptu four-song set from Bennett and Brubeck, with Wright on bass and Morello on drums (alto saxophonist Desmond sat out) that included versions of &quot;That Old Black Magic&quot; (the only track previously released before this), &quot;Lullaby of Broadway,&quot; &quot;Chicago (That Toddlin' Town),&quot; and &quot;There Will Never Be Another You,&quot; each of which purveys a loose, fun elegance that makes this archival find a true treasure. Bennett and Brubeck would not perform together again until both appeared and briefly reunited on-stage at the 2009 Newport Jazz Festival. (AllMusic)\n\nTrack list:\n01 - Introduction of Dave Brubeck Quartet\n02 - Take Five\n03 - Band Introduction\n04 - Nomad\n05 - Thank You (Dziekuje)\n06 - Castilian Blues\n07 - Introduction\n08 - Just In Time\n09 - Small World\n10 - Make Someone Happy\n11 - Rags To Riches\n12 - One For My Baby (And One More For The Road)\n13 - I Left My Heart In San Francisco\n14 - Lullaby Of Broadway\n15 - Chicago (That Toddlin' Town)\n16 - That Old Black Magic\n17 - There Will Never Be Another You\n\nNo scans.\nEnjoy and share! ","torrent":{"xt":"urn:btih:5c473f9696f3831097393af04ad5fc2b25fac714","amp;dn":"Dave+Brubeck+and+Tony+Bennett+-+2013+-+Bennett+%26amp%3B+Brubeck+The","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c473f9696f3831097393af04ad5fc2b25fac714","infoHashBuffer":{"type":"Buffer","data":[92,71,63,150,150,243,131,16,151,57,58,240,74,213,252,43,37,250,199,20]},"announce":[],"urlList":[]}}