{"title":"Gregory Alan Isakov...This Empty Northern Hemisphere(2009)[FLAC]","uid":7017931,"size":250468856,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5c65ef950d1903c975b2110b8fe57f3b84772f3c&amp;dn=Gregory+Alan+Isakov...This+Empty+Northern+Hemisphere%282009%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"dickspic","files":17,"time":1328728364,"description":"[img]http://img819.imageshack.us/img819/6994/r28565201304191426.jpg[/img]\n\n[color=Green] This Empty Northern Hemisphere [2009] SH156-1[/color]\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1 -\tDandelion Wine\n2 -\tLight Year\n3 -\tThat Moon Song\n4 -\tEvelyn\n5 -\tVirginia May\n6 -\tBig Black Car\n7 -\tMaster &amp; A Hound\n8 -\tThis Empty Northern Hemisphere\n9 -\tIdaho\n10 -\tWords\n11 -\tFire Escape\n12 -\tIf I Go, I'm Goin\n13 -\tOne of Us Cannot Be Wrong\n\n&quot;This record was recorded in many different locations. a closed down bookshop, my apartment, the studio and our friend Brandi Carlile's house, who sang on a couple of songs. There are a lot of traveling songs on it, quiet songs, and bigger songs with big string arrangements. it took about a year to make. i called it &quot;This Empty Northern Hemisphere&quot; because thats what the songs feel like to me. i think its about leaving, and coming home. and growing up. and we had so much fun making it.&quot;\n\nGregory Alan Isakov has been described by Boulder Weekly, &quot;Strong, subtle...a lyrical genius&quot; and has been compared to his influences, Bruce Springsteen, Kelly Joe Phelps, Iron &amp; Wine and Nick Drake. Born in Johannesburg, South Africa, and raised in Philadelphia, Isakov moved to Colorado at the end of the last decade. He recently was named 2008's Best Acoustic/Folk Artist by the Denver Westword (Audience Award) and was named by the Denver Westword as the Best Singer/Songwriter 2007 (Critics Award). Isakov is also the 2007 winner of the Telluride Troubador Songwriting Competition. Gregory Alan Isakov has shared the stage with numerous artists such as Ani Difranco, Rodrigo y Gabriela, Richie Havens, and Fiona Apple. He has appeared at music festivals such as South by Southwest, Falcon Ridge Folk Fest, Rocky Mountain Folks Fest, Telluride Bluegrass Festival and Monolith at Red Rocks. On the heals of his latest full length release, &quot;That Sea, The Gambler&quot;, Gregory Alan Isakov tours as a solo artist as well as with his band, The Freight. Recordings available at cdbaby.com and iTunes.\n \n &quot;Colorado loves traditionalists, and it's Gregory Alan Isakov's unquestionable purity that's elevated him above the infinite army of singer-songwriters. Rather than another would-be Jeff Buckley or Will Oldham, Isakov uses 'That Sea, The Gambler' to lay bare an elegant simplicity that's caked in dust and an utter lack of pretension. Unadulterated, loosely woven folk music will always strike a twang in Denver's soul, and 'That Sea' is one of the best this area's seen in ages.&quot; -The A.V. Club \n\n&quot;Gregory Alan Isakov proudly calls himself a folk artist, and while that's broadly accurate, it's also a tad limiting. Because while some music fans might not consider themselves fans of &quot;folk,&quot; they still bow at the alters of Jeff Tweedy, Andrew Bird and Jolie Holland. And now you can add Isakov to that list.&quot;- Denver Post \n\n&quot;Gregory Alan Isakov - Right from the first refrains of the first two tracks, it's evident that there is a reason why Gregory is recognized as &quot;Best Male Singer-songwriter 2007&quot; (Westword). When an artist can shush a room full of jaded peers and media types, as Gregory did at the Westword music showcase VIP nomination party recently, it's a major nod to the talent he posseses as a performer. He's appeared on David Dye's World Cafe and is quickly rising in the ranks of independent modern folk artists. A very highly recommended release.&quot;- KRFC Colorado \n\n &quot;...his music coasts on the same subtle strength and gravity that Bruce Springsteen built 'Nebraska' on. Hints of everyone from Steve Earle to Gillian Welch also creep into Isakov's twangy, shaded folk, but it's his absolute ease-the man sounds like he's swimming through his own songs&quot; -Westword ..\n\ncd ripped by EAC\n\nplease seed\n\n[url]http://dickthespic.org/[/url]","torrent":{"xt":"urn:btih:5c65ef950d1903c975b2110b8fe57f3b84772f3c","amp;dn":"Gregory+Alan+Isakov...This+Empty+Northern+Hemisphere%282009%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c65ef950d1903c975b2110b8fe57f3b84772f3c","infoHashBuffer":{"type":"Buffer","data":[92,101,239,149,13,25,3,201,117,178,17,11,143,229,127,59,132,119,47,60]},"announce":[],"urlList":[]}}