{"title":"Captain.Claw.(Monolith.Games)-WWW","uid":11699048,"size":1075503408,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5cc8ba0f962cd431c91b4df6a284ec40d797d5d3&amp;dn=Captain.Claw.%28Monolith.Games%29-WWW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"WDoubleYouW","files":2,"time":1423846155,"description":"W     W DDD           b    l     Y   Y          W     W\nW  W  W D  D ooo u  u bbb  l eee   Y   ooo u  u W  W  W\n W W W  D  D o o u  u b  b l e e   Y   o o u  u  W W W \n  W W   DDD  ooo  uuu bbb  l ee    Y   ooo  uuu   W W  \n\n#################################################\n\nRelease Name:\nCaptain.Claw.(Monolith.Games)-WWW\n\nRelease Type: PC Game\nGame: Captain Claw\nLanguage: English\n\nExtras:\nClaw Level Editor (ClawEdit)\nWapMap (A new, alternative level editor for Claw that dramatically improves on WapWorld's feature set and usability. Developed by kijanek6.)\nCutscenes\nArt\nIcons\nRough Drawings\nWallpaper Art\nMusic\nTrailer\nHelp\nMap Shots\nRich's Walkthroughs\nDesign Document\nDialog List\nWippien (optional)\n \n#################################################\n\nSystem Requirements:\nProcessor: 500 MHZ\nRAM: 64 MB\nVRAM: 16 MB\nDirectX Version: 3.0 or above\nOperating System: Windows XP/Vista/7/8\n\t\n#################################################\n\nHow to install:\n1. Mount CAPTAINCLAW.ISO\n2. Install by following the on-screen instructions.\n3. Play!\n\n#################################################\n\nAbout the game:\n\nJoin forces with Captain Claw, the greatest cat pirate ever to challenge the Cocker Spaniard Armada! Embark on an epic quest to recover the lost gems of the Amulet of Nine Lives. Uncover hidden treasure, navigate tricky terrain, and engage in armed combat to defeat the enemies of the courageous and legendary Captain Nathaniel J. Claw.\n\n#################################################\n\nFAQs\nQ: Is this the full game?\nA: Yes.\n\nQ: Does this require Steam?\nA: No.\n\nQ: Does this require a CD to play?\nA: No.\n\nQ: What version is this?\nA: 1.4 CrazyHook\n\nQ: It doesn't work!\nA: This is an old game, so it is possible that it may not work for you. Some have found that disabling the movies helps. To do so, go inside the extras folder and double-click the Disable Movies.reg to add that setting to the registry.\n\nQ: When launching, the screen turns black. The intro movie can still be heard playing in the background, but then the game crashes.\nA: Go inside the extras folder and double-click the Disable Movies.reg and select yes at the prompt.\n\nQ: Claw jumps far too low, barely gets off the ground, and his movement is unnaturally fast.\nA: Force VSync in your Video Card Control Panel.\n\nQ: Elevators using the TriggerElevator logic, such as the one just after the second save point in La Roca, move ridiculously slow.\nA: Force VSync in your Video Card Control Panel.\n\nQ: After reaching a save point, the 'Your game has been saved' notification is displayed. Hovever, the next time Claw is launched, all the progress is lost.\nA: Solution #1: Launch the game using an administrator account, so that it can access and modify the CLAW.USR file, where the saved games are stored. Note that under Windows Vista and Windows 7 you still have to use the 'Run as administrator' command found in the right-click context menu, even if your account actually has administrative rights. Solution #2: Install the game in a folder that is fully accessible from non-administrator accounts, such as 'My Documents'. Solution #3: Provided that you are an advanced user, and are absolutly sure what you are doing, you can manually set access rights to the Claw installation directory, so that its contents can be changed without administrative rights.\n\nQ: Can I play multiplayer?\nA: You can use Wippien (installer located in the extras folder) to create a virtual LAN-like network, enabling players from all around the world to connect and host multiplayer games, including Claw.\n\nQ: I get black screens for multiplayer!\nA: This seems to be a common problem with this game on new computers. Try changing your theme so that text is white may help, or memorize the button locations.\n\nQ: I have other questions about game settings and setup not covered in the instructions.\nA: I've created a nice little tutorial for you here:\n\nQ: Will this installer work on a Mac?\nA: Buy me a Mac and I'll figure it out.\n\nQ: Does this contain viruses?\nA: No.\n\nQ: Will you marry me?\nA: No.\n\n#################################################\n\nCredits:\nMonolith Games for the game.\nThe Claw Recluse Website for the materials to compile this","torrent":{"xt":"urn:btih:5cc8ba0f962cd431c91b4df6a284ec40d797d5d3","amp;dn":"Captain.Claw.%28Monolith.Games%29-WWW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cc8ba0f962cd431c91b4df6a284ec40d797d5d3","infoHashBuffer":{"type":"Buffer","data":[92,200,186,15,150,44,212,49,201,27,77,246,162,132,236,64,215,151,213,211]},"announce":[],"urlList":[]}}