{"title":"It's Kind of a Funny Story by Ned Vizinni","uid":8088724,"size":425964,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d0c4e9f9cf18c547540a3c8ed084efa4a2e5c1b&amp;dn=It%27s+Kind+of+a+Funny+Story+by+Ned+Vizinni&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"NewSky000","files":2,"time":1359669804,"description":"Title: It's Kind of a Funny Story\n\nAuthor: Ned Vizinni\n\nBook(s): 1\n\nFormat: eBook (.epub)\n\nAdditional Info: Readme File\n\n*Calibre is a great free tool for managing ebooks. Link: http://www.calibre-ebook.com/\n\nGenres: Indie, Comedy, Drama, Romance\n\nSummary:\n\nLike many ambitious New York City teenagers, Craig Gilner sees entry into Manhattan's Executive Pre-Professional High School as the ticket to his future. Determined to succeed at life--which means getting into the right high school to get into the right college to get the right job--Craig studies night and day to ace the entrance exam, and does. That's when things start to get crazy. \nAt his new school, Craig realizes that he isn't brilliant compared to the other kids; he's just average, and maybe not even that. He soon sees his once-perfect future crumbling away. The stress becomes unbearable and Craig stops eating and sleeping--until, one night, he nearly kills himself. \nCraig's suicidal episode gets him checked into a mental hospital, where his new neighbors include a transsexual sex addict, a girl who has scarred her own face with scissors, and the self-elected President Armelio. There, isolated from the crushing pressures of school and friends, Craig is finally able to confront the sources of his anxiety. \nNed Vizzini, who himself spent time in a psychiatric hospital, has created a remarkably moving tale about the sometimes unexpected road to happiness. For a novel about depression, it's definitely a funny story. - Goodreads Summary\n\nNote: A comedy book that now has it's own film adaption, and is mainly geared towards an older audience.\n\nCompatibility: Most eReaders\n\nMetadata: Yes\n\nCovers: Yes\n\nAny requests? Concerns? Comments? Anything of the sort? Then plz view readme for support link.\n\n\nPlease seed and thanks for downloading!\n\n\n\nBy: MastermindTTA ~ Thanks for the support!","torrent":{"xt":"urn:btih:5d0c4e9f9cf18c547540a3c8ed084efa4a2e5c1b","amp;dn":"It%27s+Kind+of+a+Funny+Story+by+Ned+Vizinni","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d0c4e9f9cf18c547540a3c8ed084efa4a2e5c1b","infoHashBuffer":{"type":"Buffer","data":[93,12,78,159,156,241,140,84,117,64,163,200,237,8,78,250,74,46,92,27]},"announce":[],"urlList":[]}}