{"title":"CUDA Application Design and Development{BBS}","uid":7392453,"size":7255113,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d2635d1f1490116a6cfc2655246e3dbf3985bb4&amp;dn=CUDA+Application+Design+and+Development%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1340819817,"description":"As the computer industry retools to leverage massively parallel graphics processing units (GPUs), this book is designed to meet the needs of working software developers who need to understand GPU programming with CUDA and increase efficiency in their projects. CUDA Application Design and Development starts with an introduction to parallel computing concepts for readers with no previous parallel experience, and focuses on issues of immediate importance to working software developers: achieving high performance, maintaining competitiveness, analyzing CUDA benefits versus costs, and determining application lifespan.\n\nThe book then details the thought behind CUDA and teaches how to create, analyze, and debug CUDA applications. Throughout, the focus is on software engineering issues: how to use CUDA in the context of existing application code, with existing compilers, languages, software tools, and industry-standard API libraries.\n\nUsing an approach refined in a series of well-received articles at Dr Dobb's Journal, author Rob Farber takes the reader step-by-step from fundamentals to implementation, moving from language theory to practical coding.\n\n    * Includes multiple examples building from simple to more complex applications in four key areas: machine learning, visualization, vision recognition, and mobile computing\n    * Addresses the foundational issues for CUDA development: multi-threaded programming and the different memory hierarchy\n    * Includes teaching chapters designed to give a full understanding of CUDA tools, techniques and structure.\n    * Presents CUDA techniques in the context of the hardware they are implemented on as well as other styles of programming that will help readers bridge into the new material\n\n\n\n\n# Paperback: 336 pages\n# Publisher: Morgan Kaufmann; 1 edition (November 14, 2011)\n# Language: English\n# ISBN-10: 0123884268\n# ISBN-13: 978-0123884268","torrent":{"xt":"urn:btih:5d2635d1f1490116a6cfc2655246e3dbf3985bb4","amp;dn":"CUDA+Application+Design+and+Development%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d2635d1f1490116a6cfc2655246e3dbf3985bb4","infoHashBuffer":{"type":"Buffer","data":[93,38,53,209,241,73,1,22,166,207,194,101,82,70,227,219,243,152,91,180]},"announce":[],"urlList":[]}}