{"title":"Standup Comedy - You Don't Have To Be Jewish (1965)","uid":3979287,"size":52195328,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5d9f4e99cfc6f8f68ce26fe84aee1f249dfcfcfa&amp;dn=Standup+Comedy+-+You+Don%5C%27t+Have+To+Be+Jewish+%281965%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"rambam1776","files":36,"time":1200455876,"description":"This is a famous comedy album from the 60s wherein actors bring classic Jewish jokes to life. The description below is from http://wm05.allmusic.com/cg/amg.dll?p=amg&amp;token=&amp;sql=10:kifixq9aldse \n\nReview\nBob Booker was a master of the seemingly lost art of the sketch comedy album; he was one of the writers behind the smash hit Kennedy parody disc The First Family, and several years later he teamed up with George Foster to create You Don't Have To Be Jewish, a collection of blackout bits and extended one-liners which poked fun at the absurdities of American Jewish culture. Like The First Family, You Don't Have To Be Jewish was recorded in a studio with a live audience in attendance, as a cast of actors performed scripted material much in the manner of a radio play. While You Don't Have To Be Jewish wasn't going to win any awards for originality even in 1965 ? many of these jokes were already antiques by that point ? and some of this material sounds a bit less than P.C. in the 21st Century (especially the persistent presence of the Nagging Jewish Mother), for the most part the album is funny stuff and far too good-hearted to offend anyone. Booker and Foster had the good judgment to assemble a superb cast for this recording, and they transform what could have been ordinary Catskill shtick into something memorable; the performers include Lou Jacobi, Jack Gilford, Betty Walker and Joe Silver, and their expert timing and feel for their characters is impeccable. You Don't Have To Be Jewish is a fine sampling of classic Borscht Belt humor (blended with a bit of like-minded new material) performed by a top-notch cast, and like the title says, you don't have to be of the Semitic faith to enjoy it ? though it couldn't hurt. \n\n1. Call from Long Island - Arlene Golonka, Betty Walker \n2. Home from the Office - Lou Jacobi, Betty Walker \n3. Reading of the Will - Jack Gilford, Arlene Golonka, Lou Jacobi, Jackie Kannon, Betty Walker \n4. Diamond - Arlene Golonka, Betty Walker \n5. Quickies: The Astronaut/The School/The Confession - Jack Gilford, Arlene Golonka, Lou Jacobi, Jackie Kannon, Bob McFadden, Betty Walker \n6. Jury - Frank Gallop, Arlene Golonka, Lou Jacobi, Betty Walker \n7. Presidents - Jack Gilford, Bob McFadden, Joe Silver \n8. Cocktail Party - Frank Gallop, Lou Jacobi \n9. Final Discussion - Lou Jacobi, Betty Walker \n10. More Quickies: Cry for Help/Panic/Two Husbands - Frank Gallop, Lou Jacobi, Jackie Kannon, Betty Walker \n11. Convicts - Jack Gilford, Jackie Kannon, Bob McFadden, Joe Silver \n12. Housewarming - Jack Gilford, Arlene Golonka, Betty Walker \n13. Luncheon - Arlene Golonka, Betty Walker \n14. Still More Quickies: The Storm/The Newspaper Reporter/The Home Remedy - Frank Gallop, Jack Gilford, Lou Jacobi, Jackie Kannon, Betty Walker \n15. Conversation in the Hotel Lobby - Lou Jacobi, Betty Walker \n16. Agony and the Ecstasy - Arlene Golonka, Betty Walker \n17. My Son, The Captain - Lou Jacobi, Jackie Kannon, Betty Walker \n18. Secret Agent, James Bondstein - Frank Gallop, Jack Gilford, Lou Jacobi, Jackie Kannon, Joe Silver, Betty Walker \n19. Enough Already with the Quickies: Dinner/The Elevator/Classified Ad, Is - Jack Gilford, Arlene Golonka, Jackie Kannon, Betty Walker \n20. Goldstein - Frank Gallop, Jack Gilford, Joe Silver \n21. Would You Believe It? - Phil Leeds \n22. Hobby - Lou Jacobi, Phil Leeds \n23. My Husband, The Monster - Bob McFadden, Betty Walker \n24. Ballad of Irving - Frank Gallop \n25. Shoe Repair Shop - Frank Gallop, Anthony Holland \n26. Divorce, Kosher Style - Frank Gallop, Betty Walker \n27. Voyage to the Bottom of the Sea - Anthony Holland, Lou Jacobi, Bob McFadden \n28. Things Might Have Been Different - Frank Gallop, Valerie Harper, Anthony Holland, Lou Jacobi, Betty Walker \n29. Call from Greenwich Village - Valerie Harper, Betty Walker \n30. Great Bank Robbery - Lou Jacobi, Phil Leeds \n31. Discussion in the Airplane - Valerie Harper, Phil Leeds, Betty Walker \n32. Miami Beach - Lou Jacobi, Phil Leeds \n33. Schtick: The Traveler/The Panhandler/The Cemetery - Frank Gallop, Valerie Harper, Lou Jacobi, Betty Walker \n34. Kidnapping - Lou Jacobi \n35. Bar Mitzvah - Anthony Holland, Lou Jacobi, Phil Leeds, Bob McFadden, Betty Walker \n36. When You're in Love the Whole World Is Jewish - Lou Jacobi \n\n","torrent":{"xt":"urn:btih:5d9f4e99cfc6f8f68ce26fe84aee1f249dfcfcfa","amp;dn":"Standup+Comedy+-+You+Don%5C%27t+Have+To+Be+Jewish+%281965%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d9f4e99cfc6f8f68ce26fe84aee1f249dfcfcfa","infoHashBuffer":{"type":"Buffer","data":[93,159,78,153,207,198,248,246,140,226,111,232,74,238,31,36,157,252,252,250]},"announce":[],"urlList":[]}}