{"title":"Hannah Arendt - Philosophical Works (22 books)","uid":13613088,"size":141198194,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e19a8b1e42ce73a7b211f55566f28962f6c26a6&amp;dn=Hannah+Arendt+-+Philosophical+Works+%2822+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"workerbee","files":56,"time":1455930390,"description":"HANNAH ARENDT (1906-1975) was one of the most influential political philosophers of the twentieth century. Born into a German-Jewish family, she was forced to leave Germany in 1933 and lived in Paris for the next eight years, working for a number of Jewish refugee organisations. In 1941 she immigrated to the United States and soon became part of a lively intellectual circle in New York. She held a number of academic positions at various American universities until her death in 1975.\n\nShe is best known for two works that had a major impact both within and outside the academic community. The first, THE ORIGINS OF TOTALITARIANISM (1951), was a study of the Nazi and Stalinist regimes that generated a wide-ranging debate on the nature and historical antecedents of the totalitarian phenomenon. The second, THE HUMAN CONDITION (1958) was an original philosophical study that investigated the fundamental categories of the vita activa (labor, work, action). In addition to these two important works, Arendt published a number of influential books and essays on topics such as the nature of revolution, freedom, authority, tradition and the modern age.\n\nIn 1961 she attended the trial of Adolf Eichmann in Jerusalem as a reporter for The New Yorker magazine, and two years later published EICHMANN IN JERUSALEM, which coined the phrase &quot;the banality of evil&quot; to describe the Nazi leader. The book caused a deep controversy in Jewish circles for its sharp criticism of the way the trial was conducted as well as Arendt's critical perspective on the actions of some Jewish leaders during the Holocaust.\n\nThe same year saw the publication of ON REVOLUTION, a comparative analysis of the American and French revolutions. A number of important essays were also published during the 1960s and early 1970s, including MEN IN DARK TIMES, a series of intellectual biographies of some creative and moral figures of the twentieth century, such as Walter Benjamin, Karl Jaspers, Rosa Luxemburg, Hermann Broch, Pope John XXIII, and Isak Dinesen).\n\nAt the time of her death in 1975, she had completed the first two volumes on her last major philosophical work, THE LIFE OF THE MIND, which examined the three fundamental faculties of the vita contemplativa (thinking, willing, judging), and was published posthumously in 1978. The third volume was left unfinished, but some background material and lecture notes were published under the title LECTURES ON KANT'S POLITICAL PHILOSOPHY (1982). \n\nThe following books are in PDF and/or ePUB format as indicated:\n\n* ANTISEMITISM: Part One of &quot;The Origins of Totalitarianism&quot; (Harcourt, 1985). -- ePUB\n\n* BETWEEN FRIENDS: The Correspondence of Hannah Arendt and Mary McCarthy, 1949-1975 (Harcourt, 1994).  Edited by Carol Brightman. -- PDF\n\n* BETWEEN PAST AND FUTURE: Eight Exercises in Political Thought (Viking, 1968 / Penguin Classics, 2006).  New and enlarged edition. -- PDF + ePUB \n\n* CRISES OF THE REPUBLIC: Lying in Politics; Civil Disobedience; On Violence; and Thoughts on Politics and Revolution (Harcourt, 1972). -- PDF + ePUB\n\n* EICHMANN IN JERUSALEM: A Report on the Banality of Evil (Penguin Classics, 2006).  Introduction by Amos Elon. -- ePUB\n\n* ESSAY IN UNDERSTANDING, 1930-1954: Formation, Exile, and Totalitarianism (Schocken, 2005).  Edited with an Introduction by Jerome Kohn. -- PDF + ePUB\n\n* THE HUMAN CONDITION, 2nd edn. (Chicago, 1998).  Introduction by Margaret Canovan. -- PDF + ePUB\n\n* IMPERIALISM: Part Two of &quot;The Origins of Totalitarianism&quot; (Harcourt, 1985). -- ePUB\n\n* THE JEWISH WRITINGS (Schocken, 2007).  Edited by Jerome Kohn and Ron H. Feldman. -- PDF + ePUB\n\n* THE LAST INTERVIEW &amp; OTHER CONVERSATIONS (Melville House, 2013). -- ePUB\n\n* LECTURES ON KANT'S POLITICAL PHILOSOPHY (Chicago, 1982).  Edited with an Interpretive Essay by Ronald Beiner. -- PDF\n\n* THE LIFE OF THE MIND, One volume edition (Harcourt, 1981).  Edited by Mary McCarthy. -- PDF + ePUB\n\n* LOVE AND SAINT AUGUSTINE (Chicago, 1996).  Edited with an Interpretive Essay by Joanna Vecchiarelli Scott and Judith Chelius Stark. -- PDF\n\n* MEN IN DARK TIMES (Harcourt, 1970). -- PDF + ePUB\n\n* ON REVOLUTION (Penguin Classics, 1990/2006). -- PDF + ePUB\n\n* ON VIOLENCE (Harcourt, 1969). -- PDF + ePUB\n\n* THE ORIGINS OF TOTALITARIANISM: New Edition with Added Prefaces (Harcourt, 1979). -- PDF\n\n* THE PORTABLE HANNAH ARENDT (Penguin Classics, 2000).  Edited with an Introduction by Peter Baehr. -- PDF\n\n* THE PROMISE OF POLITICS (Schocken, 2005).  Edited with an Introduction by Jerome Kohn. -- PDF\n\n* RAHEL VARNHAGEN: The Life of a Jewish Woman (Harcourt, 1974).  Revised edition.  Translated by Richard and Clara Winston. -- PDF\n\n* RESPONSIBILITY AND JUDGMENT (Schocken, 2003). Edited with an Introduction by Jerome Kohn. -- PDF + ePUB\n\n* TOTALITARIANISM: Part Three of &quot;The Origins of Totalitarianism&quot; (Harcourt, 1985). -- ePUB\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n\n                 \nhttps://pirates-forum.org/User-workerbee  \n\n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:5e19a8b1e42ce73a7b211f55566f28962f6c26a6","amp;dn":"Hannah+Arendt+-+Philosophical+Works+%2822+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e19a8b1e42ce73a7b211f55566f28962f6c26a6","infoHashBuffer":{"type":"Buffer","data":[94,25,168,177,228,44,231,58,123,33,31,85,86,111,40,150,47,108,38,166]},"announce":[],"urlList":[]}}