{"title":"Forge of Darkness by Steven Erikson (Kharkanas Trilogy Book 1)","uid":7619779,"size":2498477,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e59038f9f2ff955667997df2c301894b43c3067&amp;dn=Forge+of+Darkness+by+Steven+Erikson+%28Kharkanas+Trilogy+Book+1%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"azizex666","files":-1,"time":1347297437,"description":"Now is the time to tell the story of an ancient realm, a tragic tale that sets the stage for all the tales yet to come and all those already told...\n\nIt's a conflicted time in Kurald Galain, the realm of Darkness, where Mother Dark reigns. But this ancient land was once home to many a power. and even death is not quite eternal. The commoners' great hero, Vatha Urusander, is being promoted by his followers to take Mother Dark's hand in marriage, but her Consort, Lord Draconus, stands in the way of such ambitions. The impending clash sends fissures throughout the realm, and as the rumors of civil war burn through the masses, an ancient power emerges from the long dead seas. Caught in the middle of it all are the First Sons of Darkness, Anomander, Andarist, and Silchas Ruin of the Purake Hold...\n\nSteven Erikson entered the pantheon of great fantasy writers with his debut Gardens of the Moon. Now he returns with the first novel in a trilogy that takes place millennia before the events of the Malazan Book of the Fallen and introduces readers to Kurald Galain, the warren of Darkness. It is the epic story of a realm whose fate plays a crucial role in shaping the world of the Malazan Empire.\n\n\n\n                            Format 1 - .ePUB\n\n                            Format 2 - .Mobi\n\n\n         **Support Your Favorite Authors By Buying Their Books**","torrent":{"xt":"urn:btih:5e59038f9f2ff955667997df2c301894b43c3067","amp;dn":"Forge+of+Darkness+by+Steven+Erikson+%28Kharkanas+Trilogy+Book+1%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e59038f9f2ff955667997df2c301894b43c3067","infoHashBuffer":{"type":"Buffer","data":[94,89,3,143,159,47,249,85,102,121,151,223,44,48,24,148,180,60,48,103]},"announce":[],"urlList":[]}}