{"title":"Tomasz Kołodziejczak - Dominium Solarne 1-3 [PDF] [Polish]","uid":13883221,"size":3836627,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5eb688c70ca0ee6a48e77aca1df8e3d922603359&amp;dn=Tomasz+Ko%C5%82odziejczak+-+Dominium+Solarne+1-3+%5BPDF%5D+%5BPolish%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"everdarksoul","files":5,"time":1458172345,"description":"Tomasz Kołodziejczak - cykl Dominium Solarne 1-3\r\njęzyk: PL / format: PDF / jakość: dobra i średnia\r\n\r\nWstawka zawiera paczkę e-book'ów trzech części cyklu S-F autorstwa Tomasza Kołodziejczyka, pt. &quot;Dominium Solarne&quot;. Cykl potocznie nazywany jest trylogią, lecz nie jest to do końca prawidłowe - w zasadzie cykl składa się z dylogii &quot;Dominium Solarne&quot; oraz zbioru opowiadań wydanego w tomie &quot;Głowobójcy&quot;. Gwiazda Tomasza Kołodziejczaka zabłysnęła na nieboskłonie polskiej fantastyki w połowie lat dziewięćdziesiątych - wydana w 1996 powieść &quot;Kolory Sztandarów&quot; dała autorowi Zajdla, a czytelnikom - nadzieję na pierwszy, rodzimy &quot;Space-Operowy&quot; cykl. Minęły trzy lata nim ukazał się ciąg dalszy - a zakończenie &quot;Schwytanego w Światła&quot;, choć do pewnego stopnia niejednoznaczne, sugerowało jednak, że pisarz do postaci głównego bohatera - Daniela Bondaree - już nie wróci. W istocie: epilog tej powieści zamykał właściwie wszystkie wątki, które Kołodziejczak poruszał w swojej dylogii i trudno było się spodziewać, iż miłośnicy niezwykłego uniwersum kiedykolwiek do niego wrócą. Jednak pisarz jeszcze raz zaprosił ich do swego Dominium w 2011 - tym razem w zbiorze opowiadań z tego świata. Książka ta jednak nie jest kontynuacją, ale raczej uzupełnieniem swoich poprzedniczek - czytelnik nie spotka w niej bohaterów z wcześnieszych części, ani nie będzie miał okazji powrócić do już znanych mu miejsc - ale niewątpliwie przeżyje kilka świetnych przygód w naprawdę zadziwiającym uniwersum. Szkoda, że Kołodziejczak wysyła w niej czytających w tak odległy okres z historii Dominium Solarnego - ale też nie sposób nie docenić tych kilku świetnych opowiadań!\r\n\r\nWstęp do fabuły cyklu Dominium Solarne:\r\nW skolonizowanym przez ludzi układzie Multona pojawia się niespodziewanie pojazd nieznanej dotąd rasy Obcych. Przybysze kierują się prosto ku Gladiusowi, głównej planecie systemu, całkowicie ignorując próby nawiązania łączności i niszcząc jednostki, które zanadto się do nich zbliżyły. Flota wojenna ludzi podejmuje próbę powstrzymania wrogiego statku i zostaje ze szczętem zniszczona. Obcy lądują na Gladiusie i w ośmiu różnych miejscach kontynentu wznoszą bazy-forty chronione polami siłowymi o wiele potężniejszymi od tych, którymi dysponują mieszkańcy. Zamiast jednak przystąpić do regularnych działań wojennych mających na celu zajmowanie coraz większych połaci planety, najeźdźcy - zwani Korgardami - ograniczają się tylko do nieregularnych wypadów ze swoich placówek. Tylko i aż - bowiem każdy taki wypad kończy się nieodmiennie zagładą jakiegoś ludzkiego osiedla... Wojsko jest bezradne - Korgardzi górują technologicznie nad Gladianami - a podczas jednej z potyczek dochodzi do wstrząsającego odkrycia: wróg uprowadza część mieszkańców z atakowanych miasteczek, by przeprowadzać na nich potworne eksperymenty biologiczne. Armia, zrozumiawszy, że bezpośrednia walka z Korgardami nie na wiele się zda, podejmuje brawurową próbę zinfiltrowania jednego z fortów...\r\nGłówny bohater własciwej częsci cyklu to Daniel Bondaree. Tanator z zawodu, czyli - uciekając się do popkulturowego skrótu - &quot;Kołodziejczakowy&quot; odpowiednik Sędziego Dredd'a. W chwili gdy go poznajemy, Daniel opuszcza właśnie policyjno-egzekutorskie szeregi i wstępuje do tajnej komórki wojskowej zajmującej się rozpracowywaniem Korgardów. W tym momencie należy wyjaśnić, że tajemniczy najeźdźcy są pierwszoplanowymi antagonistami tylko przez pięćdziesiąt pierwszych stron &quot;Kolorów Sztandarów&quot; - potem ich miejsce zajmują na stałe agenci Dominium Solarnego - imperium ludzkiego, od którego Gladius na mocy praw kolonizacyjnych pozostaje względnie niezależny, a które chciałoby przejąć kontrolę nad układem Multona pod pretekstem niesienia pomocy w walce z Obcymi. Innymi słowy - Korgardzi zostają szybko zredukowani do roli tła fabularnego, a motorem akcji staje się konflikt z Dominium (kojarzącym się notabene z ZSRR) i jego gladiańskimi poplecznikami.\r\n\r\ncykl Dominium Solarne\r\n1 - Kolory Sztandarów\r\n2 - Schwytany w Światła\r\n3 - Głowobójcy","torrent":{"xt":"urn:btih:5eb688c70ca0ee6a48e77aca1df8e3d922603359","amp;dn":"Tomasz+Ko%C5%82odziejczak+-+Dominium+Solarne+1-3+%5BPDF%5D+%5BPolish%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eb688c70ca0ee6a48e77aca1df8e3d922603359","infoHashBuffer":{"type":"Buffer","data":[94,182,136,199,12,160,238,106,72,231,122,202,29,248,227,217,34,96,51,89]},"announce":[],"urlList":[]}}