{"title":"Charles Van Doren - A History of Knowledge. Past, Present, and F","uid":10396268,"size":5649123,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5eba56a79fa3b8b1348d1907a1c4d14d8602604a&amp;dn=Charles+Van+Doren+-+A+History+of+Knowledge.+Past%2C+Present%2C+and+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Anette14","files":-1,"time":1403225977,"description":"Description\nProduct Details\nBook Title: A History of Knowledge: Past, Present, and Future\t\nBook Author: Charles Van Doren\nPaperback: 448 pages\nPublisher: Ballantine Books; Reissue edition (March 17, 1992)\nLanguage: English\nISBN-10: 0521848792\nISBN-13: 978-0345373168\n\n===================================================================================\nBook Description\nRelease date: March 17, 1992 | ISBN-10: 0521848792 | ISBN-13: 978-0345373168 | Edition: Reissue\nA one-voume reference to the history of ideas that is a compendium of everything that humankind has thought, invented, created, considered, and perfected from the beginning of civilization into the twenty-first century. Massive in its scope, and yet totally accessible, A HISTORY OF KNOWLEDGE covers not only all the great theories and discoveries of the human race, but also explores the social conditions, political climates, and individual men and women of genius that brought ideas to fruition throughout history.\n&quot;Crystal clear and concise...Explains how humankind got to know what it knows.&quot; Clifton Fadiman\nSelected by the Book-of-the-Month Club and the History Book Club\n\n===================================================================================\nEditorial Reviews\nFrom Publishers Weekly\nVan Doren's provocative, encyclopedic guide to great thinkers, concepts and philosophical trends was a BOMC and History Book Club selection in cloth.\n\nFrom Library Journal\nVan Doren, once editorial director of the Encyclopedia Brittanica , has produced a miniature encyclopedia, organized to show that there is progress in knowledge. He praises Columbus for giving us &quot;a world well on the way to the unity it experiences today.&quot; India is mentioned as the source of the caste system. The Chinese gave us Confucius, but Van Doren notes their main legacy seems to be good recipes for tyranny. He warns that some good knowledge is unpleasant: we must now control our technology. Ultimately, the best knowledge for him is Western scientific knowledge since it is cumulative, meaning that better theories nearly always replace worse ones. An avid reader of Popular Mechanics who went to sleep in Peoria, Illinois in 1920 and awoke today with this book in her/his hands would probably find their ideals intact, needing only new technical knowledge and preparation for Van Doren's predicted revolt of intelligent machines. Van Doren has distilled the ideology of scientific progress into a neat, short drink that should win him a place on every library shelf.- Leslie Armour, Univ. of Ottawa, Canada\n===================================================================================","torrent":{"xt":"urn:btih:5eba56a79fa3b8b1348d1907a1c4d14d8602604a","amp;dn":"Charles+Van+Doren+-+A+History+of+Knowledge.+Past%2C+Present%2C+and+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eba56a79fa3b8b1348d1907a1c4d14d8602604a","infoHashBuffer":{"type":"Buffer","data":[94,186,86,167,159,163,184,177,52,141,25,7,161,196,209,77,134,2,96,74]},"announce":[],"urlList":[]}}