{"title":"Vatican museums, Rome (Great Museums of The World-Art Ebook)","uid":11777504,"size":32977002,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f1f73afbbb6cf48fa3917e11d2b53c1ee2291c1&amp;dn=Vatican+museums%2C+Rome+%28Great+Museums+of+The+World-Art+Ebook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"STBGD","files":1,"time":1427385359,"description":"Pdf / English / 1968 Newsweek / 171 pages / 31.4 MB\n\nThe ensemble of the Pontifical Monuments, Museums and Galleries is one of the most important in the world, because of the quality of the works and because the settings in which they are preserved and which were created for them (Sistine Chapel, Raphael's Stanze, the Borgia Apartment, etc.) are architectural works of equal historic and artistic importance.\n\nThe Vatican Museums had their origin in the private collections of Cardinal Giuliano della Rovere, which he brought to the Apostolic Palace and exhibited in the Belvedere Garden of Innocent VIII (1482-1492), when he was elected Pope in 1503 and took the name of Julius II (1503-1513). This typical humanistic open-air museum, which was then enriched by the munificence of Leo X (1513-1521), Clement VII (1523-1534) and Paul III (1534-1550), included such famous statues of antiquity as the Apollo, appropriately called Belvedere, the Torso, the marble group of the Laocoon, the Tiber and the Nile. The Middle Ages passed on to us the spiritual, literary, political and juridical heritage of the Western classical world, before the coming of Christ. The Church recognized the eternal human value of this precious written heritage, to which the popes of the Renaissance added that of the figurative arts, creating the museums alongside the libraries, and the first of these in Europe was opened by Sixtus IV ( 1471-1484) , on the Capitoline hill in Rome","torrent":{"xt":"urn:btih:5f1f73afbbb6cf48fa3917e11d2b53c1ee2291c1","amp;dn":"Vatican+museums%2C+Rome+%28Great+Museums+of+The+World-Art+Ebook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f1f73afbbb6cf48fa3917e11d2b53c1ee2291c1","infoHashBuffer":{"type":"Buffer","data":[95,31,115,175,187,182,207,72,250,57,23,225,29,43,83,193,238,34,145,193]},"announce":[],"urlList":[]}}