{"title":"Microsoft Office 2016 VL Multi-Language Interface Pack (x86/x64)","uid":13926619,"size":1270087680,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5fe32dfe1e5b7c2bdb3c6f38bc23665a2cefdf03&amp;dn=Microsoft+Office+2016+VL+Multi-Language+Interface+Pack+%28x86%2Fx64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"jovo_bih","files":1,"time":1458386082,"description":"Microsoft Office 2016 VL Multi-Language Interface Pack DVD (x86/x64)\r\n\r\nAbout this release\r\n\r\n- Release: official MSDN ISO image\r\n- Version: 16.0.4266.1001\r\n- Requirements: Office 2016 Volume License editions\r\n- These packs are NOT compatible with Office 2016 Click-to-Run/Office 365\r\n- Includes: 51 Language Interface Packs (32-bit / 64-bit)\r\n\r\nAbout Language Interface Packs\r\n\r\nYou can install language interface packs after installing Microsoft Office 2016 Volume License.\r\n\r\nFeatures of Language Interface Packs (LIPs)\r\n\r\nLanguage Interface Packs can be used to add more language options to Office without changing the current default language of your Office installation.\r\nLanguage interface packs change the language for the ribbon and commands for some Office applications, and include a spell checker for their language.\r\n\r\nThis compilation includes LIPs for the following languages:\r\n\r\nAfrikaans, Amharic, Assamese, Azerbaijani (Latin), Belarusian, Bangla (Bangladesh), Bangla (Bengali India), Bosnian (Latin), Catalan, Valencian, Welsh, Basque, Persian, Filipino, Irish, Scottish, Galician, Gujarati, Armenian, Icelandic, Georgian, Khmer, Kannada, Konkani, Kyrgyz, Luxembourgish, Maori, Macedonian, Malayalam, Mongolian, Marathi, Maltese, Nepali, Norwegian Nynorsk, Odia, Punjabi, Dari, Quechua (Peru), Sindhi (Arabic), Sinhala, Albanian, Serbian (Cyrillic, Bosnia and Herzegovina), Serbian (Cyrillic, Serbia), Kiswahili, Tamil, Telugu, Turkmen, Tatar, Uyghur, Urdu, Uzbek (Latin)\r\n\r\nInstallation\r\n\r\nMount / burn / extract ISO and install the desired Language Pack(s)\r\n\r\nConfigure Office language\r\n\r\nAfter you install the language accessory pack, you must configure Office for your new language preferences.\r\n\r\n- Open any Office program and then click File &gt; Options &gt; Language.\r\n- Under Choose Editing Languages, make sure that the language you want to use is added to this list.\r\n- If the language accessory pack includes proofing tools for that language, the Proofing column shows Installed.\r\n- Under Choose Display and Help languages, you can change the default display and help languages for all your Office applications.\r\n- Restart all Office programs for your changes to take effect.\r\n- You can change the default language for all your Office applications in the Set the Office Language Preferences dialog.\r\n\r\nChecksums\r\n\r\nCRC32: 210F4DB4\r\nMD5: EDBEC6AC66DB002B8BFE2ADF5E56B4AB\r\nSHA-1: 5CBCD3277A603C774D7E4F1689AF48C7D159723D\r\n\r\nPlease SEED for a while!","torrent":{"xt":"urn:btih:5fe32dfe1e5b7c2bdb3c6f38bc23665a2cefdf03","amp;dn":"Microsoft+Office+2016+VL+Multi-Language+Interface+Pack+%28x86%2Fx64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fe32dfe1e5b7c2bdb3c6f38bc23665a2cefdf03","infoHashBuffer":{"type":"Buffer","data":[95,227,45,254,30,91,124,43,219,60,111,56,188,35,102,90,44,239,223,3]},"announce":[],"urlList":[]}}