{"title":"Radiation Oncology Primer and Review [PDF] [StormRG]","uid":10800964,"size":9088406,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:60325a2fa6df82a4c425c002d24ad1844d71fdb0&amp;dn=Radiation+Oncology+Primer+and+Review+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":2,"time":1408347426,"description":"Author: George Rodrigues MD FRCPC MSc (Author), Vikram Velker MD (Author), Lara Best MD (Author)\nPaperback: 376 pages\nPublisher: Demos Medical; 1 edition (May 18, 2013)\nLanguage: English\nISBN-10: 1620700042\nISBN-13: 978-1620700044\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nRadiation Oncology Primer and Review describes the fundamental concepts, nomenclature and definitions of the field of radiation oncology that every trainee or practitioner needs to know. Divided into three sections, Radiation Oncology Primer and Review covers basic science, clinical science, and technical and planning issues to give the trainee a full overview of the core knowledge base of the field.\n\nCo-written by a former radiation oncology residency program director and a team of radiation oncology residents, the book is organized in concise sections and is amply illustrated to highlight key points and help the reader understand and retain major concepts. Treatment approaches consistent with published clinical trial protocols that define control/standard of care/consensus radiation treatment are included. In addition to serving as a primary introduction to the field, the book also offers a short review of fundamental concepts for the senior resident prior to written or oral examinations, and is a useful resource for the radiation oncology educator to develop teaching plans and quizzes. Chapter organization is based on the International Atomic Energy Agency Syllabus for the Education and Training of Radiation Oncologists, the syllabus endorsed by both the American Society for Radiation Oncology and the European Society for Therapeutic Radiology and Oncology.\n\nRadiation Oncology Primer and Review:\n\nIntegrates basic science, clinical science and technical concepts to provide the trainee with a complete introduction to the field of radiation oncology\nIs consistent with accepted training syllabus for radiation oncology professionals\nOffers a concise presentation with illustrations highlighting key poiints\nProvides key points for study and reviews\nIncludes treatment approaches consistent with published clinical trial protocols that define control/standard of care/consensus radiation treatment\nIs a valuable review resource for board review","torrent":{"xt":"urn:btih:60325a2fa6df82a4c425c002d24ad1844d71fdb0","amp;dn":"Radiation+Oncology+Primer+and+Review+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60325a2fa6df82a4c425c002d24ad1844d71fdb0","infoHashBuffer":{"type":"Buffer","data":[96,50,90,47,166,223,130,164,196,37,192,2,210,74,209,132,77,113,253,176]},"announce":[],"urlList":[]}}