{"title":"Chicken Invaders 4 - Ultimate Omelette (Mac OS X)","uid":6086994,"size":24253094,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:6037e4c639ea3c8c43ddaea86b20ee43aece8c0a&amp;dn=Chicken+Invaders+4+-+Ultimate+Omelette+%28Mac+OS+X%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ADHDerby","files":-1,"time":1294371406,"description":"Save Earth from an egg-flavored doom in Chicken Invaders 4 - The Ultimate Omelette, a hilarious and action-packed space adventure.\n\nAfter being pushed back successfully three times, the chickens have regrouped and are preparing their most sinister weapon yet. Things look bleak for humanity as the menacing squawks and ruffled feathers darken the sun, but two brave heroes are on the job. Drop that half-eaten chicken burger and jump into the cockpit of your spaceship to repel those fowl invaders!\n\nBlast off and fight through 120 waves of invading chickens in 12 intergalactic star systems. Discover nine awesome weapons such as a spread shot or beam, each upgradeable to 11 levels, and set them to extra crispy when battling gigantic Boss chickens. Collect 30 unique bonuses, 15 shiny medals, and get access to 20 unlockable secrets. Hurry before the earth burns deeply, like spicy chicken wings.\n\n\nFeatures:\n\n- Repel fowl invaders in this hilarious Arcade Shooter.\n- Blast off and fight through 120 waves in 12 intergalactic star systems.\n- Discover nine awesome weapons, each upgradeable to 11 levels.\n- Battle Boss chickens, collect 30 unique bonuses, and unlock 20 secrets.\n\n\nSystem Requirements: Mac OS X 10.4 or better\n\nChicken Invaders 4 - Ultimate Omelette is playable only on Intel-based Mac computers. This game will not be playable on Mac computers with PowerPC processors.\n\n\nInstall: Extract &amp; Play\n\n\nCheers,\n\nADHDerby","torrent":{"xt":"urn:btih:6037e4c639ea3c8c43ddaea86b20ee43aece8c0a","amp;dn":"Chicken+Invaders+4+-+Ultimate+Omelette+%28Mac+OS+X%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6037e4c639ea3c8c43ddaea86b20ee43aece8c0a","infoHashBuffer":{"type":"Buffer","data":[96,55,228,198,57,234,60,140,67,221,174,168,107,32,238,67,174,206,140,10]},"announce":[],"urlList":[]}}