{"title":"The Possessive Investment in Whiteness: How White People Profit ","uid":8797828,"size":1412655,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:606e60c575352391f5f764cb9839b14974459a1e&amp;dn=The+Possessive+Investment+in+Whiteness%3A+How+White+People+Profit+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"blackatk","files":-1,"time":1376117005,"description":"The Possessive Investment in Whiteness: How White People Profit from Identity Politics, Revised and Expanded Edition \n\n\nPublication Date: March 28, 2006 | ISBN-10: 1592134947 | ISBN-13: 978-1592134946 | Edition: Rev Exp |With A special thanks to &quot;wetworx12&quot; - The bitter, racist troll who has inspired this upload. | filetype: pdf |\n\n\n\nIn this unflinching look at white supremacy, George Lipsitz argues that racism is a matter of interests as well as attitudes, a problem of property as well as pigment. Above and beyond personal feelings and acts of individual prejudice, whiteness is a structured advantage that produced unfair gains and unearned rewards for whites while imposing impediments to asset accumulation, employment, housing, and health care for members of aggrieved racial groups. Reaching beyond the black/white binary, Lipsitz shows how whiteness works in respect to Asian Americans, Latinos, and Native Americans. Lipsitz delineates the weaknesses embedded in civil rights laws, the racialised dimensions of economic restructuring and deindustrialization, and the effects of environmental racism, job discrimination, and school segregation. He also analyzes the centrality of whiteness to U.S. culture, the racial appeals encoded within patriotic nationalism, commercialized leisure, and political advertising. Perhaps most important, he identifies the sustained and perceptive critique of white privilege embedded in the art and politics of the radical black tradition. This revised and expanded edition includes an essay about the impact of Hurricane Katrina on working class Blacks in New Orleans, whose perpetual struggle for dignity and self determination has been obscured by the city's image as a tourist party town.\n\n\nReview\n\n&quot;Traversing a remarkably broad terrain of American social, political, and cultural history from the colonial period to the present, Lipsitz interrogates as an idiom of privilege and gain--a shared &quot;investment&quot; whose dividends for generations have accrued to white liberals, and white reactionaries alike... Building on the powerful logic and commitment of [the] opening discussion ... Lipsitz takes a variety of angles on the workings of whiteness... All of these discussions are productive; some of them are dazzling...These narrative turns create the dual impression that, first, there is virtually no corner of American politics, society, or culture where the discerning eye will fail to discover evidence of &quot;race&quot; and its workings; and, second, anywhere Lipsitz casts his gaze he will find something interesting and insightful to say. I have cause to question neither conclusion. This is a terrifically important book.&quot; Matthew Frye Jacobson, American Historical Review &quot;The Possessive Investment in Whiteness is the product of painstaking research and rigorous analysis. It is a work of integrity that expresses indignation at the injustices to which some in society would like us to become inured. Lipsitz demolishes the smug homilies of the so-called neoconservative approach to race. His spirited writing recaptures a fire that has come close to being extinguished in this era. This is scholarship informed by a moral commitment now rarely seen, and often discredited, in the ivory tower. Lipsitz overturns the apple cart of comfortable resignation and brings us face-to-face with how the past has structured the painful racial issues of our day.&quot; Brenda Gayle Plummer, The Annals of the American Academy &quot;This year, I am recommending only one book--George Lipsitz;s The Possessive Investment in Whiteness... Lipsitz is best known for showing how popular culture and the changing fortunes of the working class and people of color transformed the United States after World War II. This new book brings together his fierce passion for racial justice with his talent for cultural analysis.&quot; Susan Douglas, The Progressive.\n\nFrom the Publisher\n\nA widely influential book-revised to reveal racial privilege at work in the 21st century \n\n\n\nPaperback: 320 pages\nPublisher: Temple University Press; Rev Exp edition (March 28, 2006)\nLanguage: English\nISBN-10: 1592134947\nISBN-13: 978-1592134946\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Possessive-Investment-Whiteness-Identity-Politics/dp/1592134947/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Possessive-Investment-Whiteness-Identity-Politics/dp/1592134947/&lt;/a&gt;\n\n\nTags: sociology, economics, economy, value, identity, psychology, self-image, psychology, race, racism, right, wing, republican, democrat, left-wing, commercial, industry, race coding, racially coded, subtle, doublespeak, George W Bush, George H.W Bush, Nixon, John Locke, William F Buckley, barack, obama, barry, black, biracial, IR, multiracial, preseident, bush, war, afghanistan, 2008, change, yes, we, can, hope, biden, china, afghanistan, tea, party, republican, democrat, politics, nobel, prize, war, peace, diplomacy, command, military, race, relations, racism, chicago, senator, white guilt, white anxiety, african, american, african american, black, racism, sociology, social mobiility, social climbing, mentor, race relations, race, militia, hate, nazi, white anxiety, oppression, tea party, fundamentalist, fundementalism, political science, hate group, ghettoization, blacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery, experimentation, tuskeegee, unconscious, subconscious, economics, interest, self-interest, benefits, protection, assets, economy, wealth, money, investments, ","torrent":{"xt":"urn:btih:606e60c575352391f5f764cb9839b14974459a1e","amp;dn":"The+Possessive+Investment+in+Whiteness%3A+How+White+People+Profit+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"606e60c575352391f5f764cb9839b14974459a1e","infoHashBuffer":{"type":"Buffer","data":[96,110,96,197,117,53,35,145,245,247,100,203,152,57,177,73,116,69,154,30]},"announce":[],"urlList":[]}}