{"title":"T3 India - August 2016 (gnv64)","uid":15513808,"size":51862295,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:60a700393dddcd25e62019084ad9db2ec08b7d37&amp;dn=T3+India+-+August+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"gnv65","files":4,"time":1470683130,"description":"T3 India - August 2016 (Anniversary Special)\r\nEnglish | 164 pages | True PDF | 49.4 mb\r\n\r\nFEATURES\r\n042 GADGET GURU - Our man in the know (allegedly) imparts his wisdom with tips for fashion disasters, memory-boosting gadgets and more\r\n047 AGENDA - Seven new adventures you can enjoy with tech. This issue, pair your love of the outdoors with getting trollied at a gig, design your dream bachelor pad and up your tennis skills\r\n055 THE BEST TECH FOR… - Having the most entertaining days of your life!\r\n064 MAN VS TECH - How to make off-roading even more lethal? Take one man, strap some off-road/action tech to him and watch him attempt\r\n070 STATE OF THE ART - Get to cycling but don’t just settle for normal pedal power – invest in an electric bicycle. Here, we show you which one you really need to buy\r\n082 GOOGLE HOME - It’s going to change the way you live, forever\r\n\r\nHYPE\r\n014 PREVIEW - The sexiest new gear in the world, including the Samsung SUHD TV, Omega SeaMaster Rio 2016 Edition, new Xbox One S and more\r\n038 PEOPLE - England’s hopes rest on Wayne Rooney’s shoulders but is he able to cope with the pressure? We reckon he’ll have much more chance with our top tech suggestions\r\n041 TALKING TECH - This month, our columnist Duncan Bell gets a ride in the Batmobile, and gets a little bit moist over a movie projector\r\n\r\nSELECT\r\n100 HTC 10 - We put HTC’s latest flagship device to a thorough test\r\n102 LG G5 - Is modular design, reason enough to get your hands-on the G5?\r\n104 XIAOMI MI MAX - Andre the Giant in the world of smartphones\r\n116 SUPER SIX - In the market for Bluetooth speakers? Look no further!\r\n118 GAMES - This month, we give Dark Souls III the once-over\r\n\r\nELITE\r\n137 INTRODUCING THE BEST BUYER’S GUIDE KNOWN TO MAN\r\nFrom phones to tablets, and camera to cars, our\r\nselection of the very best tells you what to buy\r\n\r\nESSENTIALS\r\n005 GAMECHANGER\r\n069 SUBSCRIPTIONS\r\n146 MONEY NO OBJECT\r\n \nhttps://s9.postimg.org/ic3ncu9q7/T3_India_August_2016.jpg","torrent":{"xt":"urn:btih:60a700393dddcd25e62019084ad9db2ec08b7d37","amp;dn":"T3+India+-+August+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60a700393dddcd25e62019084ad9db2ec08b7d37","infoHashBuffer":{"type":"Buffer","data":[96,167,0,57,61,221,205,37,230,32,25,8,74,217,219,46,192,139,125,55]},"announce":[],"urlList":[]}}