{"title":"Conjunto Primavera - Lo Mejor de Canciones Rancheras - Complete","uid":4436017,"size":39022571,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:60b6d54ab1098ee39d02e903cd15b93423deb852&amp;dn=Conjunto+Primavera+-+Lo+Mejor+de+Canciones+Rancheras+-+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"TheLabMan","files":9,"time":1223553510,"description":"- PRIMAVERA -\n\n\n\n                 Lo Mejor de Canciones Rancheras Complete Cd Mp3 \n\n\n\n\n  \n        Track - \t        Composer:  \t        Time:  \t\n\n1 \tY Nos Dieron las Diez \tSabina, Joaquin  \t5:07 \t\n \n2 \tSiento Celos \t        Velasquez, Martin  \t2:45 \t\n \n3 \tAdios Adios Adios \tMarquez, Vilma  \t2:52 \t\n \n4 \tEse SeÃƒÆ’Ã‚Â±or de las Canas \tClaro, Lorenzo Monte  \t2:47 \t\n \n5 \tLa Quebradita \t        Ochoa, Oscar    \t3:12 \t\n \n6 \tY Que Te Dicen \t        Melendez, Antonio  \t2:56 \t\n \n7 \tY Otra Vez \t        Ochoa, Oscar  \t        3:35 \t\n \n8 \tTriste Felicitacion \tOchoa, Oscar            3:42 \t\n\n\n\n\nBy the time Conjunto Primavera joined the roster of regional Mexican monolith Fonovisa Records in 1996, the romantically inclined sextet had already become one of the leading norteÃƒÆ’Ã‚Â±o acts of the day, and yet their popularity only continued to grow, as they began regularly topping the regional charts with their bottomless well of hits. As is typical of chihuahuense bands like Conjunto Primavera, they incorporate saxophone into their sound, and this sets them apart from norteÃƒÆ’Ã‚Â±o contemporaries like Los Tigres del Norte who aren't from the same region of Mexico. The saxophone is a signature component of norteÃƒÆ’Ã‚Â±o acts from Chihuahua, the large, mainly arid northwestern state across the border from New Mexico and Texas. Taking their name from the term conjunto (a style often considered synonymous with norteÃƒÆ’Ã‚Â±o, yet distinct in some minor ways), Conjunto Primavera are classified generally as a norteÃƒÆ’Ã‚Â±o act; however, they perform songs in a variety of styles, including rancheras, cumbias, boleros, and ballads. Their romantic bent is especially noteworthy, as some of their contemporaries, like the aforementioned Tigres del Norte, for example, eschew such sentiment, favoring corridos instead. Conjunto Primavera were founded on March 21, 1978 (i.e., the first day of spring), by saxophonist Juan DomÃƒÆ’Ã‚Â­nguez in Ojinaga, Chihuahua, Mexico. Other members include Tony MelÃƒÆ’Ã‚Â©ndez (vocals), Oscar Ochoa (bass), FÃƒÆ’Ã‚Â©lix Antonio Contreras (accordion, keyboards), Manuel Rolando PÃƒÆ’Ã‚Â©rez (bajo sexto), and Daniel MartÃƒÆ’Ã‚Â­nez (drums). Some slots in the lineup have turned over during the band's long career, but most have remained steadily in place. Conjunto Primavera performed locally for a few years before signing a recording contract with Joey Records, an independent regional Mexican label based in San Antonio, TX. The group recorded a steady stream of albums for Joey, many of which were reissued on CD in the mid-'90s. These reissues came in the wake of Me Nortie (1993), Conjunto Primavera's breakthrough album and their debut on AFG Sigma Records. However successful, this new label partnership didn't last long, as AFG Sigma (a label owned by the group Los Temerarios) began faltering financially in the mid-'90s and consequently was bought out by regional Mexican monolith Fonovisa. Conjunto Primavera fortunately were one of only a couple bands to survive the transition from AFG Sigma to Fonovisa, and their profile was greatly bolstered as a result, beginning with their label debut in 1996. From that point onward, Conjunto Primavera would record albums steadily for Fonovisa, which would in turn ensure optimal marketing and distribution for each. This business relationship reaped significant reward for both parties, as Conjunto Primavera ascended the ranks of regional Mexican music in terms of popularity and acclaim, joining the likes of labelmates Los Tigres del Norte and Grupo Exterminador among the norteÃƒÆ’Ã‚Â±o scene's leading acts. Necesito Decirte (1998) was their first album to be RIAA-certified platinum, with more than a million copies sold. Successive albums (Morir de Amor [2000], Ansia de Amar [2001], Perdoname Mi Amor [2002], et al.) generally went at least gold, with over a half-million sold each. Furthermore, Conjunto Primavera regularly earned Latin Grammy nominations; they even performed at the 2006 ceremony, where they won the award for Best Regional Mexican Song (&quot;AÃƒÆ’Ã‚Âºn Sigues Siendo MÃƒÆ’Ã‚Â­a&quot;). ~ Jason Birchmeier, All Music Guide\t\t\t\n \n\n\n\n\n\n","torrent":{"xt":"urn:btih:60b6d54ab1098ee39d02e903cd15b93423deb852","amp;dn":"Conjunto+Primavera+-+Lo+Mejor+de+Canciones+Rancheras+-+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60b6d54ab1098ee39d02e903cd15b93423deb852","infoHashBuffer":{"type":"Buffer","data":[96,182,213,74,177,9,142,227,157,2,233,3,205,21,185,52,35,222,184,82]},"announce":[],"urlList":[]}}