{"title":"Tommy Emmanuel - Little by little - 2CD 2010","uid":6894364,"size":506920844,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:60f363ff3c34a8b8aff138d8e28b6b27aa283624&amp;dn=Tommy+Emmanuel+-+Little+by+little+-+2CD+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"barber9","files":-1,"time":1324139192,"description":"William Thomas Tommy Emmanuel AM (born 31 May 1955) is an Australian guitarist, best known for his complex fingerpicking style, energetic performances and the use of percussive effects on the guitar. In the May 2008 and 2010 issues of Guitar Player Magazine, he was named as Best Acoustic Guitarist in their readers' poll. In June 2010 Emmanuel was appointed a Member of the Order of Australia (AM).\n\n- - -\n\nEmmanuel has said that even at a young age he was fascinated by Chet Atkins musical style - sometimes referred to as Travis picking - of playing bass with the thumb and melody parts with the first two or three fingers at the same time. This technique became the basis of Tommy's guitar style.\n\nWhile Emmanuel has never had formal music training, his playing ability has won him fans from all over the world. He is known to play percussion parts on the body of his guitar. As a solo performer he never plays to a set list and uses a minimum of effects. He usually completes recordings in one take.\n\nEmmanuel frequently uses his left thumb to fret bass notes on the 5th and 6th strings as well as playing chords such as Am and E with just two fingers. He uses a thumb pick mostly, a flat pick or just fingers. He also integrates amongst his trademark blazing runs and kaleidoscopic chord progressions a quick note / chord dive, imitating a tremolo system effect on his fixed-bridge acoustic guitars, by pressing the palm of his right hand against the body of the guitar directly above the fret board close to the neck joint while maintaining forward pressure with his left (fretting) hand.\n\nHis main guitar is a small-bodied custom Maton EBG808, that is fitted with a pickup and an internal condenser microphone, to which he has given the nickname Mouse, due to its quieter volume unplugged but massive sound when plugged into an amp. Two of his three main stage guitars, notably his signature TE1 Maton dreadnought, are battered and worn from his excessive playing and percussive techniques on them. He recently stated at a workshop during his annual festival, Tommyfest UK (2008), that all three of his stage guitars have been broken and repaired numerous times over the years.\n\n- - -\n\nLittle by Little is the 17th studio album of Australian guitarist Tommy Emmanuel, released in 2010. (wikipedia)\n\n- - -\n\nTommy Emmanuel - Little by little 2010\n(2CD Hollywood, Calif  Favored Nations)\n\n 1. Halfway home. \n 2. The jolly swagman. \n 3. Locomotivation. \n 4. Haba na haba (instrumental). \n 5. Tears for Jerusalem. \n 6. Waiting for a plane. \n 7. The fingerlakes. \n 8. The Welsh tonado. \n 9. He ain't heavy he's my brother. \n10. The mighty mouse. \n11. Ruby's eyes. \n12. Moon river (instrumental). \n13. Jack Magic. \n14. Papa George. \n15. Haba na haba (vocal). \n16. Tapestry. \n17. Mountains of Illinois. \n18. The tennessee waltz. \n19. Countrywide. \n20. Moon river (vocal). \n21. Willie's shades. \n22. Smoke Mountain lullaby. \n23. Guitar boogie. \n24. The trails\n","torrent":{"xt":"urn:btih:60f363ff3c34a8b8aff138d8e28b6b27aa283624","amp;dn":"Tommy+Emmanuel+-+Little+by+little+-+2CD+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60f363ff3c34a8b8aff138d8e28b6b27aa283624","infoHashBuffer":{"type":"Buffer","data":[96,243,99,255,60,52,168,184,175,241,56,216,226,139,107,39,170,40,54,36]},"announce":[],"urlList":[]}}