{"title":"High-Impact Interview Questions-Mantesh","uid":6314820,"size":1114379,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:610cee252e92abffef11d733ecaf432bf43224b4&amp;dn=High-Impact+Interview+Questions-Mantesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"MANTESH","files":4,"time":1302666972,"description":" &lt;a href=&quot;http://ecx.images-amazon.com/images/I/51CqS5piy4L._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://ecx.images-amazon.com/images/I/51CqS5piy4L._SS500_.jpg&lt;/a&gt;\n\n\n\n[\n\n\nHigh-Impact Interview Questions: 701 Behavior-Based Questions to Find the Right Person for Every Job\n\n\n\n\nAMACOM\nVictoria A. Hoevemeyer\nEnglish\n2005 \nISBN: 0814473016 \n192 pages \nPDF \n947 KB\n\n\n\n\nLike many of the offerings from Amacom, the publishing arm of the American Management Association, High-Impact Interview Questions: 701 Behavior-based Questions to Find the Right Person for Every Job has a no-nonsense, practical bent. Focused on both the art and the science of effective job interviews, it's clearly intended as a manual for everyday use by hiring managers and human-resource professionals across a wide range of organizations. Author Victoria Hoevemeyer has worked for over 20 years in organizational development and leadership coaching from her home base of Illinois, and her expertise shows through in the direct, straightforward tone suffusing this book.\n\nIf the interactions between job seekers and job interviewers can resemble a cat-and-mouse game, with each group trying to outwit and to stay one step ahead of the other, High-Impact Interview Questions serves as recruiters' foil to the books popular with candidates, such as How Would You Move Mt. Fuji? and Best Answers to the 201 Most Frequently Asked Interview Questions . It opens by describing three different kinds of questions which dominate most modern job interviews: conventional questions (&quot;What are your greatest strengths and weaknesses?&quot;), situational questions (&quot;How would you handle a crisis in which your boss asked you to do something that you considered unethical?&quot;), and brainteaser questions (&quot;Why are manhole covers round?&quot;), and analyzes the shortcomings of each approach. These techniques for sorting good job candidates from bad are fundamentally flawed, according to Hoevemeyer, because they are far too predictable and artificial, and don't illuminate the qualities that actually make a difference to new employees' success.\n\nInstead, Hoevemeyer advances a philosophy which she terms &quot;Competency-Based Behavioral Interviewing&quot; (CBBI). Her basic premise is that past performance is the best predictor of future performance, and that the more recent a particular behavior, the stronger of a predictor it will be. If you accept those assumptions, then much of what follows in the book's explanations of CBBI are highly logical.\n\nThe most valuable part of High-Impact Interview Questions is its extensive catalog of sample interview questions, grouped according to the underlying quality which they're meant to uncover. After introducing CBBI and showing how it ties specific and precise interview questions back to the functional competencies job seekers will need in a particular position, the book provides a very handy guide to sample questions which any interviewer can use. Interested in a candidate's decision-making ability? Try &quot;Describe a time you had to make a quick decision with incomplete information?&quot; How about attention to detail? For that, the book prescribes queries like, &quot;Tell me about a time when you caught an error that others had missed.&quot;\n\nEsoteric philosophical tome, this isn't. But for those job interviewers who believe in competency-based questions and want an efficient guide to learning about interviewees' true potential, this book is a worthwhile read.\n\n\n\n[","torrent":{"xt":"urn:btih:610cee252e92abffef11d733ecaf432bf43224b4","amp;dn":"High-Impact+Interview+Questions-Mantesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"610cee252e92abffef11d733ecaf432bf43224b4","infoHashBuffer":{"type":"Buffer","data":[97,12,238,37,46,146,171,255,239,17,215,51,236,175,67,43,244,50,36,180]},"announce":[],"urlList":[]}}