{"title":"The Painter by Peter Heller","uid":10100871,"size":1073550,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61bdecc4f598aa954ad033d5f0af9f09e9dbeeb6&amp;dn=The+Painter+by+Peter+Heller&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"PirateBook","files":1,"time":1399397867,"description":"\nPeter Heller, the celebrated author of the breakout best seller The Dog Stars, returns with an achingly beautiful, wildly suspenseful second novel about an artist trying to outrun his past.\n\nJim Stegner has seen his share of violence and loss. Years ago he shot a man in a bar. His marriage disintegrated. He grieved the one thing he loved. In the wake of tragedy, Jim, a well-known expressionist painter, abandoned the art scene of Santa Fe to start fresh in the valleys of rural Colorado.\n\nNow he spends his days painting and fly-fishing, trying to find a way to live with the dark impulses that sometimes overtake him. He works with a lovely model. His paintings fetch excellent prices. But one afternoon, on a dirt road, Jim comes across a man beating a small horse, and a brutal encounter rips his quiet life wide open. Fleeing Colorado, chased by men set on retribution, Jim returns to New Mexico, tormented by his own relentless conscience.\n\nA stunning, savage novel of art and violence, love and grief, The Painter is the story of a man who longs to transcend the shadows in his heart, a man intent on using the losses he has suffered to create a meaningful life.\n\nGenre: Literary Fiction ","torrent":{"xt":"urn:btih:61bdecc4f598aa954ad033d5f0af9f09e9dbeeb6","amp;dn":"The+Painter+by+Peter+Heller","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61bdecc4f598aa954ad033d5f0af9f09e9dbeeb6","infoHashBuffer":{"type":"Buffer","data":[97,189,236,196,245,152,170,149,74,208,51,213,240,175,159,9,233,219,238,182]},"announce":[],"urlList":[]}}