{"title":"Substitute - Nicholson Baker","uid":15778785,"size":1087397,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61cce2ba91ea055a3fc9766177af431d8befdf76&amp;dn=Substitute+-+Nicholson+Baker&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mr_mando","files":2,"time":1473267584,"description":"\nIn 2014, after a brief orientation course and a few fingerprinting sessions, Nicholson Baker became an on-call substitute teacher in a Maine public school district. He awoke to the dispatcher’s five-forty a.m. phone call and headed to one of several nearby schools; when he got there, he did his best to follow lesson plans and help his students get something done. What emerges from Baker’s experience is a complex, often touching deconstruction of public schooling in America: children swamped with overdue assignments, over­whelmed by the marvels and distractions of social media and educational technology, and staff who weary themselves trying to teach in step with an often outmoded or overly ambitious standard curriculum. \r\n \r\nIn Baker’s hands, the inner life of the classroom is examined anew—mundane work­sheets, recess time-outs, surprise nosebleeds, rebellions, griefs, jealousies, minor triumphs, kindergarten show-and-tell, daily lessons on everything from geology to metal tech to the Holocaust—as he and his pupils struggle to find ways to get through the day. Baker is one of the most inventive and remarkable writers of our time, and Substitute, filled with humor, honesty, and empathy, may be his most impressive work of nonfiction yet","torrent":{"xt":"urn:btih:61cce2ba91ea055a3fc9766177af431d8befdf76","amp;dn":"Substitute+-+Nicholson+Baker","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61cce2ba91ea055a3fc9766177af431d8befdf76","infoHashBuffer":{"type":"Buffer","data":[97,204,226,186,145,234,5,90,63,201,118,97,119,175,67,29,139,239,223,118]},"announce":[],"urlList":[]}}