{"title":"Terry Pratchett - Snuff","uid":6746704,"size":516636754,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:61edacbd6c381d74291e2bc6da382f1b8a1553b6&amp;dn=Terry+Pratchett+-+Snuff&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"CRennings","files":37,"time":1318717988,"description":"Written by Terry Pratchett\nRead by Stephen Briggs\nFormat: MP3\nBitrate: 96 Kbps\nUnabridged\n\nFor nearly three decades, Terry Pratchett has enthralled millions of fans worldwide with his irreverent, wonderfully funny satires set in the fabulously imaginative Discworld, a universe remarkably similar to our own. From sports to religion, politics to education, science to capitalism, and everything in between, Pratchett has skewered sacred cows with both laughter and wisdom, and exposed our warts, foibles, and eccentricities in a unique, entertaining, and ultimately serious way.\n\nAt long last, Lady Sybil has lured her husband, Sam Vimes, on a well-deserved holiday away from the crime and grime of Ankh-Morpork. But for the commander of the City Watch, a vacation in the country is anything but relaxing. The balls, the teas, the muck - not to mention all that fresh air and birdsong - are more than a bit taxing on a cynical city-born and -bred copper.\n\nYet a policeman will find a crime anywhere if he decides to look hard enough, and it's not long before a body is discovered, and Sam - out of his jurisdiction, out of his element, and out of bacon sandwiches (thanks to his well-meaning wife) - must rely on his instincts, guile, and street smarts to see justice done. As he sets off on the chase, though, he must remember to watch where he steps... This is the countryside, after all, and the streets most definitely are not paved with gold.","torrent":{"xt":"urn:btih:61edacbd6c381d74291e2bc6da382f1b8a1553b6","amp;dn":"Terry+Pratchett+-+Snuff","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61edacbd6c381d74291e2bc6da382f1b8a1553b6","infoHashBuffer":{"type":"Buffer","data":[97,237,172,189,108,56,29,116,41,30,43,198,218,56,47,27,138,21,83,182]},"announce":[],"urlList":[]}}