{"title":"Find Your Everest - Raj Rawat Kindle Pre-release PDF (2016)","uid":15716931,"size":681748,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6240b77dea1becaaae9b1e1479b8108d78e61789&amp;dn=Find+Your+Everest+-+Raj+Rawat+Kindle+Pre-release+PDF+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"thinkgood","files":1,"time":1472634639,"description":"This IS A FANTASTIC short book about finding your purpose and getting the skills/knowledge to be successful at achieving it. As always, support good work. IF YOU LIKE IT, BUY IT!\r\n\r\nDESCRIPTION:\r\nWhy be the pinball in someone else’s game, when you can be the one playing the game? \r\n\r\nLife is about choices, decisions, priorities. If you don’t choose, SOMEONE ELSE WILL CHOOSE FOR YOU. If you want to live a fantastic life, you’ve got to recognize that time and energy are EXTREMELY limited and precious. Your success in life is directly proportional to how well you channel your time, energy, and presence into the things that matter to YOU. \r\n\r\nIn Find Your Everest, author Raj Rawat makes the bold claim that the scarcity of time and energy compels us to be bold and to choose a target that we might normally dismiss as too big, too hard, or too difficult. Most people spend all of their time chasing opportunities. Finding your Everest is the first step to reverse the chase and get opportunities to chase you. \r\n\r\nAt once inspirational, motivational, and extremely practical, Find Your Everest shares a series of tools and techniques to help you concretely: \r\n\r\n- Identify your personal priorities \r\n- Set a goal worthy of you \r\n- and get perspective to perform at the highest level \r\n\r\n\r\nFind Your Everest will profoundly change the way you think. Build a life worthy of you.\r\n\r\n\r\n\r\nIF YOU LIKE IT, SUPPORT THE AUTHOR AND BUY IT","torrent":{"xt":"urn:btih:6240b77dea1becaaae9b1e1479b8108d78e61789","amp;dn":"Find+Your+Everest+-+Raj+Rawat+Kindle+Pre-release+PDF+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6240b77dea1becaaae9b1e1479b8108d78e61789","infoHashBuffer":{"type":"Buffer","data":[98,64,183,125,234,27,236,170,174,155,30,20,121,184,16,141,120,230,23,137]},"announce":[],"urlList":[]}}