{"title":"SuperDuper! 2.8","uid":12435787,"size":3505881,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:6265ab7ee788f97dbc0a9e094521b9487c88ef62&amp;dn=SuperDuper%21+2.8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":null,"files":3,"time":1442508736,"description":"From MacTake.com\n\nSuperDuper! is an advanced, yet easy to use disk copying program. It can, of course, make a straight copy, or &quot;clone&quot; -- useful when you want to move all your data from one machine to another, or do a simple backup. In moments, you can completely duplicate your boot drive to another drive, partition, or image file.\nClones for safety. To ensure you can safely roll back a system after the unexpected occurs. With a few clicks, you can easily &quot;checkpoint&quot; your system, preserving your computer's critical applications and files while you run on a working, bootable copy. If anything goes wrong, just reboot to the original. When you do, your current Documents, Music, Pictures -- even iSync data -- are available! You can get back to work immediately.\n\nClones for industry! SuperDuper has enough features to satisfy the advanced user, too. Its simple-but-powerful Copy Script feature allows complete control of exactly what files get copied, ignored, even aliased (&quot;soft linked&quot; for the Unix inclined) from one drive to another.\n\nWHAT'S NEW\nEnhancements &amp; Bug Fixes\n- Fixes issue with &quot;looping symlinks&quot; in some app frameworks (MDRP, FileMaker Deluxe Pro, iPhoto Library Manager 2, TextMate)","torrent":{"xt":"urn:btih:6265ab7ee788f97dbc0a9e094521b9487c88ef62","amp;dn":"SuperDuper%21+2.8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6265ab7ee788f97dbc0a9e094521b9487c88ef62","infoHashBuffer":{"type":"Buffer","data":[98,101,171,126,231,136,249,125,188,10,158,9,69,33,185,72,124,136,239,98]},"announce":[],"urlList":[]}}