{"title":"Marx's General: The Revolutionary Life of Friedrich Engels EPUB","uid":11663587,"size":470345,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:628eb1f360e566f9e0e8cedbf398c3faa4192e4e&amp;dn=Marx%27s+General%3A+The+Revolutionary+Life+of+Friedrich+Engels+EPUB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"nosnavis","files":1,"time":1418021381,"description":"Marx's General: The Revolutionary Life of Friedrich Engels\nTristram Hunt\nEPUB\n\n\n\nFriedrich Engels is one of the most intriguing and contradictory figures of the nineteenth century. Born to a prosperous mercantile family, he spent his life enjoying the comfortable existence of a Victorian gentleman; yet he was at the same time the co-author of The Communist Manifesto, a ruthless political tactician, and the man who sacrificed his best years so that Karl Marx could have the freedom to write. Although his contributions are frequently overlooked, Engels's grasp of global capital provided an indispensable foundation for communist doctrine, and his account of the Industrial Revolution, The Condition of the Working Class in England, remains one of the most haunting and brutal indictments of capitalism's human cost.\n\nDrawing on a wealth of letters and archives, acclaimed historian Tristram Hunt plumbs Engels's intellectual legacy and shows us how one of the great bon viveurs of Victorian Britain reconciled his exuberant personal life with his radical political philosophy. This epic story of devoted friendship, class compromise, ideological struggle, and family betrayal at last brings Engels out from the shadow of his famous friend and collaborator","torrent":{"xt":"urn:btih:628eb1f360e566f9e0e8cedbf398c3faa4192e4e","amp;dn":"Marx%27s+General%3A+The+Revolutionary+Life+of+Friedrich+Engels+EPUB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"628eb1f360e566f9e0e8cedbf398c3faa4192e4e","infoHashBuffer":{"type":"Buffer","data":[98,142,177,243,96,229,102,249,224,232,206,219,243,152,195,250,164,25,46,78]},"announce":[],"urlList":[]}}