{"title":"Typhoon - White Lighter (2013) [FLAC]","uid":8832168,"size":296927814,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:62bccbf5e690e94cc2859e3a0213cd63be2f04b7&amp;dn=Typhoon+-+White+Lighter+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"politux","files":-1,"time":1377015308,"description":"\n  Typhoon - White Lighter (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Pop, Indie Rock, Alternative, Chamber Pop\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Prelude \n  02 Artificial Light \n  03 Young Fathers \n  04 Morton's Fork \n  05 Possible Deaths \n  06 The Lake \n  07 Dreams of Cannibalism \n  08 One Hundred Years \n  09 Prosthetic Love \n  10 Hunger and Thirst \n  11 Caesar \n  12 Common Sentiments \n  13 Post Script \n\n  With 14 members, Portland, Oregon's Typhoon has more than enough firepower to propel its seismic indie rock confections past the nosebleed seats and into the parking lot, but despite its voluminous arsenal, the band shows great restraint on White Lighter, the follow-up to their well-received 2011 EP A New Kind of House. Operating somewhere between the nervy tenderness of Frightened Rabbit, the exotic, orchestral spell casting of Beirut, and the earnest and all-inclusive, aural high fiving of Arcade Fire, Typhoon, led by garrulous frontman Kyle Morton, is an idiosyncratic, anthem-producing machine. Familiar flavors and indie rock pantry staples like glockenspiel, spirited horn and string sections, and enthusiastic backing vocals abound, but Morton and company take frequent leaps of faith, punching holes in the indie pop template with enough melodic left turns, odd time signatures, and complex breakdowns to lure a few unsuspecting prog rock fans into the fold. \n\n  That said, this is fist-pumping, NPR-loving, heartfelt arena pop through and through, with highlights arriving via immaculately crafted mini-epics like &quot;Artificial Light,&quot; &quot;Hunger and Thirst,&quot; and &quot;Young Fathers,&quot; the latter of which sounds like an acoustic rendering of something off of Sufjan Stevens formidable Age of Adz. The band's ability to knock it out of the park without beating the listener over the head is a testament to their acumen for arranging. Songs like &quot;Lake Mix,&quot; with its easy intro, pastoral underpinnings, and propulsive backside, and the measured, hymn-like closer &quot;Post Script,&quot; benefit from tasteful applications of muscle. Refreshingly cerebral and undeniably emotional, this is music for both sides of the brain.","torrent":{"xt":"urn:btih:62bccbf5e690e94cc2859e3a0213cd63be2f04b7","amp;dn":"Typhoon+-+White+Lighter+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62bccbf5e690e94cc2859e3a0213cd63be2f04b7","infoHashBuffer":{"type":"Buffer","data":[98,188,203,245,230,144,233,76,194,133,158,58,2,19,205,99,190,47,4,183]},"announce":[],"urlList":[]}}