{"title":"Pressure Vessel Design Manual 4th ed - Dennis R. Moss","uid":12108213,"size":34978915,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62ea54b382e33af683e7714b2582b2d6a1532066&amp;dn=Pressure+Vessel+Design+Manual+4th+ed+-+Dennis+R.+Moss&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"clouderone","files":1,"time":1436489270,"description":"Pressure Vessel Design Manual 4th ed - Dennis R. Moss (Elsevier, 2013).pdf\n\nISBN 9780123870001\n\nPressure vessels are closed containers designed to hold gases or liquids at a pressure substantially different from the ambient pressure. They have a variety of applications in industry, including in oil refineries, nuclear reactors, vehicle airbrake reservoirs, and more. The pressure differential with such vessels is dangerous, and due to the risk of accident and fatality around their use, the design, manufacture, operation and inspection of pressure vessels is regulated by engineering authorities and guided by legal codes and standards. Pressure Vessel Design Manual is a solutions-focused guide to the many problems and technical challenges involved in the design of pressure vessels to match stringent standards and codes. It brings together otherwise scattered information and explanations into one easy-to-use resource to minimize research and take readers from problem to solution in the most direct manner possible.\n\nCovers almost all problems that a working pressure vessel designer can expect to face, with 50+ step-by-step design procedures including a wealth of equations, explanations and data\nInternationally recognized, widely referenced and trusted, with 20+ years of use in over 30 countries making it an accepted industry standard guide\nNow revised with up-to-date ASME, ASCE and API regulatory code information, and dual unit coverage for increased ease of international use","torrent":{"xt":"urn:btih:62ea54b382e33af683e7714b2582b2d6a1532066","amp;dn":"Pressure+Vessel+Design+Manual+4th+ed+-+Dennis+R.+Moss","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62ea54b382e33af683e7714b2582b2d6a1532066","infoHashBuffer":{"type":"Buffer","data":[98,234,84,179,130,227,58,246,131,231,113,75,37,130,178,214,161,83,32,102]},"announce":[],"urlList":[]}}