{"title":"Cracker (1993-1995) - (3 Seasons)","uid":10291085,"size":12392057044,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:62f4993e096bff48a6b33e33509232391e4df4af&amp;dn=Cracker+%281993-1995%29+-+%283+Seasons%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":5,"uploader":"bnaron","files":-1,"time":1401856595,"description":"Description Source: Wikipedia, the free encyclopedia\n\nCracker is a British crime drama series produced by Granada Television for ITV and created and principally written by Jimmy McGovern. The series is centered on a criminal psychologist (or &quot;cracker&quot;), Dr Edward &quot;Fitz&quot; Fitzgerald, played by Robbie Coltrane. Set in Manchester, it consists of three series which were originally aired from 1993 to 1995. A 100-minute special set in Hong Kong followed in 1996, and another two-hour story in 2006.\n\n\n\nEpisode Guide:\n\n\nSeason 1 - 7 Episodes covering 3 stories (Note: The episodes making up each story\n                                                have been merged into an\n                                                individual MP4 video file.\n\n\nStory 1: The Mad Woman in the Attic (2 Episodes)\n\n         Synopsis: A young woman is brutally murdered on a train, the victim of a\n                   serial killer. The prime suspect is an amnesiac man, who cannot\n                   confess to the crime if he cannot remember committing it unless\n                   Fitz can crack him.\n\n\nStory 2: To Say I Love You (3 Episodes)\n\n         Synopsis: While his own marriage is falling apart, Fitz goes up against a\n                   young couple who would literally kill for their love, leading\n                   to an equally literally explosive climax.\n\n\nStory 3: One Day a Lemming Will Fly (2 Episodes)\n\n         Synopsis: The disappearance and death of a 13-year-old boy inflames the\n                   local community as a teacher becomes the prime suspect. But\n                   Fitz begins to have doubts about the teacher's guilt and\n                   attempts to convince Billborough that the truth is more\n                   important than a mere result that seems to fit.\n\n\nSeason 2 - 9 Episodes covering 3 stories (Note: The episodes making up each story\n                                                have been merged into an\n                                                individual MP4 video file.\n\n\nStory 1: To Be a Somebody (3 Episodes)\n\n         Synopsis: A Pakistani shopkeeper is killed and a skinhead seen leaving\n                   the premises. The police are at first convinced that it is a\n                   racist killing until a white, English psychologist helping out\n                   with the case and DCI Billborough are murdered by the same man.\n                   Fitz, while facing his own problems with his family and a hurt\n                   Penhaligon, is brought in to investigate, convinced that the\n                   killer is not a mere racist hood but actually an ordinary\n                   citizen gone horribly wrong.\n\n\nStory 2: The Big Crunch (3 Episodes)\n\n         Synopsis: A young girl missing for several days is discovered naked,\n                   covered in strange symbols and quoting the Bible. The trail\n                   leads to a fringe Christian sect and its charismatic leader.\n\n\nStory 3: Men Should Weep (3 Episodes)\n\n         Synopsis: The case of a serial rapist who wears a mask, yet tries to\n                   develop a relationship with his victims strikes at the heart of\n                   Fitz's personal and professional life when Penhaligon is raped\n                   and the rapist, apparently acting on Fitz's advice, starts to\n                   kill as well. Meanwhile, Penhaligon begins to discover a\n                   connection between her rapist and Jimmy Beck.\n\n\nSeason 3 - 7 Episodes covering 3 stories (Note: The episodes making up each story\n                                                have been merged into an\n                                                individual MP4 video file.\n\n\nStory 1: Brotherly Love (3 Episodes)\n\n         Synopsis: The brutal murder and violation of a prostitute quickly leads\n                   to an arrest, but while the suspect is in custody, an identical\n                   murder happens. At the same time, the death of Fitz's mother\n                   reunites him with his brother Danny, and Jimmy Beck, under long\n                   time stress from Bilborough's death, finally reaches his\n                   breaking point, leading to a devastating climax.\n\n\nStory 2: Best Boys (2 Episodes)\n\n         Synopsis: When the older Stuart Grady meets the teenage Bill Nash, the\n                   instant attraction between the two leads to murderous\n                   consequences. Meanwhile, the birth of Fitz's new son is not the\n                   solution to his marital strife that he expected, and Judith\n                   begins to seek solace with Danny.\n\n\nStory 3: True Romance (2 Episodes)\n\n         Synopsis: Fitz is the target of a secret admirer who is willing to kill -\n                   and keep killing - to get his attention, understanding and\n                   love, even if it means targeting Fitz's loved ones.\n\n\nSpecial Episodes\n\n\n1998:    White Ghost (Single Episode)\n\n         Synopsis: While in Hong Kong on a lecture tour, Fitz is asked by the\n                   local police to help investigate the murder of a Chinese\n                   businessman.\n\n\n2006:    Nine Eleven  - UK Promo Title  (Single Episode)\n         A New Terror - USA Promo Title\n\n         Synopsis: Fitz returns to Manchester for his daughter's wedding, but is\n                   soon involved in another murder investigation when an American\n                   comedian is killed, apparently without motive.\n\n\nVideo Specs: Roughly 700 x 440 Resolution - 1122k Data Rate\n             25fps - H.264/AVC Codec - MP4 File Type\n\nAudio Specs: 96k Bit Rate - 44.1k Sample Rate\n             2 Channel Stereo - MPEG-2/4 Audio Codec\n","torrent":{"xt":"urn:btih:62f4993e096bff48a6b33e33509232391e4df4af","amp;dn":"Cracker+%281993-1995%29+-+%283+Seasons%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62f4993e096bff48a6b33e33509232391e4df4af","infoHashBuffer":{"type":"Buffer","data":[98,244,153,62,9,107,255,72,166,179,62,51,80,146,50,57,30,77,244,175]},"announce":[],"urlList":[]}}