{"title":"Peace, Propaganda And The Promised Land [AVI]","uid":4646743,"size":733212672,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:62f478b1738efbd55309a62bafb5686067c04b8a&amp;dn=Peace%2C+Propaganda+And+The+Promised+Land+%5BAVI%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"lkobescak","files":1,"time":1231909681,"description":"Peace, Propaganda &amp; the Promised Land\n-------------------------------------\n\n\nThe U.S. Media &amp; the Israeli-Palestinian Conflict\n\nPeace, Propaganda &amp; the Promised Land provides a striking comparison of U.S. and international media coverage of the crisis in the Middle East, zeroing in on how structural distortions in U.S. coverage have reinforced false perceptions of the Israeli-Palestinian conflict. This pivotal documentary exposes how the foreign policy interests of American political elites--oil, and a need to have a secure military base in the region, among others--work in combination with Israeli public relations strategies to exercise a powerful influence over how news from the region is reported. \n\nThrough the voices of scholars, media critics, peace activists, religious figures, and Middle East experts, Peace, Propaganda &amp; the Promised Land carefully analyzes and explains how--through the use of language, framing and context--the Israeli occupation of the West Bank and Gaza remains hidden in the news media, and Israeli colonization of the occupied terrorities appears to be a defensive move rather than an offensive one. The documentary also explores the ways that U.S. journalists, for reasons ranging from intimidation to a lack of thorough investigation, have become complicit in carrying out Israel's PR campaign. At its core, the documentary raises questions about the ethics and role of journalism, and the relationship between media and politics. \n\nInterviewees include Seth Ackerman, Mjr. Stav Adivi, Rabbi Arik Ascherman, Hanan Ashrawi, Noam Chomsky, Robert Fisk, Neve Gordon, Toufic Haddad, Sam Husseini, Hussein Ibish, Robert Jensen, Rabbi Michael Lerner, Karen Pfeifer, Alisa Solomon, and Gila Svirsky. \n\nSections: Intro | American Media: Occupied Territory | Hidden Occupation | Invisible Colonization | Violence in a Vacuum | Defining Who Is Newsworthy | Myth of U.S. Neutrality | Myth of the Generous Offer | Marginalized Voices | Is Peace Possible? \n\n\n\nFilm Festivals\nOfficial Selection, 2008 One World Berlin Film Festival\nOfficial Selection, 2008 PSBT International Film Festival and Forum\nOfficial Selection, 2008 Adelaide Festival of Arts\nOfficial Selection, 2004 Seattle Arab &amp; Iranian Film Festival\nOfficial Selection, 2004 Copenhagen International Documentary Film Festival\nOfficial Selection, 2004 Tempo Documentary Film Festival\n\n\n\nPraise for the Film\n&quot;I cannot recommend this documentary too highly. It should be required viewing for every student, for every taxpayer who is subsidizing the Israeli military machine, for every citizen in the United States.&quot;\n- Robert McChesney | University of Illinois \n\n&quot;Painstakingly stripping away the myths and inaccuracies regularly passed off as truth by the U.S. media, this film not only reveals the motivations and methods of those responsible for skewing the picture, but also manages to present the most concise and accurate account of the history and implications of the Israeli/Palestinian conflict and the role that the U.S. has played in the continuation of that conflict that I have seen... This is a very important piece of work that challenges the viewer to think twice before accepting a version of the world that owes more to the special interests of a powerful elite than to any notion of freedom of the press.&quot;\n- Donna Baillie | Director, Women in Black and Secret Hebron: The School Run \n\n&quot;Extraordinarily powerful and courageous.&quot;\n- Bo Smith | Boston Museum of Fine Arts \n\n\n&quot;...hands down one of the best films I've seen on American media and the Palestinian-Israeli conflict.&quot;\n- Laila Al Qatami | American Arab Anti-Discrimination Committee \n\n&quot;...enormously intelligent and effective...very well edited and presented.&quot;\n- Paul Beckett | Palestine-Israel Peace and Justice Alliance \n\n&quot;...essential viewing for all who care about human rights, for all American taxpayers, and especially for journalists and editors.&quot;\n- Mazin Quemsiyeh, M.D. | Al-Awda Right of Return Coalition \n\n&quot;A really clear presentation of the problems of media and Middle East conflict. A superlative film.&quot;\n- Gila Svirsky | Coalition of Women for Just Peace, Israel \n\n&quot;Peace, Propaganda &amp; the Promised Land is the best, least biased presentation we have of all the issues involved. A must-see documentary.&quot;\n- Chalmers Johnson | Author, Sorrows of Empire \n\n&quot;I'm just blown away by the sheer scope of it, the depth, the clear analysis.&quot;\n- Amir Terkel | Filmmaker, Other Voices from Israel and Palestine \n\n&quot;While I have always understood that the war here is over words and images, as much as it is over land and bones there, the film really enlightened me about the complexity and profundity of this form of colonization of the mind...[it] will clearly be pivotal in this movement and a priceless educational tool.&quot;\n- Cecilie Surasky | Jewish Voice for Peace \n\n\n\nRun Time: 79 minutes\n\n\n-----------------------------------------------------------------------------------\n\nAdditional information on September 11th, NWO and the great threat to you can be found at www infowars com or www.prisonplanet.tv\n\n-----------------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:62f478b1738efbd55309a62bafb5686067c04b8a","amp;dn":"Peace%2C+Propaganda+And+The+Promised+Land+%5BAVI%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62f478b1738efbd55309a62bafb5686067c04b8a","infoHashBuffer":{"type":"Buffer","data":[98,244,120,177,115,142,251,213,83,9,166,43,175,181,104,96,103,192,75,138]},"announce":[],"urlList":[]}}