{"title":"Samuel R. Delany - Dhalgren","uid":12074669,"size":455234835,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:641632165ba70bd0491d139de9eeeedfafdee0f3&amp;dn=Samuel+R.+Delany+-+Dhalgren&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Cybotage","files":47,"time":1435605791,"description":"A mysterious disaster has stricken the midwestern American city of Bellona, and its aftereffects are disturbing: a city block burns down and is intact a week later; clouds cover the sky for weeks, then part to reveal two moons; a week passes for one person when only a day passes for another. The catastrophe is confined to Bellona, and most of the inhabitants have fled. But others are drawn to the devastated city, among them the Kid, a white/American Indian man who can't remember his own name. The Kid is emblematic of those who live in the new Bellona, who are the young, the poor, the mad, the violent, the outcast--the marginalized.\n\nDhalgren is many things, but instantly accessible isn't one of them. While most of this big, ambitious, deeply detailed novel is beautifully pellucid, the opening pages will be difficult for some: the novel starts with the second half of an incomplete sentence, in the viewpoint of a man who doesn't know who he is. If you find the early pages rough going, push on; the story soon becomes clear and fascinating. But - fair warning - the central nature of the disaster, of its strange devastations and disruptions, remains a puzzle for many readers, sometimes after several readings.\n\n\nRead by Lester Rawlins\nFormat: MP3\nBitrate: 32 Kbps","torrent":{"xt":"urn:btih:641632165ba70bd0491d139de9eeeedfafdee0f3","amp;dn":"Samuel+R.+Delany+-+Dhalgren","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"641632165ba70bd0491d139de9eeeedfafdee0f3","infoHashBuffer":{"type":"Buffer","data":[100,22,50,22,91,167,11,208,73,29,19,157,233,238,238,223,175,222,224,243]},"announce":[],"urlList":[]}}