{"title":"Brainwave Generator + crack + All Presets","uid":6334851,"size":25094071,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:64f19b3df196a4512bdd269adb706a4664f8c763&amp;dn=Brainwave+Generator+%2B+crack+%2B+All+Presets&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"htortilla","files":2,"time":1303424579,"description":"Brainwave Generator + crack + All Presets\n\n\n\nDouble-click on &quot;Brainwave Generator 3.1.12.exe&quot;\nand install. This is the latest version available from\nwww.bwgen.com\n\nDouble-click &quot;Brainwave Generator Regpatch.exe&quot; to crack the program.\n\nCopy &quot;bgextra.dll&quot; to your installation folder.\nYou can download this from www.bwgen.com.\nThey are &quot;extra background sounds&quot;\nsee http://www.bwgen.com/download.htm\n\nCopy all presets and .wav sound files to your installation folder\nas some presets use these .wav files.\n\n\n\nThe folder Brainwave Generator 3.1.5 is for anyone who needs it,\nbut not needed unless you need it. It also includes another type\nof cracker.\n\n\n\nAll .wav and .bwg files were obtained using FlashGet.\nNCollector is good, too, but couldn't use it for this file grab job.\n\n\nRemember this technology can be dangerous. It is essentially\naltering your natural body's vibrations. Your chakras, or\nspiritual centers are represented by certain organs and adrenal\nglands. When you get sick it could be from something you ate,\nsomething you saw, something you thought about, something\nyou heard, etc. You can feel fine but your chakras might be out\nof whack, causing negative traits and tendencies, feelings,\nand or thoughts.\nYou should be able to feel something within 1 minute but this\ndoes not mean it is beneficial. If you use this program\nregularly remember how you felt before using it, or after,\nand how you might have changed. If negatively then find a\nbetter preset. Some can help you get out of a negative mind,\nsometimes some will, over time, put you into a negative mind.\nSo be careful.\n\n\n\nIn 1939 Joseph Geobels (Propaganda Minister for Nazi Germany) was the first to push for all music, world wide, to be played and listened to at A-440hz. He failed. But in 1953 the Elite had a meeting in London to finally impose the a-440hz Standard Concert Pitch, and succeeded. Prof Dussaut of the Paris Conservatory had a poll of over 20,000 of the head classical musicians of France and they all voted unanimously for A-432hz, but the Elite do not care what others think now do they?\nThere is more than one reason for doing this.\n1) Goebels knew that a-432 was the ONLY resonant frequency that had perfect harmonic balance.\n2) He also new that locked inside the A-432 structure was one of Pandora's boxes. The math that is evident when tuned to a-432 show, what I like to call &quot;Plato Code&quot;. Just like there are hidden codes written into the Bible, there are also hidden codes in the 432 matrix. 432 is THE ONLY resonant frequency that is capable of naturally reproducing what is called the &quot;Pythagorian Musical Spiral&quot;, its the same sequence of growth that all life follows. It utilizes the formula of Phi, also known as the Golden Mean, and is also found in the Fibonnaci sequence.\n I know this may be a lot to take in but what I'm trying to say in a nutshell is A-440hz=BAD A-432= Very Good....lol.\n\nOur universe is made up of harmonics and sound waves and these waves all resonate together in a Grand Cosmic resonance. This resonance is 432. It is the overall resonant frequency from which ALL LIFE evolves. It is literally the Tone of Life. The Ancient Mayans called it the Sound of Creation. 432HZ is the only frequency that has not been used in the main stream in the last 300 years. For some reason it was forgotten and purposefully removed from societies the world over.\n\n\nI believe it is VERY IMPORTANT to spread the message of 432 and to get as many entertainment people aware of and using this tuning. I know it sounds like mumbo-jumbo, but in fact there is considerable amount of serious research being done in this area. Just Google-search &quot;432hz&quot; and you too can begin to unlock an ancient secret. This may hopefully become a full blown music revolution.\nOur world is um... a little crazy lately. I believe this will be a major contribution to our fragile world.\nIf you tune to 432 then the numbers of the notes line up to all kinds of sacred monuments. Its how music should be played. 440 is the standard but Mozart played in 432 and the Stradivarius was 432 tuned. Attempts to change the standard have failed, in my opinion, because the pop music propaganda industry depends on having a higher tune.\n\nSome interesting facts about 432:\n1. Harmonically aligns to astronomical time count of Precession of the Equinoxes; 432 X 60 = 25920\n2. The original Stradivarius violin was designed to be tuned to 432. It is the most precise instrument ever constructed by humans.\n3. 432 is found at countless ancient sacred sites. Furia's virtual Tour of Sacred Sites along with such key locations as the Great Pyramid in Egypt, 432 is found at the largest Buddhist temple in the world, The Borobudur - At the Borobudur the amount of statues at the Temple of Countless Buddhas is 432\n4. D = 288, diameter of the outer circle of Stonehenge, 144, Gematrian for light (also Bible) 72 one degree of precession. Pythagorean ratio 4/3 which also represents the Chephren Pyramids apex angle tangent - also a ratio between 2 Gematrian systems.\n\nConcert pitch is usually the frequency assigned to note 'A' and is usually 440hz. If you drop this tuning to 432hz it can have a very nice effect as it seems more resonant some how - the sound carriers further and the sound is 'bigger'.\nAnother handy thing about tuning to 432hz can best be compared to computer-generated music. For instance, if you tune to 440hz then each note is a division of this number and you get 18.666666 recurring. Your computer cannot generate these tones! By using 432 not only do you get an exact tone and harmonics but you can also set the tempo of your music to the wavelengths of the tone and get even more aspects of the composition 'in harmony'. At 432 the note 'D' resonates at 144000 times per second, so tempos of 36, 72, 108, 144 etc are in tune with the notes ! But as D and A are also in tune with one another those tempos will also work for all tunes. Another harmony that occurs when you tune to 432hz is that all the digits of each note always add to 9 (4+3+2). The note D becomes 144hz 1+4+4 etc.\nWhen i tune to 432hz, as long as the other parameters i am using, temp, speed of effects, etc add up to 9 i know it will always sound well-balanced.\n\n1 mile = 186322223.74145hz\n1hz =186282.4 miles\nspeed of light 186000 miles/second\n432hz= 431.21 miles\n432000 seconds in every 12hour period\nRadius of the sun is 432000 miles\n3600 seconds in one hour ( completing the 360 degrees cycle/pulse/frequency)\n86400 seconds in one day (864, one octave higher that 432)\n\nThe distance from the center of the earth to the average height of the atmosphere is given as 4320 arc-minutes, which harmonically can be reduce down to 432, the fundamental vibration for the sixth node in the octave.\n\nColor:\nRed 780-640 nm\nOrange: 640-595 nm\nYellow 595-570 nm\nGreen 570-500 nm\nBlue 500-450 nm\nViolet 450-380 nm\n\nIn frequencies (Hz) this is:\nRed 3,85E+14 4,69E+14\nOrange 4,69E+14 5,04E+14\nYellow 5,04E+14 5,26E+14\nGreen 5,26E+14 6,00E+14\nBlue 6,00E+14 6,67E+14\nViolet 6,67E+14 7,89E+14\n\nOnce they are brought down by octaves we get:\n2^41 6,333E+14 474 - -Blue\nD 288..... 2^41 7,125E+14 421 - -Indigo\nE 324..... 2^41 7,504E+14 400 - -Violet\nF 341..... 2^40 4,222E+14 711 - -Red\nG 384..... 2^40 4,750E+14 632 - -Orange\nA 432..... 2^40 5,344E+14 561 - -Yellow\nB 486..... 2^40 5,629E+14 533 - -Green\nC 512\n\nPeace to you all -Music is Magic\n\nFROMpublic info on left side.\n\n\n\n\nAnd rememebr, the PTB, the globalists, the evil elite, without them, without a struggle, life is boring.\nIf they were all just killed, the cycle will still continue, people to take their place.\nForgiveness is the key to peace and ultimately, in whatever lifetime, enlightenment.\nLove is acceptance, non-violence not pacifism (self defense is desired), righteousness.\nMaster the 5 senses for the goal of enlightenment.\n\nPeace be with you.","torrent":{"xt":"urn:btih:64f19b3df196a4512bdd269adb706a4664f8c763","amp;dn":"Brainwave+Generator+%2B+crack+%2B+All+Presets","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64f19b3df196a4512bdd269adb706a4664f8c763","infoHashBuffer":{"type":"Buffer","data":[100,241,155,61,241,150,164,81,43,221,38,154,219,112,106,70,100,248,199,99]},"announce":[],"urlList":[]}}