{"title":"Ryszard Kapuscinski - The Shadow of the Sun","uid":7935255,"size":431234,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:650d7a15708acb65871304993f388a1d6f73081f&amp;dn=Ryszard+Kapuscinski+-+The+Shadow+of+the+Sun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"wearehidden","files":1,"time":1355830848,"description":"Release Date: April 9, 2002 | Series: Vintage International\nIn 1957, Ryszard Kapuscinski arrived in Africa to witness the beginning of the end of colonial rule as the first African correspondent of Poland's state newspaper. From the early days of independence in Ghana to the ongoing ethnic genocide in Rwanda, Kapuscinski has crisscrossed vast distances pursuing the swift, and often violent, events that followed liberation. Kapuscinski hitchhikes with caravans, wanders the Sahara with nomads, and lives in the poverty-stricken slums of Nigeria. He wrestles a king cobra to the death and suffers through a bout of malaria. What emerges is an extraordinary depiction of Africa--not as a group of nations or geographic locations--but as a vibrant and frequently joyous montage of peoples, cultures, and encounters. Kapuscinski's trenchant observations, wry analysis and overwhelming humanity paint a remarkable portrait of the continent and its people. His unorthodox approach and profound respect for the people he meets challenge conventional understandings of the modern problems faced by Africa at the dawn of the twenty-first century.\n","torrent":{"xt":"urn:btih:650d7a15708acb65871304993f388a1d6f73081f","amp;dn":"Ryszard+Kapuscinski+-+The+Shadow+of+the+Sun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"650d7a15708acb65871304993f388a1d6f73081f","infoHashBuffer":{"type":"Buffer","data":[101,13,122,21,112,138,203,101,135,19,4,153,63,56,138,29,111,115,8,31]},"announce":[],"urlList":[]}}