{"title":"Teaching the Common Core Math Standards, K-2 [PDF] [StormRG]","uid":11257449,"size":5558748,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:65e13be9988fbdefbba51a7949b29e03c2d8d80d&amp;dn=Teaching+the+Common+Core+Math+Standards%2C+K-2+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"krystine","files":-1,"time":1413920279,"description":"Teaching the Common Core Math Standards with Hands-On Activities, Grades K-2 (Jossey-Bass Teacher)\nAuthor: Erin Muschla, Judith A. Muschla &amp; Gary Robert Muschla\nPublished: 2014\nPublisher: Jossey-Bass\nISBN: 9781118710241\nFormat: Retail PDF\n\nPM IF YOU NEED HELP WITH THE TORRENT :)\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\n\n\nStart young children off with Common Core math using these innovative activities\nTeaching the Common Core Math Standards with Hands-On Activities, Grades K-2 provides teachers with the help they need to begin teaching to the new standards right away. The book outlines the Common Core math standards from kindergarten to second grade, providing one classroom-ready activity for each standard, plus suggestions for variations and extensions for students of different learning styles and abilities. Along with teaching the required mathematical concepts and skills, many of the activities encourage collaboration, technology utilization, written and oral communication, and an appreciation of the significance of mathematics in modern life.\n\nAs the Common Core is adopted across the nation, teachers are scrambling to find information on CCSS-aligned lesson planning and classroom activities. This comprehensive guide answers that need, providing both the background information and practical, applicable guidance that can bring the Common Core into the classroom today. The activities include:\n\nAbstract and critical thinking using mathematical reasoning\nProblem-solving strategies and calculation proficiency\nMath fluency, and an understanding of mathematical concepts and skills\nApplying mathematical understanding to real life problems\nEarly confidence and success in math is critical to a student's future performance. Math anxiety and a shaky foundation can hinder a student's potential far into the future, giving elementary math teachers a huge role in shaping their students' academic lives. The Common Core has set the bar, and Teaching the Common Core Math Standards with Hands-On Activities, Grades K-2 brings the standards to life","torrent":{"xt":"urn:btih:65e13be9988fbdefbba51a7949b29e03c2d8d80d","amp;dn":"Teaching+the+Common+Core+Math+Standards%2C+K-2+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65e13be9988fbdefbba51a7949b29e03c2d8d80d","infoHashBuffer":{"type":"Buffer","data":[101,225,59,233,152,143,189,239,187,165,26,121,73,178,158,3,194,216,216,13]},"announce":[],"urlList":[]}}