{"title":"Will Smith - Big Willie Style 320cbr (Big Papi)","uid":9512870,"size":132237378,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:65f14fcf80d854b27b5cf92e1c1c0c18519017f3&amp;dn=Will+Smith+-+Big+Willie+Style+320cbr+%28Big+Papi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1390449213,"description":"Source: CD\n\n\n\nBy Mikeisha\nIt matters not what negative is said about this man. He has been called a punk, a sellout, popcorn rapper, Uncle Tom, etc. But, anyone and everyone who ever called Will Smith out of his name tuned in to &quot;The Fresh Prince of Bel-Air&quot; every Monday night, I know they did. They probably saw a couple of his movies and listen to his music, too. This guy is very talented. I can't think of a male entertainer more talented that him, now that I think about it. &quot;Big Willie Style&quot; is no exception. This is a nice CD. Its also proof of how incredibly talented he is. He doesn't have to curse and degrade women in order to create a good rap album. I know of no one who can do that, and neither do you. He definitely some of the best word play in the rap game, this album is a prime example of his best work. I love his word play. This album is very happy and upbeat. The Keith B-Real interludes are really funny. Jamie Foxx plays as Keith B-Real.\n\n&quot;Getting' Jiggy Wit It&quot; and &quot;Miami&quot; were released from this album, but they are not the best on this album. In fact, they can easily get skipping because the production is right annoying. &quot;Men in Black&quot; and &quot;Just the Two of Us&quot; were also released. These are definitely better songs than the ones mentioned previously. &quot;Just the Two of Us&quot; is dedicated to Will's son, Trey. It is definitely one of the best dedications I've ever heard. He pours his heart out to his son. Will lets the world know Jada is his. In one of his songs he says, &quot;To all ya'll rappers, when ya'll saying your rhymes, please stop saying Jada, cuz that names mine&quot;. Haha, that's so cute. &quot;Candy&quot; and &quot;Chasing Forever&quot; are some of the best songs on the album. Pay close attention to Will's wordplay on these two songs. &quot;I Loved You&quot; and &quot;Don't Say Nothin&quot; are borderline fillers. They are OK tracks, but they do not help make the album.\n\nOverall, Willie does a good job. He loooves to BRAG about himself, but somehow, he doesn't annoy me like most people who do that. I enjoy this album, but it's definitely not a 5 star album. The reason I gave it 3 is because the good songs are REAL good and gives the album a nice balance,\n\nMikeisha's Top 5\n\n1. Just the Two of Us\n2. Ya'll Know\n3. Chasing Forever\n4. Candy\n5. Men in Black","torrent":{"xt":"urn:btih:65f14fcf80d854b27b5cf92e1c1c0c18519017f3","amp;dn":"Will+Smith+-+Big+Willie+Style+320cbr+%28Big+Papi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65f14fcf80d854b27b5cf92e1c1c0c18519017f3","infoHashBuffer":{"type":"Buffer","data":[101,241,79,207,128,216,84,178,123,92,249,46,28,28,12,24,81,144,23,243]},"announce":[],"urlList":[]}}