{"title":"Days of Fire: Bush and Cheney in the - Peter Baker - Audiobook","uid":10326875,"size":844313778,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:662c7d27af8d7cac80dd02c91b72d4f568251558&amp;dn=Days+of+Fire%3A+Bush+and+Cheney+in+the+-+Peter+Baker+-+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1402367199,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Smart AudioBook Player or Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nDays of Fire: Bush and Cheney in the White House\n\nWritten by: Peter Baker\nNarrated by: Mark Deakins\nLength: 29 hrs and 15 mins\nFormat: Unabridged\nRelease Date:10-22-13\nProgram Type: Audiobook\n\nIn Days of Fire, Peter Baker, Chief White House Correspondent for The New York Times, takes us on a gripping and intimate journey through the eight years of the Bush and Cheney administration in a tour-de-force narrative of a dramatic and controversial presidency.\n\nTheirs was the most captivating American political partnership since Richard Nixon and Henry Kissinger: a bold and untested president and his seasoned, relentless vice president. Confronted by one crisis after another, they struggled to protect the country, remake the world, and define their own relationship along the way. In Days of Fire, Peter Baker chronicles the history of the most consequential presidency in modern times through the prism of its two most compelling characters, capturing the elusive and shifting alliance of George Walker Bush and Richard Bruce Cheney as no historian has done before. He brings to life with in-the-room immediacy all the drama of an era marked by devastating terror attacks, the Iraq War, Hurricane Katrina, and financial collapse.\n\nThe real story of Bush and Cheney is a far more fascinating tale than the familiar suspicion that Cheney was the power behind the throne. Drawing on hundreds of interviews with key players, and thousands of pages of never-released notes, memos, and other internal documents, Baker paints a riveting portrait of a partnership that evolved dramatically over time, from the early days when Bush leaned on Cheney, making him the most influential vice president in history, to their final hours, when the two had grown so far apart they were clashing in the West Wing. Together and separately, they were tested as no other president and vice president have been, first on a bright September morning, an unforgettable &quot;day of fire&quot; just months into the presidency, and on countless days of fire over the course of eight tumultuous years.\n\nDays of Fire is a monumental and definitive work that will rank with the best of presidential histories. As absorbing as a thriller, it is eye-opening and essential listening.","torrent":{"xt":"urn:btih:662c7d27af8d7cac80dd02c91b72d4f568251558","amp;dn":"Days+of+Fire%3A+Bush+and+Cheney+in+the+-+Peter+Baker+-+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"662c7d27af8d7cac80dd02c91b72d4f568251558","infoHashBuffer":{"type":"Buffer","data":[102,44,125,39,175,141,124,172,128,221,2,201,27,114,212,245,104,37,21,88]},"announce":[],"urlList":[]}}