{"title":"The_Sims_3_Island_Paradise-FLT","uid":8614232,"size":4326891409,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6677d642d5c97f172276bb7f7de6f053bf923320&amp;dn=The_Sims_3_Island_Paradise-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Mr.Stifmeister","files":-1,"time":1372212801,"description":"\nANSiJEDACiD\n\nIn Their 26th Year Of Glory, FairLight Released #1099\n\nThe Sims 3 - Island Paradise (c) Electronic Nerds\n\n:   Supplied by: FAIRLIGHT            : : Release Date: 25/06/2013\nCracked by:  FAIRLIGHT              Game Type:    Sims\nPackaged by: FAIRLIGHT              Image Format: ISO\n-----\nDISCS: 1 DVD                        Protection: Disc-Checks\n\nSystem Requirements : Grandma's PC\n\nGame information\n=================\n\nNew adventures await  your  Sims  on  the  sunny  shores  and  beneath  the\nglistening water of an island paradise\n\nFrom   exploring  the  tropical  isles  to  creating  a  five-star   resort\nexperience, your Sims can decide to embark on an unforgettable  journey  or\nmake themselves a new home in this new utopia. Nautical Sims can even  take\nthe helm of fully customizable houseboats and set sail between islands  If\nyour Sims would rather be in the water than on it,  they  can  snorkel  and\nscuba dive their way through the  ocean.  Who  knows,  they  might  uncover\nsunken treasure or befriend  a  mermaid  With  innovative  features  never\nbefore seen in The Sims PC franchise and a world of  new  possibilities  on\nland and in sea, your Sims will reap  the  benefits  of  their  own  island\nparadise\n\nFeatures\n=========\n\nSet sail for adventure\nBe it by paddleboat or speedboat, your Sims can now leave port to\ndiscover new lands and explore like never before, from inter-island\ntravel to discovering their own uncharted island. Landlubbers need not\napply\nBuild and run a five-star resort\nCreate a family-friendly resort of waterslides and buffet tables, a\nromantic retreat dotted with minimalist cottages, or a singles resort\nfeaturing multiple pool bars where Sims can mingle and flirt. Choose and\nfine-tune your amenities, set your prices, and wait for the reviews-and\nSimoleons-to pour in. The higher your star rating, the more popular your\nresort will be\nLife is a beach\nSee what surprises await under the sea as your Sims build their skills\nin snorkeling/scuba diving. Your Sims may find themselves on the shore\nof a new island or discover sunken or buried treasure\nBoat sweet boat\nWhether your Sims love the water or are just prone to wanderlust, a\nhouseboat may be the perfect abode. Houseboats are fully customizable\nand can be moored at any open port, so if your Sims tire of the view,\nrelocate to a new locale\n\nInstallation Information\n=========================\n\nBurn or mount\nInstall using our keygen ( requires the Sims 3 main game installed\nCopy the cracked content from the Fairlight folder\nto your 'The Sims 3' installation\nPlay the game\n\nNOTE: As usual, block the game exe in your firewall\n\n/TEAM FAiRLIGHT\n\n-  QUALITY, TRADITION  AND PRIDE -\n\n","torrent":{"xt":"urn:btih:6677d642d5c97f172276bb7f7de6f053bf923320","amp;dn":"The_Sims_3_Island_Paradise-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6677d642d5c97f172276bb7f7de6f053bf923320","infoHashBuffer":{"type":"Buffer","data":[102,119,214,66,213,201,127,23,34,118,187,127,125,230,240,83,191,146,51,32]},"announce":[],"urlList":[]}}