{"title":"Gas Turbine Diagnostics - Signal Processing and Fault Isolation","uid":12098031,"size":7950580,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6693be7c883fb7ec125f8f4971425318571bb174&amp;dn=Gas+Turbine+Diagnostics+-+Signal+Processing+and+Fault+Isolation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"clouderone","files":1,"time":1436225864,"description":"Gas Turbine Diagnostics - Signal Processing and Fault Isolation - Ranjan Ganguli (CRC, 2013).pdf\n\nISBN 9781466502819\n\nWidely used for power generation, gas turbine engines are susceptible to faults due to the harsh working environment. Most engine problems are preceded by a sharp change in measurement deviations compared to a baseline engine, but the trend data of these deviations over time are contaminated with noise and non-Gaussian outliers. Gas Turbine Diagnostics: Signal Processing and Fault Isolation presents signal processing algorithms to improve fault diagnosis in gas turbine engines, particularly jet engines. The algorithms focus on removing noise and outliers while keeping the key signal features that may indicate a fault.\n\nThe book brings together recent methods in data filtering, trend shift detection, and fault isolation, including several novel approaches proposed by the author. Each method is demonstrated through numerical simulations that can be easily performed by the reader. Coverage includes:\n\n\n    Filters for gas turbines with slow data availability\n\n    Hybrid filters for engines equipped with faster data monitoring systems\n\n    Nonlinear myriad filters for cases where monitoring of transient data can lead to better fault detection\n\n    Innovative nonlinear filters for data cleaning developed using optimization methods\n\n    An edge detector based on gradient and Laplacian calculations\n\n    A process of automating fault isolation using a bank of Kalman filters, fuzzy logic systems, neural networks, and genetic fuzzy systems when an engine model is available\n\n    An example of vibration-based diagnostics for turbine blades to complement the performance-based methods\n\n\nUsing simple examples, the book describes new research tools to more effectively isolate faults in gas turbine engines. These algorithms may also be useful for condition and health monitoring in other systems where sharp changes in measurement data indicate the onset of a fault","torrent":{"xt":"urn:btih:6693be7c883fb7ec125f8f4971425318571bb174","amp;dn":"Gas+Turbine+Diagnostics+-+Signal+Processing+and+Fault+Isolation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6693be7c883fb7ec125f8f4971425318571bb174","infoHashBuffer":{"type":"Buffer","data":[102,147,190,124,136,63,183,236,18,95,143,73,113,66,83,24,87,27,177,116]},"announce":[],"urlList":[]}}