{"title":"Kill.Buljo.DVDRip.NorAudio.NorSub_}HellSir{.avi","uid":4649779,"size":923319592,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:66982fc082b5339901f7f1b12a70f2b03ed162d3&amp;dn=Kill.Buljo.DVDRip.NorAudio.NorSub_%7DHellSir%7B.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"hellsir","files":1,"time":1232010983,"description":"Forlovelseskaffen til Jompa Tormann ender skjebnesvangert. Den ukompliserte og gifteklare samen blir brutalt skutt ned. Samtlige gjester, inkludert bandet Banana Airlines havner i skuddlinjen og stryker med. Den same- og kvinnehatende politimannen Sid WislÃƒÂ¸ff settes pÃƒÂ¥ saken. Sammen med kollega Unni Formen og den samiske veiviseren Peggy Mathilassi starter han jakten pÃƒÂ¥ de skyldige. Men Jompa overlevde ... Han vet hvem som sto bak massakren og vil han ha hevn. Blodig hevn ...\n\nI &quot;Kill Buljo - The Movie&quot; mÃƒÂ¸ter vi vÃƒÂ¥r helt, Jompa Torman, idet han motvillig er pÃƒÂ¥ vei inn i ekteskapet. Brudeparets familier er samlet til den tradisjonelle forlovelseskaffen pÃƒÂ¥ Katuokeino samfunnshus nÃƒÂ¥r helvete bryter lÃƒÂ¸s. The Deadly Sapmi Assassination Squad, bestÃƒÂ¥ende av Tampa Buljo, Crazy Beibifeit, Dr. Kjell Driver og Bud Light stormer lokalet, trekker vÃƒÂ¥pnene, og plaffer lÃƒÂ¸s pÃƒÂ¥ alt som beveger seg. Ingen skal forlate huset i live ...\n\nMen ÃƒÂ©n gjÃƒÂ¸r nettopp det - heldigvis - for ellers hadde det ikke vÃƒÂ¦rt noen film. Jompa overlever mirakulÃƒÂ¸st og havner i dyp koma.\n\nDen same- og kvinnehatende politibetjenten Sid WislÃƒÂ¸ff, blir sammen med sin assistent Unni Formen satt pÃƒÂ¥ saken, og WislÃƒÂ¸ff er sikker i sin sak; Jompa Tormann drepte selv alle sine gjester, og plantet sÃƒÂ¥ fire skudd i egen skalle for ÃƒÂ¥ virke uskyldig.\n\nNoen uker senere vÃƒÂ¥kner Jompa fra koma og er opptatt av ÃƒÂ©n ting; ÃƒÂ¥ tÃƒÂ¸mme blÃƒÂ¦ra. Deretter: hevn. Han skal finne The Deadly Sapmi Assassination Squad og gjÃƒÂ¸re opp med dem - en etter en. I hÃƒÂ¦lene har han Sid WislÃƒÂ¸ff og Unni Formen, som sammen med den samiske veiviseren Peggy Mathilassi skal spore ham opp, og sette ham bak lÃƒÂ¥s og slÃƒÂ¥.\n\nHistorien bak\nEn liten kompisgjeng fra Alta med ett kamera og altfor mye fritid. Slik kan man oppsummere starten pÃƒÂ¥ &quot;Kill Buljo - The Movie&quot;.\n\nSommeren 2004 laget Tommy Wirkola, Stig Frode Henriksen, Martin Hykkeryd, ÃƒËœrjan Gamst, John Even Pedersen og Odd Helge Haugsnes kortfilmen &quot;Kill Buljo&quot;. Ideen kom da Tommy og Stig Frode var i den lokale videosjappa Bobbo og snakket om at det hadde vÃƒÂ¦rt morsomt ÃƒÂ¥ lage en nordnorsk parodi pÃƒÂ¥ &quot;Kill Bill&quot;. De samlet gjengen, filmet hele greia pÃƒÂ¥ en dag og redigerte den pÃƒÂ¥ en halv time. Det var opprinnelig ment som en intern spÃƒÂ¸k -...\n","torrent":{"xt":"urn:btih:66982fc082b5339901f7f1b12a70f2b03ed162d3","amp;dn":"Kill.Buljo.DVDRip.NorAudio.NorSub_%7DHellSir%7B.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66982fc082b5339901f7f1b12a70f2b03ed162d3","infoHashBuffer":{"type":"Buffer","data":[102,152,47,192,130,181,51,153,1,247,241,177,42,112,242,176,62,209,98,211]},"announce":[],"urlList":[]}}