{"title":"Robert Charles Wilson - The Chronoliths","uid":11676416,"size":143456813,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:66be8b81d9c69264efb3004d0fdc63cc341c0a1e&amp;dn=Robert+Charles+Wilson+-+The+Chronoliths&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Cybotage","files":1,"time":1422891255,"description":"\nThe Chronoliths is a 2002 Hugo Award Nominee for Best Novel and the winner of the 2002 John W. Campbell Memorial Award.\n\n\nScott Warden is a man haunted by the past-and soon to be haunted by the future.\n\nIn early twenty-first-century Thailand, Scott is an expatriate slacker. Then, one day, he inadvertently witnesses an impossible event: the violent appearance of a 200-foot stone pillar in the forested interior. Its arrival collapses trees for a quarter mile around its base, freezing ice out of the air and emitting a burst of ionizing radiation. It appears to be composed of an exotic form of matter. And the inscription chiseled into it commemorates a military victory--sixteen years in the future.\n\nShortly afterwards, another, larger pillar arrives in the center of Bangkok-obliterating the city and killing thousands. Over the next several years, human society is transformed by these mysterious arrivals from, seemingly, our own near future. Who is the warlord &quot;Kuin&quot; whose victories they note?\n\nScott wants only to rebuild his life. But some strange loop of causality keeps drawing him in, to the central mystery and a final battle with the future.\n\nFormat: M4A\nBitrate: 32 Kbps\nUnabridged","torrent":{"xt":"urn:btih:66be8b81d9c69264efb3004d0fdc63cc341c0a1e","amp;dn":"Robert+Charles+Wilson+-+The+Chronoliths","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66be8b81d9c69264efb3004d0fdc63cc341c0a1e","infoHashBuffer":{"type":"Buffer","data":[102,190,139,129,217,198,146,100,239,179,0,77,15,220,99,204,52,28,10,30]},"announce":[],"urlList":[]}}