{"title":"No Escape - Burton, Mary.epub","uid":9159497,"size":380994,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:674f80af04a89cdb27a9f06cef34c29d9c197091&amp;dn=No+Escape+-+Burton%2C+Mary.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"420weedman","files":1,"time":1383846887,"description":"No Escape is the latest serial-killer-thriller from New York Times bestselling author, Mary Burton.\n\nHe Was Taught How To Kill\n\nEven behind bars, serial killer Harvey Lee Smith exudes menace. Psychologist Jolene Granger has agreed to hear his dying confession, vowing not to let the monster inside her head. And Harvey has secrets to share - about bodies that were never found, and about the apprentice who is continuing his grisly work . . .\n\nAnd Now He'll Teach Them\n\nHe buries his victims alive the way his mentor Harvey did, relishing their final screams as the earth rains down. And as one last gift to the only father he knew, he'll make the most perfect kill of all.\n\nHow To Die.\n\nEverything about this investigation is unnerving Jo, from Harvey's fascination with her to the fact that she's working alongside Texas Ranger Brody Winchester, her ex-husband. Harvey's protï¿½gï¿½ is growing bolder and more vicious every day. And soon the trail of shallow graves will lead them to the last place Jo expected, and to the most terrifying truth of all . .\n\nThe dark mistress of crime and New York Times bestselling author of Dead Ringer and I'm Watching You, Mary Burton, is back with No Escape. Fans of Karin Slaughter, Kathy Reichs and Karen Rose will love Mary Burton's tales full of action-packed tension.\nGenre: Contemporary Fiction, Romantic Suspense","torrent":{"xt":"urn:btih:674f80af04a89cdb27a9f06cef34c29d9c197091","amp;dn":"No+Escape+-+Burton%2C+Mary.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"674f80af04a89cdb27a9f06cef34c29d9c197091","infoHashBuffer":{"type":"Buffer","data":[103,79,128,175,4,168,156,219,39,169,240,108,239,52,194,157,156,25,112,145]},"announce":[],"urlList":[]}}