{"title":"Chasing Chiles: Hot Spots along the Pepper Trail","uid":11474542,"size":4090098,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:681aadfce678da4bbc8d49185fb261f54f0c7a4a&amp;dn=Chasing+Chiles%3A+Hot+Spots+along+the+Pepper+Trail&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Jallentino","files":-1,"time":1416131246,"description":"Chasing Chiles: Hot Spots along the Pepper Trail by Gary Paul Nabhan, Kraig Kraft, Kurt Michael Friese\nEnglish | 2011 | ISBN: 1603582509 | 224 pages | EPUB | 3,9 MB\n\nChasing Chiles looks at both the future of place-based foods and the effects of climate change on agriculture through the lens of the chile pepper-from the farmers who cultivate this iconic crop to the cuisines and cultural traditions in which peppers play a huge role.\n\nWhy chile peppers? Both a spice and a vegetable, chile peppers have captivated imaginations and taste buds for thousands of years. Native to Mesoamerica and the New World, chiles are currently grown on every continent, since their relatively recent introduction to Europe (in the early 1500s via Christopher Columbus). Chiles are delicious, dynamic, and very diverse-they have been rapidly adopted, adapted, and assimilated into numerous world cuisines, and while malleable to a degree, certain heirloom varieties are deeply tied to place and culture-but now accelerating climate change may be scrambling their terroir.\n\nOver a year-long journey, three pepper-loving gastronauts-an agroecologist, a chef, and an ethnobotanist-set out to find the real stories of America's rarest heirloom chile varieties, and learn about the changing climate from farmers and other people who live by the pepper, and who, lately, have been adapting to shifting growing conditions and weather patterns. They put a face on an issue that has been made far too abstract for our own good.\n\nChasing Chiles is not your archetypal book about climate change, with facts and computer models delivered by a distant narrator. On the contrary, these three dedicated chileheads look and listen, sit down to eat, and get stories and recipes from on the ground-in farmers' fields, local cafes, and the desert-scrub hillsides across North America. From the Sonoran Desert to Santa Fe and St. Augustine (the two oldest cities in the U.S.), from the marshes of Avery Island in Cajun Louisiana to the thin limestone soils of the Yucatan, this book looks at how and why climate change will continue to affect our palates and our producers, and how it already has","torrent":{"xt":"urn:btih:681aadfce678da4bbc8d49185fb261f54f0c7a4a","amp;dn":"Chasing+Chiles%3A+Hot+Spots+along+the+Pepper+Trail","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"681aadfce678da4bbc8d49185fb261f54f0c7a4a","infoHashBuffer":{"type":"Buffer","data":[104,26,173,252,230,120,218,75,188,141,73,24,95,178,97,245,79,12,122,74]},"announce":[],"urlList":[]}}