{"title":"Split Second [1992] DVDRiP","uid":5634328,"size":734529536,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6821b6f842ca4dc3ad65aada07f0fd03b718d1a3&amp;dn=Split+Second+%5B1992%5D+DVDRiP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"neon","files":-1,"time":1276818238,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0105459/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0105459/&lt;/a&gt;\n\nSplit Second is a 1992  British science fiction film starring Rutger Hauer, Kim Cattrall, and Neil Duncan.\n\nIn the year 2008, extensive rainfall has caused large areas of London to be under a foot or more of water. Rookie police officer Dick Durkin (Duncan) is assigned to partner Harley Stone (Hauer), a burnt-out and highly cynical homicide detective who, according to his commanding officer, survives on &quot;Anxiety, coffee and chocolate&quot; after being unable to prevent the murder of his partner by a serial killer several years previously. Now however, the murders have begun again and Stone and Durkin are assigned the case. After investigating the scenes of several killings, they appear no closer to identifying the killer, with their only clues being that the murders seem to be linked to the lunar cycle, and that the killer has multiple recombinant DNA strands, having absorbed the DNA of seemingly anything he kills.\n\nFinally, after Stone's girlfriend Michelle (Cattrall) is kidnapped, the detectives track the killer deep into the flooded and disused London Underground system and discover the truth: The killer is not human, and actually some horrific and unknown homicidal form of life - Fast, savage, bloodthirsty and fixated upon killing Stone just as it previously killed his partner. In fact, as the movie progresses, each killing and &quot;appearance&quot; of the monster is an attempt to lure Stone closer and closer.\n\n\nniki_benzzz upload\n","torrent":{"xt":"urn:btih:6821b6f842ca4dc3ad65aada07f0fd03b718d1a3","amp;dn":"Split+Second+%5B1992%5D+DVDRiP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6821b6f842ca4dc3ad65aada07f0fd03b718d1a3","infoHashBuffer":{"type":"Buffer","data":[104,33,182,248,66,202,77,195,173,101,170,218,7,240,253,3,183,24,209,163]},"announce":[],"urlList":[]}}