{"title":"The Concept and Attributes of God","uid":5092184,"size":241432825,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68519759233251ff14be45e062d14335238c4464&amp;dn=The+Concept+and+Attributes+of+God&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"moman73","files":46,"time":1253234153,"description":"The Concept and Attributes of God:\n\nThe Abrahamic religions are so called because their prophets are all descendents of Abraham. Moses and Jesus (through his mother Mary) were descendents of Isaac and Mohammed was a descendent of Ishmael. Additionally, the Abrahamic religions are supposed to carry the same message and teachings (monotheism) of Abraham.\n\nAlthough the Jews believe in one God, but their beliefs were severely corrupted that Judaism can hardly be identified as an Abrahamic religion. Jehovah (God) in Judaism is given human characteristics and attributes including some of the worst human attributes. According to the Old Testament, Jehovah lies, makes mistakes and repent for his mistakes. He deceives people and can be deceived by them; He manipulates people and can be manipulated by them. He takes human form and wrestles with humans. He forgets and gets exhausted; and so on.\n\nThe God of the Christians is the same God of the Jews with all his shortcomings. On top of that, Christianity invented new creeds and doctrines such as: that Christ was the Son of God begotten not created by His Father before all world, the Trinity, Incarnation, original sin, atonement, etc.\n\nThis upload examines the concept and attributes of God in different religions with a focus on the Abrahamic religions. It contains 46 titles distributed as follows:\n\n - 17 titles in the main directory. It includes books that give good comparative analysis to the concepts of God in different religions. The rest of the titles give different views of God; many of them are recently written which reflect the current thoughts about the subject.\n\n-  8 titles in the subdirectory: Judaism View of God.\n\n-  9 titles in the subdirectory: The Christian View of God\n\n- 12 titles in the subdirectory: The Islamic View of God \n\n","torrent":{"xt":"urn:btih:68519759233251ff14be45e062d14335238c4464","amp;dn":"The+Concept+and+Attributes+of+God","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68519759233251ff14be45e062d14335238c4464","infoHashBuffer":{"type":"Buffer","data":[104,81,151,89,35,50,81,255,20,190,69,224,98,209,67,53,35,140,68,100]},"announce":[],"urlList":[]}}