{"title":"Learn Chinese: Complete","uid":11757632,"size":1592060183,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68abf6582a67314af152fe50dbf75ea7c279dda2&amp;dn=Learn+Chinese%3A+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"mdusanjay","files":1,"time":1426474640,"description":"Learn Chinese: Complete (Windows) | 1.48 GB\n\nAre you ready to learn Chinese on your PC in just minutes a day? You are about to experience the evolution of language learning! Never before has learning to speak Chinese been so fun, fast or easy. You'll be speaking Chinese within just minutes of the very first lesson, and our interactive language experience will keep you engaged and locked in! The progress you make with &quot;Learn Chinese - Complete Audio Course (Beginner to Advanced)&quot; will utterly shock and amaze your friends, family, colleagues, and teachers.\n\nThis complete language learning course gives you ALL of the benefits of a state of the art language lab right on your PC.\n\nActually, that statement is not entirely honest. This application is even better than a language lab!\n\nBetter than a language lab? You're joking, right?\n\nActually, we're not. In a language lab, you don't get two expert teachers to personally walk you through the pitfalls and pleasantries of mastering Chinese. With &quot;Learn Chinese - Complete Audio Course&quot; you do! With the material a language lab presents there is no accountability for the material taught. With us there is!","torrent":{"xt":"urn:btih:68abf6582a67314af152fe50dbf75ea7c279dda2","amp;dn":"Learn+Chinese%3A+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68abf6582a67314af152fe50dbf75ea7c279dda2","infoHashBuffer":{"type":"Buffer","data":[104,171,246,88,42,103,49,74,241,82,254,80,219,247,94,167,194,121,221,162]},"announce":[],"urlList":[]}}