{"title":"The Modern Interior (Art Ebook).pdf","uid":12112352,"size":3812331,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68c59d686afee1adc6a2f1201585a9a378af7675&amp;dn=The+Modern+Interior+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"STBGD","files":1,"time":1436609297,"description":"The Modern Interior By Penny Sparke\n2008 | 240 Pages | ISBN: 1861893728 | PDF | 4 MB\n\n\nThrough the impact of shops like Habitat and IKEA, and of the countless glossy magazines, books and catalogues that focus on the concept of 'interior design', we have all become familiar with the idea of our homes and public interiors containing items of modern furniture and decor. Yet design historian and critic Penny Sparke shows that, unlike designed buildings and artefacts, the fixed idea of the 'modern interior' has only ever been an abstract and idealized concept, promoted through exhibitions, retail contexts and the mass media, and that it rarely exists in an absolute form. &quot;The Modern Interior&quot; provides a persuasive account of the forces, conflicts and debates that have underpinned the emergence of something we now effortlessly refer to as the 'modern interior'. Offering fascinating and eloquent insights into the work of international designers including C.R. Mackintosh, Adolf Loos, Josef Frank, Frank Lloyd Wright, Marcel Breuer, Lilly Reich, Mies van der Rohe, Le Corbusier, Philippe Starck, and Charles and Ray Eames, Sparke focuses on the realities as well as concepts of the modern interior, whether in the hands of professional decorators and designers, or in those of its amateur inhabitants. By doing so, she deftly unravels the shift from Victorian to modern style, and demonstrates that the easy transition to the modern interior so frequently portrayed is little more than a mythology. &quot;The Modern Interior&quot; is essential reading for all students of modern design, architecture and culture, as well as anyone interested in why the interior spaces we inhabit look the way they do","torrent":{"xt":"urn:btih:68c59d686afee1adc6a2f1201585a9a378af7675","amp;dn":"The+Modern+Interior+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68c59d686afee1adc6a2f1201585a9a378af7675","infoHashBuffer":{"type":"Buffer","data":[104,197,157,104,106,254,225,173,198,162,241,32,21,133,169,163,120,175,118,117]},"announce":[],"urlList":[]}}