{"title":"Alexanders Lost World Series 1 2of6 Mother Of All Cities 720p x2","uid":9843815,"size":1092824983,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:68c812b6049858b27927d40d103474e0a63947c0&amp;dn=Alexanders+Lost+World+Series+1+2of6+Mother+Of+All+Cities+720p+x2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"MVGroup","files":-1,"time":1396038540,"description":"Alexander's Lost World\n\nHistory, Travel Documentary hosted by David Adams, published by UKTV in 2014 - English narration\n\n\nInformation\n------------------------------\n\nAlexanders Lost World\nAlexander's Lost World is a series co-produced with David Adams Films and Sky Vision. Following the course of the River Oxus (Amu Darya) for the first time, Adams takes viewers on an extraordinary 1,500-mile (2400 km) journey through war-torn Afghanistan and Central Asia.Explorations The Ancient Greeks have long been credited for bringing 'civilization' to the East. In fact it appears to be the other way round. Alexander the Great discovered a highly developed civilization (a lost world) that pre-dated even the Persians. As Adams unravels the mysteries of the Oxus Civilizations, its great fortress cities are dramatically recreated in stunning CGI. Travelling through the most remote regions of Afghanistan unarmed, Adams and his Cameraman live as everyday Afghans gaining a most unique insight into the people and our shared heritage.\n\n\n1)  On An Ancient Sea \nIn search of the Alexander's Lost World, Adams follows in the footsteps of the earliest Greek explorers, putting a new theory on Jason and the Argonauts to the test. Are the ancient accounts correct? Were the Caspian and Black seas once joined, actually making it possible for the Argonauts to sail to the East? Aboard a replica of the Argo, David embarks on an epic journey that will take him from Greece across half the earth and in to war torn Afghanistan. In Russia David discovers the Phasis River, the waterway that led Jason to 'The land of the Golden Fleece' and onto the Caspian Sea where Alexander planned to created a great canal to connecting it to the Black Sea. Then, guided by desert horsemen, he enters Alexander's Lost World in search of the mysterious River Oxus that according to the Ancient Greeks once flowed into the Caspian, transporting riches all the way from India. In the desert wastes of Turkmenistan he discovers the ruins of a magnificent 4,000 year old city and startling evidence to suggest that the reports of the Ancient Greeks were correct; in their time, earth's climate was radically different than today.\n\n2)  Mother of All Cities \nCrossing into Afghanistan in search of the lost city of Bactra, Adams uses the Ancient Greek accounts as a guide to try and locate Alexander's fabled Central Asian Capital. Long thought to be the citadel of Balkh, the Greeks accounts appear to describe a different city entirely. In the markets beneath the citadel, he finds evidence to suggest Bactra may lie out towards the Oxus River at the end of a great delta. Entering Taliban territory, David and his cameraman, Greg, discover the remains of a vast defensive network of walls and fortresses more than 2,500 years old. Bactra though remains elusive. Then a chance meeting leads David into the legendary Paraopamisus Mountains of the Greeks. Entering Taliban territory once again, he follows a system of archaic tunnels that lead into a remote valley. As he explores an abandoned archaeological dig site, he considers the Greek records carefully - is this the lost city of Bactra?\n\n3)  Alexandria on the Oxus \nDid Alexander really build sixteen cities in Afghanistan and Central Asia or was he the destroyer of a far more ancient civilization? Adams goes in search of the most alluring of them all - Alexandria on the Oxus. On patrol with the German army David moves over the very same ground as Alexander. At a festival celebrated long before Alexander's time he joins Mullahs and Generals to witness the war game of Buzkashi. In search of the fabled city, David travels along Alexander's route of conquest through Uzbekistan and Tajikistan to unearth Alexandria on the Oxus. He then crosses the Oxus River in the same manner as Alexander's men, building a goatskin raft to ford the vast river. With an eccentric archaeologist Adams explores an excavated city, discovering the truth about the marriage of Alexander to Roxanne. Travelling with the Tajik army, he gains entry through the border defenses of the former USSR to reach what many believe is Alexandria on the Oxus. But is this really the fabled city or does it lie back across the Oxus River in Afghanistan?\n\n4)  City of Moon Lady \nCrossing back into Afghanistan, Adams continues his search for Alexander's Lost Cities. Lost in a sand storm in the desert, he and cameraman Greg finally reach a remote police outpost in the Taliban held Kunduz delta. The police take him deeper into the delta to the vast fortress known as Qy-i-Zal, believed to be one of Alexander's bases. Here, he makes an incredible discovery. But still on the horizon is one of the only Greek cities ever found in Afghanistan - Ai Khanoum. Beset with obstacles, broken bridges, flooded rivers and the constant threat of Taliban roadblocks he finally reaches his destination. Ai Khanoum - the city of the Moon Lady - spreads out across the plain, a whole Greek city lies in the dust. But was it the once magnificent Alexandria on the Oxus? With the help of the local Afghan General, Adams uncovers the truth behind the legend of Alexander and his cities - and out on the plains he discovers an even more astounding revelation.\n\n5)  Land of the Golden Fleece \nIn the waters of the Oxus River Adams discovers a surprising connection to Jason and the Argonauts - could they have possibly travelled this far from Greece? David explores the riches that had drawn Alexander and the Greeks, following the ancient trade route deep into in remotest Badakshan to discover more of its ancient civilization. Deep in the Hindu Kush, on the borders of hostile Nuristan, David reaches lapis lazuli mines that supplied the precious blue stone for Tutankhamuns funeral mask. For 7,000 years they have given up their riches - extraordinary evidence that this lost world was once connected to the west. On the Pakistan borders, David meets with the fabled 'Children of Alexander' and determines - once and for all - Alexander's relationship to them. When the road turns to river and rubble, he finds the remains of other invaders and their unexplored citadel - Chinese and Tibetans who just like Alexander once fought for control of the trade routes in an epic battle of 20,000 men.\n\n6)  Source of Civilization \nTo discover the origins of these people and their civilization that flowered long before Alexander's arrival David enters one of the least visited places on earth - the Wakhan Corridor. With a caravan of twenty-five yaks, horses and handlers, he begins the final leg of his Quest for Alexander's lost world and experiences what it was like for Alexander's army to live and fight in the high passes on the roof of the world. Then, looking for evidence of the earliest communities, Adams finds evidence of farming and irrigation above 4000 meters - evidence that long ago a radically different climate made farming possible on the roof of the world. He journeys on, deep into the high Pamir Mountains on Afghanistan's border with China. Invited by his Kirghiz guides to a wedding on the high plains, he plays Buzkashi and experiences their precarious existence. David then goes in search of the true source of the Oxus River - it remains undetermined till this day. To the merriment of his Kirghiz guides, he measures flow and volumes, before making the final push to the place he believes is the source - an ice cave at the base of a glacier. However, is this the answer to the riddle behind the source of the ancient Oxus River?\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img823.imageshack.us/img823/7761/b3f9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img823.imageshack.us/img823/7761/b3f9.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img203.imageshack.us/img203/9843/59rd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img203.imageshack.us/img203/9843/59rd.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img822.imageshack.us/img822/5144/rpzp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img822.imageshack.us/img822/5144/rpzp.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img703.imageshack.us/img703/2258/1fyl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img703.imageshack.us/img703/2258/1fyl.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img841.imageshack.us/img841/7645/0ynk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img841.imageshack.us/img841/7645/0ynk.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img713.imageshack.us/img713/8071/tt9e.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img713.imageshack.us/img713/8071/tt9e.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img833.imageshack.us/img833/5238/zg86.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img833.imageshack.us/img833/5238/zg86.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img541.imageshack.us/img541/1346/t6tv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img541.imageshack.us/img541/1346/t6tv.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img716.imageshack.us/img716/5791/vf9s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img716.imageshack.us/img716/5791/vf9s.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img829.imageshack.us/img829/6656/wg1s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img829.imageshack.us/img829/6656/wg1s.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img89.imageshack.us/img89/5980/df0g.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img89.imageshack.us/img89/5980/df0g.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img856.imageshack.us/img856/3007/qu5u.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img856.imageshack.us/img856/3007/qu5u.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img33.imageshack.us/img33/3016/0sbq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img33.imageshack.us/img33/3016/0sbq.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img853.imageshack.us/img853/9497/fnq5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img853.imageshack.us/img853/9497/fnq5.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img541.imageshack.us/img541/8070/yzar.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img541.imageshack.us/img541/8070/yzar.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img34.imageshack.us/img34/5172/75hs.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img34.imageshack.us/img34/5172/75hs.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;6c24050b042c2058425d&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 2978 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 Kbps ABR 48KHz\n * Audio Channels: Stereo 2\n * Run-Time: 46mins\n * Framerate: 25 FPS\n * Number of Parts: 6\n * Container Mp4\n * Part Size: average 1.01 GB\n * Source: HDTV\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.alexanderslostworld.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.alexanderslostworld.com/&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:68c812b6049858b27927d40d103474e0a63947c0","amp;dn":"Alexanders+Lost+World+Series+1+2of6+Mother+Of+All+Cities+720p+x2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68c812b6049858b27927d40d103474e0a63947c0","infoHashBuffer":{"type":"Buffer","data":[104,200,18,182,4,152,88,178,121,39,212,13,16,52,116,224,166,57,71,192]},"announce":[],"urlList":[]}}