{"title":"Propellerheads Reason Pianos 16 and 24 bit Reason 3.0 Refill","uid":3579750,"size":2057190018,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:68fb365a394a22337f458be623e5a6e4ef3d4c9d&amp;dn=Propellerheads+Reason+Pianos+16+and+24+bit+Reason+3.0+Refill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"coney_123","files":5,"time":1166538531,"description":"Hypersampled Production Pianos \nfor Reason\n\nReason Pianos is the perfect piano package: three stunning sounding, highly realistic pianos for Reason\\\\\\&amp;#039;s Combinator. Reason Pianos were recorded from multiple angles, using six different sets of microphones. Why? Because there\\\\\\&amp;#039;s no one way to record a piano.\n\n\nThe Reason Pianos ReFill gives you three amazing-sounding Hypersampled acoustic pianos with the kind of presence and playability you normally wouldn\\\\\\&amp;#039;t associate with sampled pianos. Until now. Where other piano libraries leave you with a fixed piano sound that may or may not suit your project, Reason Pianos does just the opposite: these pianos were recorded using multiple microphones, leaving the mixing and shaping of your piano sound to you. You create piano sounds that suit your mix, not the other way around. A large selection of Combinator presets ranging from basic microphone setups to wide multi-mic patches guarantees you absolute sonic control. There\\\\\\&amp;#039;s no one way to record a piano. And, there\\\\\\&amp;#039;s no one way to mix one.\n\nThe Pianos \nThe featured pianos were chosen for their classic pop and rock friendly sound; The Steinway D is considered to be the world\\\\\\&amp;#039;s finest grand piano, the Yamaha C7 is a classic rock and jazz piano with a distinctive sound, and the Steinway K is a well balanced upright known for its deep tone. These instruments were hand-picked and then tuned and adjusted to perfection.\n\nIn the mix \nThe Piano with its wide tonal range and broad frequency spectrum is a notoriously tricky instrument to fit into a mix. Not any more. The four stereo pairs and the two separate mono microphones used to record the pianos are all represented as individual channels in Reason\\\\\\&amp;#039;s mixer, allowing you to tailor your piano sound to suit the other elements in your songs.\n\nUse plenty of mics or just a few, whatever sounds best. The mono ribbon mic signal alone might be perfect for a busy track. Need more bass? Simply bring up the floor microphones a notch. Or, give the individual mics some EQ or compression or other FX. For further sound sculpting, use the Combinator\\\\\\&amp;#039;s front-panel rotaries and buttons to control release resonance, presence, dynamics and more.\n\nClassically unclassical - yet classy \nThe Reason Pianos ReFill does not seek to deliver a set of clinically perfect, scientifically reproduced concert pianos in a box. These are pianos you can use. Pianos to play. Pianos that simply sound good - without filling up your harddrive or chewing up all your RAM. These hypersampled pianos are sophisticated and highly responsive instruments - play softly or put some weight into it, and you\\\\\\&amp;#039;ll feel it. Enjoy.\n","torrent":{"xt":"urn:btih:68fb365a394a22337f458be623e5a6e4ef3d4c9d","amp;dn":"Propellerheads+Reason+Pianos+16+and+24+bit+Reason+3.0+Refill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68fb365a394a22337f458be623e5a6e4ef3d4c9d","infoHashBuffer":{"type":"Buffer","data":[104,251,54,90,57,74,34,51,127,69,139,230,35,229,166,228,239,61,76,157]},"announce":[],"urlList":[]}}