{"title":"Heartbreak High - Season 1 (see inside before downloading)","uid":5075914,"size":14554864546,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:692acb82705aaf3ab3d00e6b2a4bc0d9d39f43f6&amp;dn=Heartbreak+High+-+Season+1+%28see+inside+before+downloading%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":7,"uploader":"softline","files":40,"time":1251834612,"description":"Heartbreak High is a hip and realistic series about the lives of teenage students, their families and teachers at a high school. Heartbreak High is set in an inner city school, Hartley High, within a multi-racial area. Heartbreak High was originally a stage play which producer, Ben Gannon, turned into a successful film The Heartbreak Kid in 1993. The show captured more than 70 per cent of the youth audience in its first five weeks of broadcast in Australia. \n\nThis is one of the most popular shows in the history of television.  It has aired in nearly every country in the world except USA.  It is still on the air in many non-english speaking countries (Brazil, Italy, Spain, etc.).  Another tribute to its popularity is the number of short clips that populate sites like\n\nThe show was high quality in addition to being popular.  Scenes from the show are still used in drama classes throughout the world.  Of particular distinction was Abi Tucker's death scene.\n\nThe show was also the launching point of the carreers of most of the major players in current television and the movies.  A popular career path in the 90s was to do a few episodes of Heartbreak High, get noticed by an agent in the UK or US, and then move there to continue your career (such as Simon Baker).  If you watch episodes carefully you will notice many actors who are not even listed in the credits who are major stars today.  Many of the cast who did not continue with acting carreers have gone on to be major players in the entertainment industry.  For example Sarah Lambert (who played fresh out of college english teacher) has gone on to an award winning carreer as a maker of documentary films and currently lives in New York.\n\nThe show in unlikely to be released on DVD.  The production company failed to get DVD releases from the musicians who provided music for the series.  Something similar happened to the DVD release of Dawson's Creek.  As a result the DVD release of Dawson's Creek had different music from what was used on the original broadcasts.  I am not sure if the show's producers would be willing to spend the money to rerecord the audio (particularly in light of the recent death of Ben Gannon).\n\nThese files are VHS captures from Netherlands TV.  The shows have english audio with hardwired dutch subtitles.  The quality is better than any of the other episodes you find elsewhere on the internet.  Episode 108 is missing and episode  136 has quality problems.  If anyone has replacements for these to episodes please upload them.\n\nA note on episode numbering.  Episodes are numbered sequentially and grouped in to seasons based on how they were originally aired in Australia.  When shown in other countries the episodes were grouped differently.  For example seaons two and three were often combined into a single long season.  Full season torrents will be posted every other day until all seven seasons are up.","torrent":{"xt":"urn:btih:692acb82705aaf3ab3d00e6b2a4bc0d9d39f43f6","amp;dn":"Heartbreak+High+-+Season+1+%28see+inside+before+downloading%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"692acb82705aaf3ab3d00e6b2a4bc0d9d39f43f6","infoHashBuffer":{"type":"Buffer","data":[105,42,203,130,112,90,175,58,179,208,14,107,42,75,192,217,211,159,67,246]},"announce":[],"urlList":[]}}