{"title":"The Practice of Modernism - Modern Architects and Urban Transfor","uid":11601193,"size":6317918,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:694ac9e5a120fbdbe6ad3d4e46cd8416935517f6&amp;dn=The+Practice+of+Modernism+-+Modern+Architects+and+Urban+Transfor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"STBGD","files":-1,"time":1417355282,"description":"The Practice of Modernism: Modern Architects and Urban Transformation, 1954-1972 by John R. Gold\nEnglish | July 26, 2007 | ISBN: 0415258421 | 352 pages | PDF | 6 MB\n\nIn this sequel to his widely-acclaimed book The Experience of Modernism (1997), John Gold continues his detailed enquiry into the Modern Movement's involvement in urban planning and city design.\n\nMaking extensive use of information gained from hours of in-depth interviews with architects of the time, this new book examines the complex relationship between vision and subsequent practice in the saga of postwar urban reconstruction. The Practice of Modernism:\n\ntraces the personal, institutional and professional backgrounds of the architects involved in schemes for reconstruction and replanning\ndeals directly with the progress of urban transformation, focusing on the contribution that modern architects and architectural principles made to town centre renewal and social housing\nhighlights how the exuberance of the 1960s gave way to the profound reappraisal that emerged by the early 1970s.\nWritten by an expert, this is a key book on the planning aspects of the modernist movement for architectural historians, urban geographers, planners and all concerned with understanding the recent history of the contemporary city","torrent":{"xt":"urn:btih:694ac9e5a120fbdbe6ad3d4e46cd8416935517f6","amp;dn":"The+Practice+of+Modernism+-+Modern+Architects+and+Urban+Transfor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"694ac9e5a120fbdbe6ad3d4e46cd8416935517f6","infoHashBuffer":{"type":"Buffer","data":[105,74,201,229,161,32,251,219,230,173,61,78,70,205,132,22,147,85,23,246]},"announce":[],"urlList":[]}}