{"title":"The Breakout Novelist - Donald Maass","uid":11745847,"size":1421482,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:695ccdd7af1ccee057a7709b623b53bd471a3cdb&amp;dn=The+Breakout+Novelist+-+Donald+Maass&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ZamKhan","files":1,"time":1426014502,"description":"The all-inclusive guide for novel writers\n\nIf you're serious about making your fiction vibrant, engaging, and marketable, you've found the right book. The Breakout Novelist gives you the craft and business know-how you need to make your book stand out.\n\nInside, veteran agent Donald Maass brings together the most innovative and practical information from his workshops and previous books to lead you through every aspect of setting your novel apart from the rest. Maass shares examples from contemporary writers across all genres to equip you with the strategies great writers use to craft great fiction - from core fiction-writing elements like character, setting, description, and plot, to more advanced techniques including point of view, voice, and suspense. Plus, you'll find over 70 practical exercises to help you move your writing from blah to breakout.\n\nYou'll also learn from Maass' experiences over more than three decades in the publishing industry. Get straight talk from an insider about agents, contracts, how the industry is changing, and how to be the kind of author who builds a successful career book after book.\n\nGet the best of Maass' expertise and instruction in one easy-to-use reference","torrent":{"xt":"urn:btih:695ccdd7af1ccee057a7709b623b53bd471a3cdb","amp;dn":"The+Breakout+Novelist+-+Donald+Maass","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"695ccdd7af1ccee057a7709b623b53bd471a3cdb","infoHashBuffer":{"type":"Buffer","data":[105,92,205,215,175,28,206,224,87,167,112,155,98,59,83,189,71,26,60,219]},"announce":[],"urlList":[]}}