{"title":"Total.War.ROME.II.Hannibal.at.the.Gates-RELOADED","uid":9843826,"size":12718637644,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:69a893c7fe9e1682ffbf7714265a319aaa33fa89&amp;dn=Total.War.ROME.II.Hannibal.at.the.Gates-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Thhaque","files":2,"time":1396038744,"description":"[b]More Exclusive: \n &lt;a href=&quot;\nhttp://www.celeritygames.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.celeritygames.com/&lt;/a&gt;\n\n[IMG]http://i.imgur.com/ZBPrp5D.jpg[/IMG]\n\n Total War: ROME II - Hannibal at the Gates (c) SEGA\n \n 03/2014 :..... RELEASE.DATE .. PROTECTION .......: Steam+CEG\n 1 :.......... DISC(S) .. GAME.TYPE ........: Strategy\n\n \n NOTE: \n ----\n This release is standalone, an addon of this DLC would require 17 GB over a 23\n GB installation dir.\n It includes full game with latest update, Caesar in Gaul and Hannibal at the\n Gates official campaign addons.\n \n This release includes the following DLC:\n - Greek States Culture Pack\n - Nomadic Tribes Culture Pack\n - Baktria Faction Pack\n - Seleucid Empire Faction Pack\n - Blood &amp; Gore\n - Caesar in Gaul\n - Beasts of War\n - Hannibal at the Gates\n \n ----\n \n Total War: ROME II Hannibal at the Gates\n \n \n Dropping you into the Western Mediterranean at the outbreak of the 2nd Punic\n War, Hannibal at the Gates features a new campaign map focused on the period\n that brought the ancient-world superpowers of Rome and Carthage to all-out\n war.\n \n \n One of the most famous in history, the conflict demonstrated the tactical\n genius of great rival generals Scipio and Hannibal. Can you recreate their\n remarkable strategies, or can you do better? How will you change history?\n \n \n You enter the war as Carthage or Rome, command the noble Hellenic city-state\n of Syracuse, or, for the first time in ROME II, play an Iberian faction as\n the Arevaci or the Lusitani.\n \n \n Hannibal at the Gates also features:\n \n \n New Campaign Map:\n \n \n A more detailed representation of the western Mediterranean than the ROME II\n map, with players able to expand across 19 provinces dotted with resources\n and settlements. The major powers of the time, Rome and Carthage, begin at\n loggerheads but with a number of key regions and client states under their\n control. Syracuse, the Arevaci and the Lusitani all start with a single\n region, offering a significantly different and more formidable challenge than\n playing as one of the two great empires.\n \n \n Diplomacy-focused Technology:\n \n \n Rome and Carthage both feature new civil tech-tree branches focused on\n diplomacy. Both sides begin with multiple allies and client states, and can\n undermine their opponents' support by diplomatic means.\n \n \n 12 Turns per-year:\n \n \n With a time period covering events between 218 - 202BC, each turn in Hannibal\n at the Gates represents a month, and the campaign transitions through all\n four seasons of the year, complete with seasonal gameplay effects.\n \n \n Compact, focused Multiplayer Campaign:\n For those generals seeking a more rapid Multiplayer Campaign game, Hannibal\n at the Gates' tighter geographic scope makes co-op or competitive 2-player\n campaigns more focused and faster than a full Grand Campaign.\n \n \n New Historical Battles:\n \n \n Hannibal at the Gates adds two new Historical Battles: the Battle of Cannae\n (216BC) and the Battle of Zama (202BC). Both battles marked key points in the\n 2nd Punic War, with Cannae representing the high point of Hannibal's invasion\n of Italy, and Zama marking the completion of Rome's victory and dominance\n over Carthage.\n \n \n New Playable Factions for Total War: ROME II\n \n \n In addition to mighty Carthage and Rome, players can fight the 2nd Punic War\n as three new factions: the Arevaci, the Lusitani and Syracuse, each one\n featuring its own faction traits, characteristics, unique units and campaign\n start-position. If Hannibal at the Gates is owned, these factions are also\n playable in the ROME II Grand Campaign.\n \n \n The Arevaci\n \n \n Imperialist expansion has brought both Carthage and Rome to the Arevaci's\n door, although it is Hannibal that currently shares a border with the warlike\n Celtiberian tribe. As the campaign begins, the Arevaci are neutral but have a\n clear choice before them: unite with Hannibal and risk genocidal retaliation\n from the Romans, or remain on good terms with Rome and face the certainty of\n Carthaginian wrath. Despite their knowledge of the terrain and superb\n fighting prowess, the Arevaci cannot take on both superpowers at once. For\n now, they maintain their neutrality, but it cannot last. Someone must control\n the Iberian peninsula, could it be the Arevaci?\n \n \n The Lusitani\n \n \n The Lusitani lived in Iberia long before Carthage or Rome disturbed the\n region. They are, like their distant cousins the Suebi, not a single clan but\n a confederation of smaller tribes, working together for defensive and mutual\n gain Fierce and agile warriors, the Lusitani are well suited to guerrilla\n warfare. As Hannibal's Carthaginian army marches through lands previously\n controlled by Rome, there is opportunity for the Lusitani to expand beyond\n their bounds and claim back Iberia from its invaders. However, though there\n may be prudence in caution, even fraternisation with the enemy at first,\n eventually they must be expelled from the land!\n \n \n Syracuse\n \n \n The city-state of Syracuse is renowned throughout the ancient world as a\n centre for culture and science. It is also rich; Syracuse benefits greatly\n from its prime position in the central Mediterranean. A string of tyrants\n dominate its history, defending the city's autonomy against fellow Greeks,\n Carthaginians and threats from within. In 218BC, both Rome and Carthage would\n like to see Syracuse under their control once and for all. As the two\n superpowers go to war again, it stands on a precipice - will Syracuse forge\n its own destiny or fall into obscurity as just another colonial possession?\n \n \n New Units\n \n \n Alongside their regular unit rosters, the playable factions in Hannibal at\n the Gates get the following new units. If you own Hannibal at the Gates,\n these units will also be available in the ROME II Grand Campaign:\n \n \n Arevaci\n Painted Warriors (melee infantry)\n Painted bodies and unpleasant stenches instil fear in unlucky opponents,\n which is half the battle.\n \n \n Celtiberian Cavalry (melee cavalry)\n A versatile cavalry strike force when commanded by a skilled general.\n \n \n Lusitani\n Lusitani Guerrillas (stealth spear infantry)\n Moving unseen to ambush their opponents, these stealthy guerrilla fighters\n are masters of their craft.\n \n \n Lusitani Spearmen (spear infantry)\n Skilled tribal spearmen whose reputation on the battlefield is fully\n deserved.\n \n \n Syracuse\n Picked Hoplites (elite hoplites, also available to Athens)\n The cream of citizen hoplites to proudly defend their city from invasion.\n \n \n New Roman Auxiliary units:\n Auxiliary Scutarii (Iberian melee infantry)\n These Iberians are more than able to serve Rome at the front of a battle\n line.\n \n \n Auxiliary Scutarii Cavalry (Iberian melee cavalry)\n These heavy cavalrymen add a touch of Iberian fire to otherwise conservative\n Roman ranks.\n \n \n New Iberian Mercenary units:\n Mercenary Scutarii (Iberian melee infantry)\n Large, well-paid men with falcatas can settle a surprisingly large number of\n arguments.\n \n \n Mercenary Scutarii Cavalry (Iberian melee cavalry)\n These mounted mercenaries are a fine force for close-quarters combat.\n \n \n New Italian Mercenary units:\n Mercenary Etruscan Hoplites (Italian hoplites)\n Equipped and trained in the Greek fashion, Rome's former masters remain a\n force to be reckoned with.\n \n \n Mercenary Samnite Warriors (Italian heavy infantry)\n Conquered peoples can still produce the finest warriors.\n \n \n Mercenary Campanian Cavalry (Italian heavy cavalry)\n Noble horsemen from some of the finest pastures of the peninsula.\n\n Installation:\n \n 1. Unrar.\n 2. Burn or mount the image.\n 3. Install the game.\n 4. Copy over the cracked content from the /Crack directory on the image to\n your game install directory.\n 5. Play the game.\n 6. Support the software developers. If you like this game, BUY IT![/b]","torrent":{"xt":"urn:btih:69a893c7fe9e1682ffbf7714265a319aaa33fa89","amp;dn":"Total.War.ROME.II.Hannibal.at.the.Gates-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69a893c7fe9e1682ffbf7714265a319aaa33fa89","infoHashBuffer":{"type":"Buffer","data":[105,168,147,199,254,158,22,130,255,191,119,20,38,90,49,154,170,51,250,137]},"announce":[],"urlList":[]}}