{"title":"Keith Jarret Trio - Always Let Me Go CD 1 (2001) [Jazz][mp3 320]","uid":5104378,"size":148655361,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:69f865723097321c38274bdc0f87e4462b1a06ff&amp;dn=Keith+Jarret+Trio+-+Always+Let+Me+Go+CD+1+%282001%29+%5BJazz%5D%5Bmp3+320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"schon55","files":16,"time":1254249161,"description":"Keith Jarret Trio - Always Let Me Go CD 1\nYear: 2001 (Recorded live in Japan)\nLabel: ECM (2002)\nTotal time: 137:21\nQuality: 320 kbps\n\nRecorded live in Tokyo in April 2001, Always Let Me Go is Keith Jarrett's 149th concert in Japan.  Joined by his long-standing partners Gary Peacock and Jack DeJohnette, these performances are playful, explosive, somber, and completely improvised.  After 20 years of working together, they trust each other (and the audience) enough to deliver over two hours of unscripted music.  DeJohnette prowls through his drums like a restless cougar: he chatters, scuffles, and pounces on the skins with agility.  Likewise, Peacock spoons out a concrete foundation of bass; one that bubbles as it spreads through the cracks in Jarrett's 88 keys (which serve the pianist so very well).  For listeners familiar with the trio's Inside Out CD, here is the same idea further elaborated on.  &quot;Hearts in Space&quot; spirals out of the starting gate with geometrical tremors, as three virtuosos all start their respective engines and read each other's pulses over the course of 32 minutes.  The trio effortlessly glide from mood to mood in synchronization to deliver a ballad in the eye of a hurricane, then dismount into straight-ahead swing.  &quot;The River&quot; is a stoic hymn, a richness of melancholy in deep scarlet blue.  It is Jarrett's only solo here, as brief as it is rewarding.  &quot;Paradox&quot; rides the crest of bebop in a simmering stew to close out the first disc with a punch that stops on a dime.  There are enough recurring themes here to call it a standard of sorts, and the musicians quickly assume the proper formation as they've done thousands of times before.  Disc two opens with &quot;Waves,&quot; another half-hour marathon of moods that evolves seamlessly between chromatic stillness, manic fluttering, and gunpowder bop.  DeJohnette clearly sets the tone for &quot;Facing East&quot; -- a syncopated clockwork of beat, as Jarrett pinwheels in like-minded percussives with Peacock flipping through volumes of frets.  Next comes the aptly titled &quot;Tsunami,&quot; which swells and bursts with power before finally subsiding to fractured stillness.  It is the fire in the musicians' bellies -- perhaps the darkest and most ferocious passage of the album.  As is often the case, Jarrett's distant vocals pinch the air from time to time.  Although purists may wince at this additional layer of seasoning, there's no denying his expression comes out of the deepest level of commitment.  It is this same commitment that fuels so much of the album.  With the knowledge that Always Let Me Go is live and improvised, it adds a rewarding layer of understanding and appreciation, as few musicians can deliver such diamonds with so little structure in place.  Song for song, the symbiosis is a marvel to behold -- and the audience knows it.  These are gods at play, and the lightning bolts they toss around are awe-inspiring.  ~ Glenn Swan, AMG\n\nPersonnel:\nKeith Jarrett (Piano) \nGary Peacock (Double Bass) \nJack DeJohnette (Drums)\n\nKeith Jarret Trio - Always Let Me Go Tracks on CD1:\n01.  Hearts In Space (Keith Jarrett) 32:12 \n02.  The River (Keith Jarrett) 3:34 \n03.  Tributaries (Keith Jarrett/Gary Peacock/Jack DeJohnette) 16:18 \n04.  Paradox (Keith Jarrett) 9:01","torrent":{"xt":"urn:btih:69f865723097321c38274bdc0f87e4462b1a06ff","amp;dn":"Keith+Jarret+Trio+-+Always+Let+Me+Go+CD+1+%282001%29+%5BJazz%5D%5Bmp3+320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69f865723097321c38274bdc0f87e4462b1a06ff","infoHashBuffer":{"type":"Buffer","data":[105,248,101,114,48,151,50,28,56,39,75,220,15,135,228,70,43,26,6,255]},"announce":[],"urlList":[]}}