{"title":"TAUT: The Ford Book  (2014) J A Huss (multi)","uid":9505875,"size":1259067,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a3a587bb84432ce92395c4f794974c82ce0d0aa&amp;dn=TAUT%3A+The+Ford+Book++%282014%29+J+A+Huss+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"7","files":-1,"time":1390316982,"description":"TAUT: The Ford Book (Rook and Ronin Spinoff #1) by J.A. Huss\n\n\nFormat: mobi/epub/azw3\nLength: 325 pages\nGenre: Romantic Suspense\nDate: 20 January 2014\n\n*According to Ms Huss, this is a standalone novel, and not part of the Rook &amp; Ronin series. It's a separate spin-off featuring only Ford Aston.\n\nFord Aston is known for many things. Being an emotionless, messed up b*stard, a freakishly smart social outcast, and a cold, domineering master who keeps &quot;pets&quot; instead of girlfriends.\n\nAnd after Rook broke his heart, he plans to keep it that way.\n\nAshleigh is known for nothing, and that's exactly what she's got going for her. She's broke, stranded in the mountains with a three month old baby, and Ford Aston is screwing with her head.\n\nBig. Time.\n\nAnd she plans to mess with his right back.\n\nIt's a coy game at first, filled with flirting, and innuendo--but Ford soon realizes something is not quite right with Ashleigh. In fact, something is seriously, seriously wrong and the closer they get to their final destination, the closer Ford gets to the truth.\n\nOne night of devastation, self-loathing, and emptiness turns into the best thing that ever happened to Ford Aston. But one day of in-your-face reality threatens Ashleigh's whole existence.\n\nAuthor:\n\nJ.A. Huss writes new adult speculative and science fiction as well as an entire line of science non-fiction textbooks that cater to home learners. She has an undergraduate degree in equine science and a graduate degree in forensic toxicology. She adores everything science and considers herself a major geek! Her first series is called I Am Just Junco.\n","torrent":{"xt":"urn:btih:6a3a587bb84432ce92395c4f794974c82ce0d0aa","amp;dn":"TAUT%3A+The+Ford+Book++%282014%29+J+A+Huss+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a3a587bb84432ce92395c4f794974c82ce0d0aa","infoHashBuffer":{"type":"Buffer","data":[106,58,88,123,184,68,50,206,146,57,92,79,121,73,116,200,44,224,208,170]},"announce":[],"urlList":[]}}