{"title":"Cloe Palmer - 7 Man Gangbang and Bukkake at Theater HD 1080p","uid":15270768,"size":2130729390,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:6a4315fe3f688b3fb82b9ae4d5eaa1aa9ec24068&amp;dn=Cloe+Palmer+-+7+Man+Gangbang+and+Bukkake+at+Theater+HD+1080p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"ElitePorn","files":1,"time":1468265853,"description":"Cloe Palmer - 7 Man Gangbang and Bukkake at Theater HD 1080p\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\nSeven's my lucky number, it seems. My very first gangbang after aching and craving more cock from my first bukkake party, I absolutely had to return to the adult theater - after teasing, approaching, and rounding up seven strangers, I lead everyone into the big group play room and sit center stage, surrounded by big, anonymous cocks. I become exhilarated thinking about all of the different flavors I'm about to taste, scheming my shenanigans away as I contemplate how each and every one of them would feel inside me. Once I begin milking a few of the guys, I am overcome. Three massive facials and I am delirious with a cum-lust that cannot be described as anything but completely compelling and carnal. I can only handle so much before I am driven mad with desire - one of the gentlemen truly surprised me with the most massive &quot;grower&quot; that I have ever seen. After worshipping his cock and letting him throat-fuck me nice and deep, I have to ask if he has a condom - if he would do me the honor of doing me right then and there. It's at this point that I fully relinquish myself unto him (and whoever else still has any cum left). On my knees, he fucks me relentlessly with the biggest cock I have ever felt, as another man brings his member to my mouth. I had NEVER before this night been fucked like this - I'm so absolutely thrilled to have captured this, my first real &quot;threesome&quot;, on video. I know now that I never want to be without being as full as possible, a cock in each hole - I've had a taste and am positively hooked. Pure euphoria is the only way to describe my feeling as the two of them take turns using and fucking me as hard as they possibly can. I really have never in my life experienced a sensation quite like this. I never knew it was possible to feel so incredibly. One of the men cums inside me and the video comes to a close with an enormous, truly beautiful facial in astonishing slow motion - once again, one of the hugest that I've ever seen. I'm so unbelievably happy that I get to share my real experiences and personal exploration with you all - this was a big &quot;first&quot; for me but is absolutely only the beginning.\r\n\r\nScreenshots:\r\n~~~~~~~~~~~~ \nhttp://picturescream.com/x/clean/G8Kn\r\n \nhttp://picturescream.com/x/clean/G8Ko\r\n \nhttp://picturescream.com/x/clean/G8K2\r\n \nhttp://picturescream.com/x/clean/G8K6\r\n \nhttp://picturescream.com/x/clean/G8KO\r\n \nhttp://picturescream.com/x/clean/G8KQ\r\n \nhttp://picturescream.com/x/clean/G8Kd\r\n\r\n\r\nVideos Info:\r\n~~~~~~~~~~~~\r\nSize: 1.98 GB\r\nDuration: 22:11 min \t\r\nResolution: 1440x1080\r\n\r\n\r\nShow Your Appreciation - BitCoin: 1JxUQqRrvGC6txChvaZEbqSSsq9wtswoto","torrent":{"xt":"urn:btih:6a4315fe3f688b3fb82b9ae4d5eaa1aa9ec24068","amp;dn":"Cloe+Palmer+-+7+Man+Gangbang+and+Bukkake+at+Theater+HD+1080p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a4315fe3f688b3fb82b9ae4d5eaa1aa9ec24068","infoHashBuffer":{"type":"Buffer","data":[106,67,21,254,63,104,139,63,184,43,154,228,213,234,161,170,158,194,64,104]},"announce":[],"urlList":[]}}