{"title":"Introduction to Chi Energy Workout with David Carradine [MP4]","uid":11844571,"size":2645609624,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6a845069e0dab901335876f631d75ad8d91072d7&amp;dn=Introduction+to+Chi+Energy+Workout+with+David+Carradine+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":5,"uploader":"elessedilgirl","files":4,"time":1429908804,"description":"Let Hollywood legend and Kill Bill star David Carradine guide you through this introduction to the basic Chi Kung and Tai Chi exercises, both designed to remove tension, stress and pent-up emotions from the mind, whilst also increasing your flow of energy. Gently tone, stretch and oxygenate the muscles of the body while feeling thoroughly relaxed, rejuvenated and energized. This programme includes inspirational nature footage, accompanied by the soothing music of Jonn Serrie, with sequences choreographed by Doctor of Chi Kung, Arnold E Tayam. Tai Chi Maintain and Restore Health Tai Chi has proven to be one of the most powerful, yet gentle ways to rejuvenate the body and maintain and restore health. The Chinese believe that one s health and vitality is directly influenced by the flow of one s internal energy. This flow of energy can be easily enhanced by combining smooth and circular body movements with mental relaxation and focus. This is the essence of Tai Chi and this programme is devoted to the simplicity of this essence. Workout Time: Approx 57 mins Chi Kung Energy Skill Chi Kung literally means energy skill and was created 5000 years ago in ancient China as a way to find inner peace, harmony, strength and health. The Chinese believe that the mind, body, emotions and the spirit are all components of energy or Chi . This Chi affects not only our physical health but our mental and spiritual well being. In essence, inner harmony and mental focus are not just achieved by understanding, but also through efficient, simple and gentle exercises.\n\nVideo; x264; 706*578 (4:3); 2484 kbps; 25.000 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:6a845069e0dab901335876f631d75ad8d91072d7","amp;dn":"Introduction+to+Chi+Energy+Workout+with+David+Carradine+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a845069e0dab901335876f631d75ad8d91072d7","infoHashBuffer":{"type":"Buffer","data":[106,132,80,105,224,218,185,1,51,88,118,246,49,215,90,216,217,16,114,215]},"announce":[],"urlList":[]}}