{"title":"Geinoh Yamashirogumi 1976-1994","uid":7389542,"size":993345077,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6adb3041798357b866f0980e5941befcad9d34b6&amp;dn=Geinoh+Yamashirogumi+1976-1994&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":null,"files":-1,"time":1340733176,"description":"Geinoh Yamashirogumi is a Japanese musical collective founded on January 19, 1974 by Tsutomu ÅŒhashi, consisting of hundreds of people from all walks of life: journalists, doctors, engineers, students, businessmen, etc.\n\nThey are known for both their faithful re-creations of folk music from around the world, as well as their fusion of various traditional musical styles with modern instrumentation and synthesizers. For example, in the 1980s, MIDI digital synthesizers could not handle the tuning systems of traditional gamelan music, so the group had to teach themselves how to program in order to modify their equipment. The album that followed, Ecophony Rinne (1986) was a new direction for the group: they had not previously incorporated computer-generated sounds into their work. The success of this album brought them to the attention of Katsuhiro ÅŒtomo, who commissioned them to create the soundtrack of Akira. The soundtrack is built on the concept of recurrent themes or &quot;modules&quot;. Texturally, the soundtrack is a mix of digital synthesizers (Roland D-50 and Yamaha DX7-II, both of which could, by then, be tuned to the Pure-Minor, slendro, and pelog tuning scales), Indonesian chromatic percussion (jegog, etc.), traditional Japanese theatrical and spiritual music (Noh), European classical, and progressive rock.\n\nGeinoh Yamashirogumi has reproduced over eighty different styles of traditional music and performances from around the world, but despite having performed internationally to a high degree of critical acclaim, they remain relatively unknown.\n\nThe group's name uses ÅŒhashi's pseudonym, Shoji Yamashiro, and translates roughly to &quot;Performing Yamashiro Collective&quot;. ÅŒhashi took his inspiration from a postwar 1950s group of similar characters that lived as a commune.","torrent":{"xt":"urn:btih:6adb3041798357b866f0980e5941befcad9d34b6","amp;dn":"Geinoh+Yamashirogumi+1976-1994","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6adb3041798357b866f0980e5941befcad9d34b6","infoHashBuffer":{"type":"Buffer","data":[106,219,48,65,121,131,87,184,102,240,152,14,89,65,190,252,173,157,52,182]},"announce":[],"urlList":[]}}