{"title":"CIRCLE OF IRON - SILENT FLUTE.1978.LEGENDADO.PT.BR","uid":6368911,"size":747047994,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6af4fc9006c26214fb43bb9ffc5108fdd8709228&amp;dn=CIRCLE+OF+IRON+-+SILENT+FLUTE.1978.LEGENDADO.PT.BR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"fjtheo","files":2,"time":1304606159,"description":"A young martial artist, Cord the Seeker, competes for and loses the right to go on a quest for the Book of All Knowlege held by a wizard named Zetan, but he goes along the path to seek Zetan anyway. Along the way, he meets strange tests and challenges by enemies and allies - often having difficulty determining which is which.\n\nAntes da morte do Lendario Bruce Lee, ele ajudou a criar um filme cuja historia pudesse capturar nao somente o espirito das artes marcias mas tambem uma parte da Filosofia Zen que ele praticava.\nEstava ciente que um filme com esta dinamica causaria controversia, particulartmente entre aqueles estranhos aos fundamentos da Filosofia Zen. \nMas era justamente essa particularidade exclusiva que ele acreditou \nfaria a marca de um grande filme. Bruce criou a historia da flauta silenciosa em uma terra que nunca existiu  - e sempre e.\nE A Bruce Lee que este filme e postumamente dedicado.\n\n\nA profundidade e a sabedoria zen budista transforma a atmosfera desse filme em algo primoroso, farto em ensinamentos, O Circulo de Ferro, tambem e conhecido como O Silencio da Flauta (Silent Flute), um filme sobre o poder e com muitas respostas aos nossos questionamentos.\nJovem especialista em artes marciais decide competir, mas perde o direito de procurar pelo Livro de Todos os Conhecimetos, mantido por um feiticeiro chamado Zetan. Mesmo assim o jovem se arrisca a enfrentar essa jornada, na qual ele ira se deparar com dificeis desafios. O maior de todos, no entanto, e descobrir quem e, de fato, inimigo ou aliado. Producao zen budista que conta com David Carradine no auge de sua forma como mestre de artes marciais. \n\nDIVX\nAUDIO: INGLES\nLEGENDAS: PORTUGUES-BR (ANEXO AO VIDEO)\nTAMANHO: 717 MEGAS\n","torrent":{"xt":"urn:btih:6af4fc9006c26214fb43bb9ffc5108fdd8709228","amp;dn":"CIRCLE+OF+IRON+-+SILENT+FLUTE.1978.LEGENDADO.PT.BR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6af4fc9006c26214fb43bb9ffc5108fdd8709228","infoHashBuffer":{"type":"Buffer","data":[106,244,252,144,6,194,98,20,251,67,187,159,252,81,8,253,216,112,146,40]},"announce":[],"urlList":[]}}