{"title":"Wim Wenders - Der Stand der Dinge aka The State of Things (1982)","uid":3703030,"size":1571320456,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6afe720c32401b5aa594c341ff0f1a4cafdc339e&amp;dn=Wim+Wenders+-+Der+Stand+der+Dinge+aka+The+State+of+Things+%281982%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"kegir","files":3,"time":1180737977,"description":"German Title: Der Stand der Dinge \nEnglish Title: The State of Things\nDirector: Wim Wenders\nYear: 1982\nLanguage: English\nSubtitles: German (softsubs)\nSource: DVD\n\nPlot Synopsis from AMG\t\n\nWim Wenders&amp;#039; The State of Things (Der Stand der Dinge) was financed by one of the director&amp;#039;s chief mentors, Francis Ford Coppola. This highly autobiographical work concerns a shoestring movie producer and his ragtag crew. Stranded in the outer reaches of Portugal, the director doesn&amp;#039;t even have any film in his camera. There&amp;#039;s nothing left to do but scare up a potential backer--preferably one of those rich, movie-mad Americans. In illustrating the plight of the fictional filmmakers, Wenders strikes a blow on behalf of the homeless and disenfranchised everywhere; it is also an a clef recreation of the difficulties faced by the director during production of his first American film Hammett (also made under the auspices of Coppola).\nHal Erickson\n\nA few voices from IMDB\n\nOne of my all time favorite, 18 January 2000\n9/10\nAuthor: Alain Tanguay from Montreal, Canada\n\nThis is one movie I&amp;#039;ve enjoyed seeing over and over.It&amp;#039;s one of my all time favorite. The story is pretty simple; A filmmaker runs out of money while shooting in Portugal. He goes looking for his producer in Los Angeles to find out what is going on. This one of the most beautifully shot movie in black and white I&amp;#039;ve seen and it helps to set the overall atmosphere of the film. The cast is great and the story flows right along. Apart from a few lenghty scenes (wich is why I gave it a 9), you won&amp;#039;t be disappointed.If you&amp;#039;re interested at all about movie making don&amp;#039;t miss this one. \n\nA masterpiece of early Wenders and 1980s Los Angeles, 1 December 2003\n9/10\nAuthor: Joel J. Rane from Los Angeles, California\n\nFrom the first time I saw it, this film resonated strongly on two levels; first, it is an excellent example of Wenders at his best: an almost dreamy progression of exactingly composed images, mysterious characters, a &quot;story&quot; which comes as close as film can to &quot;truth&quot;, and for the cineastes in the audience, a complex dialogue with films of the past. But my second reason for loving this film is far more personal. As a teenager growing up in Hollywood during the early 1980s, I knew nothing about Wim Wenders or film history, but friends guided me to this film because of the soundtrack and the images at the end, inside an RV wandering aimlessly in Hollywood. This is, as far as I know, the first film to use either X or Joe Ely in the soundtrack. It also captures a lost city with amazing precision; almost every shot at the end contains some nostalgic element, from Tiny Naylor&amp;#039;s drive-in to the Parisian Room, from Schwab&amp;#039;s Pharmacy to the white smog in Laurel Canyon. This is a great film, but for Los Angelenos of my generation, it&amp;#039;s a treasure-trove. \n\nClassic Wenders!, 14 May 2003\n10/10\nAuthor: billcody from seattle, wa\n\nNot only is this film a classic - the short ends became Stranger Than Paradise making this film a true two-fer.\n\nA very anti-Hollywood film structured first as a kind of meditation and then turning into a great faux whodunit indictment of Hollywood itself. This won&amp;#039;t make a lot of sense until you actually see the film - but see it you must if you are a true film afficianado. Ignore the ridiculous film geek influenced 7.3 rating - the actual rating of 7.7 is much more accurate. One of the films that made Wim Wenders great\n\nThanks to smig for the up elsewhere\n\nFile Name .............: The State of Things (Der Stand der Dinge, Wim Wenders, 1982).avi\nFile Size (in bytes) ..: 1,562,267,648 bytes\nRuntime (# of frames) .: 1:56:33 (4190096 frames)\n\nVideo Codec ...........: XviD 1.0.3\nFrame Size ............: 640x352[=1.818]\nFPS ...................: 25.000\nVideo Bitrate .........: 1137 kb/s\nBits per Pixel ........: 0.202 bpp\nB-VOP, N-VOP, QPel, GMC ......: [B-VOP]...[]...[]...[]\n\nAudio Codec ...........: 0x2000 (Dolby AC3) AC3\nSample Rate ...........: 48000 Hz\nAudio bitrate .........: 448 kb/s [6 channel(s)] CBR audio\nInterleave ............: 40 ms\nNo. of audio streams ..: 2\n\n********************************* FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art\nto the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\t\t &lt;a href=&quot;\thttp://www.freakyflicks.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.freakyflicks.tk&lt;/a&gt;\n\n\t\t &lt;a href=&quot;\thttp://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://freakyflicks.proboards54.com/&lt;/a&gt;\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;","torrent":{"xt":"urn:btih:6afe720c32401b5aa594c341ff0f1a4cafdc339e","amp;dn":"Wim+Wenders+-+Der+Stand+der+Dinge+aka+The+State+of+Things+%281982%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6afe720c32401b5aa594c341ff0f1a4cafdc339e","infoHashBuffer":{"type":"Buffer","data":[106,254,114,12,50,64,27,90,165,148,195,65,255,15,26,76,175,220,51,158]},"announce":[],"urlList":[]}}