{"title":"LEGO Drome Racers (PC)","uid":9849278,"size":518220171,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6b23441e1d0831e2d4e80ac4e7e5c6cd41c92280&amp;dn=LEGO+Drome+Racers+%28PC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mindcrasher","files":1,"time":1396127631,"description":"Set in the year 2015, Drome Racers is a combination of racing gameplay with the Lego license, offering vehicles based upon the 2002 Lego construction toys. Career mode puts the player in the role of Max Axel, who is tasked with winning the coveted Drome Championship. To do so, he must work his way through the ranks by completing a number of Multi-Challenge Races; a series of races in which the completion time in one round is carried over to the next. For example, if Max finished three seconds behind in the last race, the leader is awarded a three-second head start in the next. The overall winner is the first to cross the finish line in the final race of the series. Preceding each Multi-Challenge series is a qualifying drag race, where victory is determined by a good start and proper gear-shifting.\n\nMax Axel is aided by other such Team Nitro members as Shicane who handles car upgrades, and Rocket, who gives advice. The winnings can be put toward building a new car or upgrading the existing one. The former allows players to select the wheels, chassis, and body type of the new vehicle, each of which is suited to specific conditions and environments. The latter offers five level upgrades in categories, such as engine, aerodynamics, turbo, armor, and tires. Weapons also play a vital role. The arcade mode presents players with Normal or Time Attack racing through a variety of courses, weather conditions, and routes. The Quick Race option allows for instant action by randomly selecting any pertinent variables, including cars and tracks, for either one or two players.\n\nInstallation:\nNo installation required. Simply extract the rar file to a location of your choosing and start the game by opening Drome Racers.exe.","torrent":{"xt":"urn:btih:6b23441e1d0831e2d4e80ac4e7e5c6cd41c92280","amp;dn":"LEGO+Drome+Racers+%28PC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b23441e1d0831e2d4e80ac4e7e5c6cd41c92280","infoHashBuffer":{"type":"Buffer","data":[107,35,68,30,29,8,49,226,212,232,10,196,231,229,198,205,65,201,34,128]},"announce":[],"urlList":[]}}