{"title":"The Killing ground - Wilderness to Cold Harbor (Time-Life)","uid":11776638,"size":32273836,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b8551523c607c6a7d16f9313191db4eda4d7aba&amp;dn=The+Killing+ground+-+Wilderness+to+Cold+Harbor+%28Time-Life%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"STBGD","files":1,"time":1427324536,"description":"Pdf / English / 1986 Time-Life / 176 pages / 30.7 MB / ISBN10 0809447681\n\nThis volume looks at the Virginia Front following the twin 1863 Confederate defeats at Vicksburg and Gettysburg. General Ulysses S. Grant, the victor at Vicksburg, went to Washington D.C. and began coordinating the Western and Eastern armies against the rebels... giving the Confederates no rest. He also stopped prisoner exchanges with the Confederates and stripped garrisons of troops for the field armies. His strategy would rely on attrition... a fight that Lee couldn't win. And Grant would seize the initiative and make Lee dance to HIS tune, no longer allowing his staff to worry about what Lee's next move would be but to concentrate and what THEIR next move would be. The Wilderness, Spotsylvania Courthouse and Cold Harbor are all illustrated in this volume. The 1864 battles in Virginia would be bloody and time-consuming, especially for the Federals, but would end with Lee's back to the wall at Petersburg and Richmond.\n\nIncludes great period photos, pictures of Civil War artifacts, artwork and excellent maps. Sidebars include Night Assault at the Rappahannock, Dahlgren's &quot;Secret Mission,&quot; Edwin Forbes sketches, the Peacock Garb of the Zouave Brigade and Photographing the Union Brass","torrent":{"xt":"urn:btih:6b8551523c607c6a7d16f9313191db4eda4d7aba","amp;dn":"The+Killing+ground+-+Wilderness+to+Cold+Harbor+%28Time-Life%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b8551523c607c6a7d16f9313191db4eda4d7aba","infoHashBuffer":{"type":"Buffer","data":[107,133,81,82,60,96,124,106,125,22,249,49,49,145,219,78,218,77,122,186]},"announce":[],"urlList":[]}}