{"title":"Anzacs WW1 Miniseries [1985]","uid":3590221,"size":3930672838,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6badec836b72293a6c9846de57bb7e136560ae59&amp;dn=Anzacs+WW1+Miniseries+%5B1985%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Diztinct","files":19,"time":1168008565,"description":"The epic television series that took Australia by storm!\n\nNothing in Australia&amp;#039;s history, beore or since, approaches the scale of drama and tragedy of our participation in the Great War of 1914-18. Over those 4 turbulent years, our boldest and brightest young men freely went to war over half a world away. After the blooding at Gallipoli, they were thrown in amongst the millions of soldiers on the Western Front. There, against all the odds and in defiance of all expectations, they developed into a military force beyond peer. While all great armies of Europe crumbled around them, somehow this small band of civilian volunteer soldiers forced the issu and shaped the outcome of that terrible war. They had changed the face of Europe and made their own legend, but at appaling cost to themselves and their young nation. Their depleted numbers coupled with a pervasive war weariness resulted in their story never being told. Until ANZACS.\n\nAn outstanding Australian cast including Andrew Clarke, Megan Williams, Tony Bonner, Ilona Rogers, Robert Coleby, Mark Hembrow, Jon Blake, Jonathan Sweet and Paul Hogan, in what was his first dramatic role, tell a story of love, valour, triumph and true Australian humour.\n\nNo television drama in Australia&amp;#039;s history has matched the magnitude and the compassion of this once in a lifetime event - ANZACS.","torrent":{"xt":"urn:btih:6badec836b72293a6c9846de57bb7e136560ae59","amp;dn":"Anzacs+WW1+Miniseries+%5B1985%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6badec836b72293a6c9846de57bb7e136560ae59","infoHashBuffer":{"type":"Buffer","data":[107,173,236,131,107,114,41,58,108,152,70,222,87,187,126,19,101,96,174,89]},"announce":[],"urlList":[]}}