{"title":"Afgantsy: The Russians in Afghanistan 1979-89 -Braithwaite PDF [","uid":9195296,"size":4486526,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6bb0395ba079572ca7aada9ace83bccd15999960&amp;dn=Afgantsy%3A+The+Russians+in+Afghanistan+1979-89+-Braithwaite+PDF+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"K-Slender","files":3,"time":1384479945,"description":"Publisher: Oxford University Press, USA (October 1, 2013)\nLanguage: English\nISBN-10: 0199322481\nISBN-13: 978-0199322480\n\nThe story of the Soviet occupation of Afghanistan is well known: the expansionist Communists overwhelmed a poor country as a means of reaching a warm-water port on the Persian Gulf. Afghan mujahideen upset their plans, holding on with little more than natural fighting skills, until CIA agents came to the rescue with American arms. Humiliated in battle, the Soviets hastily retreated. It is a great story-but it never happened.\n\n\nIn this brilliant, myth-busting account, Rodric Braithwaite, the former British ambassador to Moscow, challenges much of what we know about the Soviets in Afghanistan. He provides an inside look at this little-understood episode, using first-hand accounts and piercing analysis to show the war as it was fought and experienced by the Russians. The invasion was a defensive response to a chaotic situation in the Soviets' immediate neighbor. They intended to establish a stable, friendly government, secure the major towns, and train the police and armed forces before making a rapid exit. But the mission escalated, as did casualties. Braithwaite does not paint the occupation as a Russian triumph. To the contrary, he illustrates the searing effect of the brutal conflict on soldiers, their families, and the broader public, as returning veterans struggled to regain their footing back home.\n\nNow available in paperback, Braithwaite carries readers through these complex and momentous events, capturing those violent and tragic days as no one has done before. ","torrent":{"xt":"urn:btih:6bb0395ba079572ca7aada9ace83bccd15999960","amp;dn":"Afgantsy%3A+The+Russians+in+Afghanistan+1979-89+-Braithwaite+PDF+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bb0395ba079572ca7aada9ace83bccd15999960","infoHashBuffer":{"type":"Buffer","data":[107,176,57,91,160,121,87,44,167,170,218,154,206,131,188,205,21,153,153,96]},"announce":[],"urlList":[]}}