{"title":"Jorge Cervantes - Marijuana Horticulture for Kindle","uid":9398455,"size":13446381,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ca00a1307ed945ee12cb6d6177aae9bc1baa933&amp;dn=Jorge+Cervantes+-+Marijuana+Horticulture+for+Kindle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"BurnProcess","files":-1,"time":1388023306,"description":"I spent a lot of time searching the web for a Kindle version of this book, and just recently found one that works.  Most had no seeders, and the ones that were available on file sharing sites were fake or corrupt.  So when I finally found one, I decided I had to do the kind thing and make sure it was available to other pirate stoners.  Enjoy.  I will seed for the next few weeks.  This file has been tested on the Kindle Fire.\n\nWith 512 full color pages and 1120 full color photographs and illustrations, Marijuana Horticulture: The Indoor/Outdoor Medical Grower's Bible is the most complete cultivation book available. The Fifth Edition of the former Indoor Marijuana Horticulture: The Indoor Bible was originally published in 1983, when it immediately became a best seller. More than 500,000 copies of the Indoor Bible are in print in Dutch, English, French, German and Spanish.\n\nNew greenhouse and outdoor growing chapters make this a book both indoor and outdoor growers will keep under thumb. The other 15 chapters (17 total) are all updated with the most current information, completely rewritten and significantly expanded. For example, Dr. John McPartland contributed an all new medical section - The books credits list more than 300 contributors and reads like a who's who in the world of cannabis cultivation.","torrent":{"xt":"urn:btih:6ca00a1307ed945ee12cb6d6177aae9bc1baa933","amp;dn":"Jorge+Cervantes+-+Marijuana+Horticulture+for+Kindle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ca00a1307ed945ee12cb6d6177aae9bc1baa933","infoHashBuffer":{"type":"Buffer","data":[108,160,10,19,7,237,148,94,225,44,182,214,23,122,174,155,193,186,169,51]},"announce":[],"urlList":[]}}