{"title":"Woven Hand - Blush Music (2003) [192]","uid":3648627,"size":98939303,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6d0227be10ff3ba9fce04d1997d746359d2e2eb3&amp;dn=Woven+Hand+-+Blush+Music+%282003%29+%5B192%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"epeb","files":10,"time":1175000926,"description":"David Eugene Edwards, enigmatic frontman and visionary for 16 Horsepower, began recording under the Woven Hand moniker while Horsepower was on hiatus in 2001. (The name &quot;Woven Hand&quot; refers to hands clasped in prayer; Edwards&amp;#039; Christianity ? he was raised the son of a traveling Nazarene preacher ? is a consistent, driving theme in his music.) Fans of 16HP will instantly recognize the same forces at work in Woven Hand ? e.g., incendiary gospel, hallowed folk and mordant tones infused with a high, dark theatricality worthy of Nick Cave. Edwards worked on the material at home in Denver, recording, producing, and playing on most of the album by himself. Later, he pulled in guitarist Steve Taylor (ex-16 Horsepower) to help flesh out the compositions. The self-titled project was initially released on the German label Glitterhouse; it was issued in the U.S. on Sounds Familyre in early 2003. Along with a parcel of Edwards originals the album includes a knee-buckling take on Bill Withers&amp;#039; &quot;Ain&amp;#039;t No Sunshine When She&amp;#039;s Gone.&quot; That same year, Edwards set to work on Blush Music, a set of compositions created for a modern dance company in Belgium. \n\n\nLargely made up of de-/re-constructed songs from the self-titled Woven Hand album, David Eugene Edwards creates a whole new (though similarly sinister) experience with Blush Music. Commissioned by the Belgian avant dance company Ultima Vez, Blush Music stretches out the previously released songs, adding interludes of incidental music and found-sound collages. The result is something similar to a film score that is best listened to all the way through in a single sitting. Edwards&amp;#039; cover of Bill Withers&amp;#039; &quot;Ain&amp;#039;t No Sunshine&quot; gets a reprise. This time menacing bird caws, distant voices, what sounds like a crackling fire, and a raga-like banjo make for a deeply affecting 14-minute mini-epic of psychedelic gospel-folk. The ultimate track, &quot;Story and Pictures&quot; (which also appeared on the first Woven Hand disc in different form), is maybe the best piece of music Edwards has ever recorded. Heartbreaking yet strangely uplifting, the song uses a simple piano figure, an acoustic guitar strum, and Edwards&amp;#039; haunted (or haunting) vocals to communicate a dark, almost mystical beauty. \n","torrent":{"xt":"urn:btih:6d0227be10ff3ba9fce04d1997d746359d2e2eb3","amp;dn":"Woven+Hand+-+Blush+Music+%282003%29+%5B192%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d0227be10ff3ba9fce04d1997d746359d2e2eb3","infoHashBuffer":{"type":"Buffer","data":[109,2,39,190,16,255,59,169,252,224,77,25,151,215,70,53,157,46,46,179]},"announce":[],"urlList":[]}}