{"title":"Pineapple Express","uid":4659063,"size":730806272,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6d1c3f59dfb67a5806dc1c4444e3a35f19f307c6&amp;dn=Pineapple+Express&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"imma_rocker","files":1,"time":1232313077,"description":"Dale Denton (Seth Rogen) is a 25-year-old process server who, in delivering a subpoena to drug lord Ted Jones (Gary Cole), witnesses Jones and a corrupt female police officer, Carol Brazier (Rosie Perez), commit murder. Dale panics and leaves a roach at the scene containing a rare strain of cannabis called Pineapple Express. Ted and Carol run outside to catch the witness, only to miss him. Ted picks up the roach and identifies it as the rare strain that he has only sold to one dealer. He sends his henchmen, Matheson (Craig Robinson) and Budlofsky (Kevin Corrigan), to the dealer, Red (Danny R. McBride), who discloses that he has only sold this cannabis to Dale's dealer, Saul Silver (James Franco).\n\nDale tells Saul what he saw because he anticipates that the roach will lead Ted to Saul. They flee Saul's apartment. Ted's henchmen persuade Saul's supplier, Red, to arrange a meeting between Red and Saul, but this fails because Dale and Saul spend the night in the woods. Matheson and Budlofsky learn Dale's identity through Red.\n\nDale and Saul sleep 18 hours after getting stoned, so they visit Red after the agreed upon time. They hope that talking with Red in person will help them determine that Ted has not linked them, and is not in pursuit of them. Instead, Dale determines that Red intends to reveal their whereabouts to Ted, and the three fight. Convinced that Ted's men are pursuing them, they decide that they must leave the city. Dale goes to his girlfriend Angie's (Amber Heard) house to warn her and her parents, but Angie's dad doesn't believe him. Instead, he threatens to shoot Dale. Matheson and Budlofsky pursue Dale and Saul to Angie's house, and her family goes into hiding.\n\nTo leave town Dale and Saul sell some of Saul's Pineapple Express to raise bus fare. They get money after offering weed to a couple middle school kids, who gladly smoke the weed with Dale and Saul. A police officer catches Dale torching a joint and arrests him. Handcuffed in the back of a squad car, Dale manages to convince the arresting officer that Officer Brazier is corrupt. Saul 'saves' Dale by gaining control of the squad car, and drives away with Dale handcuffed in the back seat. Officer Brazier hears a police radio call of Dale's arrest for battering a police car, and pursues Dale and Saul in a high speed chase, but Dale and Saul evade her.\n\nDale and Saul argue about the mess they've found themselves in, resulting in Dale telling Saul that they aren't friends and never were, much to Saul's surprise. They then split up and continue on their own, despite how miserable they later become. Saul visits his grandmother in an assisted living home and finds Budlofsky and Matheson looking for him. They kidnap Saul and take him to Ted's lair, a barn and underground pot grow house which used to be an old Army base. Dale enlists Red to help him rescue Saul from Ted, but Red backs out at the last minute and Dale is captured.\n\nWhile Dale and Saul are captive, they make up and Dale admits that Saul really is his friend but was reluctant to admit that earlier. A rival Asian drug gang then attacks the barn in revenge for Ted and Carol killing the fellow gang member that Dale witnessed. Dale and Saul free themselves, and Dale fights with Ted and Saul fights with Carol. Matheson kills Budlofsky for refusing to kill Saul when he had the chance. When Matheson is about to kill Saul, Red returns and saves Saul, while killing Matheson with his car. A rival gang member sets off a bomb that destroys the barn, and kills Ted and Carol. Dale carries an unconscious Saul out of the burning barn, and Red crawls from the wreckage.\n\nSaul, Dale, and Red go to a diner for breakfast, reminisce about the events and bond, before Saul's grandmother takes them to the hospital.\n\n\n\n\n\n\n\n\nVERY FUNNY MOVIE\n\nPlease keep it seeded to keep it funny","torrent":{"xt":"urn:btih:6d1c3f59dfb67a5806dc1c4444e3a35f19f307c6","amp;dn":"Pineapple+Express","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d1c3f59dfb67a5806dc1c4444e3a35f19f307c6","infoHashBuffer":{"type":"Buffer","data":[109,28,63,89,223,182,122,88,6,220,28,68,68,227,163,95,25,243,7,198]},"announce":[],"urlList":[]}}