{"title":"Guacamelee! Gold Edition-3DM","uid":8794978,"size":596054219,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6d80436a5ea9dd94d2626fcc46383268833dfd75&amp;dn=Guacamelee%21+Gold+Edition-3DM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"AN0NYMOUS142857","files":1,"time":1376006787,"description":"\nGuacamelee! Gold Edition is a Metroid-vania style action-platformer set in a magical Mexican inspired world. The game draws its inspiration from traditional Mexican culture and folklore, and features many interesting and unique characters.\n\nGuacamelee! builds upon the classic open-world Metroid-vania style of games, by adding a strong melee combat component, a new dimension switching mechanic, and cooperative same-screen multiplayer for the entire story. The game also blurs the boundaries between combat and platforming by making many of the moves useful and necessary for both of these.\n\nTravel through a mystical and mysterious Mexican world as a Luchador using the power of your two fists to battle evil. Uncover hidden wrestling techniques like the Rooster Uppercut, and Dimension Swap to open new areas and secrets.\nKey Features\nUse combat moves for both fighting enemies and platforming challenges\nSwap between multiple overlapping dimensions (World of the Living and the World of the Dead)\n&quot;El Infierno&quot; level expansion. Brave the fires of El Infierno and prove yourself in a series of challenges to unlock powerful new costumes for Juan and Tostada\nPlayer costumes! Swap costumes to change the attributes of your Hero, and obtain new achievements\nSteam Achievements, Leaderboards, Cloud Save, and Big Picture Mode\nTrading Cards\nCreate new custom costumes and share these with others via Steam Workshop\nDrop in/out 2-Player local Co-operative play for the entire story\nChickens. Lots and lots of Chickens.\n\nInstructions:\n\n1. Extract with 7zip\n2. Play\n\n\nAs always add steam_api.dll in your whitelist of your antivirus if you have any problems with this.","torrent":{"xt":"urn:btih:6d80436a5ea9dd94d2626fcc46383268833dfd75","amp;dn":"Guacamelee%21+Gold+Edition-3DM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d80436a5ea9dd94d2626fcc46383268833dfd75","infoHashBuffer":{"type":"Buffer","data":[109,128,67,106,94,169,221,148,210,98,111,204,70,56,50,104,131,61,253,117]},"announce":[],"urlList":[]}}