{"title":"BBE Sonic Maximizer plugin, Windows DirectX VST, Mac VST  . iso","uid":4166062,"size":45268992,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6da2db4b2832cb44c8f97531add3f487d16d7a50&amp;dn=BBE+Sonic+Maximizer+plugin%2C+Windows+DirectX+VST%2C+Mac+VST++.+iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"hypster","files":1,"time":1209618471,"description":"People, this is my first torrent..let me know if you have any problems\n\nnote: this is not the new D82 plugin\n\n\nBased on the 4th generation 882i analog unit.\n\nThe BBE Sonic Maximizer Plug-In is a new software version of BBE&amp;#039;s award-winning Sonic Maximizer that features revised code to support more platforms including Mac, PC VST, and Direct X. The Sonic Maximizer Plug-In allows unlimited user-definable presets, realtime preset changes, and full MIDI implementation. It&amp;#039;s like having a rack full of the 882i units at your command for processing multiple tracks. The Sonic Maximzeer Plug-In can add brilliance, depth, detail, and definition to your music in many PC audio software applications that accept Direct X plug-ins, from multi-track recording to sampling to remixing.\n\nThe BBE Process &quot;What it Is&quot;\n\nLoudspeakers have difficulty working with the electronic signals supplied by an amplifier. These difficulties cause such major phase and amplitude distortion that the sound reproduced by the speaker differs significantly from the sound produced by the original source.\nIn the past, these problems proved unsolvable and were thus relegated to a position of secondary importance in audio system design. However, phase and amplitude integrity is essential to accurate sound reproduction. Research shows that the information which the listener translates into the recognizable characteristics of a live performance are intimately tied into complex time and amplitude relationships between the fundamental and harmonic components of a given musical note or sound. These relationships define a sound&amp;#039;s sound .\nWhen these complex relationships pass through a speaker, the proper order is lost. The higher frequencies are delayed. A lower frequency may reach the listener&amp;#039;s ear first or perhaps simultaneously with that of a higher frequency. In some cases, the fundamental components may be so time-shifted that they reach the listener&amp;#039;s ear ahead of some or all of the harmonic components.\nThis change in the phase and amplitude relationship on the harmonic and fundamental frequencies is technically called envelope distortion. The listener perceives this loss of sound integrity in the reproduced sound as muddy and smeared. In the extreme, it can become difficult to tell the difference between musical instruments, for example, an oboe and a clarinet.\nBBE Sound, Inc. conducted extensive studies of numerous speaker systems over a ten year period. With this knowledge, it became possible to identify the characteristics of an ideal speaker and to distill the corrections necessary to return the fundamental and harmonic frequency structures to their correct order. While there are differences among various speaker designs in the magnitude of their correction, the overall pattern of correction needed is remarkably consistent.\nThe BBE Process is so unique that 42 patents have been awarded by the U.S. Patent Office.\n\n******\n\nNow VST and Direct X users don&amp;#039;t have to take signal out of the digital domain to get that same amazingly fresh, punchy and detailed sound that only BBE High Definition Sound processing offers. The BBE Sonic Maximizer plug-in features the BBE 4th Generation Processing Engine -- just like analog BBE 482 and 882 Sonic Maximizer processors.\n\nThe BBE Sonic Maximizer Plug-In Works with Many Host Applications\nThe BBE Sonic Maximizer plug-in will add brilliance, depth, detail and definition to your music in many PC and Mac audio software applications that accept Direct X and VST plug-ins, from multi-track recording to sampling to remixing.\n\nThe BBE Sonic Maximizer plug-in works superbly with these and other host applications:\n\nSteinberg Cubase, VST and SL\n\nBias Peak\n\nSonic Foundry Sound Forge, Sound Forge XP, Acid and CD Architect\n\nSyntrillium Cool Edit Pro\n\nCakewalk SONAR, Cakewalk Pro Audio, Cakewalk Home Studio, Cakewalk Guitar Studio, Cakewalk Guitar Tracks, Cakewalk Club Tracks, Cakewalk Professional, Pyro, and Cakewalk Express\n\nBBE&amp;#039;s Best Sonic Quality with Plug-In Convenience\nOwning the Sonic Maximizer Plug-in is the equivalent of having a rack full of BBE 882i units with automation, just the thing for processing multiple tracks simultaneously. The most important thing in developing the Sonic Maximizer algorithm was to accurately capture the quality of our fourth generation Sonic Maximizer processor featured in our 482i and 882i products.\n\nThe most encouraging comment BBE hears from users is that the Sonic Maximizer plug-in is true to the rack mount 482i and 882i units they&amp;#039;ve come to depend on, retaining all of the warmth, punch and clarity that our analogue processors are renowned for.\n\nAbout BBE\nBBE Sound, Inc., manufactures professional signal processing equipment used by the broadcast, recording, concert sound and public address industries and is a leading licensor of audio enhancement technologies to the consumer electronics industry. BBE High Definition Sound has been used in premium products from the world&amp;#039;s most respected electronics manufacturers since 1988 and today virtually all manufacturers are offering products featuring the BBE trademark and technology.\nTechnical Info\nWindows Minimum Requirements\nIntel-based PC or compatible (486 or higher)\n\n4 MB of free hard-disk space\n\n16 MB of RAM\n\n256 color VGA video or better\n\nWindows 9.x, ME, 2000\n\nHost application that supports DirectX plugins\n\nMacintosh Minimum Requirements\nPower Mac based 604e Processor, G3, or G4\n\n120 MHz processor 64 MB RAM\n\nMac OS 8.5\n\n4 MB Hard drive space\n\nVST 2 compliant host application\n\nINTEL MAC COMPATIBILITY:\nThe BBE SONIC MAXIMIZER PLUGIN does not currently\nsupport INTEL MACS of any kind. A new version will address this sometime in\n2008.","torrent":{"xt":"urn:btih:6da2db4b2832cb44c8f97531add3f487d16d7a50","amp;dn":"BBE+Sonic+Maximizer+plugin%2C+Windows+DirectX+VST%2C+Mac+VST++.+iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6da2db4b2832cb44c8f97531add3f487d16d7a50","infoHashBuffer":{"type":"Buffer","data":[109,162,219,75,40,50,203,68,200,249,117,49,173,211,244,135,209,109,122,80]},"announce":[],"urlList":[]}}