{"title":"David Foster Wallace - The Broom of the System","uid":15223708,"size":566517532,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6e2292d14a9c5aad689e404f16a771777150adb3&amp;dn=David+Foster+Wallace+-+The+Broom+of+the+System&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Cybotage","files":203,"time":1467754090,"description":"The &quot;dazzling, exhilarating&quot; (San Francisco Chronicle) debut novel from the best-selling author of Infinite Jest, available for the first time as an audiobook.\r\n\r\nAt the center of The Broom of the System is the betwitching (and also bewildered) heroine, Lenore Stonecipher Beadsman. The year is 1990 and the place is a slightly altered Cleveland, Ohio, which sits on the edge of a suburban wasteland-the Great Ohio Desert. Lenore works as a switchboard attendant at a publishing firm, and in addition to her mind-numbing job, she has a few other problems. Her great-grandmother, a one-time student of Wittgenstein, has disappeared with twenty-five other inmates of the Shaker Heights Nursing Home. Her beau (and boss), editor-in-chief Rick Vigorous, is insanely jealous. And her cockatiel, Vlad the Impaler, has suddenly started spouting a mixture of psychobabble, Auden, and the King James Bible, which may propel him to stardom on a Christian fundamentalist television program.\r\n\r\nFiercely intelligent and entertaining, this debut novel from one of the most innovative writers of our generation explores the paradoxes of language, storytelling, and reality.\r\n\r\nRead by Robert Petkoff\r\nFormat: MP3\r\nUnabridged","torrent":{"xt":"urn:btih:6e2292d14a9c5aad689e404f16a771777150adb3","amp;dn":"David+Foster+Wallace+-+The+Broom+of+the+System","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e2292d14a9c5aad689e404f16a771777150adb3","infoHashBuffer":{"type":"Buffer","data":[110,34,146,209,74,156,90,173,104,158,64,79,22,167,113,119,113,80,173,179]},"announce":[],"urlList":[]}}