{"title":"Misbehaving: The Making of Behavioral Economics","uid":12578662,"size":1182627886,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6efb22fbfadff4f58e00368c5b2e129f1106908c&amp;dn=Misbehaving%3A+The+Making+of+Behavioral+Economics&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"oinky222","files":172,"time":1444930310,"description":"Get ready to change the way you think about economics.\r\n\r\nRichard H. Thaler has spent his career studying the radical notion that the central agents in the economy are humans?predictable, error-prone individuals. Misbehaving is his arresting, frequently hilarious account of the struggle to bring an academic discipline back down to earth?and change the way we think about economics, ourselves, and our world.\r\n\r\nTraditional economics assumes rational actors. Early in his research, Thaler realized these Spock-like automatons were nothing like real people. Whether buying a clock radio, selling basketball tickets, or applying for a mortgage, we all succumb to biases and make decisions that deviate from the standards of rationality assumed by economists. In other words, we misbehave. More importantly, our misbehavior has serious consequences. Dismissed at first by economists as an amusing sideshow, the study of human miscalculations and their effects on markets now drives efforts to make better decisions in our lives, our businesses, and our governments.\r\n\r\nCoupling recent discoveries in human psychology with a practical understanding of incentives and market behavior, Thaler enlightens listeners about how to make smarter decisions in an increasingly mystifying world. He reveals how behavioral economic analysis opens up new ways to look at everything from household finance to assigning faculty offices in a new building, to TV game shows, the NFL draft, and businesses like Uber.\r\n\r\nLaced with antic stories of Thaler’s spirited battles with the bastions of traditional economic thinking, Misbehaving is a singular look into profound human foibles. When economics meets psychology, the implications for individuals, managers, and policy makers are both profound and entertaining","torrent":{"xt":"urn:btih:6efb22fbfadff4f58e00368c5b2e129f1106908c","amp;dn":"Misbehaving%3A+The+Making+of+Behavioral+Economics","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6efb22fbfadff4f58e00368c5b2e129f1106908c","infoHashBuffer":{"type":"Buffer","data":[110,251,34,251,250,223,244,245,142,0,54,140,91,46,18,159,17,6,144,140]},"announce":[],"urlList":[]}}