{"title":"Raindance Writers' Lab : Write + Sell the Hot Screenplay","uid":8989323,"size":1347618,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f7c43c4f44711154696a190a312bd1f59a23a45&amp;dn=Raindance+Writers%27+Lab+%3A+Write+%2B+Sell+the+Hot+Screenplay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1380750718,"description":"If you're looking for a straightforward, practical, no-nonsense guide to scriptwriting that will hold your hand right the way through the process, read on! The Raindance Writers' Lab guides you through the tools that enable you to execute a strong treatment for a feature and be well on the way to the first draft of your script.\n\nWritten by the creator of the Raindance Film Festival himself, Elliot Grove uses a hands-on approach to screenwriting based on his many years of experience teaching the subject for Raindance training. He uses step-by-step processes illustrated with diagrams and charts to lend a visual structure to the teaching. Techniques are related to real-life examples throughout, from low budget to blockbuster films.\n\nThe Companion Website contains interviews with British writers and directors as well as a handy series of legal contracts, video clips and writing exercises.\n\nIn this brand new 2nd edition, Grove expands on his story structure theory, as well as how to write for the internet and short films.\n\nThe website also contains sample scripts and legal contracts, a writing exercise illustrated with a video clip, a folder full of useful hyperlinks for research, and a demo version of Final Draft screenwriting software.","torrent":{"xt":"urn:btih:6f7c43c4f44711154696a190a312bd1f59a23a45","amp;dn":"Raindance+Writers%27+Lab+%3A+Write+%2B+Sell+the+Hot+Screenplay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f7c43c4f44711154696a190a312bd1f59a23a45","infoHashBuffer":{"type":"Buffer","data":[111,124,67,196,244,71,17,21,70,150,161,144,163,18,189,31,89,162,58,69]},"announce":[],"urlList":[]}}