{"title":"Overcoming the Fear of Fear b","uid":10612633,"size":1847401,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6fb4bfa3c67779940662cf9fbd664251bc8b0c0e&amp;dn=Overcoming+the+Fear+of+Fear+b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1406059215,"description":"Overcoming the Fear of Fear by Sherry Stewart, Margo Watt\nEnglish | 2009 | ISBN: 1572245581 | 216 pages | EPUB | 2 MB\n\nAnxiety isn't all in your head. When you feel nervous, symptoms such as chills, sweating, heart palpitations, and shaking can affect your whole body. If you worry that others notice these anxiety symptoms or fear that they could be harmful to your health, you may have anxiety sensitivity. Anxiety sensitivity is the fear of anxiety-related sensations, a condition that affects approximately 16 percent of the population. People with high anxiety sensitivity often fear these bodily sensations even more than the situation that caused their anxiety in the first place. This fear of fear can lead them to avoid activities that might trigger their symptoms, and can cause other mental and physical problems down the road.\n\nOvercoming the Fear of Fear provides you with all the tools you need to stop fearing your anxiety symptoms for good. You'll learn to use cognitive behavioral techniques that have been proven effective for people with anxiety sensitivity. These techniques can help you reduce your anxiety sensitivity, prevent recurrence of panic attacks, and start living without fear.\n","torrent":{"xt":"urn:btih:6fb4bfa3c67779940662cf9fbd664251bc8b0c0e","amp;dn":"Overcoming+the+Fear+of+Fear+b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fb4bfa3c67779940662cf9fbd664251bc8b0c0e","infoHashBuffer":{"type":"Buffer","data":[111,180,191,163,198,119,121,148,6,98,207,159,189,102,66,81,188,139,12,14]},"announce":[],"urlList":[]}}