{"title":"Marijuana As Medicine The Science Beyond The Controversy.pdf Goo","uid":8675025,"size":3810655,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7004b8ff3f2c9e33a16a2c9e629fbd5c52acfad0&amp;dn=Marijuana+As+Medicine+The+Science+Beyond+The+Controversy.pdf+Goo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1373571618,"description":"Format: pdf\nGenre: Alternative Medicine\nPrint Length: 199 pages\nRelease Date: 2001\n\nDescription:\n\nSome people suffer from chronic, debilitating disorders for which no conventional treatment brings relief. Can marijuana ease their symptoms? Would it be breaking the law to turn to marijuana as a medication?\n\nThere are few sources of objective, scientifically sound advice for people in this situation. Most books about marijuana and medicine attempt to promote the views of advocates or opponents. To fill the gap between these extremes, authors Alison Mack and Janet Joy have extracted critical findings from a recent Institute of Medicine study on this important issue, interpreting them for a general audience.\n\nMarijuana As Medicine? provides patients--as well as the people who care for them--with a foundation for making decisions about their own health care. This empowering volume examines several key points, including:\n\nWhether marijuana can relieve a variety of symptoms, including pain, muscle spasticity, nausea, and appetite loss.\nThe dangers of smoking marijuana, as well as the effects of its active chemical components on the immune system and on psychological health.\nThe potential use of marijuana-based medications on symptoms of AIDS, cancer, multiple sclerosis, and several other specific disorders, in comparison with existing treatments.\n\nMarijuana As Medicine introduces readers to the active compounds in marijuana. These include the principal ingredient in Marinol, a legal medication. The authors also discuss the prospects for developing other drugs derived from marijuana's active ingredients.\n\nIn addition to providing an up-to-date review of the science behind the medical marijuana debate, Mack and Joy also answer common questions about the legal status of marijuana, explaining the conflict between state and federal law regarding its medical use.\n\nIntended primarily as an aid to patients and caregivers, this book objectively presents critical information so that it can be used to make responsible health care decisions. Marijuana As Medicine? will also be a valuable resource for policymakers, health care providers, patient counselors, medical faculty and students--in short, anyone who wants to learn more about this important issue. ","torrent":{"xt":"urn:btih:7004b8ff3f2c9e33a16a2c9e629fbd5c52acfad0","amp;dn":"Marijuana+As+Medicine+The+Science+Beyond+The+Controversy.pdf+Goo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7004b8ff3f2c9e33a16a2c9e629fbd5c52acfad0","infoHashBuffer":{"type":"Buffer","data":[112,4,184,255,63,44,158,51,161,106,44,158,98,159,189,92,82,172,250,208]},"announce":[],"urlList":[]}}