{"title":"Jason Blaine-Make My Move (2008-Advance-VBR-Country)","uid":4166040,"size":56288420,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7032e244f7ecf915c4d8b1176ec23a3511f81baa&amp;dn=Jason+Blaine-Make+My+Move+%282008-Advance-VBR-Country%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Cheng","files":14,"time":1209616984,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51yKPl333WL._SS300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51yKPl333WL._SS300_.jpg&lt;/a&gt;\n\n-=Biography=-\n\nGrowing up in the small town of Pembroke ON, Canada, Jason&amp;#039;s house was always filled with the sound of modern country radio. Inspired by his father&amp;#039;s popular local band, Jason began playing guitar at age eight and a few short years later was performing regularly around the local area. \n\nAt sixteen, Jason formed and fronted a family band with his brother, father, and two local musicians. The group played many fairs &amp; festivals and opened shows locally for some of Canada&amp;#039;s top recording acts. Jason&amp;#039;s talent as a musician later allowed him to earn a living as a side-man for several years playing guitar for some of Canada&amp;#039;s best recording acts, including an appearance with Paul Brandt on the 2004 Canadian Country Music Awards show. \n\nToday, with five CMT videos to his credit and a solid foothold at Canadian radio, Jason Blaine is ready to embark on the next stage of his promising career. \n\nAfter winning Project Discovery 2002 (a CMT talent search) and the ensuing success of his debut single &quot;That&amp;#039;s What I Do&quot; (2003), which spent twelve weeks in the Top 20 on Canadian Country Radio charts, Jason spent the majority of his available time in Nashville further developing his craft as a writer co-writing with Canadian successes Deric Ruttan and Paul Brandt among others, and landing a song called &quot;I Still Do&quot; on Brandt&amp;#039;s latest record. \n\nNominated for the Best New Country Group or Solo Artist at the 2004 Canadian Radio Music Awards, as well as a CCMA nominations for Independent Single of the Year and Rising Star (2006), Jason is confident that the inroads made at radio with his debut single will continue to pay dividends. &quot;I feel like things are really starting to roll and it will go as far as the country music fans will take it&quot; says Blaine. \n\nMost recently, Jason has moved to Nashville, where he has signed his first publishing/production deal with Anchor Down Entertainment and New Millennium Music. He has just completed a new record with producers Phil O&amp;#039;Donnell (of Craig Morgan) and Noah Gordon, and the first radio single and CMT video, &quot;Rock In My Boot&quot; is flying up the charts in Canada.\n\n---------------------------\n\nJason Blaine - Make My Move\n\n\nRip Info\n--------\n\nArtist: Jason Blaine\nAlbum Title: Make My Move\nRecord Label: New Millennium Music/Anchor Down\nRip Date: 2008-04-26\nCatalog Number:\nGenre: Country\nYear: 2008\nSource: CD\nEncoder: LAME 3.97 -V2 --vbr-new\nQuality: 213 kbps avg / 44.1KHz / Joint Stereo\n\n\nTrack List\n----------\n\n01 Good Day To Get Gone                           3:58\n02 Rock In My Boot                                3:19\n03 Just A Memory                                  3:46\n04 If You Don&amp;#039;t Love Me                           3:45\n05 I Wanna Be That Man                            3:00\n06 My First Car                                   3:16\n07 Flirtin&amp;#039; With Me                               3:13\n08 Give It To Me                                  3:27\n09 Make My Move                                   3:51\n10 The Man I Am                                   3:25\n                                                --------\n                                                00:35:00\n                                                56.28 megs\n\nRip Notes\n---------\n\nNominated for the Best New Country Group or Solo Artist at the 2004 Canadian\nRadio Music Awards, and several CCMA nominations for Independent Single of the\nYear and Rising Star (2006 and 2007), the inroads made with his debut singles\ncontinue to pay dividends. &quot;I really think my career is starting to roll and it\nwill go as far as the country music will take it&quot; says Blaine. &quot;My music is all\nabout real people, in real situations; it&amp;#039;s just country music, and it&amp;#039;s real\nlife.&quot;\n\nHere&amp;#039;s a fact from his real life adventures. He&amp;#039;s the first artist to ever have\n2 Number 1 videos on CMT Canada as an independent artist.\n\nFuelled by the success of singles That&amp;#039;s What I Do, Heartache Like Mine, While\nWe Were Waiting and What I Can&amp;#039;t Forget (Top 10 CMT and Top 20 at radio\nnationally), Jason&amp;#039;s next logical move was to relocate to Music City, so in\nOctober of 2006 Jason made the move to Nashville where he immediately secured a\npublishing deal with New Millennium Music/Anchor Down Publishing and continues\nto write on a daily basis with some of finest writers Nashville has to offer. In\nmid-March of 2007, Jason entered the studio with veteran producers Phil\nO&amp;#039;Donnell (Craig Morgan) and Noah Gordon at the helm to record his sophomore\nrecord. This collaboration produced immediate results spawning TWO Top 5 singles\nand two #1 videos (Rock In My Boat and Flirtin&amp;#039; With Me) by the end of 2007.\n\nCurrently back in Nashville with wheels in motion for a new single and video in\nthe early spring of 2008 as well as the mid-May release of his new 24 months\nwill be a blur as he supports the market with a steady stream of live\nappearances, promotional tours and songs being played on CMT and country music\nradio stations across North America.\n","torrent":{"xt":"urn:btih:7032e244f7ecf915c4d8b1176ec23a3511f81baa","amp;dn":"Jason+Blaine-Make+My+Move+%282008-Advance-VBR-Country%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7032e244f7ecf915c4d8b1176ec23a3511f81baa","infoHashBuffer":{"type":"Buffer","data":[112,50,226,68,247,236,249,21,196,216,177,23,110,194,58,53,17,248,27,170]},"announce":[],"urlList":[]}}