{"title":"Minecraft 1.6.2 [Cracked] [Free] [Installer] [Multiplayer] [Mini","uid":8660377,"size":53397737,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:70e0bf38cedd0840f8038618c5475f30a3e3ccc4&amp;dn=Minecraft+1.6.2+%5BCracked%5D+%5BFree%5D+%5BInstaller%5D+%5BMultiplayer%5D+%5BMini&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"TagCraft","files":-1,"time":1373308017,"description":"TagCraftMCs official 1.6.2 minecraft launcher WITH REIS MINIMAP MOD\n\nWith 1.6.2 we have a new launcher, but its just as simple to as install and use.\n\n--Info on installing--\n- Download the torrent from here.\n- Run the installer that download.\n- Use the shortcut on the desktop to play.\n- *Optional* Go to the optionÎ“s menu and choose to allocate more ram.\n- Type in a desired user name and click Launch\n\nWe have a help section on the launcher if you get stuck with anything. You can also ask on our forums or here. Although you will get better support on the forums.\n\nIf you wish to play on our multiplayer server you will have to wait a little bit. The multiplayer is working but we have not yet updated to 1.6.1, we plan to do so by the start of this weekend so you guys can all ride those majestic steads together.\n\n--Info on playing our multiplayer server--\n- Click Multiplayer \n- Click on what server you want to play. *Note the first 2 are the same, just with a backup link and the MiniGames is only planned, not live or started yet)\n- Once connected you will need to register then login. If you are connecting for the first time and its telling you to just login, more than likely someone has already choose that username.\n- You can register with /register passwordhere (Example of this is /register minecraftwooo)\n- You can now login with /login thepasswordyoumade (Example would be /login minecraftwoo)\n\nEven though our launcher is not in any kind of official beta, it is fairly new and could not work correctly for you, If so, please go to our forums to tell us what the problem is so we can update it.\nThe launcher will tell you when itÎ“Ã‡Ã–s out of date and tell you where to go to update it.\nThe launcher has been tested on Vista, Windows 7 and Windows 8 using 32 and 64 bit Operating system.\n\nCurrently, our new launcher only supports windows and unix systems. In the future we plan to also release a less flashy standalone .jar version for those people. (Sorry to any mac users, although this is in the windows section).\nAlso at the launchers current capabilities, it can only play 1.6.1, we do plan to allow multi version and auto updating in the future. We were just a little short on time to add everything we wanted.\n\nYou will need .net 4.0 to run this, most modern PC's have this, if the installer tells you that you don't, please download it from here: http://www.microsoft.com/en-au/download/details.aspx?id=17851\n\nIf you want anymore help or info you can not see here, feel free to visit our forums at http://www.tagcraftmc.com/forum We hope you enjoy the launcher, and like always if you like the game support the devs at mojang and grab your self a copy.\nAlso check out our event on the forums that is running until 15th of July 2013, win premium MC accounts, games and more.\n\nEnjoy!\t","torrent":{"xt":"urn:btih:70e0bf38cedd0840f8038618c5475f30a3e3ccc4","amp;dn":"Minecraft+1.6.2+%5BCracked%5D+%5BFree%5D+%5BInstaller%5D+%5BMultiplayer%5D+%5BMini","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70e0bf38cedd0840f8038618c5475f30a3e3ccc4","infoHashBuffer":{"type":"Buffer","data":[112,224,191,56,206,221,8,64,248,3,134,24,197,71,95,48,163,227,204,196]},"announce":[],"urlList":[]}}