{"title":"101 Social Media Tactics for Nonprofits (2012) Gooner","uid":13096765,"size":28997962,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7110078532c5d4e8238744bef0ed0815c8af5230&amp;dn=101+Social+Media+Tactics+for+Nonprofits+%282012%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1451137678,"description":"101 Social Media Tactics for Nonprofits - A Field Guide - 1st Edition (2012) (Pdf, Epub &amp; Mobi) Gooner\r\n\r\nPublisher: Wiley; 1 edition (February 7, 2012)\r\nLanguage: English\r\nISBN-10: 1118106245\r\nISBN-13: 978-1118106242\r\n\r\nThe ultimate social media field guide for nonprofits—with 101 ways to engage supporters, share your mission, and inspire action using the social web\r\n101 Social Media Tactics for Nonprofits features 101 actionable tactics that nonprofits can start using today, and most of the featured resources are free. Broken down into five key areas, this unique guide explains the steps and tools needed to implement each tactic, and provides many real-life examples of how nonprofits are using the tactics.\r\n\r\nWith this book as your guide, you'll learn how leading nonprofit professionals around the world are leveraging social media to engage constituents, communicate their cause, and deliver on their mission.\r\n\r\nPresents immediately useful ideas for relevant impact on your organization's social presence so you can engage with supporters in new and inventive ways\r\nFeatures 101 beginner to intermediate-level tactics with real-life examples\r\nOffers a workable format to help nonprofits discover new ways of deploying their strategy\r\nIncludes nonprofit social media influencers from leading nonprofits around the world including National Wildlife Federation, March of Dimes, and The Humane Society\r\nNonprofits know they need to start engaging with supporters through social media channels. This field guide to social media tactics for nonprofits will feature 101 beginner to intermediate-level tactics with real-life examples to help nonprofits discover new ways of deploying their strategy and meeting their social media objectives","torrent":{"xt":"urn:btih:7110078532c5d4e8238744bef0ed0815c8af5230","amp;dn":"101+Social+Media+Tactics+for+Nonprofits+%282012%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7110078532c5d4e8238744bef0ed0815c8af5230","infoHashBuffer":{"type":"Buffer","data":[113,16,7,133,50,197,212,232,35,135,68,190,240,237,8,21,200,175,82,48]},"announce":[],"urlList":[]}}