{"title":"John Perkins - Confessions of an Economic Hit Man 2005","uid":15448523,"size":1669903,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:715bac48540160486495952262e83280f839067a&amp;dn=John+Perkins+-+Confessions+of+an+Economic+Hit+Man+2005&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1469919803,"description":"https://extraimago.com/images/2016/07/30/df2c77317a4265fd9ee42897495f0ae4-d.jpg\r\n\r\nJohn Perkins - Confessions of an Economic Hit Man 2005\r\n\r\nFrom the author of the phenomenal New York Times bestseller, Confessions of an Economic Hit Man, comes an exposé of international corruption, and an inspired plan to turn the tide for future generations\r\n\r\nWith a presidential election around the corner, questions of America's military buildup, environmental impact, and foreign policy are on everyone's mind. Former Economic Hit Man John Perkins goes behind the scenes of the current geopolitical crisis and offers bold solutions to our most pressing problems. Drawing on interviews with other EHMs, jackals, CIA operatives, reporters, businessmen, and activists, Perkins reveals the secret history of events that have created the current American Empire, including:\r\n \r\nHow the defeats in Vietnam and Iraq have benefited big business\r\nThe role of Israel as Fortress America in the Middle East\r\nTragic repercussions of the IMF's Asian Economic Collapse\r\nThe current Latin American revolution and its lessons for democracy\r\nU.S. blunders in Tibet, Congo, Lebanon, and Venezuela\r\n\r\nFrom the U.S. military in Iraq to infrastructure development in Indonesia, from Peace Corps volunteers in Africa to jackals in Venezuela, Perkins exposes a conspiracy of corruption that has fueled instability and anti-Americanism around the globe, with consequences reflected in our daily headlines. Having raised the alarm, Perkins passionately addresses how Americans can work to create a more peaceful and stable world for future generations","torrent":{"xt":"urn:btih:715bac48540160486495952262e83280f839067a","amp;dn":"John+Perkins+-+Confessions+of+an+Economic+Hit+Man+2005","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"715bac48540160486495952262e83280f839067a","infoHashBuffer":{"type":"Buffer","data":[113,91,172,72,84,1,96,72,100,149,149,34,98,232,50,128,248,57,6,122]},"announce":[],"urlList":[]}}