{"title":"Airplane II 2 The Sequel(DVD RIP)","uid":4333434,"size":716100786,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:717a1757bd4b26f62bd728849857d7a3fb969707&amp;dn=Airplane+II+2+The+Sequel%28DVD+RIP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"Shadymedia","files":1,"time":1218176124,"description":"Airplane II: The Sequel (also known as Flying High II: The Sequel) is an American comedy sequel to the 1980 film Airplane! First released on December 10, 1982, the film was written and directed by Ken Finkleman and stars Robert Hays, Julie Hagerty, Lloyd Bridges, Chad Everett, William Shatner, Rip Torn, and Sonny Bono. It is the second of the Airplane! Films.\n\nPlot:\nAirplane spoofs airline disaster stories, such as Zero Hour! and Airport. In the sequel, however, the plot combines elements of the science fiction film genre, drawing specifically from 2001: A Space Odyssey. Airplane II also makes light of the wave of aircraft hijackings that had occurred in the late 1970s and early 1980s.\n\nSome of Airplane!&amp;#039;s original cast members play different characters in the sequel, the most noticeable being Stephen Stucker&amp;#039;s &quot;Jacobs&quot; character (in the original, he was known as &quot;Johnny Hinshaw&quot;). In addition, Frank Ashmore, who played flight navigator Victor Basta in the original, has a small role as a Houston air traffic controller while Craig Berenson, who was played by Paul Carey (the airline employee sent to pick up Rex Kramer) in the original, has a role as a passenger who shaves in the shuttle&amp;#039;s restroom as it descends...And More Just download it\n\nGreat RIP Clasic Movie Make sure to download the first one I uploaded that one aswell\n\nENJOY!!","torrent":{"xt":"urn:btih:717a1757bd4b26f62bd728849857d7a3fb969707","amp;dn":"Airplane+II+2+The+Sequel%28DVD+RIP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"717a1757bd4b26f62bd728849857d7a3fb969707","infoHashBuffer":{"type":"Buffer","data":[113,122,23,87,189,75,38,246,43,215,40,132,152,87,215,163,251,150,151,7]},"announce":[],"urlList":[]}}