{"title":"Locked Up (Vis a Vis) S01 - WebRip - Hardcoded Eng Subs - Sno","uid":14789856,"size":6203728214,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:718582243e0f4bc9401d92826eac000a4a1b320d&amp;dn=Locked+Up+%28Vis+a+Vis%29+S01+-+WebRip+-+Hardcoded+Eng+Subs+-+Sno&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"Snowhiter","files":18,"time":1465049086,"description":"Locked Up (Vis a Vis) S01 - WebRip - Hardcoded Eng Subs - Sno\r\n\r\nSpanish drama series set in a women's prison, starring Maggie Civantos as Macarena Ferreiro, who is framed by her lover and boss for corporate fraud. Still in denial about her crime, she lies to her parents and tells them she has gone away on a sailing trip, but ends up in the high-security Cruz del Sur jail, surrounded by ruthless criminals. When her only friend and cellmate Yolanda is brutally killed by the prison's self-appointed queen bee, Macarena's life is destined to change forever.\r\n\r\n1/16. Unable to cope with prison life, Macarena is taken under the wing of her cellmate Yolanda\r\n\r\n2/16. Macarena is caught with a package of drugs and is tricked into revealing who owned them.\r\n\r\n3/16. Macarena's confrontation with self-appointed prison queen bee Zulema endangers her family.\r\n\r\n4/16. After threats from Macarena's father Leopoldo, her ex-lover runs away with the fraud money.\r\n\r\n5/16. Macarena gets a new cellmate, and her brother Roman is kidnapped by Zulema's boyfriend.\r\n\r\n6/16. The police take Macarena to the forest to find the missing money, but they're not alone.\r\n\r\n7/16. Macarena is now happy with her pregnancy. Zulema is worried about her boyfriend's silence.\r\n\r\n8/16. Zulema's boyfriend steals photos of the stolen loot's location from Macarena's family home.\r\n\r\n9/16. Macarena is caught smuggling drugs and ends up in debt, while Zulema prepares to escape.\r\n\r\n10/16. A DNA test could help prove Macarena's innocence but the doctor refuses to perform one.\r\n\r\n11/16. Zulema's escape plot is scuppered at the last moment when Leopoldo captures her boyfriend.\r\n\r\n12/16. Roman admits everything to his mother. Macarena is in big trouble with the other inmates.\r\n\r\n13/16. Zulema poisons and kidnaps Macarena and demands that Leopoldo must release her boyfriend.\r\n\r\n14/16. Macarena's family now has the stolen money but Zulema's boyfriend is gunning for them.\r\n\r\n15/16. The DNA samples taken at the time of Macarena's miscarriage prove that her ex was lying.\r\n\r\n16/16. Macarena's about to attend a hearing when she stumbles on Zulema's latest bid for freedom. \r\n\r\nVideo 852 x 480 / 29.97 fps / 950 kbps (Approx) / Mp4\r\n\r\nAudio 128 kbps AAC\r\n\r\nDuration 0:48 (Approx)\r\n\r\nSeed to the Max - muchas gracias . . .\r\n\r\nI seed all of my torrents to a ratio of 150:1 - after that its your responsibility to keep them alive. Please seed . . .\r\n\r\n-----------------------------------------------------------------------------------------------------\r\n\r\nRipped / Encoded / Uploaded by Snowhiter\r\n\r\n-----------------------------------------------------------------------------------------------------\r\n\r\nAny Bitcoin Donations - no matter how small Welcome here : 164BRZMwZZHmBHS7WLU2s4ZB3geRZZuV3b","torrent":{"xt":"urn:btih:718582243e0f4bc9401d92826eac000a4a1b320d","amp;dn":"Locked+Up+%28Vis+a+Vis%29+S01+-+WebRip+-+Hardcoded+Eng+Subs+-+Sno","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"718582243e0f4bc9401d92826eac000a4a1b320d","infoHashBuffer":{"type":"Buffer","data":[113,133,130,36,62,15,75,201,64,29,146,130,110,172,0,10,74,27,50,13]},"announce":[],"urlList":[]}}