{"title":"Unsolved Mysteries Disc 14","uid":5970733,"size":4519956745,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:71e3bfe04703755872dfe74e02c811c2d2943ca2&amp;dn=Unsolved+Mysteries+Disc+14&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"slasherman","files":-1,"time":1290270794,"description":" &lt;a href=&quot;http://i33.photobucket.com/albums/d54/slasherman1971/dask/PDVD_000-4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://i33.photobucket.com/albums/d54/slasherman1971/dask/PDVD_000-4.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i33.photobucket.com/albums/d54/slasherman1971/dask/PDVD_002-5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i33.photobucket.com/albums/d54/slasherman1971/dask/PDVD_002-5.jpg&lt;/a&gt;\n\n\nOnly murder, wanted and unexplained deaths..real crime stuff.\nThe quality is very poor. Old vhs tapes which has been compressed into small file size. Typical vhs noise on most.\n\nTime: About 6 hours\n\nHow to burn:\nI have chosen .iso file.\nIf you use ImgBurn: WRITE IMAGE FILE TO DISC\nI tested it at 6x write speed and it worked perfectly...\nRemember to keep the .iso file on your pc so you can seed.\n\nDisc 14\n- Jacqueline Dowaliby - Young girl is murdered and her adopted father was convicted of the crime. Later exonerated. Looking for her killer.\n- Lyle Moody is wanted for shooting and injuring two cops. He's on the run.\n- Unidentified man in coma - Was involved in an accident. Police are trying to find his family and his identity.\n- Lawrence Harding Jr. was abducted as an infant. His brother is searching for him.\n- Special Alert: Tyrone Thiess is wanted for a triple murder.\n- Special Alert: Shannon Smith is wanted for the rape of underage girls.\n- Wallace Thrasher is an international drug runner. His wife claims he died in a plane crash but authorities think he is still alive.\n- Kelly Finnigan is a conwoman wanted for robbing men with her &quot;red wine con&quot;.\n- Randolph Dial is accused of breaking out of prison and kidnapping the Deputy Warden's wife. Police are searching for both of them.\n- Neal &amp; Terri Gott are being sought by police for drug dealing.\n- Robert Leeds is wanted for art theft. RS profiles other famous works of art that have been stolen.\n- &quot;Thumper&quot; - Outlaw biker is wanted for making meth labs.\n- Tina Resch claims to have telekinetic powers and that things move mysteriously when she's around.\n- Joseph Prushanowski - Jewish community leader who is wanted for international bank fraud.\n- John Grundhofer is abducted by an inept kidnapper. He later escapes and police are searching for his abductor.\n- Brian Brophill is wanted for narcotics smuggling and drug dealing.\n- Zip Gun Bomber has been sending bombs through the mail. One person has died and others wounded. Searching for who is responsible.\n- Mollie Jordan's house was set on fire, killing several of her grandchildren inside. Police are searching for the arsonist.\n- Noreen Renier is a psychic who is profiled.\n- Kay Beeman, prison guard, is wanted for helping two inmates escape one of whom she was romantically involved with.\n- Reverse Sting Operation - Authorities work to bust several individuals accused of bribing police officers.\n- Final Appeal: Bird Road Rapist. Luis Diaz was convicted of rapes that occurred in the Florida area but several people believe he is innocent.\n- McDonald's Shooting - Police are searching for Michael Anthony Star who they believed robbed a McDonalds in Virginia shooting and maming the asst. manager.\n- Coma victim &quot;John&quot; has been unresponsive for 7 months following being hit by a motorcycle while walking. They are looking for his identity and his family.\n- Psychic surgery - Gary Magnou is wanted for conning many people out of money with his phony surgery claims.\n- Clifford Sherwood was 9 years old when he went missing while on his way to school in 1954. Did he run away or meet with foul play?\n- Jim Fontes, police officer, is searching for his two sons whom his ex-wife abducted.\n- Lynn Amos is found barely alive in her burning bed. She later died. Was it a random act of violence or connected to her job?\n- Amy Bradley disappears while vacationing with her family on a cruise ship.\n- Carl &amp; Mary Denny are wanted for insurance fraud concerning a boat.\n- Kristi Lee is found dead in her apartment. Her in-laws are not cooperating with the investigation and are considered suspects.\n- Randal Utterback escaped from prison where he was being held for kidnapping his ex-girlfriend. He is on the run and police are searching for him.\n- Audrey Moate &amp; Thomas Houtard were lovers. Thomas was found near a lovers lane murdered but Audrey was gone and has never been seen since. Did she meet with foul play as well?\n- Seattle arsonist is blamed for a rash of extremely intense fires that have killed 1 firefighter and cost millions.\n- Jim Boomgarden keeps running into strangers who claim they know him. He recently found out he has a twin brother as well as a sister he is searching for.\n- Selena Edon was badly injured in a motorcycle accident leaving her with some confusion. She has since disappeared.\n\nVideo Attributes:\n  Video compression mode: MPEG-1\n  TV system: 525/60 (NTSC)\n  Aspect Ratio: 4:3\n  Source picture resolution: 352x240 (525/60)\n  Frame Rate: 30.00\n  Bitrate: 4.11Mbps\t\t\n\nIf you need more information or want to discuss the cases you can do it on this excellent forum http://www.sitcomsonline.com/boards/forumdisplay.php?f=322 \nSpecial thanks to crystaldawn who is a UM genius.\n","torrent":{"xt":"urn:btih:71e3bfe04703755872dfe74e02c811c2d2943ca2","amp;dn":"Unsolved+Mysteries+Disc+14","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71e3bfe04703755872dfe74e02c811c2d2943ca2","infoHashBuffer":{"type":"Buffer","data":[113,227,191,224,71,3,117,88,114,223,231,78,2,200,17,194,210,148,60,162]},"announce":[],"urlList":[]}}