{"title":"The History of Cartography Vol 1 - Cartography in Prehistoric, A","uid":8627499,"size":60442840,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71e4a9bdc96198f8a950e7d03e5fea68bb12a39b&amp;dn=The+History+of+Cartography+Vol+1+-+Cartography+in+Prehistoric%2C+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"STBGD","files":-1,"time":1372547708,"description":"656 pages / PDF / English / University Of Chicago Press / 1987\nISBN-10: 0226316335 / ISBN-13: 978-0226316338\n\ny developing the broadest and most inclusive definition of the term &quot;map&quot; ever adopted in the history of cartography, this inaugural volume of the History of Cartography series has helped redefine the way maps are studied and understood by scholars in a number of disciplines.\n\nVolume One addresses the prehistorical and historical mapping traditions of premodern Europe and the Mediterranean world. A substantial introductory essay surveys the historiography and theoretical development of the history of cartography and situates the work of the multi-volume series within this scholarly tradition. Cartographic themes include an emphasis on the spatial-cognitive abilities of Europe's prehistoric peoples and their transmission of cartographic concepts through media such as rock art; the emphasis on mensuration, land surveys, and architectural plans in the cartography of Ancient Egypt and the Near East; the emergence of both theoretical and practical cartographic knowledge in the Greco-Roman world; and the parallel existence of diverse mapping traditions (mappaemundi, portolan charts, local and regional cartography) in the Medieval period.\n\nThroughout the volume, a commitment to include cosmographical and celestial maps underscores the inclusive definition of &quot;map&quot; and sets the tone for the breadth of scholarship found in later volumes of the series.","torrent":{"xt":"urn:btih:71e4a9bdc96198f8a950e7d03e5fea68bb12a39b","amp;dn":"The+History+of+Cartography+Vol+1+-+Cartography+in+Prehistoric%2C+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71e4a9bdc96198f8a950e7d03e5fea68bb12a39b","infoHashBuffer":{"type":"Buffer","data":[113,228,169,189,201,97,152,248,169,80,231,208,62,95,234,104,187,18,163,155]},"announce":[],"urlList":[]}}