{"title":"The Politics of Design","uid":15611690,"size":18555452,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72076f423db5a1b6a60e416ed7ffe24ee0d639e4&amp;dn=The+Politics+of+Design&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":28,"uploader":"drone500","files":1,"time":1471790273,"description":"Many designs that appear in today’s society will circulate and encounter audiences of many different cultures and languages. With communication comes responsibility; are designers aware of the meaning and impact of their work? An image or symbol that is acceptable in one culture can be offensive or even harmful in the next. A typeface or colour in a design might appear to be neutral, but its meaning is always culturally dependent. If designers learn to be aware of global cultural contexts, we can avoid stereotyping and help improve mutual understanding between people.\r\n\r\nPolitics of Design is a collection of visual examples from around the world. Using ideas from anthropology and sociology, it creates surprising and educational insight in contemporary visual communication. The examples relate to the daily practice of both online and offline visual communication: typography, images, colour, symbols, and information.\r\n\r\nPolitics of Design shows the importance of visual literacy when communicating beyond borders and cultures. It explores the cultural meaning behind the symbols, maps, photography, typography, and colours that are used every day. It is a practical guide for design and communication professionals and students to create more effective and responsible visual communication.\r\n\r\n&quot;It’s the kind of literature that should be handed out to all students on their first days at art school, along with all the Albers, Berger, Benjamin, and Sontag that form the backbone of the design curriculum—an up-to-date assessment of the landscape through which all modern visual practitioners must navigate.&quot;\r\n- AIGA.com","torrent":{"xt":"urn:btih:72076f423db5a1b6a60e416ed7ffe24ee0d639e4","amp;dn":"The+Politics+of+Design","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72076f423db5a1b6a60e416ed7ffe24ee0d639e4","infoHashBuffer":{"type":"Buffer","data":[114,7,111,66,61,181,161,182,166,14,65,110,215,255,226,78,224,214,57,228]},"announce":[],"urlList":[]}}