{"title":"Crosstalk - Connie Willis [EN EPUB MOBI] [ebook] [p_s]","uid":15970682,"size":4269327,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7223e379b6ed3484cfdacd74ee1efc8567baa53f&amp;dn=Crosstalk+-+Connie+Willis+%5BEN+EPUB+MOBI%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"perfect_stan","files":3,"time":1475776123,"description":"Crosstalk by Connie Willis\r\nEnglish | 2016 | Science Fiction | 4.1 MB\r\n\r\n\r\nBriddey is about to get exactly what she thinks she wants…\r\nBriddey is a high-powered exec in the mobile phone industry, overseeing new products from concept (‘anything to beat the new apple phone’) to delivery. And she works with her wonderful partner, Trent. They’ve been together for six magical weeks, in a whirlwind of flowers, dinners, laughter and now comes the icing on the cake: not a weekend away or a proposal but something even better. An EDD. A procedure which will let them sense each other’s feelings. Trent doesn’t just want to tell her how much he loves her – he wants her to feel it. Everything is perfect. The trouble is, Briddey can’t breathe a word of it to anyone (difficult, when the whole office is guessing) until she’s had two minutes to call her family. And they’re hounding her about the latest family drama, but when they find out about the EDD – which they will – they’ll drop everything to interrogate her. And it might just be easier to have the procedure now and explain later. Only Apple are poised to deliver an amazing new product and she has to be one step ahead …if she can only persuade their tech genius, C. B., to drop his crazy ideas about a ‘privacy phone’ with its ‘do not disturb’ settings, and focus on what people really want: more efficient, instinctive and immediate ways to communicate. The race is on: not just for new, cutting-edge technology, but also for a shred of privacy in a public world and – for Briddey – a chance for love at the heart of it all.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:7223e379b6ed3484cfdacd74ee1efc8567baa53f","amp;dn":"Crosstalk+-+Connie+Willis+%5BEN+EPUB+MOBI%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7223e379b6ed3484cfdacd74ee1efc8567baa53f","infoHashBuffer":{"type":"Buffer","data":[114,35,227,121,182,237,52,132,207,218,205,116,238,30,252,133,103,186,165,63]},"announce":[],"urlList":[]}}