{"title":"The Blind Assassin (Audiobook) By Margaret Atwood","uid":8349208,"size":496074514,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:72bec9aa366d63f8f371d93b090156eb59266b58&amp;dn=The+Blind+Assassin+%28Audiobook%29+By+Margaret+Atwood&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Arazbr","files":212,"time":1365282662,"description":"For the past twenty-five years, Margaret Atwood has written works of striking originality and imagination. In The Blind Assassin, she stretches the limits of her accomplishment as never before, creating a novel that is both entertaining and profoundly serious.\n\n The novel opens with these simple resonant words: &quot;Ten days after the war ended, my sister Laura drove a car off a bridge.&quot; They are spoken by Iris, whose terse account of her sister's death in 1945 is followed by an inquest report proclaiming the death accidental. But just as you expect to settle into Laura's story, Atwood introduces a novel-within-a-novel. Entitled The Blind Assassin, it is a science fiction story told by two unnamed lovers who meet in dingy backstreet rooms. When you return to Iris, it is through a 1947 newspaper article announcing the discovery of a sailboat carrying the dead body of her husband, a distinguished industrialist.\n\n Told in a style that magnificently captures the colloquialisms of the 1930s and 1940s, The Blind Assassin is a richly layered and uniquely rewarding experience. The novel has many threads and a series of events that follow one another at a breathtaking pace. As everything comes together, you will discover that the story Atwood is telling is not only what it seems to be - but is, in fact, much more.\n","torrent":{"xt":"urn:btih:72bec9aa366d63f8f371d93b090156eb59266b58","amp;dn":"The+Blind+Assassin+%28Audiobook%29+By+Margaret+Atwood","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72bec9aa366d63f8f371d93b090156eb59266b58","infoHashBuffer":{"type":"Buffer","data":[114,190,201,170,54,109,99,248,243,113,217,59,9,1,86,235,89,38,107,88]},"announce":[],"urlList":[]}}