{"title":"Perspective as Symbolic Form by Erwin Panofsky (Art Ebook).pdf","uid":11403461,"size":5603128,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7369f6e9265d504e5954c9134894d434850d157d&amp;dn=Perspective+as+Symbolic+Form+by+Erwin+Panofsky+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"STBGD","files":-1,"time":1415405082,"description":"Pdf / English / 1993 / 196 pages / 5 MB\n\nErwin Panofsky's Perspective as Symbolic Form is one of the great works of modern intellectual history, the legendary text that has dominated all art historical and philosophical discussions on the topic of perspective in this century. Finally available in English, it is an unrivaled example of Panofsky's early method that placed him within broader developments in theories of knowledge and cultural change. Here, drawing on a massive body of learning that ranges over Antique philosophy, theology, science, and optics as well as the history of art, Panofsky produces a type of &quot;archaeology&quot; of Western representation that far surpasses the usual scope of art historical studies.Perspective in Panofsky's hands becomes a central component of a Western &quot;will to form,&quot; the expression of a schema linking the social, cognitive, psychological, and especially technical practices of a given culture into harmonious and integrated wholes. Yet the perceptual schema of each historical culture or epoch is different, and each gives rise to a different but equally full vision of the world. Panofsky articulates these different spatial systems, demonstrating their particular coherence and compatibility with the modes of knowledge, belief, and exchange that characterized the cultures in which they arose. Our own modernity, Panofsky shows, is characterized by its peculiarly mathematical expression of the concept of the infinite, within a space that is necessarily both continuous and homogeneous.\n\nPS. Below average scan but usable","torrent":{"xt":"urn:btih:7369f6e9265d504e5954c9134894d434850d157d","amp;dn":"Perspective+as+Symbolic+Form+by+Erwin+Panofsky+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7369f6e9265d504e5954c9134894d434850d157d","infoHashBuffer":{"type":"Buffer","data":[115,105,246,233,38,93,80,78,89,84,201,19,72,148,212,52,133,13,21,125]},"announce":[],"urlList":[]}}