{"title":"Lonely Planet - Discover Greece - 2nd Ed (2012).epub Gooner","uid":13641579,"size":136286678,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73a7408ae831bd9fe28597b61c4754154520030f&amp;dn=Lonely+Planet+-+Discover+Greece+-+2nd+Ed+%282012%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1456140737,"description":"Lonely Planet - Discover Greece (Travel Guide) - 2nd Edition (2012).epub Gooner\r\n\r\nPublisher: Lonely Planet; 2 edition (May 1, 2012)\r\nLanguage: English\r\nISBN-10: 1742202268\r\nISBN-13: 978-1742202266\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet Discover Greece is your passport to all the most relevant and up-to-date advice on what to see, what to skip, and what hidden discoveries await you. Take an early morning stroll up the flanks of the Acropolis, see the soaring pillars of rock at the Meteora, or catch the Santorini sunset; all with your trusted travel companion. Discover the best of Greece and begin your journey now!\r\n\r\nInside Lonely Planet Discover Greece:\r\n\r\n* Full-colour maps and images throughout\r\n\r\n* Highlights and itineraries show you the simplest way to tailor your trip to your own personal needs and interests\r\n\r\n* Insider tips save you time and money and help you get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - including hours of operation, phone numbers, websites, transit tips, and prices\r\n\r\n* Honest reviews for all budgets - including eating, sleeping, sight-seeing, going out, shopping, and hidden gems that most guidebooks miss\r\n\r\n* Cultural insights give you a richer and more rewarding travel experience - including customs, history, art, literature, music, architecture, politics, and cuisine\r\n\r\n* Free, convenient pull-out Athens map (included in print version), plus over 36 colour local maps\r\n\r\n* Useful features - including Walking Tours, Month-by-Month (annual festival calendar), and Family Travel\r\n\r\n* Coverage of Athens, Crete, Santorini, Mykonos, the Cyclades, Delphi, Meteora, Thessaloniki, the Peloponnese, Corfu, Kefallonia, Rhodes, the Dodecanese, Hania, Patmos, Knossos, and more\r\n\r\nThe Perfect Choice: Lonely Planet Discover Greece, our easy-to-use guide, is perfect for travellers who seek the most popular attractions a destination has to offer. Filled with inspiring and colourful photos, this guide focuses on the best of the best.\r\n\r\n* Looking for a comprehensive guide that recommends a wide range of experiences, both popular and offbeat, and extensively covers all the country has to offer? Check out Lonely Planet's Greece guide.\r\n\r\n* Looking for a guide for Athens? Check out Lonely Planet's Pocket Athens, a handy-sized guide focused on the can't-miss sights for a quick trip.\r\n\r\nAuthors: Written and researched by Lonely Planet, Korina Miller, Kate Armstrong, Alexis Averbuck, Michael Stamatios Clark, Chris Deliso, Des Hannigan, Victoria Kyriakopoulos, Andrea Schulte-Peevers, and Richard Waters.\r\n\r\nAbout Lonely Planet: Started in 1973, Lonely Planet has become the world's leading travel guide publisher with guidebooks to every destination on the planet, as well as an award-winning website, a suite of mobile and digital travel products, and a dedicated traveller community. Lonely Planet's mission is to enable curious travellers to experience the world and to truly get to the heart of the places they find themselves in","torrent":{"xt":"urn:btih:73a7408ae831bd9fe28597b61c4754154520030f","amp;dn":"Lonely+Planet+-+Discover+Greece+-+2nd+Ed+%282012%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73a7408ae831bd9fe28597b61c4754154520030f","infoHashBuffer":{"type":"Buffer","data":[115,167,64,138,232,49,189,159,226,133,151,182,28,71,84,21,69,32,3,15]},"announce":[],"urlList":[]}}