{"title":"Katha: Tell a Story, Sell a Dream by Shoba Narayan","uid":15573610,"size":597833,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:754abc7df2a2d1a96ecdb67e05e91847475e35ce&amp;dn=Katha%3A+Tell+a+Story%2C+Sell+a+Dream+by+Shoba+Narayan&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"steve-kon","files":4,"time":1471294935,"description":"Title: Katha: Tell a Story, Sell a Dream by Shoba Narayan\r\n\r\nFormat: EPUB, AZW3\r\n\r\n\r\nSome of the most successful people of our times are master storytellers. From Steve Jobs to N.R. Narayana Murthy, from Indra Nooyi to Rakesh Jhunjhunwala, the best communicators are those who effectively use stories, analogies, metaphors and even jokes to get their message across.\r\n\r\nMaybe you are an entrepreneur, trying to sell your business plan to potential investors. Maybe you are the head of a company, trying to influence your employees to follow a rather unconventional path. Or a mid-level manager, trying to convince your boss to take a chance on a project. No matter which field you are in, there comes a time when you have to persuade and influence and there's no better way to do it than by narrating stories. In fact, the modern designation of chief storytelling officer (CSO) - which is said to have begun at Nike in the nineties - is a growing trend in companies.\r\n\r\nKatha: Tell a Story, Sell a Dream is about the art of storytelling in business. It tells you why stories are important, when you must tell a story and how to find and tell the most effective tales, whether you are communicating to stakeholders, business associates, employees or colleagues.\r\n\r\nWritten in simple, lucid prose, Kathã will demonstrate why the art of storytelling is perhaps the number one skill and how the power of storytelling may well be the key to achieving your goals","torrent":{"xt":"urn:btih:754abc7df2a2d1a96ecdb67e05e91847475e35ce","amp;dn":"Katha%3A+Tell+a+Story%2C+Sell+a+Dream+by+Shoba+Narayan","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"754abc7df2a2d1a96ecdb67e05e91847475e35ce","infoHashBuffer":{"type":"Buffer","data":[117,74,188,125,242,162,209,169,110,205,182,126,5,233,24,71,71,94,53,206]},"announce":[],"urlList":[]}}