{"title":"[SoM]Piccolo grande uomo[DvdRip-DivX5-Ita-Mp3]","uid":4469597,"size":735961088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:757945c63dbfc2f07bd5876e67a7204471a959a7&amp;dn=%5BSoM%5DPiccolo+grande+uomo%5BDvdRip-DivX5-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"mitimex","files":1,"time":1225062590,"description":"Il film ÃƒÂ¨ narrato in prima persona dal vecchio Jack Crabb, che ha raggiunto la veneranda etÃƒÂ  di 121 anni, ad un giornalista interessato alla battaglia di Little Big Horn. Inizia la storia raccontando di essere stato l&amp;#039;unico sopravvissuto insieme alla sorella Carolina a un attacco indiano quando era bambino. I due orfani vengono trovati da un Cheyenne, di nome Ombra Silenziosa che li porta con sÃƒÂ¨ al villaggio. Carolina scappa di notte; rimasto solo Jack viene adottato dai Cheyenne ed entra nelle grazie del loro capo, Cotenna di Bisonte. A causa della sua bassa statura e del suo coraggio nella lotta viene chiamato &quot;Piccolo grande uomo&quot;. Dopo lo sterminio fatto dall&amp;#039;esercito a carico di donne e bambini, i Cheyenne scendono in guerra ma mentre combatte, Piccolo grande uomo, in chiara difficoltÃƒÂ , si mostra a un militare per quello che ÃƒÂ¨: un uomo bianco. Viene cosÃƒÂ¬ arruolato nell&amp;#039;esercito, ma visto che ÃƒÂ¨ cresciuto tra i &quot;selvaggi&quot;, si decide che debba essere educato. Viene preso in custodia da un sacerdote e da una signora, Louise Pendrake, che lo lava, lo accudisce e gli parla della morale; di lÃƒÂ¬ a poco perÃƒÂ² la scopre intenta a fare cose tutt&amp;#039;altro che morali e decide di andarsene. Incontra un ciarlatano, Merriweather, il quale ben presto lo mette nei pasticci: vengono circondati da una banda di giustizieri, capeggiati da quella che lui scopre essere sua sorella Carolina, la quale gli insegna a sparare. Durante il periodo da pistolero, incontra e fa amicizia con Wild Bill Hickock. In seguito diventa commerciante e sposa Olga, una ragazza svedese e durante il viaggio verso il West, la loro diligenza viene attaccata dagli Indiani, che rapiscono la moglie. Jack torna dai suoi indiani Cheyenne, ma per ritrovare Olga, si riarruola nell&amp;#039;esercito: non la trova perÃƒÂ² tra i bianchi, bensÃƒÂ¬ sposata con Orso Giovane, a cui un tempo aveva salvato la vita, ma non ha il coraggio di dirle nulla. Dopo un massacro compiuto dall&amp;#039;esercito su donne e bambini, Jack ÃƒÂ¨ deciso ad uccidere il Generale George Armstrong Custer, ma non ci riesce. Ritornato per strada si dÃƒÂ  all&amp;#039;alcool, assiste alla morte di Wild Bill Hickock e ritrova la signora Pendrake, che ora fa la prostituta in un bordello. Intanto la situazione con gli Indiani degenera e Custer ÃƒÂ¨ sempre piÃƒÂ¹ convinto di dover sterminare sia i Sioux che i Cheyenne a Little Big Horn: durante la battaglia Jack viene ferito, Custer impazzisce e lo scambia per il Presidente degli Stati Uniti (con cui non corre buon sangue) e, mentre sta per ucciderlo, viene colpito da Orso Giovane, che ricambia cosÃƒÂ¬ il debito con Piccolo grande uomo. Nelle scene finali Cotenna di Bisonte aspetta la sua fine e ringrazia il Creatore del mondo per aver fatto tutto questo; ma la morte non arriva e cosÃƒÂ¬, si allontana con il suo nipote adottivo Piccolo grande uomo sotto la pioggia battente.","torrent":{"xt":"urn:btih:757945c63dbfc2f07bd5876e67a7204471a959a7","amp;dn":"%5BSoM%5DPiccolo+grande+uomo%5BDvdRip-DivX5-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"757945c63dbfc2f07bd5876e67a7204471a959a7","infoHashBuffer":{"type":"Buffer","data":[117,121,69,198,61,191,194,240,123,213,135,110,103,167,32,68,113,169,89,167]},"announce":[],"urlList":[]}}