{"title":"Keb' Mo' - 2000 - The Door (SACD 24 88.2) FLAC","uid":9134362,"size":1056292537,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:75bafa025f243c62de80747b9cec69649493ac4a&amp;dn=Keb%27+Mo%27+-+2000+-+The+Door+%28SACD+24+88.2%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"eika256","files":-1,"time":1383390792,"description":"Keb' Mo' - 2000 - The Door\nSACD 24 bits, 88.2 KHz\n\nKeb' Mo''s self-titled first album, from its Robert Johnson covers to its appearance on a resuscitated Okeh Records, seemed to suggest the arrival of a Delta blues traditionalist, even though the former Kevin Moore was really a Los Angeles native who had kicked around the music business for years playing various styles of music. The follow-up, Just Like You, was therefore a disappointment to blues purists, since it clearly used folk-blues as a basis to create adult contemporary pop in the Bonnie Raitt mold. But to the music industry, that was just fine, since it fostered the hope that here was an artist (finally!) who could find a way to make the blues -- consistently revered but commercially dicey -- pay, and Keb' Mo' won a Best Contemporary Blues Album Grammy for his effort. Slow Down (1998) brought him a second Grammy and got even higher in the charts. The Door is more of the same. Keb' Mo''s slightly gritty voice and fingerpicking are the focus of the music, but he does not hesitate to add mainstream pop elements, beginning with writing partners who include Bobby McFerrin and Melissa Manchester, and continuing with a backup band that features such session aces as keyboard player Greg Phillinganes and drummer Jim Keltner. This is music that is folkish and bluesy rather than being actual folk-blues. Just in case anyone hasn't gotten the point yet, Keb' Mo' begins the album's sole cover, Elmore James' &quot;It Hurts Me Too,&quot; in authentic folk-blues style, after which the arrangement lurches into a heavily percussive, anything but traditional direction. It's fair warning that the singer/guitarist is interested in tradition only as a jumping-off point. Maybe that's what &quot;contemporary blues&quot; is. (AllMusic)\n\nTrack list:\n01. The Door\n02. Loola Loo\n03. It Hurts Me Too\n04. Come On Back\n05. Stand Up (And Be Strong)\n06. Anyway\n07. Don't You Know\n08. It's All Coming Back\n09. Gimme What You Got\n10. Mommy Can I Come Home\n11. Change\n12. The Beginning\n\nPersonnel:\nKeb' Mo' - guitars, banjo, harmonica, vocals\nJim Keltner, Steve Jordan - drums\nSergio Gonzalez - percussion, drums\nReggie McBride - bass\nScarlet Rivera - violin\nGreg Leisz - pedal steel guitar\nGreg Phillinganes - synthesizer, pedal steel guitar, keyboards\nDavid Mann, Lawrence Feldman - saxes\nThomas Tally - viola\nGerri Sutyak - cello\nLeon Ware, Dennis Collins, Marva Hicks - backup vocals\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:75bafa025f243c62de80747b9cec69649493ac4a","amp;dn":"Keb%27+Mo%27+-+2000+-+The+Door+%28SACD+24+88.2%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75bafa025f243c62de80747b9cec69649493ac4a","infoHashBuffer":{"type":"Buffer","data":[117,186,250,2,95,36,60,98,222,128,116,123,156,236,105,100,148,147,172,74]},"announce":[],"urlList":[]}}