{"title":"Amen Dunes - Love [2014][EAC/FLAC]","uid":10561754,"size":286404833,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7682dc9a7cf0e5520de1a5f17f4485cf368810e1&amp;dn=Amen+Dunes+-+Love+%5B2014%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"dickspic","files":-1,"time":1405466317,"description":"FLAC / Lossless / Log 100%/ Cue\nLabel/Cat#: Sacred Bones #SBR 113\nCountry: USA\nYear: May 13, 2014\nGenre: alternative, folk, indie, psychedelic, lo.fi,\nFormat: CD,Album\n\n\n\n\n\n01. White Child ( 5:14)\n02. Lonely Richard ( 5:18)\n03. Splits Are Parted ( 3:51)\n04. Sixteen ( 2:55)\n05. Lilac In Hand ( 3:28)\n06. Rocket Flare ( 3:53)\n07. I Know Myself ( 4:23)\n08. Everybody Is Crazy ( 3:35)\n09. Green Eyes ( 2:57)\n10. I Can't Dig It ( 4:52)\n11. Love ( 8:29)\n\n\n\nSome artists' music gets more intricate as the years pass, while others, like Amen Dunes' Damon McMahon, pare it down to its essence. While 2011's sprawling Through Donkey Jaw suggested he could go in almost any direction on his next album, on Love he forgoes much of that woolliness -- some of which ended up on the smaller-scale releases Ethio Covers and Spoiler -- resulting in songs with a newfound clarity and serenity. The album begins with some of McMahon's most appealing music yet: &quot;White Child&quot; manages to be bold and eerie at the same time, tempering its punchy brass with trippy woodwinds and a melodic sensibility that evokes fellow travelers Epic Soundtracks and Greg Ashley. &quot;Lonely Richard&quot; might be the closest McMahon has come to a bona fide pop song, but its heavy reverb and droning violins help keep it weird. &quot;Splits Are Parted,&quot; meanwhile, captures the album's strange grace and yearning in McMahon's cries of &quot;Oh, I could love you.&quot; Love's pastoral excursions are simpler yet more sophisticated than what came before, but the album still boasts plenty of haze on the eight-minute title track and &quot;Lilac in Hand,&quot; which nods to and modernizes flower-child freedom. The wide-open drones that dominate these songs allow more details and nuances to come out, whether it's the layered backing vocals on &quot;I Know Myself&quot; or &quot;Sixteen&quot;'s carefully sketched portrait of youth, love, and loss. That said, Love also shows McMahon's way with towering sonics hasn't deserted him: &quot;Green Eyes&quot; creates an air of doomy majesty that makes it feel longer and more imposing than two and a half minutes. The album's more polished feel extends to how well blended and balanced it is; the dense weirdness of Love's lone rocker, &quot;I Can't Dig It,&quot; enhances the alluring drift of songs like &quot;Rocket Flare&quot; and &quot;Everybody Is Crazy.&quot; This is easily some of McMahon's prettiest and most accessible music, and it's also some of his finest. In its own simple, graceful way, Love adds more depth to the rest of Amen Dunes' work.","torrent":{"xt":"urn:btih:7682dc9a7cf0e5520de1a5f17f4485cf368810e1","amp;dn":"Amen+Dunes+-+Love+%5B2014%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7682dc9a7cf0e5520de1a5f17f4485cf368810e1","infoHashBuffer":{"type":"Buffer","data":[118,130,220,154,124,240,229,82,13,225,165,241,127,68,133,207,54,136,16,225]},"announce":[],"urlList":[]}}