{"title":"Carissa's Wierd - Songs About Leaving","uid":5623428,"size":107288015,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:76bcea260095a27807b3ec4808be6ce9a36d9c6d&amp;dn=Carissa%5C%27s+Wierd+-+Songs+About+Leaving&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Neohostus","files":13,"time":1276371960,"description":"The third release by Seattle cult-faves Carissa's Wierd (do not adjust your spell-check) is as emotionally uplifting as a drizzling, endlessly gray day in the Pacific Northwest. But then that seems largely the metaphorical point: whose spirit hasn't felt this dampened? This is sensitive, sophisticated acoustic pop as an ever-troubled Brian Wilson might have imagined it in some alternate, sun-deprived universe--sad and depressed, yet spiritually resonant and beautifully realized. There's a crucial fine line between morose and moody, and the band pirouettes with grace along its boundaries here. The delicate vocal harmonies and counterpoint of &quot;You Should Be Hated Here&quot; and hypnotic, minimalist-inspired interplay of strings and keyboard on &quot;The Piano Song&quot; belie the album's seven-day, largely in-studio gestation, while shuffling dirges like &quot;Silently Leaving the Room&quot; and &quot;Farewell to All These Rotten Teeth&quot; tap into a seeming stream-of-subconsciousness vein that's seductively mesmerizing, while the nervous &quot;Sofisticated Fuck Princess Please Leave Me Alone&quot; suggests there's still something seething beneath the album's languid mood and dreamy, musical torpor. Produced with understated grace by Death Cab for Cutie's Chris Walla. --Jerry McCulley\n\nTrack Listings \n  \n1. You Should Be Hated Here \n2. Silently Leaving the Room \n3. So You Wanna Be a Superhero \n4. September Come Take This Heart Away \n5. Ignorant Piece of Shit \n6. Piano Song \n7. They'll Only Miss You When You Leave \n8. New Holiday (November 16th) \n9. Farewell to All These Rotten Teeth \n10. Sofisticated Fuck Princess Please Leave Me Alone \n11. Low Budget Slow Motion Soundtrack Song for the Leaving Scene \n\nEnjoy.","torrent":{"xt":"urn:btih:76bcea260095a27807b3ec4808be6ce9a36d9c6d","amp;dn":"Carissa%5C%27s+Wierd+-+Songs+About+Leaving","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76bcea260095a27807b3ec4808be6ce9a36d9c6d","infoHashBuffer":{"type":"Buffer","data":[118,188,234,38,0,149,162,120,7,179,236,72,8,190,108,233,163,109,156,109]},"announce":[],"urlList":[]}}