{"title":"TTC - The Skeptic's Guide To The Great Books  (Audio)","uid":8803115,"size":267740650,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:76dabf34f04a02010e2c1192877eecb255841782&amp;dn=TTC+-+The+Skeptic%27s+Guide+To+The+Great+Books++%28Audio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Mousebelt","files":13,"time":1376259916,"description":"The Teaching Company - Audio - 2011\n\nI don't think this lecture is named very well:  The lecturer simply recommends literature outside the Western Canon/Great Books selections.\n\n\nHamlet. Moby Dick. War and Peace. Ulysses. These are just four of what are considered the &quot;Great Books&quot;-works of literature that have been singled out as essential parts of a well-read individual's reading list. The only problem: The &quot;Great Books&quot; can be daunting, intimidating, and oftentimes nearly impossible to get through. The truth of the matter is that there is so much more to literature than these giants of the Western canon. In fact, you can get the same pleasures, satisfactions, and insights from books that have yet to be considered &quot;great.&quot; Books that are shorter, more accessible, and less dependent on classical references and difficult language. Books that, in the opinion of popular Great Courses Professor Grant L. Voth of Monterey Peninsula College, &quot;allow you to connect with them without quite so many layers of resistance to work through.&quot; When you take this skeptical approach to the &quot;Great Books,&quot; you open yourself up to works that are just as engaging, just as enjoyable, and-most important-just as insightful about great human themes and ideas as anything you'd encounter on a college-level reading list. Professor Voth's course, The Skeptic's Guide to the Great Books, is your opportunity to discover new literary adventures that make worthy substitutes to works from the Western literary canon. In these 12 highly rewarding lectures, you'll get an introduction to 12 works that redefine what great literature is and how it can reveal startling truths about life-all without being such a chore to read. The first half of The Skeptic's Guide to the Great Books focuses on what Professor Voth considers direct &quot;alternatives&quot; to more canonical works of literature. In each case, he convinces you that you won't be missing out on much by reading these books instead of their more famous cousins and proves that these selections can be just as substantive, challenging, and stimulating.","torrent":{"xt":"urn:btih:76dabf34f04a02010e2c1192877eecb255841782","amp;dn":"TTC+-+The+Skeptic%27s+Guide+To+The+Great+Books++%28Audio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76dabf34f04a02010e2c1192877eecb255841782","infoHashBuffer":{"type":"Buffer","data":[118,218,191,52,240,74,2,1,14,44,17,146,135,126,236,178,85,132,23,130]},"announce":[],"urlList":[]}}