{"title":"CRU - Da Dirty 30 - 1997 - Rare Hip-Hop Gem","uid":3777846,"size":112576512,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:76db95ba2ebebabd2fec4bc8a52e86277ab993f6&amp;dn=CRU+-+Da+Dirty+30+-+1997+-+Rare+Hip-Hop+Gem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"MistaMoak","files":59,"time":1187499375,"description":"By now you&amp;#039;ve probably read tons of reviews scouring the net for that undiscovered Hip Hop gem. You&amp;#039;ve been digging in the crates, asking friends for recommendations, trying to find that one album that reminds you of why you fell in love with Hip Hop to begin with. For those of you fortunate enough to be reading this review - congratulations - this is the album you&amp;#039;ve been searching for. Every now and again you come across an album that hits you track after track - Nas&amp;#039;s Illmatic, Biggie&amp;#039;s Ready to Die, The Beatnuts self-titled debut come to mind among a handful of others. Somehow this album never hit it big and fell off the radar before word of mouth had a chance to bring it to mass audiences. 7 years later this album is still inexplicably obscure. But true NY Hip Hop heads consider this masterpiece one of the most slept on albums of all time. The production is top-notch (some chill trax mixed with straight-up party bangers) and flows seamlessly with tight story-telling rhymes. Unfortunately, similar to most Hip Hop albums from &amp;#039;97, there are a number of annoying interludes making this unplayable front to back without reaching for the skip button. However a total of 20 trax says you won&amp;#039;t care once you realize that 18 of them are pure Hip Hop bliss. It doesn&amp;#039;t get much better than this. Believe me, all your friends who are into Hip Hop will be burning copies and asking you how you ever found out about this one. It&amp;#039;s that good. Cru may never get the recognition they deserve but you and your boys will bond over this album forever. And that&amp;#039;s what makes a classic a true classic.\n","torrent":{"xt":"urn:btih:76db95ba2ebebabd2fec4bc8a52e86277ab993f6","amp;dn":"CRU+-+Da+Dirty+30+-+1997+-+Rare+Hip-Hop+Gem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76db95ba2ebebabd2fec4bc8a52e86277ab993f6","infoHashBuffer":{"type":"Buffer","data":[118,219,149,186,46,190,186,189,47,236,75,200,165,46,134,39,122,185,147,246]},"announce":[],"urlList":[]}}