{"title":"maya banks sweet series","uid":8806712,"size":3039825,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:774c21f4713b7c3a264de23ec59b8f031349cf3f&amp;dn=maya+banks+sweet+series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"420weedman","files":8,"time":1376350698,"description":"\n0\n \n0\nmaya banks sweet series\nseeders: 0leechers: 0\nDOWNLOAD TORRENT\nAdded on Aug 12, 2013 by  w33dm4n1794 in Books &gt; Ebooks\t\nDownloaded 0 times.\nMAIN\n \nTECHNICAL\n \nCOMMENTS\nadd torrent to bookmarks add torrent to your personal rss feed\nmaya banks sweet series (Size: 2.9 MB)\n \t\t4 - Sweet Temptation.lit\t874.06 KB\n \t\t4 - Sweet Temptation.epub\t385.8 KB\n \t\t2 - Sweet Persuasion.epub\t382.24 KB\n \t\t1 - Sweet Surrender.epub\t337.45 KB\n \t\t1 - Sweet Surrender.lit\t328.57 KB\n \t\t2 - Sweet Persuasion.lit\t254.55 KB\n \t\t3 - Sweet Seduction.lit\t206.18 KB\n \t\t3 - Sweet Seduction.epub\t199.72 KB\nDescription\nSWEET SURRENDER\nSometimes the first step in taking control is surrendering.\n\nUnder Faith Malone's deceptively soft exterior lies a woman who knows exactly what she wants. A strong man who'll take without asking--because she's willing to give him everything...\n\nDallas cop Gray Montgomery is on a mission: find the guy who killed his partner--and bring him to justice. So far, he's found a link between the killer and Faith--and if Gray has to get close to her to catch the killer, so be it.\n\nFaith is sweet and feminine, everything Gray wants and desires in a woman, but he suspects she's playing games. No way she would allow a man to call the shots in their relationship. Or would she?\n\nFaith sees in Gray the strong, dominant man she needs, but he seems determined to keep her at a distance. So she takes matters into her own hands to prove to him it's no game she's playing. She's willing to surrender to the right man. Gray would like to be that man. But catching his partner's killer has to be his first priority. Until Faith is threatened and Gray realizes he will do anything to protect her.\n\nSWEET PERSUASION\nFor five years, Serena has run Fantasy Incorporated and has devoted her time to fulfilling her clients' fantasies. Never her own. Until now...\n\nHer most secret desire is to give ownership of her body to a man. Someone who will command her, pleasure her, and have complete authority over her. So she seeks out Damon Roche, owner of an exclusive sex club and a man strong enough to make her do anything he wants. Anything.\n\nTogether they'll journey into a world she's only dreamed of. She's given the opportunity to immerse herself in a different life while her normal one waits for her to return whenever she wishes. Damon has no desire to let her go, however. Serena is the woman he's long searched for, and it's up to him to convince her to stay when the game is all over with. He wants their fantasy to become their reality and for Serena to remain his pampered, cherished submissive.\n\nSWEET SEDUCTION\nHe was the stuff erotic dreams are made of...\n\nSalon owner Julie Stanford wanted Nathan Tucker ever since she gave him his first massage. Getting paid to feel every inch of his body, stripped, oiled, and spread out in front of her? Stuff dreams are made of. But the sexy lug was oblivious to the signals she was sending--until she finished off his final rub-down with something extra. In fact, the best extra he ever had. Unfortunately, he came around too late. Now Julie's moving on...\n\nShe was everything he'd dreamed of...\n\nThe woman was driving him crazy. She lit fire to his insides then ran like a scalded cat. And now she's going to someone else to have all her fantasies fulfilled? Over his dead body... He's more than willing to give her what she wants, and as soon as he pins the little minx down, he'd show her his own brand of sweet seduction.\n\nSWEET TEMPTATION\nHe was a by-the-book cop who broke the rules in the bedroom\n\nMicah Hudson has painful secrets he's run hard from. He has new friends, a new life, but he's about to be confronted with the one person who reminds him of all he's tried to forget--Angelina, the sister of his oldest friend David. She knows everything about his past, including how he and David fell in love with the same woman, and how they decided the best way to prevent her from tearing them apart was to share her between them. But then a terrible accident left Micah alone...\n\nShe was willing to do anything to make him see the woman she'd become...\n\nMicah lost the two people who meant the most in the world to him. Angelina lost her only family. And she kept her deepest secret close to her heart. Her love for Micah. No longer willing to wait, she decides it's time to go after him and bring him to his knees. She knows his secrets, his desires, his kinks and fetishes, and she'll use whatever it takes to reel him in. Behind the easy going, loves women exterior lies a man with dark needs and passions. She can give him what he wants. But will he decide she's what he needs","torrent":{"xt":"urn:btih:774c21f4713b7c3a264de23ec59b8f031349cf3f","amp;dn":"maya+banks+sweet+series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"774c21f4713b7c3a264de23ec59b8f031349cf3f","infoHashBuffer":{"type":"Buffer","data":[119,76,33,244,113,59,124,58,38,77,226,62,197,155,143,3,19,73,207,63]},"announce":[],"urlList":[]}}