{"title":"Norikos.Dinner.Table.2005.DVDRip.[Allzine]","uid":3681566,"size":1458155745,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:778b5e1da0e871a2ec1f9561b176c5512ac03e55&amp;dn=Norikos.Dinner.Table.2005.DVDRip.%5BAllzine%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"enasccis","files":3,"time":1178404301,"description":"In 2002, director Sono Shion released the cult hit Suicide Club, a violent thriller about a mysterous epidemic of cult-related suicides that takes over Tokyo. Sono expands on this chilling story with Noriko no Shokutaku (a.k.a. Noriko&amp;#039;s Dinner Table), which covers events both before and after the first film, focusing on the mass suicide of 54 schoolgirls that opened Suicide Club. Both a sensational thriller and a psychological drama, Sono&amp;#039;s film throws a bloody light on family conflicts, generation gap, teenage suicides, and other issues that trouble modern society. Noriko no Shokutaku premiered in July 2005 at the 40th Karlovy Vary International Film Festival in Czech Republic, and won the Don Quijote Award.\n\nUnhappy with her family and mundane suburban life in Tokoyama, 17-year-old Shimabara Noriko (Fukiishi Kazue ) runs away to Tokyo. She joins a circle of discontented schoolgirls led by Kumiko (Tsugumi), the proprietor of Family Circle, a business in which the girls are rented out to people to create pseudo-families. Soon Noriko&amp;#039;s younger sister Yuko (Yoshitaka Yuriko) also joins her in Tokyo. The girls find solace and a deeper understanding of family in their new lives and identities. Blindly submitting to the increasingly sinister Kumiko&amp;#039;s misleading guidance, the girls slowly lose their original selves. What appears to be a comforting service to create families is actually a shocking plan to destroy the girls. ","torrent":{"xt":"urn:btih:778b5e1da0e871a2ec1f9561b176c5512ac03e55","amp;dn":"Norikos.Dinner.Table.2005.DVDRip.%5BAllzine%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"778b5e1da0e871a2ec1f9561b176c5512ac03e55","infoHashBuffer":{"type":"Buffer","data":[119,139,94,29,160,232,113,162,236,31,149,97,177,118,197,81,42,192,62,85]},"announce":[],"urlList":[]}}