{"title":"Les Amants du Flore - TVRip - Legendado PT-BT","uid":4193930,"size":734534788,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:778c2af1bb113adb80d72e7eb87ed358346ae0f5&amp;dn=Les+Amants+du+Flore+-+TVRip+-+Legendado+PT-BT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"xara_maior","files":1,"time":1211120327,"description":"Audio: Frances\nLegendas/Subtitles: Portugues\nDuracao: 104 min\nBitrate: 800 kbps (TVRip)\nResolucao: 720x480 (4:3)\nCodecs: DivX6/mp3\n\nResenha do IMDB\n\nDevo comecar dizendo que embora eu viva em Israel, nasci em Paris/Franca e minha primeira graduacao foi na Universidade de Paris. Literatura Francesa e  filosofia, Francesa ou outra qualquer, eram parte do nosso curriÃƒ?Ã‚Â­culo de bacharelado. Entao, o ambiente apresentado pelo filme eh bastante autentico e o Flore eh o famoso cafeh em Montparnasse Boulevard frequentado por este ciÃƒ?Ã‚Â­rculo. Ateh onde sei o Cafeh ainda existe mas agora eh um ponto de encontro da comunidade gay. A exemplo do Cafeh Coupole, eles perderam um pouco do seu brilho do qual eu me recordo quando costumava frequenta-los em minha juventude nas tardes de domingo.\n\nEu vi o filme e devo dizer que Laurant Deutsch eh a cara de Sartre, o mesmo porte, os oculos e o cachimbo. Simone de Beuavoir me era menos conhecida mas li seu primeiro romance \\&quot;O Convidado\\&quot; que eh mencionado no filme. Lembro-me de comentarios sobre eles mas todos sabiam que nunca se casaram e que ela nunca teve filhos. Sartre morreu em 1980 e Simone em 1984. Jazem no famoso cemiterio Pere Lachaise, junto com Balzac, Chopin, Proust, Jim Morrison e outros.\n\nNo filme vemos Albert Camus, Francois Mauriac e citacoes de Andre Malraux, Aragon, etc. Alguns deles comunistas fanaticos como Aragon e sua amiga/esposa Elsa. O impacto da WWW II em todos os envolvidos, na vida da Franca, em Paris, eh muito bem descrito como tambem a omissao de Sartre ao ajudar um dos envolvidos, judeu, fuzilado pelos nazistas em plena rua. Desse modo, acredito que ele era um pouco racista. Usou Simone e ela, devotada e consciente da dependencia dele e de sua genialidade, desistiu de sua propria felicidade por ele. O episodio com o cara de Chicago foi novidade para mim. Mas muitas coisas foram novidade para mim.\n\nOs atores atuam convincentemente em algumas partes dificeis. Deutsch eh otimo assim como Anna Mouglalis, e os outros membros do elenco sao bons. O roteiro foi muito bem pesquisado e reflete apropriadamente os personagens e o periodo. No geral o filme eh agradavel, aa parte as cenas de nudez, que para mim eram desnecessarias. Um bom filme para aqueles que gostam do genero.\n\nDe modo geral, a historia deles eh bem conhecida, mas tambem triste. A ideia de que o talento masculino autoproclamado pudesse convencer o intelecto de uma mulher como o de Simone de Beauvoir a fazer qualquer coisa, o fato inegavel de que a condicao de celebridade seja suficiente para evocar a atracao sexual, com tudo isso fica difiÃƒ?Ã‚Â­cil ser otimista sobre a condicao da mulher tanto na epoca como hoje. Eh claro, a liberdade comeca com a independencia economica e um lugar soh para si, mas a escravidao de uma criatura por outra sobrepuja tudo isso.\\&quot;\n\n+++++++++++++++++++++++++++\n\nFrom IMDB\n\n\\&quot;I must begin by saying that although I live in Israel, I am born in Paris, France and I got my first degree from the University of Paris. French literature and philosophy, French or otherwise, were part of our curriculum for the Baccalaureat. So, the background presented in the movie is quite authentic, and the Flore is the famous cafe on the Montparnasse Boulevard, where this Circle would meet. As far as I know the Cafe still exists but was more a place of meeting for the gay\\&amp;#039;s community. Just like the Coupole, they have lost some of the lustre, which I remember from my youth when I used to go there with my late parents on Sundays afternoon...\n\nI just saw the film and I must say that Laurant Deutsch looks exactly like Sartre, same looks, same glasses, and same pipe. Simone de Beauvoir was less known to me but I did read her first novel \\&quot;L\\&amp;#039;Invite\\&quot; (The Guest), which is mentioned in the movie. I seem to remember that there were talks about them, but every one seemed to know about it like the fact that they never married and that she never had children. Sartre died in 1980 and Simone in 1984, they are buried in the famous Pere Lachaise Cemetery, together with Balzac, Chopin, Proust (and even Jim Morrison from The Doors), and all the others.\n\nWe see Albert Camus, Francois Mauriac, we hear about Andre Malraux, Aragon etc. Some of them were fanatic communists like Aragon and his friend/wife Elsa, and others. The impact of WWII on all involved, on the life in France, in Paris, is quite well described as well as the rather uninvolvement of Sartre to help one member, who was a Jew, and shot by Nazis in the street - which was a much better end than the camps. So I do think he was a bit of a racist, he used Simone, and she, out of devotion and knowing how much he depended on her and knowing also what a genius he was, she gave up on her own happiness for him. The episode about the Chicago guy was news to me. But many details on this whole set have been new to me.\n\nThe actors play very convincingly some parts, which are pretty tough, Deutsch is great, and so is Anna Mouglalis, and the other members of the cast are quite good. The movie script is well researched and fits properly the personages and the period; on the whole it is quite enjoyable, apart from the nude scenes, which I think are unneeded. A good movie for those, who like this genre. \n\nI must say that it is kind of refreshing to see Nelson Algren called \\&quot;the Chicago guy\\&quot;. All in all, the story is well known, but still so sad. The idea that male self-proclaimed geniuses could convince women of Simone de Beauvoir\\&amp;#039;s intellect to do practically anything; the undeniable fact that celebrity status is enough to evoke sexual attraction... it is very difficult to feel optimism about the fate of women now as then. Yes, freedom begins with one\\&amp;#039;s own wallet, and could do with a room of one\\&amp;#039;s own, but captivity can surpass all this.\\&quot;","torrent":{"xt":"urn:btih:778c2af1bb113adb80d72e7eb87ed358346ae0f5","amp;dn":"Les+Amants+du+Flore+-+TVRip+-+Legendado+PT-BT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"778c2af1bb113adb80d72e7eb87ed358346ae0f5","infoHashBuffer":{"type":"Buffer","data":[119,140,42,241,187,17,58,219,128,215,46,126,184,126,211,88,52,106,224,245]},"announce":[],"urlList":[]}}