{"title":"ToneBoosters All Plugins Bundle VST v1.9.0 PC/MAC OSX [ak]","uid":6396361,"size":16893048,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:77e3ecbd49162630d23ec3e8d7258d721a66d85f&amp;dn=ToneBoosters+All+Plugins+Bundle+VST+v1.9.0+PC%2FMAC+OSX+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1305534475,"description":"ToneBoosters All Plugins Bundle VST v1.9.0 PC/MAC OSX\n\nOur audio plugins are based on more than a decade of scientific research and product development in the areas of digital signal processing and auditory perception. We combine advanced signal processing techniques and highly-optimized cross-platform implementations with simple-to-use interfaces to optimize your workflow. We strive for both affordability as well as quality rather than settling for compromises and trade-offs, introducing professional-grade products to a broad range of users.\n\nTB Equalizer\nAnalyze and modify the spectral balance with TB Equalizer a versatile EQ with digital and analog filter prototypes.\n\nTB Isone\nA virtual monitoring setup with adjustable speakers and room acoustic properties right from your headphones.\n\nTB HumRemover\nClean-up that great performance and remove low-frequency rumble or AC hum resulting from ground loops with TB HumRemover.\n\nTB DeEsser\nReduce excess sibilance from vocals, or apply smooth and natural limiting of high frequencies of stereo mixes with TB DeEsser.\n\nTB Ferox\nAdd the warmth and punch of analog tape right within your audio workstation - with TB Ferox tape simulator plugin.\n\nTB EZCompressor\nImprove your workflow with the most advanced yet simplest to use compressor you can think of TB EZCompressor.\n\nTB Gate\nReduce any unwanted background noise or create that legendary gated reverb with your reverb of choice and TB Gate.\n\nTB Reverb\nSimulate any acoustic environment from a small room to a warm and dense concert hall with TB Reverb.\n\nTB XYTool\nChange the direction of your XY-configuration (super) cardioid microphones or add new microphones - after recording.\n\nTB Compressor\nGet any audio dynamics under control with TB Compressor a versatile and advanced VST dynamic range compressor.\n\nHomepage: http://www.toneboosters.com/products/\n\n","torrent":{"xt":"urn:btih:77e3ecbd49162630d23ec3e8d7258d721a66d85f","amp;dn":"ToneBoosters+All+Plugins+Bundle+VST+v1.9.0+PC%2FMAC+OSX+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77e3ecbd49162630d23ec3e8d7258d721a66d85f","infoHashBuffer":{"type":"Buffer","data":[119,227,236,189,73,22,38,48,210,62,195,232,215,37,141,114,26,102,216,95]},"announce":[],"urlList":[]}}