{"title":"The DUNE Saga - Frank Herbert","uid":6720400,"size":3643025476,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:77eb7ad746a2d4d42783d2815ccffb99c06035dc&amp;dn=The+DUNE+Saga+-+Frank+Herbert&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"neil1966hardy","files":9,"time":1317766719,"description":"The complete and epic saga of Frank Herbert's DUNE and his son's completion of the epic tales with the DUNE 7.\n\nAll files are m4b iTunes formatted in one single file per book. So no need to sync multiple files to your iPod... Complete with all metadata tags and album artwork ready to sync directly into iTunes.\nNarrated by Scott Brick\n\nContents...\n\nDUNE 1965 - Frank Herbert\nSet in the far future amidst a sprawling feudal interstellar empire where planetary fiefdoms are controlled by noble houses that owe an allegiance to the Imperial House Corrino, Dune tells the story of young Paul Atreides (the heir apparent to Duke Leto Atreides and the heir of House Atreides) as he and his family accept control of the desert planet Arrakis, the only source of the &quot;spice&quot; melange, the most important and valuable substance in the universe.\n\nDUNE Messiah 1969 - Frank Herbert\nTwelve years after the events described in Dune, Paul &quot;Muad'Dib&quot; Atreides rules as Emperor. By accepting the role of messiah to the Fremen, Paul had unleashed a jihad which conquered most of the known universe. While Paul is the most powerful Emperor ever known, he is powerless to stop the lethal excesses of the religious juggernaut he has created.\n\nChildren of DUNE 1976 - Frank Herbert\nAt the end of Dune Messiah, Paul Atreides walks into the desert, a blind man, leaving his twin children Leto and Ghanima in the care of the Fremen, while his sister Alia rules the universe as regent. Awoken in the womb by the spice, the children are the heirs to Paul's prescient vision of the fate of the universe, a role that Alia desperately craves.\n\nGod Emperor of DUNE 1981 - Frank Herbert\nThirty-five hundred years have passed since Paul Atreides had become the messiah of the Fremen and the Emperor of the known universe at the end of the novel Dune. His son, Leto Atreides II, sees the path that his father Muad'Dib had also seen, a future that secures the continuation of human life throughout the universe. That future, however, requires an aberrant act of selflessness: becoming a hybrid of man and sandworm.\n\nHeretics of DUNE 1984 - Frank Herbert\nFifteen hundred years have passed since the 3,500-year reign of the God Emperor Leto Atreides II ended with his assassination; humanity is firmly on the Golden Path, Leto's plan to save mankind from destruction. By crushing the aspirations of humans for over three thousand years, Leto caused the Scattering, an explosion of humanity into the rest of the universe upon his death. Now, some of those who went out into the universe are coming back, bent on conquest.\n\nChapterhouse: DUNE 1985 - Frank Herbert\nThe Bene Gesserit still find themselves questioning the Golden Path of humanity set by the God Emperor Leto II. Now they must survive the Honored Matres, whose reckless conquest of the Old Empire threatens Bene Gesserit survival. The Sisters must reassess their timeless methods: does ultimate survival go beyond calculated manipulation? Is there greater purpose to life than consolidating power?\n\nHunters of DUNE 2006 - Brian Herbert &amp; Keven J. Anderson\nFor three years, the no-ship (named the Ithaca by its passengers) has been in an alternate universe, carrying the gholas of Duncan Idaho and the famous military commander Miles Teg as well as the Bene Gesserit Sheeana, who has the mysterious power to control sandworms. Other passengers include the last Bene Tleilax Master Scytale, some Bene Gesserits, a group of Jews saved from Honored Matre oppression on the planet Gammu, seven small sandworms that can produce spice, and four captive Futars, fierce half-man/half-cat creatures bred to hunt Honored Matres.\n\nSandworms of DUNE 2007 - Brian Herbert &amp; Keven J. Anderson\nThe passengers of the no-ship Ithaca continue their nearly two-decade search for a new home world for the Bene Gesserit, while Duncan Idaho evades the tachyon net of the old couple Daniel and Marty, now known to be thinking machine leaders Omnius and Erasmus. Among the inhabitants of the Ithaca are young gholas of Paul Atreides, Lady Jessica and others. Back in the Old Empire, Mother Commander Murbella of the New Sisterhood attempts to rally humankind for a last stand against the thinking machines.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:77eb7ad746a2d4d42783d2815ccffb99c06035dc","amp;dn":"The+DUNE+Saga+-+Frank+Herbert","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77eb7ad746a2d4d42783d2815ccffb99c06035dc","infoHashBuffer":{"type":"Buffer","data":[119,235,122,215,70,162,212,212,39,131,210,129,92,207,251,153,192,96,53,220]},"announce":[],"urlList":[]}}