{"title":"Belleruche - Rollerchain (2012)","uid":7326176,"size":105040517,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:780e7a8096ae3339989d95d8dcd85cfece73adcb&amp;dn=Belleruche+-+Rollerchain+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Vaunski","files":13,"time":1338761313,"description":"Rollerchain is the fourth album from Belleruche on Tru Thoughts Records. Showcasing a\nstunning new progression in sound for the acclaimed London trio.\n\nAs evidenced by the single, on Rollerchain, Belleruche have created a darker, more bass heavy and evocative sound, whilst still retaining the melodic soulful touch that\nsets them apart and has gained them a worldwide fanbase. Stormbird is a sub bass driven pop song with clipped drums, tempo shifts and swells of looped feedback, unlike Belleruche's previous work but drawing from the same cabinet of sonic references. \n\nAs the album opener, this gorgeous little distorted oddity of a track grabs your attention and runs away with it through the shadows into a new sonic underworld.\nCombining a very modern aesthetic with classic song writing ability, the album is a collision of haunting vocals,tough analogue sounds and bleeding edge electronic\nproduction. Stranger rhythms and basslines inhabit this record; both in the studio and onstage, Belleruche have picked up new instruments and ideas to create a\ncomplexity and an attack that take the band's core elements - vocals (care of Kathrin deBoer), guitar (Ricky Fabulous) and turntables (DJ modest) - to a new level.","torrent":{"xt":"urn:btih:780e7a8096ae3339989d95d8dcd85cfece73adcb","amp;dn":"Belleruche+-+Rollerchain+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"780e7a8096ae3339989d95d8dcd85cfece73adcb","infoHashBuffer":{"type":"Buffer","data":[120,14,122,128,150,174,51,57,152,157,149,216,220,216,92,254,206,115,173,203]},"announce":[],"urlList":[]}}