{"title":"Punisher MAX 01-22 (2010-2012|Digital|Minutemen-PhD)","uid":9948523,"size":884800671,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7843960179af7a700acc3c9208ceb21238212de0&amp;dn=Punisher+MAX+01-22+%282010-2012%7CDigital%7CMinutemen-PhD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1397356012,"description":"Jason Aaron and Steve Dillon pick up the tale of Frank Castle where Garth Ennis left it off, in yet more violent and gritty scenarios that The Punisher never seems to be able to escape. Promotional info for the collected edition - &quot;The Mob has set a trap for Frank Castle, turning low-level enforcer Wilson Fisk into a fictional &quot;Kingpin of Crime&quot; for Frank to target. But Fisk decides he quite likes his new position...enough to kill his bosses to keep it. Suddenly, the Punisher finds himself in a one-on-one war with a deadly threat...and he must decide how far he is willing to go to take the Kingpin down! Contending with dirty cops, battling the Kingpin's henchmen Bullseye and Elektra, and suffering through a stint in prison, Frank Castle is brought lower than he has ever been. But as the Kingpin of Crime will soon find out - all that means is that Frank has nothing left to lose!&quot;\n\nThis is all 22 issues of the series in HD digital copies thanks to Minutmen-PhD. There are lower-res digital rips by Zone-Empire available as well. This torrent does NOT contain the X-Mas Special or the Annual as neither have yet been ripped into the MM-HD versions. All the work and effort of the scanners are appreciated, please seed and enjoy! :-)","torrent":{"xt":"urn:btih:7843960179af7a700acc3c9208ceb21238212de0","amp;dn":"Punisher+MAX+01-22+%282010-2012%7CDigital%7CMinutemen-PhD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7843960179af7a700acc3c9208ceb21238212de0","infoHashBuffer":{"type":"Buffer","data":[120,67,150,1,121,175,122,112,10,204,60,146,8,206,178,18,56,33,45,224]},"announce":[],"urlList":[]}}