{"title":"The Steve Miller Band - Book Of Dreams [1977][320 KBPS]","uid":11013319,"size":116621422,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:78534144913dba81470b9af5226361052ef469ab&amp;dn=The+Steve+Miller+Band+-+Book+Of+Dreams+%5B1977%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"LameDuck69","files":19,"time":1410414666,"description":"The Steve Miller Band - Book Of Dreams [1977]\n\n\n\n\n01. Threshold  \n02. Jet Airliner  \n03. Winter Time  \n04. Swingtown  \n05. True Fine Love  \n06. Wish Upon A Star  \n07. Jungle Love  \n08. Electro Lux Imbroglio  \n09. Sacrifice  \n10. The Stake  \n11. My Own Space  \n12. Babes In The Wood \n\n\n\n\n320 KBPS [CBR]\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\n The Steve Miller Band is an American rock band formed in 1966 in San Francisco, California. The band is managed by Steve Miller on guitar and lead vocals, and is best known today for a string of (mainly) mid-1970s hit singles that are staples of classic rock radio, as well as several earlier acid rock albums.\n\nIn 1965 after moving to Chicago to play the blues, Steve Miller and keyboardist Barry Goldberg founded the Goldberg-Miller Blues Band along with bassist Shawn Yoder, rhythm guitarist Craymore Stevens, and drummer Lance Haas. The band was contracted to Epic Records after playing many Chicago clubs. They also appeared on Hullabaloo with the Four Tops and the Supremes.\n\nMiller left the group to go to San Francisco where the psychedelic scene was flourishing. He then formed the Steve Miller Blues Band. Harvey Kornspan, managing partner, wrote and negotiated the band's landmark contract ($860,000 over 5 years as well as $25,000 of promotion money that was to be spent at the band's discretion) with Capitol Records then president, Alan Livingston in 1967. Shortly after, the band's name was shortened to the Steve Miller Band in order to broaden its appeal. The band, consisting of Miller, guitarist James Cooke, bassist Lonnie Turner, drummer Tim Davis (who replaced the departing Lance Haas on drums) and Jim Peterman on Hammond B3 organ, backed Chuck Berry at a gig at the Fillmore West that was released as the live album, Live at Fillmore Auditorium. Guitarist Boz Scaggs joined the band soon after and the group performed at the Monterey Pop Festival in June.\n\nIn February 1968, while in England, the band recorded their debut album Children of the Future at Olympic studios with Glyn Johns as engineer/producer. The album did not score among the Top 100 album chart. The second album Sailor appeared in October 1968 and climbed the Billboard chart to #24. Successes included the single &quot;Living in the USA&quot;.\n\nBrave New World (#22, 1969) featured the song &quot;Space Cowboy&quot; and &quot;My Dark Hour&quot; which was co-written by &quot;Paul Ramon&quot; (alias Paul McCartney) who also played drums, bass and guitar and sang backing vocals. This was followed by Your Saving Grace (#38, 1969); and then Number 5 (#23, 1970).\n\nIn 1971 Miller broke his neck in a car accident. Capitol Records released the album Rock Love, featuring unreleased live performances (including an eleven-minute jam on the title track) and studio material. This is one of two Steve Miller Band albums not to be released on CD, the other being Recall the Beginning...A Journey from Eden. In 1972, the double album compilation Anthology was released, containing 16 songs from the band's first five albums.\n\nThe style and personnel of the band changed radically with The Joker (#2, 1973), concentrating on straightforward rock and leaving the psychedelic side of the band behind. The title track became a #1 single and was certified platinum, reaching over one million sales.\n\nThree years later, the band returned with the album Fly Like an Eagle, which charted at #3. Three singles were released from the album: &quot;Take the Money and Run&quot; (#11), &quot;Fly Like an Eagle&quot; (#2) and their second Number One success, &quot;Rock'n Me&quot;. Miller credits the guitar intro to &quot;Rock'n Me&quot; as a tribute to the classic song by Free, &quot;All Right Now&quot;.\n\nBook of Dreams (#2, 1977) also included three successes: &quot;Jet Airliner&quot; (#8), &quot;Jungle Love&quot; (#23) (later becoming the song played over the opening credits of the 8th season of the sitcom Everybody Loves Raymond), and &quot;Swingtown&quot; (#17). 1982's Abracadabra album gave Steve Miller his third Number One success with the title track. Miller's hit pushed Chicago's &quot;Hard to Say I'm Sorry&quot; out of the #1 spot, just as his &quot;Rock'n Me&quot; had knocked Chicago's &quot;If You Leave Me Now&quot; out of the #1 spot in 1976.\n\nReleased in 1978, The Steve Miller Band's Greatest Hits 1974-1978 has sold over 13 million copies and Miller continues to perform successful sold-out concert performances.\n\nBingo!, a new album of blues and R&amp;B covers, was released on June 15, 2010. Let Your Hair Down, a companion release to Bingo!, was released 10 months later, on April 18, 2011.\n\nFounding member Tim Davis died from complications due to diabetes on September 20, 1988 at the age of 44. Longtime band member Norton Buffalo died from lung cancer on October 30, 2009. John King (drummer during &quot;The Joker&quot; era) died after a short bout with kidney cancer on October 26, 2010. James Cooke died from cancer on 16 May 2011.\n\nBlues guitarist Jacob Peterson officially joined the band before the Spring 2011 tour. Following Petersen joining the band, longtime guitarist Kenny Lee Lewis switched instruments to become the band's full-time bassist.\n\nOn November 10, 2011 the band played inside the Boeing factory in Everett, Washington to celebrate the successful delivery milestones of the 747-8 program. They opened the set with &quot;Jet Airliner&quot;.\n\nIn 2014 Steve Miller Band is touring with fellow San Francisco rock band Journey.\n\n--------------------------------------------------------------------------------\n\nBook of Dreams is the tenth album by American rock band The Steve Miller Band. The album was released in 1977 on the Capitol label in North America and on the Mercury label in Europe. Three singles were released from the album in 1977 with the first single, &quot;Jet Airliner&quot;, being the most successful.\n\nThe album peaked in the top 10 of the trade charts in four countries, including Canada where the album topped RPM magazine's 100 Albums chart. The album has gone on to become one of the group's most successful studio albums.\n\nThe songs on Book of Dreams were recorded at CBS Studios in San Francisco, California from leftover material recorded for Fly Like an Eagle, but not released on the album. The sessions were produced by the group's leader, Steve Miller, who had been producing the group's albums since Number 5 in 1970. John Palladino was the album's executive producer and the recording engineer was Mike Fusaro. The recordings were later mixed by Jim Gains with assistance from Win Kutz and were mastered by Ken Perry.\n\nThe winged horse art was created by Alton Kelley and Stanley Mouse, who were credited as &quot;Kelly and Mouse&quot;. The art director for the album was Roy Kohara. The cover illustration was also used on the record label on the vinyl version of the album.\n\n--------------------------------------------------------------------------------\n\nPersonnel:\n\nSteve Miller: vocals, guitar, synthesizer, sitar, producer\nDavid Denny: guitar\nGreg Douglass: slide guitar\nByron Allred: piano, synthesizer\nLonnie Turner: bass guitar\nGary Mallaber:drums, percussion\n\n\n\nAdditional Personnel:\n\n\nNorton Buffalo: harmonica on &quot;Winter Time&quot; and &quot;The Stake&quot;\nLes Dudek: lead guitar on &quot;Sacrifice&quot;\nKenny Johnson: drums on &quot;Sacrifice&quot;\nJachym Young: piano on &quot;Sacrifice&quot;\nCharles Calamise: bass on &quot;Sacrifice&quot;\nCurley Cooke: acoustic guitar on &quot;Sacrifice&quot;\nBob Glaub: bass on &quot;Winter Time&quot;\nSteven (Sticks Douglas) Moore: Drums / Background vocals on &quot;Winter Time&quot;","torrent":{"xt":"urn:btih:78534144913dba81470b9af5226361052ef469ab","amp;dn":"The+Steve+Miller+Band+-+Book+Of+Dreams+%5B1977%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78534144913dba81470b9af5226361052ef469ab","infoHashBuffer":{"type":"Buffer","data":[120,83,65,68,145,61,186,129,71,11,154,245,34,99,97,5,46,244,105,171]},"announce":[],"urlList":[]}}