{"title":"Resident.Evil.6-RELOADED","uid":8286437,"size":16627520522,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:788be587930a700802ab499d25c30d069f1ed48e&amp;dn=Resident.Evil.6-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"Cr@cker","files":-1,"time":1363952162,"description":"If you have problem in installation then visit the source link\n   \nCRACK Only V2 version Crack and Fixes Also\n  &lt;a href=&quot;\nhttp://www.skidrowzgames.com/resident-evil-6-reloaded/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.skidrowzgames.com/resident-evil-6-reloaded/&lt;/a&gt;\n\n\nTrailer\n  &lt;a href=&quot;\nhttp://www.7videotube.com/resident-evil-6-official-trailer-new-video_a2e2deee2.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.7videotube.com/resident-evil-6-official-trailer-new-video_a2e2deee2.html&lt;/a&gt;\n\n\nResident Evil 6 (c) Capcom\n\n03/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Action, Adventure\n\nBlending action and survival horror, Resident Evil 6 promises to be the\ndramatic horror experience of 2013. Resident Evil favorites Leon S. Kennedy,\nChris Redfield and Ada Wong are joined by new characters, including Jake\nMuller, to face a new horror, the highly virulent C-virus, as the narrative\nmoves between North America, the war-torn Eastern European state of Edonia\nand the Chinese city of Lanshiang.\n\nWith four distinct, yet interwoven story threads, each with their own pair of\nprotagonists for either solo or co-op play, both offline and online, not only\nwill Resident Evil 6 deliver both different perspectives and gameplay styles\nbut, with the introduction of the innovative Crossover mechanic players will\nbe able to team up and share the horror. At key moments during the game, up\nto four players can join together online to tackle a specific situation, with\nsome stages seeing the usual partnerships swapped to further increase the\ndepth of gameplay.\n\nFeatures:\n\nHorror on a global scale  No longer confined to a specific location, the\noutbreak of the C-virus is worldwide with the action taking place in\nNorth America, Eastern Europe and China The most expansive Resident Evil\ngame to date- Experience the horror through four distinct yet intertwined\ncampaigns:\nSolo or co-op play  Resident Evil 6 delivers both single and two player\nco-op gameplay either offline or online (however Ada Wong's campaign is\none player only)\nPlay your way  Use skill points to upgrade your character to provide\nfaster reload speed, improved firepower or increase your health bar with\nthe Character Skill system\nMercenaries returns  Players will once more be able to enjoy the highly\npopular Mercenaries Mode\n7 Additional Stages for the Extra Content Modes - Previously available\nfor purchase as DLC for the console versions, these 7 additional stages\ncome as standard on the PC version. These stages are unlocked via\nachievements.\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to your game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT","torrent":{"xt":"urn:btih:788be587930a700802ab499d25c30d069f1ed48e","amp;dn":"Resident.Evil.6-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"788be587930a700802ab499d25c30d069f1ed48e","infoHashBuffer":{"type":"Buffer","data":[120,139,229,135,147,10,112,8,2,171,73,157,37,195,13,6,159,30,212,142]},"announce":[],"urlList":[]}}