{"title":"Colm Toibin - The Sign of the Cross: Catholic Europe (pdf)","uid":8564735,"size":2024988,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:79031ac65468d51c9364ad6f7bdba006ad016008&amp;dn=Colm+Toibin+-+The+Sign+of+the+Cross%3A+Catholic+Europe+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"pharmakate","files":-1,"time":1370975102,"description":"Colm Toibin - The Sign of the Cross: Travels in Catholic Europe (Vintage, 1994). 296 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nAn early nonfiction work by the great Irish novelist. Meditations on Catholicism by a &quot;lapsed Catholic&quot; (such an absurd phrase!) using his travels in Europe as his launching point.\n\ndescription:\n\nColm Toibin is one of Ireland's most distinguished young writers; he is also a lapsed Catholic. Yet over a succession of Holy Weeks, Toibin found himself traveling to places where Catholicism still possesses mystery and power, from Poland to Lithuania, from Lourdes to Santiago, and from Croatia to Ireland. And in seeing how the faith persisted in other people's lives, he discovered how it still resonated in his own. In this beautifully observed work of travel writing and spiritual reportage, Toibin turns his eye on Catholicism's rituals and processions, its high-minded fanatics and humble communicants. He shows how it ripples outward into the history and politics of homelands. Yet Toibin also encounters the cross-shaped wound that lies at his own center--and it is his unflinching examination of that wound that makes The Sign of the Cross as moving as it is perceptive and urbane.\n\n&quot;A writer of considerable poetic gifts. Toibin's descriptions are enlivening.&quot;--Los Angeles Times Book Review\n\n&quot;An extraordinary document.&quot;--Entertainment Weekly","torrent":{"xt":"urn:btih:79031ac65468d51c9364ad6f7bdba006ad016008","amp;dn":"Colm+Toibin+-+The+Sign+of+the+Cross%3A+Catholic+Europe+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79031ac65468d51c9364ad6f7bdba006ad016008","infoHashBuffer":{"type":"Buffer","data":[121,3,26,198,84,104,213,28,147,100,173,111,123,219,160,6,173,1,96,8]},"announce":[],"urlList":[]}}