{"title":"The Portrait of a Lady - Henry James","uid":9972977,"size":2858826,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:790ebbebf5407750d43e10e047c6cccd736983a1&amp;dn=The+Portrait+of+a+Lady+-+Henry+James&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1397609877,"description":"One ought to choose something very deliberately, and be faithful to that.'\n\nIsabel Archer is a young, intelligent, and spirited American girl, determined to relish her first experience of Europe. She rejects two eligible suitors in her fervent commitment to liberty and independence, declaring that she will never marry. Thanks to the generosity of her devoted cousin Ralph, she is free to make her own choice about her destiny. Yet in the intoxicating worlds of Paris, Florence, and Rome, her fond illusions of self-reliance are twisted by the machinations of her friends\nand apparent allies. What had seemed to be a vista of infinite promise steadily closes around her and becomes instead a 'house of suffocation'.\n\nConsidered by many as one of the finest novels in the English language, this is Henry James's most poised achievement, written at the height of his fame in 1881. It is at once a dramatic Victorian tale of betrayal and a wholly modern psychological study of a woman caught in a web of relations she only comes to understand too late. This edition reproduces the revised New York Edition, with James's own Preface.\nABOUT THE SERIES: For over 100 years Oxford World's Classics has made available the widest range of literature from around the globe. Each affordable volume reflects Oxford's commitment to scholarship, providing the most accurate text plus a wealth of other valuable features, including expert introductions by leading authorities, helpful notes to clarify the text, up-to-date bibliographies for further study, and much more.","torrent":{"xt":"urn:btih:790ebbebf5407750d43e10e047c6cccd736983a1","amp;dn":"The+Portrait+of+a+Lady+-+Henry+James","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"790ebbebf5407750d43e10e047c6cccd736983a1","infoHashBuffer":{"type":"Buffer","data":[121,14,187,235,245,64,119,80,212,62,16,224,71,198,204,205,115,105,131,161]},"announce":[],"urlList":[]}}