{"title":"Paul Celan - Selected Poetry and Prose (5 books)","uid":14748656,"size":6170756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7932d28b21cc29d23ecf7d4362de31bc24fc23ce&amp;dn=Paul+Celan+-+Selected+Poetry+and+Prose+%285+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"workerbee","files":10,"time":1464740894,"description":"PAUL CELAN, the pseudonym of Paul Antschel (1920-1970), was a Romanian-born German language poet and translator.  When Romania came under virtual Nazi control in World War II, Celan was sent to a forced-labor camp, and his parents were murdered.  Although he never lived in Germany, Celan gave its post-war literature one of its most powerful and regenerative voices, and is now widely regarded as one of the greatest poets of the 20th century.\n\nCelan's poetry was influenced stylistically by French Surrealism, and its subject matter by his grief as a Jew.  It is marked by a phantasmagoric perception of the terrors and injuries of reality and by a sureness of imagery and prosody.  Among his most well-known and often-anthologized poems is &quot;Death Fugue&quot; [Todesfuge], which presents a stark evocation of life in the Nazi death camps.  The urgency and power of Celan's work stem from his attempt to find words &quot;after&quot;, to bear (impossible) witness while recognizing the limitations of poetic expression and of language itself &quot;for that which happened&quot;.\n\nThe books in this collection offer a broad introduction to his verse, as well as two prose works -- &quot;The Meridian&quot;, Celan's core statement on poetics, and the narrative &quot;Conversation in the Mountains&quot; -- and a number of letters.  In later years his poetry became progressively more cryptic, fractured and monosyllabic.  BREATHTURN INTO TIMESTEAD (2014) gathers five of these final volumes, following what Celan himself called the &quot;turn&quot; (Wende) of his work away from the lush, surreal metaphors of his earlier verse, paring down his compositions to increase the accuracy of the language that now &quot;does not transfigure or render 'poetical'; it names, it posits, it tries to measure the area of the given and the possible.&quot;\n\n\nThe following books are in PDF and/or ePUB format as indicated:\n\n* Breathturn into Timestead: The Collected Later Poetry (FSG, 2014).  Bilingual edition.  Translated with commentary by Pierre Joris. -- ePUB\n\n* Glottal Stop: 101 Poems (Wesleyan UP, 2004).  Translated by Nikolai Popov &amp; Heather McHugh. -- PDF + ePUB\n\n* Meridian, The: Speech on the Occasion of Receiving the Georg Buchner Prize, 1960.  Excerpt from Paul Celan, &quot;Collected Prose&quot;, translated by Rosemary Waldrop (Routledge, 2003). -- PDF\n\n* Paul Celan: Selections (California, 2005).  Edited with an Introduction by Pierre Joris. -- ePUB\n\n* Selected Poems (Penguin, 1972).  Translated by Michael Hamburger and Christopher Middleton. -- PDF\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n                              \nhttps://pirates-forum.org/User-workerbee  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:7932d28b21cc29d23ecf7d4362de31bc24fc23ce","amp;dn":"Paul+Celan+-+Selected+Poetry+and+Prose+%285+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7932d28b21cc29d23ecf7d4362de31bc24fc23ce","infoHashBuffer":{"type":"Buffer","data":[121,50,210,139,33,204,41,210,62,207,125,67,98,222,49,188,36,252,35,206]},"announce":[],"urlList":[]}}