{"title":"To the Bright Edge of the World - Eowyn Ivey","uid":15645360,"size":28422079,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:793a68586532547f625833bcdbf0f1b9e941dafe&amp;dn=To+the+Bright+Edge+of+the+World+-+Eowyn+Ivey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mr_mando","files":2,"time":1472049312,"description":"\nIn the winter of 1885, decorated war hero Colonel Allen Forrester leads a small band of men on an expedition that has been deemed impossible: to venture up the Wolverine River and pierce the vast, untamed Alaska Territory. Leaving behind Sophie, his newly pregnant wife, Colonel Forrester records his extraordinary experiences in hopes that his journal will reach her if he doesn't return--once he passes beyond the edge of the known world, there's no telling what awaits him. \r\n\r\nThe Wolverine River Valley is not only breathtaking and forbidding but also terrifying in ways that the colonel and his men never could have imagined. As they map the territory and gather information on the native tribes, whose understanding of the natural world is unlike anything they have ever encountered, Forrester and his men discover the blurred lines between human and wild animal, the living and the dead. And while the men knew they would face starvation and danger, they cannot escape the sense that some greater, mysterious force threatens their lives. \r\n\r\nMeanwhile, on her own at Vancouver Barracks, Sophie chafes under the social restrictions and yearns to travel alongside her husband. She does not know that the winter will require as much of her as it does her husband, that both her courage and faith will be tested to the breaking point. Can her exploration of nature through the new art of photography help her to rediscover her sense of beauty and wonder?\r\n\r\nThe truths that Allen and Sophie discover over the course of that fateful year change both of their lives--and the lives of those who hear their stories long after they're gone--forever","torrent":{"xt":"urn:btih:793a68586532547f625833bcdbf0f1b9e941dafe","amp;dn":"To+the+Bright+Edge+of+the+World+-+Eowyn+Ivey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"793a68586532547f625833bcdbf0f1b9e941dafe","infoHashBuffer":{"type":"Buffer","data":[121,58,104,88,101,50,84,127,98,88,51,188,219,240,241,185,233,65,218,254]},"announce":[],"urlList":[]}}