{"title":"Stealers Wheel - Discography","uid":6095456,"size":281426850,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:796e2c8a1d6fd2bc07b5b9cc2652c6189e17bcf6&amp;dn=Stealers+Wheel+-+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"piratetorrent1989","files":33,"time":1294750996,"description":"Stealers Wheel are a Scottish folk rock/rock band formed in Paisley, Renfrewshire in 1972 by former school friends Joe Egan and Gerry Rafferty.\n\nThe band broke up in 1975 and re-formed without Rafferty and Egan in 2008.\n\nRafferty and Egan first met when they were teenagers in Paisley and they became the core of Stealers Wheel. In the early 1970s, the band was considered to be the British version of American folk/rock supergroup Crosby, Stills, Nash &amp; Young. They were initially joined by Roger Brown, Rab Noakes and Ian Campbell in 1972. However, that line-up only lasted a few months and by the time the band were signed to A&amp;M Records later that same year, Brown, Noakes and Campbell had been replaced by Paul Pilnick, Tony Williams and Rod Coombes. This line-up recorded their self-titled debut album, Stealers Wheel and was produced by the influential American songwriters and producers Leiber &amp; Stoller. The album was a critical and commercial success reaching number fifty in the US album charts, with their million selling hit single &quot;Stuck in the Middle With You&quot;, coming from the album.\n\nBy the time the first album was released Rafferty had left the band to be replaced by Luther Grosvenor, who remained with the band for much of 1973 on tour. DeLisle Harper also replaced Tony Williams on tour. &quot;Stuck in the Middle With You&quot; reached number six in the USA and number eight in the UK in 1973, and sold over one million copies worldwide, and with the album also selling well, Rafferty was persuaded to return. However, Grosvenor, Coombes and Pilnick all left the band. With so many changes in the band's line-up they officially became a duo, with backing musicians as needed on tour and in the studio. Later in 1973 the single &quot;Everyone's Agreed That Everything Will Turn Out Fine&quot; (which has never been reissued on any subsequent LPs or CDs; the following year they recorded a quite different, equally fine version on Ferguslie Park) had modest chart success and in 1974 the single &quot;Star&quot; reached the top thirty of both the UK and US charts.\n\nA second album Ferguslie Park was released in 1974, with the duo backed up by nine backing musicians. The album, named after an area of Paisley, only just reached the top 200 in the USA and was a commercial failure. With increasing tension between Rafferty and Egan they could not agree on which studio musicians to use on the third album, and with Leiber &amp; Stoller also having business problems, Stealers Wheel disappeared for eighteen months. By the time the album Right Or Wrong was released in 1975, Stealers Wheel had ceased to exist. The last album, because of disagreements and managerial problems, was produced by Mentor Williams. All three albums had particularly striking, slightly surrealist sleeve designs by artist John Byrne.\n\nAfter 1975 the group was hardly known and the two last single releases faded away in the charts. Both Rafferty and Egan recorded songs which included lyrics referring to the acrimonious history of Stealers Wheel and a Best of Stealers Wheel album was released in 1990. In 1992 director Quentin Tarantino used the track &quot;Stuck in the Middle&quot; in the soundtrack of his debut film Reservoir Dogs, bringing new attention to the band.In September 2001 a dance version of Stuck in the Middle was a UK Top 10 hit for Louise , with a music video that drew heavily on the original song's appearance in the soundtrack of Reservoir Dogs.\n\nAll three albums have been unavailable for a number of years, although in 2004 and 2005 the British independent label Lemon Recordings, of Cherry Red, re-released them with remastered sound and new liner-notes.\n\nAfter being contacted by iTunes and K-tel records in California, Tony Williams re-formed Stealers Wheel in Blackpool in 2008 with two other original band members, Rod Coombes and Paul Pilnick together with locally based musician and songwriter Tony Mitchell. On 10 November 2008 they started filming a music video for a re-release of &quot;Stuck in the Middle&quot; on the Fylde coast. They also began writing songs for a new album to be released in 2009, although they have no plans to go on tour. Luther Grosvenor has expressed his interest in joining the band should they tour.\n\nGerry Rafferty died on January 4, 2011 after suffering liver failure.","torrent":{"xt":"urn:btih:796e2c8a1d6fd2bc07b5b9cc2652c6189e17bcf6","amp;dn":"Stealers+Wheel+-+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"796e2c8a1d6fd2bc07b5b9cc2652c6189e17bcf6","infoHashBuffer":{"type":"Buffer","data":[121,110,44,138,29,111,210,188,7,181,185,204,38,82,198,24,158,23,188,246]},"announce":[],"urlList":[]}}