{"title":"Chet Baker - 1958 - Chet Baker In New York (2004 SACD 24 88.2) F","uid":9107883,"size":1042134408,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:79c280cda8a23dfd221d724406d835ad9267bff5&amp;dn=Chet+Baker+-+1958+-+Chet+Baker+In+New+York+%282004+SACD+24+88.2%29+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"eika256","files":-1,"time":1382912240,"description":"Chet Baker - 1958 - Chet Baker In New York (2004)\nSACD 24 bits, 88.2 KHz\n\nChet Baker's West Coast cool comes to the Big Apple on Chet Baker in New York. The project would be Baker's first -- in a four album deal -- with the Big Apple-based Riverside Records. The bicoastal artist incorporates his decidedly undernourished sound and laid-back phrasing into the styling of Al Haig (piano), Johnny Griffin (tenor sax), Paul Chambers (bass), and Philly Joe Jones (drums). The results are uniformly brilliant as Baker's cool-toned solos fly and bop with authority around the equally impressive supporting soloists. Conversely, the same cohesive unity continues on the introspective numbers that are more akin to Baker's California cool. Undoubtedly one of the charms of this collection is the distinct choice of material. Running the gamut from the relaxed and soothing &quot;Polka Dots and Moonbeams&quot; and equally serene &quot;Blue Thoughts&quot; at one end of the spectrum to the percolating and driving intensity of &quot;Hotel 49&quot; on the other. This track features each quintet member taking extended solos corralling together at the head and again at the coda for some intense bop interaction. Especially ferocious is Philly Joe Jones, who could easily be mistaken for Keith Moon, Ginger Baker, or even Gene Krupa with his cacophonous solo that never strays from the beat or loses its sense of swing. Perhaps the best meshing of styles can be heard on the Miles Davis composition &quot;Solar.&quot; This &quot;best-of&quot; candidate refers to both Chambers' and Jones' concurrent involvement with Davis. The churning backbeat likewise propels the melody and ultimately the performers into reaching beyond their individual expertise and into an area of mutual brilliance. Chet Baker in New York is a highly recommended entry into Baker's catalog. It should also be noted that these same sides were issued in 1967 as Polka Dots and Moonbeams on the Jazzland label. (AllMusic)\n\nTrack list:\n01. Fair Weather\n02. Polka Dots and Moonbeams\n03. Hotel 49\n04. Solar\n05. Blue Thoughts\n06. When Lights Are Low\n07. Soft Winds\n\nPersonnel:\nChet Baker - trumpet\nJohnny Griffin - tenor saxophone (tracks 1, 3 &amp; 5)\nAl Haig - piano\nPaul Chambers - bass\nPhilly Joe Jones - drums\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:79c280cda8a23dfd221d724406d835ad9267bff5","amp;dn":"Chet+Baker+-+1958+-+Chet+Baker+In+New+York+%282004+SACD+24+88.2%29+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79c280cda8a23dfd221d724406d835ad9267bff5","infoHashBuffer":{"type":"Buffer","data":[121,194,128,205,168,162,61,253,34,29,114,68,6,216,53,173,146,103,191,245]},"announce":[],"urlList":[]}}