{"title":"Urban Farming by Thomas J. Fox","uid":10320109,"size":21273764,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a57cb56d156c8019e34f630bb76ecebc30f126a&amp;dn=Urban+Farming+by+Thomas+J.+Fox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"PirateBook","files":1,"time":1402297517,"description":"\nUrban Farming - Sustainable City Living in Your Backyard, in Your Community, and in the World by Thomas J. Fox\n\n\nWinner of the 2012 Benjamin Franklin Award in Home &amp; Garden from the Independent Book Publishers Association (IBPA). It doesn't take a farm to have the heart of a farmer. Now, due to a burgeoning sustainable-living movement, you don't have to own acreage to fulfill your dream of raising your own food. \n\nHobby Farms Urban Farming, from Hobby Farm Press and the same people who bring you Hobby Farms and Hobby Farm Home magazine, will walk every city and suburban dweller down the path of self sustainability. \n\nUrban Farming will introduce readers to the concepts of gardening and farming from a high-rise apartment, participating in a community garden, vertical farming, and converting terraces and other small city spaces into fruitful, vegetableful real estate.\n\nThis comprehensive volume will answer every up and coming urban farmer's questions about how, what, where and why--a new green book for the dedicated citizen seeking to reduce his carbon footprint and grocery bill.\n\nGenre: Non-Fiction | General","torrent":{"xt":"urn:btih:7a57cb56d156c8019e34f630bb76ecebc30f126a","amp;dn":"Urban+Farming+by+Thomas+J.+Fox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a57cb56d156c8019e34f630bb76ecebc30f126a","infoHashBuffer":{"type":"Buffer","data":[122,87,203,86,209,86,200,1,158,52,246,48,187,118,236,235,195,15,18,106]},"announce":[],"urlList":[]}}