{"title":"Persuasion 1GB (BBC - Jane Austen) 720p DivX - moviesbyrizzo","uid":6047150,"size":1231491482,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:7a73dbdd1202d363650b02b0cd2be502e5bc2404&amp;dn=Persuasion+1GB+%28BBC+-+Jane+Austen%29+720p+DivX+-+moviesbyrizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1292601054,"description":"1280 X 720p video, 1500k video bitrate 256k audio\nConverted using DivX converter plus and viewed in its entirety before launch\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0844330/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0844330/&lt;/a&gt;\n\nWe are at this very moment seeding at high speed into our (Jane Austen's) &quot;Pride\nand Prejudice&quot; 4GB torrent, so please carry on with your downloads and seeding\nefforts - with thanks to all involved at the piratebay most especially!\n\nThis is a followup torrent of Jane Austen's &quot;Persuasion&quot; novel made into a movie\nideal for Television and was featured on the popular PBS networks in the United \nStates of America.\n\nIt is often suggested that &quot;Persuasion&quot; is Jane Austen's novel that was in some\nrespect autobiographical perhaps. There is some mention of her distaste of Bath\nas a place of her liking and there may be other aspects too that suggest she is \nsomehow relating a story that mirrors her own lot in life in giving us the\ncharacter of &quot;Anne&quot; in this final of her novels.\n\nWhat is most interesting to me personally in this story is the theme that often\nis encountered from such writers in the contrasts between characters such as that\nof Anne versus that of Louisa Musgrove in what would be a suitable match for \nCaptain Wentworth's character in this tale.\n\nFor his own part, Captain Wentworth indicates he is seeking a woman who isn't \nfragile in her emotions. He wants a woman who &quot;wont be swayed&quot; he tells us.\n\nYet considering his own good nature and strength of great character, it would\nhardly do him justice to be saddled with such a disposition upon his own spirit.\nIn this regard, I think we are scripting for Captain Wentworth, an unwise\nposition on the matter - to hisown honest interests, as he is in fact clearly\nbest served in life by staying close to the knitting instead of the likes of\nthe lovely Miss Louisa Musgrove.\n\nIn order to retard the truth of this, Louisa is seen as so foolhardy as to allow\nherself a prank of sorts that nearly costs her her life at the moment she takes a\nfall from a perilous climb onto a rock a the seaside where they are all out\nfor an enjoyable excursion. A posting concerning this novel on Wikipedia has an\nobserver noting that this tells all in what makes the character of Anne more\nsensible than that of the lovely Louisa. I beg to differ. In any event the \ncontrivance fails in more substantive elements of the argument as what makes them\ndifferent is clear enough to an observer of human nature, and in any event, to any \nto would honestly befriend captain Wentworth or certainly Miss Louisa, on the \nbasis of the merits alone. Look at the difference in what is their spirit!\nAnne would be best off with Mr. darcy perhaps as there is always one such man\naround willing to oblige in whatever would make her happier!\n\nEnough said, perhaps! Enjoy the show, Jane Austen never fails to impress\nin old fashioned wit of the greatest of languages which English is!\n\n\nMichael Rizzo Chessman\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:7a73dbdd1202d363650b02b0cd2be502e5bc2404","amp;dn":"Persuasion+1GB+%28BBC+-+Jane+Austen%29+720p+DivX+-+moviesbyrizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a73dbdd1202d363650b02b0cd2be502e5bc2404","infoHashBuffer":{"type":"Buffer","data":[122,115,219,221,18,2,211,99,101,11,2,176,205,43,229,2,229,188,36,4]},"announce":[],"urlList":[]}}