{"title":"Fatal Frame 1, 2 &amp; 3 -- PS2 -- NTSC (USA) -- NSDOTHACK (LZMA","uid":8602181,"size":6042666858,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:7ac2f2be96d94da33acc3551e8ea3616c5e5c74a&amp;dn=Fatal+Frame+1%2C+2+%26amp%3B+3+--+PS2+--+NTSC+%28USA%29+--+NSDOTHACK+%28LZMA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"d3m0n1q_733rz","files":12,"time":1371913825,"description":"If you don't read this, chances are you won't know what you're doing.  First off, the files offered in this torrent are not my own.  Do not get on my case about it since I really don't need to hear it.  NSDOTHACK is the original creator, I've just done some recompressing to shrink the file size by a few hundred MB so that people can download this a little faster and added some PAR2 files in case the seeds die out.\n\nBefore you download, be sure you have some sort of program to open 7z files.  If you have Winzip, you might as well uninstall it because it will be of no help here.  Winrar, no help either.  7z uses a LZMA2 compression format with superior compression ratios; for this reason, I have decided to use it to compress everything.  Now, you're probably wondering to yourself, &quot;What the hell is 7z and what do I do with it?&quot;  Don't worry, you're not daft.  7z is the extension given to 7-zip files.  7-zip being a free program from 7-zip.org that will compress zip, 7-zip, tar, gz, and bz2 files.  It also decompresses a wide range of other files including rar.  There are far too many to list here, but you should download it and give it a try just because.\n\nAnyhow, mad props to NSDOTHACK.  I hope you don't mind my supplying an alternative (or two) to your own torrent, I'm just not a real fan of the rar format.\n\nOh, and before I forget, the 7z files are not compatible with the rar files.  If you have a few rar files already and decide to use this instead, those rar files you have completed won't help you one bit.\n\nAs a side note, each torrent piece is 4 MB.  Each block within the PAR2 recovery files is also 4 MB.  I'm not sure how well this will work out in case of missing pieces, but up to about 10.16% of the Fatal Frame game files can be recovered if pieces are missing.  You will have to copy the 7z files to the PAR2 files directory before using something like QuickPAR to repair them.  Even if the PAR2 files are incomplete, there's a good chance that you can restore missing pieces of the Fatal Frame game files.  It is my hope that this method will be utilized with future torrents as well so as to complete them in no-seed situations.\n\nEven if you don't need the PAR2 files, please seed them if you can so as to allow them to be used when they will be needed.  And almost all torrents eventually reach that point.\n\nEnjoy!  And don't forget to buy the game if you like it and it's available!","torrent":{"xt":"urn:btih:7ac2f2be96d94da33acc3551e8ea3616c5e5c74a","amp;dn":"Fatal+Frame+1%2C+2+%26amp%3B+3+--+PS2+--+NTSC+%28USA%29+--+NSDOTHACK+%28LZMA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ac2f2be96d94da33acc3551e8ea3616c5e5c74a","infoHashBuffer":{"type":"Buffer","data":[122,194,242,190,150,217,77,163,58,204,53,81,232,234,54,22,197,229,199,74]},"announce":[],"urlList":[]}}