{"title":"Dr. Lonnie Smith - In The Beginning, Vol 1 and 2 - Jazz Organ","uid":9641460,"size":275867016,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7b4e1e51ac9f1e5a1edb0b17da7c6678483d628f&amp;dn=Dr.+Lonnie+Smith+-+In+The+Beginning%2C+Vol+1+and+2+-+Jazz+Organ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"L_Hammond","files":-1,"time":1392933099,"description":"Dr. Lonnie Smith - In The Beginning, Vol 1 and 2\n\nOn 'In The Beginning', the second release on Pilgrimage Recording, his imprint label which he founded in 2012, jazz organist Dr. Lonnie Smith revisits, recontextualizes, and reimagines a dozen songs culled from his first decade as a recording artist. The end product is a document as distinctive and accomplished as any within Smith's iconic canon.\n\nTracklist:\nDisc One\n01. Falling In Love\n02. Aw Shucks\n03. Move Your Hand\n04. Turning Point\n05. In The Beginning\n06. Mama Wailer / Hola Muneca Medley\n\nDisc Two\n07. Keep Talkin'\n08. Psychedelic Pi\n09. Slow High\n10. Call of the Wild\n11. Slouchin'\n12. Track Nine\n\n\nPersonnel:\nDr. Lonnie Smith - Hammond B-3 organ, vocals\nEd Cherry - guitar\nJonathan Blake - drums\nLittle Johnny Rivero - congas\nAndy Gravish - trumpet\nIan Hendrickson-Smith - alto sax, flute\nJohn Ellis - tenor sax, bass clarinet\nJason Marshall - baritone sax\n\nYear: 2013. Label: Pilgrimage PCD002\n\nFormat: MP3 320 kbit/s. All songs are tagged by the book.\n\n--------\n\nDr. Lonnie Smith's new two-disc album is not only his most invigorating effort in years, it's also one of the most exciting Hammond B-3 albums in some time. Credit the octet format on several tracks for adding heaps of energy and pizzazz. And credit arranger Ian Hendrickson-Smith for skillfully polishing the various facets of Smith's style on this collection of originals, which reaches back to the '60s via the soulful fuss of 'Keep Talkin', the blues testifying of 'Aw Shucks, the slinky sensuality of 'Slow High' and the funky soul of 'Move Your Hand', featuring a vocal from the good Dr.\n\nUltimately, though, it's the exceptional trio at the core of this live recording that matters most. Smith's command of the organ is remarkable - dig his mesmerizing, multiphonic-like running of separate but equal lines. Onetime Dizzy Gillespie guitarist Ed Cherry's melodic snap and drummer Johnathan Blake's adrenalized-in-the-groove strokes - especially on the psychedelic swinger 'Turning Point' - enliven the classic sound. The trio (sometimes joined by conga player Little Johnny Rivero) doesn't need the horns (saxophonists Hendrickson-Smith and John Ellis and trumpeter Andy Gravish) to produce powerhouse moments.\n\nSuch are the roaring capabilities of the Hammond that surrounding it with an expanded cast of players can be an exercise in excess. There's a reason Jimmy Smith, Dr. Lonnie's great role model, didn't often return to big-band settings following his early '60s collaborations with Oliver Nelson and Lalo Schifrin. But Dr. Lonnie and Hendrickson-Smith are less interested in ramping up the sound than in adding harmonic color and depth. As demonstrated on the recent composition 'Falling in Love', they do that exceptionally well.\n\n--------\n\nIf you encounter errors during the file sharing, please, place this material as close to the root of the hard disk as possible and restart the file sharing (e.g. as close as possible to C: in Windows). This is in order to make the path (drive, directory and filename) as short as possible. Operating systems have limits regarding how long a path including the filename can be, and if this limit is exceeded there will be errors.\n\n--------\n\nL Hammond, The Pirate Bay, where you'll find more jazz organ.\n\n","torrent":{"xt":"urn:btih:7b4e1e51ac9f1e5a1edb0b17da7c6678483d628f","amp;dn":"Dr.+Lonnie+Smith+-+In+The+Beginning%2C+Vol+1+and+2+-+Jazz+Organ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b4e1e51ac9f1e5a1edb0b17da7c6678483d628f","infoHashBuffer":{"type":"Buffer","data":[123,78,30,81,172,159,30,90,30,219,11,23,218,124,102,120,72,61,98,143]},"announce":[],"urlList":[]}}