{"title":"Nikki Yanofsky - 2010 - Nikki FLAC","uid":9549264,"size":290454931,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7b6816f2ee1ff1621d53aa77a96385ece1117514&amp;dn=Nikki+Yanofsky+-+2010+-+Nikki+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"eika256","files":-1,"time":1391206093,"description":"Nikki Yanofsky - 2010 - Nikki\n\nNikki Yanofsky is a Montreal-based talent whose phenomenal voice and jazz style made her an international success at age 15. Yanofsky was born February 8, 1994; her talent was apparent from an early age, and her love for theater made her a natural performer. In 2006, the then 12-year-old Yanofsky became the youngest artist to ever headline her own show at the Montreal Jazz Festival, selling out numerous times and performing for crowds of over 100,000. She made her recording debut in 2007 on the Ella Fitzgerald tribute album We All Love Ella, where she performed Ella's classic &quot;Airmail Special.&quot; In addition to her growing jazz fame, Yanofsky became a recognizable talent in the teen pop market, recording French and English versions of &quot;Gotta Go My Own Way&quot; for the High School Musical 2 soundtrack, as well as appearing on YTV's The Next Star.\nIn September 2008, Yanofsky released her first full-length, a live album entitled Ella...Of Thee I Swing, an impressive recorded version of one of her many spectacular live performances. The album became a critical and commercial success in Canada, and earned her two Juno nominations, one for Vocal Jazz Album of the Year and another for New Artist of the Year; in both categories she stood as one of the youngest vocalists ever to earn such honors. Her debut studio album, Nikki, featured production help from Phil Ramone. After it was released in May 2010, it charted high on the Canadian chart but failed to crack the U.S. Top 40. Another live album, Nikki Live in Montreal, followed a month later. (AllMusic)\n\nTrack lis:\n01 - Take The A Train\n02 - Never Make It On Time\n03 - I Got Rhythm\n04 - For Another Day\n05 - God Bless The Child\n06 - Cool My Heels\n07 - You'll Have To Swing It (Mr. Paganini)\n08 - Bienvenue Dans Ma Vie\n09 - First Lady\n10 - On The Sunny Side Of The Street Fool In The Rain\n11 - Grey Skies\n12 - Try Try Try\n13 - Over The Rainbow\n\nEnjoy and share!","torrent":{"xt":"urn:btih:7b6816f2ee1ff1621d53aa77a96385ece1117514","amp;dn":"Nikki+Yanofsky+-+2010+-+Nikki+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b6816f2ee1ff1621d53aa77a96385ece1117514","infoHashBuffer":{"type":"Buffer","data":[123,104,22,242,238,31,241,98,29,83,170,119,169,99,133,236,225,17,117,20]},"announce":[],"urlList":[]}}