{"title":"Don't Starve Reign of Giants Where There's a Wilson...","uid":10078065,"size":195902248,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7bbc4e86ad3b910e5245dcba26306bd8d4f15478&amp;dn=Don%27t+Starve+Reign+of+Giants+Where+There%27s+a+Wilson...&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ramasbmv","files":1,"time":1398904184,"description":"Hello all! Here's the final set of patch notes before we release in a couple hours. As you can see it's almost entirely tweaks and bug fixes. Thank you for all your help developing Reign of Giants!\n \nWe will be releasing at least one more patch that will include mod support and, most likely, more bug fixes.\n \nWe do have a video that will be coming at around 10AM PST.\n \nBuild # 100795(April 30, 2014):\n \nAdditions:\n \nWorld:\nAdded some new skeletons with RoG items.\nAdded a &quot;random&quot; season start option.\nAdded a sheltered-by-tree rain sound to further indicate when you're being protected by a tree in the rain.\nPlayer:\nAdded an option to disable Wigfrid's special font.\nGeneral:\nAdded Twitch streaming directly into the client.\nAdded an option to disable screen shake.\nAdded a difficulty warning for Reign of Giants if the player profile has under 32 days played.\nA skeleton will now spawn at your death location if you are resurrected.\nChanges:\n \nWorld:\nEach season can now be tweaked individually via the customization screen.\nPresets other than the default now have the new RoG content.\nSummer's DSP is now less aggressive.\nPan flute now has a chance to spawn in the Glommer Statue set piece.\nAll evergreens (not just fully grown ones) now give shelter.\nPut in a small delay before standing under a tree gives its shelter bonus.\nTree shelter can actually cool you slightly during Summer.\nTweaked the damage done by lightning to the player.\nPlants will rejuvenate slightly earlier in Autumn.\nPlayer:\nWebber's beard gives half insulation.\nWebber can no longer eat &quot;horrible&quot; food items.\nWebber no longer loses sanity from Spider Queens.\nHaving a beard will now decrease summer insulation values.\nIncreased the range of temperatures that the hot and cold idle animations play in.\nCreatures:\nThe catcoon den will now play the dead animation if no more catcoons will spawn (transition only happens when it's off-screen).\nTweaked catcoon follower behaviours.\nMade catcoon a worse hunter.\nBuzzards are now harder to kill before they fly away.\nDeciduous monsters will now spawn a wave of Birch Nutters if they are ignited.\nDeciduous monsters are now less likely to spawn (spawn chance increases with number of days lived).\nDeciduous Monsters can no longer spawn from barren trees.\nBirds in bird cages no longer starve to death.\nSnow Chester is now a less efficient fridge.\nIce Hounds now spawn in hound waves during Spring.\nBearger will now attack beehives.\nItems:\nIncreased moggle duration. Moggles can now be refueled with glow berries.\nGlow berries are now stackable.\nReduced the number of steps before &amp; after ringing the old bell.\nUsing a tent or siesta hut will now change your moisture and temperature accordingly.\nHambat damage now decreases as it becomes more rotten.\nTuned the Cat Cap. It's now basically a more dapper but less insulating winter hat.\nCactus Flowers can now only be harvested during summer.\nSwapped craftable tiers - Floral Shirt is now better than the Summer Frest.\nUsing the old bell in the caves now starts an earthquake.\nHeat rocks are now less effective when on the ground but more effective when carried.\nAdjusted heat rock heating/ cooling values.\nThe tornado from the Weather Pain now moves slower after it has reached it's target.\nWatermelon now cools you when eaten.\nWatermelon now has different stats after getting cooked.\nPigs and Gobblers will eat raw Birchnuts again.\nHammering a Pig or Merm Head during a full moon will now also yield nightmare fuel.\nGlommer Flower (only after dead) and Glommer Wings are now fuel and burnable.\nGeneral:\nMoisture now has a greater effect on sanity.\nCharcoal will now drop from burnt structures.\nFull sized deciduous trees give an additional nut if cut down during autumn.\nEach giant now has a unique warning sound.\nTree shade now cools you slightly if you are overheating.\nMade a pass over adventure mode content to remove issues introduced by RoG content.\nFollowers now stop following on death.\nThe old bell will now wake up sleeping creatures.\nBug Fixes:\n \nWorld:\nSetting rain to &quot;none&quot; will also turn off rain in the caves.\nMade some changes to prevent cave rain from happening during unintended times.\nGlaciers can no longer spawn on top of other entities when spawned near penguin rookeries.\nDeciduous saplings will start growing again if they are lit on fire and extinguished.\nSlurtles will drop shell pieces again.\nCreatures:\nFixed deciduous monster sometimes not reverting back when intended.\nFixed deciduous monster sometimes reverting back to an incorrect state.\nCatcoons can no longer remove world entities.\nMoles can no longer clone themselves.\nMoles no longer behave strangely when lit on fire (this also fixes their their sounds not stopping).\nVolt Goats now repopulate properly.\nChester's insomnia has been cured.\nVarg insomnia has been cured.\nLureplants can no longer be stolen from.\nPigs no longer transform into were pigs if a long update happens that skips over a full moon.\nPigs spawned during a full moon (i.e. from their house being broken down) will now change into were pigs.\nThe Bearger no longer collects bees and butterflies as he moves through the world.\nYou can no longer combine a bee with a bee that is in the world.\nFix some issues with fireflies getting into a bad state when they get picked up (after making this fix, could not reproduce fireflies having reversed light-up behaviors and fireflies getting wet when inside containers).\nFixed rabbits being able to get picked as targets for wildfires while they are in their holes (i.e. fixed smoldering rabbit holes).\nItems:\nMoggles unequip no longer triggers dusk events (talking, music).\nGlommer Flower is now &quot;non-potatoable&quot;.\nBoomerang will now hit you in the face again.\nAdded physics to items that were missing it.\nIce Flingomatic will now properly shut off when out of fuel. \nYou can no longer target untargetable enemies with the Weather Pain.\nMeat Effigies will properly update health amount on destruction.\nUsing the Luxury Fan to cool off now removes the blood over effect too.\nThe star from the starcaller's staff now stops emitting sound once it has expired.\nFixed the crash that happened when the Eyebrella Hat perished.\nGeneral:\nFull moon lighting/ colour cubes are no longer used in the caves.\nYou can now put out fires that start on farmplots.\nPlants should no longer get into a state where they can regrow instantly.\nDeciduous saplings can no longer be eaten by creatures.\nFixed a bug that was causing RoG saves to get messed up after looking at a non-RoG save slot.\nTumbleweeds can no longer walk on water.\nItem Wetness is now saved properly.\nWetness borders will not show up when held on the mouse.\nBase Hassler now triggers warning strings.\nGlommer Flower is now pickable if you save and reload during full moon.\nFixed a crash in overseer.lua.\nFixed a crash that happened if you left the mods screen before the top mods list was populated.\nChanged how modified day segments are calculated - this fixes the issue of total night after emerging from the ruins.\nTurning off wildfires now turns off wildfires.\nFixed up surface to cave synchronizations.\nFixed a crash in pighouse.lua that happened when entering caves.\nFixed Webber not being able to use straw and furry rolls when spiders were nearby.\nGrass will play its grow animation again.\n \nHotfix # 100880:\n \nBug Fixes:\nFix crash in hambat.lua affecting base Don't Starve games (i.e. not RoG)\nMade a change to the options menu that should fix the crashes experienced there.\nFix crash when dropping beemine.\nIce Cube will now make inventory items wet.\nPigs will transform to Werepigs from eating monster meat as well.\nSome fixes related to Twitch streaming.","torrent":{"xt":"urn:btih:7bbc4e86ad3b910e5245dcba26306bd8d4f15478","amp;dn":"Don%27t+Starve+Reign+of+Giants+Where+There%27s+a+Wilson...","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bbc4e86ad3b910e5245dcba26306bd8d4f15478","infoHashBuffer":{"type":"Buffer","data":[123,188,78,134,173,59,145,14,82,69,220,186,38,48,107,216,212,241,84,120]},"announce":[],"urlList":[]}}