{"title":"Glory Denied: America's Longest Held Vietnam P.O.W.","uid":15769857,"size":5761057,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7bce0c2a560318b5e8b00f8a4cf61428cc2e346f&amp;dn=Glory+Denied%3A+America%27s+Longest+Held+Vietnam+P.O.W.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"marty14","files":1,"time":1473193045,"description":"Glory Denied: The Vietnam Saga of Jim Thompson, America's Longest-Held Prisoner of War - Tom Philpott [epub]\r\n\r\nArmy officer Jim Thompson's horrific experience in a series of North Vietnamese prisons was nasty and brutish--but definitely not short. He was held as a prisoner of war for nearly nine years, longer than any other American POW. His treatment was torturous: &quot;I was put into a horizontal cage maybe two feet wide, two feet high, and five feet long. There I was kept for four months, chained hand and feet.&quot; And sometimes he was just plain tortured: &quot;I sat there with a pen in hand as they shouted at me to write,&quot; he recalls of a time his captors tried to make him issue a statement condemning the American war effort. &quot;Periodically they hit me with bamboo. Not hard enough to knock me unconscious or to break the skin. Just enough to hurt. They kept at it for eight, ten, twelve hours a day.&quot; (He eventually gave in, and signed a statement.)\r\n\r\nThe irony is that Thompson's life improved little upon his return to the United States. His wife had taken up with another man, his family fell apart, he drank to excess, and his son was convicted of murder. Readers will be at once tempted and reluctant to call Thompson a hero--tempted because of how much he suffered for serving his country and for his numerous escape attempts, but reluctant because Thompson was himself responsible for much of the pain he brought on himself and his family following his return.\r\n\r\nMilitary journalist Tom Philpott has produced an oddly fascinating book about Thompson's ordeal. Glory Denied is not a piece of narrative nonfiction, but an oral history. It tells Thompson's story through the words of Thompson and those who knew him. Readers who want a more uplifting POW story may want to try Faith of Our Fathers by Senator John McCain (who contributes a foreword to Glory Denied), yet Philpott's book may come closer to capturing the agony so many Americans continue to associate with Vietnam","torrent":{"xt":"urn:btih:7bce0c2a560318b5e8b00f8a4cf61428cc2e346f","amp;dn":"Glory+Denied%3A+America%27s+Longest+Held+Vietnam+P.O.W.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bce0c2a560318b5e8b00f8a4cf61428cc2e346f","infoHashBuffer":{"type":"Buffer","data":[123,206,12,42,86,3,24,181,232,176,15,138,76,246,20,40,204,46,52,111]},"announce":[],"urlList":[]}}