{"title":"FilmConvert Pro 1.2 plugin (After Effects-Premiere) [ChingLiu]","uid":8187650,"size":679988933,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7c5872831d0208db2acad1a4282a2943a04b46ab&amp;dn=FilmConvert+Pro+1.2+plugin+%28After+Effects-Premiere%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Ching_Liu","files":-1,"time":1361757641,"description":"Real Film Grain - Add real grain to your footage, and render at up to 4k. Unlike other plugins that simply overlay film grain, FilmConvert realistically models the mount of grain required for each color and exposure level in your image.\n\nAccurate Color Modelling - FilmConvertâ„¢ models the characteristics of digital sensors, and provides a complex algorithm to transform digital footage to match your favorite film stocks.\n\nMultiple Platform Support - FilmConvert is available as a plugin for After Effects and Premiere\n\nCamera Controls\n* Source Camera Selects the camera (or camera type) used to shoot your footage. This setting is required in order to apply the correct color correction.\n* Exposure Performs an adjustment prior to the film emulation being applied.\n* Temp Adjusts the color temperature. This assumes that the clip temp is 5600 (daylight). Moving the slider to the left makes the scene cooler. Moving to the right makes it warmer.\n\nNote for RED footage. You should apply our metadata preset in the Adobe provided &quot;Source Settings&quot; interface. This preset merely resets all metadata settings to their default, thereby giving FilmConvert a known starting point for color adjustments.\n\nFilm Controls\n* Convert To drop down Selects the particular film stock to be emulated.\n* Size drop down Selects the negative size to emulate. Smaller values such as 8mm are fuzzier with larger grain. Larger values have smaller grain.\n* Film Color slider Adjusts the balance between the original digital camera color palette, and the film color palette. Typically you would leave this at 100% film\n* Grain slider Adjusts the amount of grain applied to the image. The default is 100%, which is an accurate representation of the grain for the selected film stocks. Some stocks have more grain - such as D3200.\n\nSupported Cameras (FilmConvert works on any Digital Camera footage. )\n\nFor more accurate results, we are releasing free data packs with profiles of various cameras. Currently released packs:\n\n- Arri Alexa\n- Canon 5D Mk II + Picture Styles\n- Canon C100, C300, C500, 1DC + Picture Styles\n- Panasonic GH2 + Picture Styles\n- RED one\n- RED one MX\n- RED EPIC / Scarlet\n*Until your camera is added, try using the default profile, which is accurate for most cameras.\n\nSystem Requirements\nFilmConvert for After Effects or Premiere works on CS5.5 and up.\n\nSample video : \n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://www.filmconvert.com/default.aspx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.filmconvert.com/default.aspx&lt;/a&gt;","torrent":{"xt":"urn:btih:7c5872831d0208db2acad1a4282a2943a04b46ab","amp;dn":"FilmConvert+Pro+1.2+plugin+%28After+Effects-Premiere%29+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c5872831d0208db2acad1a4282a2943a04b46ab","infoHashBuffer":{"type":"Buffer","data":[124,88,114,131,29,2,8,219,42,202,209,164,40,42,41,67,160,75,70,171]},"announce":[],"urlList":[]}}