{"title":"Negative Approach - Total Recall [1992] HxC","uid":3517516,"size":76063589,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7c6078f8ad68257a3ff8af779b28e9b01ce58b46&amp;dn=Negative+Approach+-+Total+Recall+%5B1992%5D+HxC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"byowt","files":38,"time":1156979228,"description":"TRACK LIST:\n\n   1. Lost Cause\n   2. Can&amp;#039;t Tell No One\n   3. Sick of Talk\n   4. Pressure\n   5. Why Be Something That You&amp;#039;re Not\n   6. Nothing\n   7. Fair Warning\n   8. Ready to Fight\n   9. Lead Song\n  10. What Ever I Do\n  11. Negative Approach\n  12. Tied Down\n  13. Hypocrite\n  14. Evacuate\n  15. Said and Done\n  16. Nothing\n  17. Your Mistake\n  18. Live Your Life\n  19. Friend or Foe\n  20. Dead Stop\n  21. I&amp;#039;ll Survive\n  22. Can&amp;#039;t Tell No One\n  23. What Ever I Do\n  24. Ready to Fight\n  25. Chaos\n  26. Pressure / Fair Warning\n  27. Lost Cause\n  28. Genocide / Nothing\n  29. Never Surrender\n  30. D.A.B.F.\n  31. Said and Done\n  32. Sick of Talk / N.A.\n  33. Your Mistake\n  34. Tied Down\n  35. I&amp;#039;ll Survive\n  36. Kiss Me Kill Me\n  37. I Got a Right\n  38. Tunnel Vision\n\n\nNegative Approach, from Detroit, Michigan, were one of the early hardcore bands in the Midwest. Pioneers of a brutal, nihilistic, and angry style of punk, they are regarded by many as &quot;the greatest hardcore band ever.&quot; It&amp;#039;s certainly a bold statement, but one that is also difficult to dispute...\n\nAlong with Maumee, OH&amp;#039;s Necros, N.A. were the undisputed champs of Midwestern hardcore in the early to mid-&amp;#039;80s. Legend has it that vocalist John Brannon recruited drummer OP Moore and the guitar/bass team of Rob and Graham McCulloch at a skate park sometime in 1981. Lead by the bald-headed Brannon&amp;#039;s hoarse wail, the band concocted an extreme sound devoid of frills that alternated between violent and mean. This was first fully documented in 1982 on their self-titled Touch and Go 7&quot;. The band released the more metallic-sounding Tied Down 12&quot; on Touch and Go in 1983, but died out in 1985 as Brannon incubated the Birthday Party blues of Laughing Hyenas. Unfortunately lacking the more widespread post-hardcore fame of peers Ian McKaye and Henry Rollins, Brannon&amp;#039;s Negative Approach has not gotten the later-day due often accorded Minor Threat and Black Flag. Negative Approach was certainly as influential as those two bands, touching everyone from Poison Idea to Sonic Youth to Los Crudos, as well as entire generations of hardcore fans in Boston and New York. The band was also as original and extreme as any early-&amp;#039;80s punk outfit -- the rhythmic crush created by Moore and the McCulloch brothers continues to be an undeniable steel-toe to the face. Touch and Go compiled the band&amp;#039;s discography as Total Recall in 1992, an essential listen for anyone who wants to understand hardcore.\n\nTotal Recall is Negative Approach&amp;#039;s complete discography - essential &amp;#039;80s hardcore with an impact that will always feel extreme. Minor Threat and Bad Brains traveled similar loud/fast ground, but NA were a direct line to pure hate and anger. The band never sounds cartoonish, just stripped-down and mean, a sound that could have only come from Detroit. &quot;Can&amp;#039;t Tell No One,&quot; &quot;Nothing,&quot; and just about every other studio track are hardcore anthems waiting to be discovered by the next confused kid who cannot stand a repressive world. The only lacking material on Total Recall comes from the live shows that round out the release. This is due to poor sound quality that makes them barely listenable, though the Stooges and Blitz covers are of historical note. The songs culled from the Touch and Go seven inch, the Process of Elimination compilation, and the Tied Down twelve inch however, are a powerful enough document to make Negative Approach matter well beyond the times that produced them.","torrent":{"xt":"urn:btih:7c6078f8ad68257a3ff8af779b28e9b01ce58b46","amp;dn":"Negative+Approach+-+Total+Recall+%5B1992%5D+HxC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c6078f8ad68257a3ff8af779b28e9b01ce58b46","infoHashBuffer":{"type":"Buffer","data":[124,96,120,248,173,104,37,122,63,248,175,119,155,40,233,176,28,229,139,70]},"announce":[],"urlList":[]}}