{"title":"Criticism of the Western Civilization - Collection 24 (Broken Ho","uid":7833331,"size":172398184,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c67d5c6ca4f2b146f55f24b528cade72fb14834&amp;dn=Criticism+of+the+Western+Civilization+-+Collection+24+%28Broken+Ho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"moman73","files":34,"time":1353129708,"description":"Criticism of the Western Civilization - Collection 24 (Broken Homes):\n\nThe news in the last 2 weeks were dominated by the scandal of Gen. Petraeus, the ex. army General and ex. CIA director, who was involved in a love triangle with two married women. The affair was exposed when the two women started competing for his affection and loyalty, and one of them sent threatening emails to the other.\n\nAll the parties involved in the Petraeus affair were married with children, and they displayed little or no respect towards: their spouses, their children, the sanctity of marriage, the 10 Commandments, the teachings of the Bible, or the integrity and reputation of the institution they belong to. Their marriages may survive divorce, but the damage is already done and it is irreparable. \n\nInfidelity is one of the major causes of broken homes. Other causes include: domestic violence, sexual abuse, alcoholism, drugs, economical problems, .. ; all of these are chronic problems in the Western civilization.\n\nWe have 34 titles here:\n\n-  Ahrons - We're Still Family; What Grown Children Have to Say About Their Parent's Divorce (2004)\n\n-  Benoit-Bryan - Over a Decade of Trends in Crisis Calls to the National Runaway Switchboard (2012)\n\n-  Bentovim - Safeguarding Children Living with Trauma and Family Violence (2009)\n\n-  Buchanan - Adolescents after Divorce (1996)\n\n-  Cantelo - It's No Big Deal Really; a Parent's Guide to Making Divorce Easy for Children (2007)\n\n-  Chalk &amp; King (Ed.) - Violence in Families; Assessing Prevention and Treatment Programs (1998)\n\n-  Clarke-Stewart &amp; Brentano - Divorce; Causes and Consequences (2006)\n\n-  Cunningham &amp; Baker - Little Eyes, Little Ears; How Violence against a Mother Shapes Children as They Grow (2007)\n\n-  Duncombe (Ed.) - The State of Affairs; Explorations in Infidelity and Commitment (2004)\n\n-  Eriksson (Ed.) - Tackling Men's Violence in Families; Nordic Issues and Dilemmas (2005)\n\n-  Family Violence and Homelessness; a Review of the Literature (2006)\n\n-  Flowers - Runaway Kids and Teenage Prostitution; America's Lost, Abandoned, and Sexually Exploited Children (2001)\n\n-  Glass &amp; Staeheli - Not Just Friends; Rebuilding Trust and Recovering Your Sanity After Infidelity (2003)\n\n-  Jacobs - All You Need is Love, and Other Lies about Marriage (2004)\n\n-  Jasinski - Hard Lives, Mean Streets; Violence in the Lives of Homeless Women (2010)\n\n-  Lawless - Women Escaping Violence; Empowerment through Narrative (2001)\n\n-  Lesbian, Gay, Bisexual and Transgender Youth; an Epidemic of Homelessness (2006)\n\n-  McClennen - Social Work and Family Violence; Theories, Assessment, and Intervention (2010)\n\n-  NCH - Domestic Violence and Homelessness (2009)\n\n-  NCH - Employment and Homelessness (2009)\n\n-  NCH - Substance Abuse and Homelessness (2009)\n\n-  Parrillo - Contemporary Social Problems, 6e (2005)\n\n-  Piorkowski - Adult Children of Divorce; Confused Love Seekers (2008)\n\n-  Sloan - Runaway Daughters; Seduction, Elopement, and Honor in Nineteenth-Century Mexico (2008)\n\n-  Smetana - Adolescents, Families, and Social Development; How Teens Construct Their Worlds (2011)\n\n-  Son - Information Packet; Runaway and Homeless Youth (2002)\n\n-  Spring - After the Affair; Healing the Pain and Rebuilding Trust When a Partner Has Been Unfaithful (1996)\n\n-  Stark - Coercive Control; The Entrapment of Women in Personal Life (2007)\n\n-  Stewart - Clean Break; How to Divorce with Dignity and Move On with Your Life (2008)\n\n-  Turkle - Alone Together; Why We Expect More from Technology and Less from Each Other (2011)\n\n-  Up Against a Wall; Coping with Becoming a Teen When You Have Been Maltreated as a Child (2009)\n\n-  Ventura &amp; Reed - Divorce for Dummies, 3e (2009)\n\n-  Warshak - Divorce Poison; Protecting the Parent-Child Bond from a Vindictive Ex (2001)\n\n\nNote:  \nWith this upload the project surpassed the 4000-titles mark. It is time to remind the new users that the objective of the project is to collect testimonies against Judeo Christianity, and the Western civilization. \nAlmost all of the testimonies were written by Western scholars and writers.\n\n","torrent":{"xt":"urn:btih:7c67d5c6ca4f2b146f55f24b528cade72fb14834","amp;dn":"Criticism+of+the+Western+Civilization+-+Collection+24+%28Broken+Ho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c67d5c6ca4f2b146f55f24b528cade72fb14834","infoHashBuffer":{"type":"Buffer","data":[124,103,213,198,202,79,43,20,111,85,242,75,82,140,173,231,47,177,72,52]},"announce":[],"urlList":[]}}