{"title":"Gardens of Revelation - Environments by Visionary Artists (Art E","uid":11490911,"size":35561529,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d87d5147d2c0ce04c10f55389b71524877adead&amp;dn=Gardens+of+Revelation+-+Environments+by+Visionary+Artists+%28Art+E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"STBGD","files":-1,"time":1416260915,"description":"Pdf / English / 1995 / 223 pages / 33.9 MB\n\nWith incisive intelligence and beguiling prose, John Beardsley tells the story of about twenty-five &quot;visionary environments&quot; and the fiercely independent individuals who have created them in the course of the last century. Many of these handmade environments - usually the result of years of obsessive work - express profoundly personal and frequently unorthodox beliefs. These gardens are often a form of persuasion, places to make public the creators' heartfelt ideas about past or future, politics or religion, sexual fulfillment or healthful living. The forms they take are varied and extraordinary, from luminous bottle villages to garishly painted temple compounds, from mock castles to miniature cities, from sculpture gardens populated with biblical and historical figures to artificial grottoes encrusted with glittering geodes. While capturing the spirit of each individual's unique creation, Beardsley also situates the work in the larger contexts of traditional garden design, religious architecture, environmental sculpture, and folk art. He muses about the compulsion to create, the sense of place, and the visionary spirit that has inflamed these artists, quoting at length their own poignant and pungent commentary on what they have created and why. The thought-provoking text combines with dazzling views of the far-flung gardens to make this a richly rewarding and often inspiring volume","torrent":{"xt":"urn:btih:7d87d5147d2c0ce04c10f55389b71524877adead","amp;dn":"Gardens+of+Revelation+-+Environments+by+Visionary+Artists+%28Art+E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d87d5147d2c0ce04c10f55389b71524877adead","infoHashBuffer":{"type":"Buffer","data":[125,135,213,20,125,44,12,224,76,16,245,83,137,183,21,36,135,122,222,173]},"announce":[],"urlList":[]}}