{"title":"Race The Sun (Latest With 1.42 Patch) (GOG)","uid":11157647,"size":26883480,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7daead92f456c3888e3f1e1e4d4761ec1bebdac2&amp;dn=Race+The+Sun+%28Latest+With+1.42+Patch%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Sarah116","files":-1,"time":1412466003,"description":"Hey guys, here the latest version of Race the sun. This is the latest version. Patch notes below. Hope you guys enjoy and please help seed.\n\n\n---------------\n\n\nChangelog: 1.42 Patch\n\n\n- Brand new, completely redesigned UI. Designed to work better with\ncontrollers, Keyboard, and Mouse navigation\n- TONS of bug fixes across the UI and game\n- Re-enabled user world portals\n- Lots of optimizations to the world generation. Should run smoother on\nolder PCs!\n\nFixes:\n- Fixed UI for French players (Sorry!)\n- fixed portal world bugs\n- Fixed most of the issues with editor world browser, and editor itself\n- hopefully fixed issues with options screen not saving your settings\n\nMajor Known issues remaining:\n- Robotoki decal doesn't unlock properly\n- Unsubscribing/deleting mods doesn't refresh screen properly\n- resolution isn't always properly detected in options screen\n- Not all menus can be navigated using Brass Monkey\n- Controller navigation in Options menu broken\n\nUnknown:\n- Tri collision is sometimes inconsistent. Let us know if you see issues!\n\n\n--------------\n\n\nYou are a solar powered craft, racing against the sunset at insane speeds. You navigate a procedural landscape that changes every day. You find and collect speed boosts to go even faster and momentarily reverse time. The goal is to increase your score and survive as long as you can without running out of daylight or smashing into pieces. For a change of pace, team-up with other players in an asynchronous relay race.\n\nThe Simplex World Creator is included right in the game and allows anyone to make unique new game modes (or modify existing ones) and share them in a special user worlds screen for all to see. The game also includes an extremely difficult world called Apocalypse and a deep player leveling system - with tons of objectives and 25 player levels to unlock. As you unlock items, you can customize your ship with attachments like faster turning, protective shield, and decals.\n\n\n   \n* Race at insane speeds through an infinite procedural world that changes every day.\n   \n* Complete objectives to level-up your ship and unlock upgrades (25 levels).\n    \n* Includes a built-in world creator so you can make your own worlds and share them with friends.\n    \n* Compete as a team in a multiplayer relay\n","torrent":{"xt":"urn:btih:7daead92f456c3888e3f1e1e4d4761ec1bebdac2","amp;dn":"Race+The+Sun+%28Latest+With+1.42+Patch%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7daead92f456c3888e3f1e1e4d4761ec1bebdac2","infoHashBuffer":{"type":"Buffer","data":[125,174,173,146,244,86,195,136,142,63,30,30,77,71,97,236,27,235,218,194]},"announce":[],"urlList":[]}}