{"title":"Home Alone 1 2 3 4 5 Lost in New York &amp; The Holiday Heist DV","uid":10938095,"size":5246009344,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7df28df356980192bdbcedc8b9f705384cb20365&amp;dn=Home+Alone+1+2+3+4+5+Lost+in+New+York+%26amp%3B+The+Holiday+Heist+DV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"MaxiDownloads","files":-1,"time":1409460747,"description":"Home Alone (1990)\nHome Alone is primarily a coming-of-age story about an 8-year-old boy named Kevin McCallister. He is the youngest of five children who is frequently tormented by his older brothers and sisters. After events transpire between him and his family, he wishes he had no family when his mother is punishing him for what he feels are unjustified reasons. She warns him to be careful what he wishes for. He wakes up the next day to discover he is the only one left in the house. He thinks his wish came true and that he is finally alone without his obnoxious family. In reality, he was left home by mistake. His family is en route to France for a holiday trip. While his parents realize their mistake and scramble to get back to the United States, Harry and Marv, a pair of thieves known as the &quot;Wet Bandits&quot;, attempt to rob the house and Kevin must foil them with a collection of homemade booby traps. They get arrested at the end of the film. The film became the highest-grossing film of 1990, grossing $476,684,675 worldwide.\n\nHome Alone 2: Lost in New York (1992)\nAbout a year later, Kevin and his family are taking yet another Christmas trip, this time to Florida. During the chaos at the airport, he gets separated from them and accidentally gets on a plane to New York City. After enjoying himself there for a while, he runs into Harry and Marv, who now call themselves the &quot;Sticky Bandits&quot;, have escaped from prison during a riot and end up in New York as well. This time, he leads them to a relative's house, which is undergoing renovation, and once again foils them with his booby traps, before they finally get arrested by NYPD.\n\nHome Alone 3 (1997)\nThis film does not revolve around Kevin, but centers on Alex Pruitt, a young boy who is home alone with the chickenpox, but gets better. At the same time, four burglars working for a North Korean terrorist group are sent by their boss to retrieve a top-secret microchip that can act as a cloaking device for a missile. They succeed in retrieving it and hide it in a remote controlled car, but due to a luggage mix-up at the airport with the Pruitts' neighbor Mrs. Hess, the car lands in the hands of Alex, who is given the car for shoveling the snow in her driveway. The burglars begin systematically searching every house on his street. Once they realize he has the chip, they prepare to invade his house. He devises elaborate traps and bamboozles the four crooks with the help of his pet rat, his brother's pet parrot, and some intricate tripwires, all the while monitoring them with a video camera on the race car.\n\nHome Alone 4 (2002)\nThe fourth installment was directed by Rod Daniel and premiered as a television film on ABC on November 3, 2002. This film returns to the original's main character, Kevin (played by Mike Weinberg), and one of the two Sticky Bandits, Marv (played by French Stewart). Kevin's parents have divorced, and he lives with his mother. He decides to go spend Christmas with his father and his rich girlfriend, Natalie, but finds himself having to deal with his old nemesis Marv, and his new sidekick wife, Vera (played by Missi Pyle), who replaces Harry since he and Marv put their partnership to an end. It was released to Region 1 DVD on October 20, 2003. Filming began on July 29 in Melbourne. Home Alone 4 is the first film in the series that was not theatrically released. The film was also panned worldwide by critics and fans of the first two films, for its low budget production and its inferior continuity to the first two films.\n\nHome Alone 5: The Holiday Heist (2012)\nOn March 15, 2012, ABC Family announced the development of the fifth installment in the Home Alone series. It premiered exclusively on ABC Family's Countdown to the 25 Days of Christmas on November 25, 2012. The film stars Christian Martyn, Jodelle Ferland, Malcolm McDowell, Debi Mazar and Eddie Steeples.The story centers on the family's relocation from California to Maine, where Finn becomes convinced that his new house is haunted. When his parents become stranded across town, Finn sets traps to catch his new home's ghosts, but instead proves troublesome for a group of three thieves (McDowell, Mazar and Steeples). Despite performing well in the ratings and being considered much better than its predecessor, Home Alone 4, the film still received mixed to reviews from fans and television critics.\n\n\n--- ALSO ---\n\nDo you like oldies? Check out MaxiMusic! MaxiMusic is a collection of popular and rare oldies from the 1910-2000's. Either search &quot;MaxiMusic&quot; on The Pirate Bay, or head over to this link:\n    &lt;a href=&quot;\nhttp://thepiratebay.se/user/MaxiMusic/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/MaxiMusic/&lt;/a&gt;\t","torrent":{"xt":"urn:btih:7df28df356980192bdbcedc8b9f705384cb20365","amp;dn":"Home+Alone+1+2+3+4+5+Lost+in+New+York+%26amp%3B+The+Holiday+Heist+DV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7df28df356980192bdbcedc8b9f705384cb20365","infoHashBuffer":{"type":"Buffer","data":[125,242,141,243,86,152,1,146,189,188,237,200,185,247,5,56,76,178,3,101]},"announce":[],"urlList":[]}}