{"title":"Santana - Abraxas (2000) [CD Rip] 320 vtwin88cube","uid":6192526,"size":126486074,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7e0099619601522fe51272aab076c0f47336852c&amp;dn=Santana+-+Abraxas+%282000%29+%5BCD+Rip%5D+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1298341412,"description":"\n\nSantana\nAbraxas (2000)\nOriginal Recording Remastered\n\n\nSantana is the primary exponent of Latin-tinged rock, particularly due to its combination of Latin percussion (congas, timbales, etc.) with bandleader Carlos Santana's distinctive, high-pitched lead guitar playing. The group was the last major act to emerge from the psychedelic San Francisco music scene of the 1960s and it enjoyed massive success at the end of the decade and into the early '70s. The musical direction then changed to a more contemplative and jazzy style as the band's early personnel gradually departed, leaving the name in the hands of Carlos Santana, who guided the group to consistent commercial success over the next quarter-century. By the mid-'90s, Santana seemed spent as a commercial force on records, though the group continued to attract audiences for its concerts worldwide. But the band made a surprising and monumental comeback in 1999 with Supernatural, an album featuring many guest stars that became Santana's best-selling release and won a raft of Grammy Awards.\n\nMexican-native Carlos Santana (born July 20, 1947, in Autlan de Navarro, Mexico) moved to San Francisco in the early '60s, by which time he was already playing the guitar professionally. In 1966, he formed the Santana Blues Band with keyboard player and singer Gregg Rolie (born June 17, 1947, in Seattle, WA) and other musicians, the personnel changing frequently. The group was given its name due to a musicians union requirement that a single person be named a band's leader and it did not at first indicate that Carlos was in charge. Bass player David Brown (born February 15, 1947, in New York, NY) joined early on, as did Carlos' high school friend, conga player Mike Carabello (born November 18, 1947, in San Francisco), though he did not stay long at first. By mid-1967, the band's lineup consisted of Carlos, Rolie, Brown, drummer Bob &quot;Doc&quot; Livingston, and percussionist Marcus Malone. The name was shortened simply to Santana and the group came to the attention of promoter Bill Graham, who gave it its debut at his Fillmore West theater on June 16, 1968. Santana was signed to Columbia Records, which sent producer David Rubinson to tape the band at a four-night stand at the Fillmore West December 19-22, 1968. The results were not released until almost 30 years later, when Columbia/Legacy issued Live at the Fillmore 1968 in 1997.\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tRock\nSource:\t\t\tRetail CD\nLabel:\t\t\tSony\nOriginal Release Date:\t1970\n\n\nThe San Francisco Bay Area rock scene of the late '60s was one that encouraged radical experimentation and discouraged the type of mindless conformity that's often plagued corporate rock. When one considers just how different Santana, Jefferson Airplane, Moby Grape, and the Grateful Dead sounded, it becomes obvious just how much it was encouraged. In the mid-'90s, an album as eclectic as Abraxas would be considered a marketing exec's worst nightmare. But at the dawn of the 1970s, this unorthodox mix of rock, jazz, salsa, and blues proved quite successful. Whether adding rock elements to salsa king Tito Puente's &quot;Oye Como Va,&quot; embracing instrumental jazz-rock on &quot;Incident at Neshabur&quot; and &quot;Samba Pa Ti,&quot; or tackling moody blues-rock on Fleetwood Mac's &quot;Black Magic Woman,&quot; the band keeps things unpredictable yet cohesive. Many of the Santana albums that came out in the '70s are worth acquiring, but for novices, Abraxas is an excellent place to start. \n\n\n01.Singing Winds, Crying Beasts\n02.Black Magic Woman/Gypsy Queen\n03.Oye Como Va\n04.Incident At Neshabur\n05.Se A Cabo\n06.Mother's Daughter\n07.Samba Pa Ti\n08.Hope You're Feeling Better\n09.El Nicoya\n10.Se A Cabo (Live)\n11.Toussaint L'overture (Live)\n12.Black Magic Woman/Gypsy Queen (Live)\n","torrent":{"xt":"urn:btih:7e0099619601522fe51272aab076c0f47336852c","amp;dn":"Santana+-+Abraxas+%282000%29+%5BCD+Rip%5D+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e0099619601522fe51272aab076c0f47336852c","infoHashBuffer":{"type":"Buffer","data":[126,0,153,97,150,1,82,47,229,18,114,170,176,118,192,244,115,54,133,44]},"announce":[],"urlList":[]}}