{"title":"PROPA PSP AUDIOWARE SUITE FULL SUITE FOR MAC OS X/AU/VST/RTAS -","uid":4300168,"size":234422071,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:7e1661ebc492431a9b310b889eb7547e13891be1&amp;dn=PROPA+PSP+AUDIOWARE+SUITE+FULL+SUITE+FOR+MAC+OS+X%2FAU%2FVST%2FRTAS+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"UrbanLeecha","files":1,"time":1216233531,"description":"PSP AUDIOWARE FULL SUITE\n\nAS REQUESTED BY POPULAR DEMAND, HERE IS A RE-POST OF THE  SAME TORRENT WITH ALL THE SAME PLUGINS BUT ZIPPED INTO A SINGLE STUFFIT FILE...AND JUST TO MAKE SURE, I&amp;#039;VE INCLUDED THE ORIGINL .dmg FILES WHICH IS WHY THIS TORRENT IS BIGGER.\n\n&amp;#039;What is this&amp;#039; i hear you ask... Nothing to do with Playstation Portable.\n\nPSP is a premiere developer of high quality audio effect and processor plug-ins for use in nearly any audio software. The &amp;#039;native&amp;#039; products have become integral tools for mixing and mastering audio for professional studios to home studios world.\n\nThese are basically very high quality audio plugins (reverb, EQ, Compressor, Delay, etc) for highend audio systems - Logic Pro 8, Cubast VST, Digidesign Pro Tools, and others that uie the AU/VST or RTAS format.\n\nPlugins in this torrent are:\n\n\n- PSP 608 Multidelay 1.1.2\n- PSP Easyverb 1.5.4\n- PSP MasterQ 1.5.2\n- PSP Mixpack 1.8.5 (old)\n- PSP Mixpack 2 inc. Mixgate 2.0.3\n- PSP Vintage Warmer 2.1.4 (nice !)\n- PSP Nitro 1.1.1\n- PSP Neon 1.5.0\n- PSP42 Lexicon 1.5.1\n- PSP84 Lexicon 1.5.2\n- Keygen for authorizing above (Mac applet not Windows so parallels desktop is NOT needed to launch the Keygen)\n\n\np/s the Mastercomp along with Xenon plugin is a premium bespoke plugin that u need an iLok USB hardware dongle so cannot be authorised using the keygen hence it&amp;#039;s not included in this Up.\n\n\n\n\nHow to use:\n-----------\n\nFirstly, note the Keygen in the main folder. this works for EVERY plugin provided here.\n\n    *\n    * These are the FULL original plugins as downloaded from PSP audioware website. The keygen provides codes to unlock the plugins, making them the full version.\n\n\n\n    *\n    * Have been tested on the latest version of Logic Pro 8 on Intel Macbook \n\n\n\n    *\n    * Universal Binary for Mac OSX\n\n\n\n\n    *\n    * When installing, select Easy/Custom Install, u can select to install only AU/VST or RTAS\n\n\n\nTo Install:\n------------\n\nInstall the individual plugins and then Authorize it. Simple.\n\nNote: when you authorise the plugin it will ask you for usr id and license key.\n\ngo to the Keygen and select the plugin u want to authorize\n\nPLEASE NOTE: try to copy and place the user id and license key to stop any spelling mistakes.\n\nIf you manually type the user id, note it is case sensitive.\n\nThe Userid is NEMESiS (with a small &amp;#039;i&amp;#039;). not nemesis or NEMESIS. This is the single biggest common mistake made by people trying to authorizew and if i get posted comments saying AUTH KEY DOESNT WORK, i shall cum round and bitchslap you.\n\n\n\nPSP AUDIOWARE FULL SUITE + Keygen MAC OSX AU/VST/RTAS - UB\n\nOnce again. this is MAC OS X ONLY and UNIVERSAL BINARY. so you can use it on Cubase VST or any platform as long as is on the Mac OSX.\n\nDoesn&amp;#039;t work with OS9\n\nprobably does work with old PowerPC G4 macs as is Universal Binary.\n\nThey all work with the latest version of Logic Pro 8\n\nPlease accept my apologies for the other Unzipped torrent. and good luck and keep seeding\n\nRegards - UrbanLeech","torrent":{"xt":"urn:btih:7e1661ebc492431a9b310b889eb7547e13891be1","amp;dn":"PROPA+PSP+AUDIOWARE+SUITE+FULL+SUITE+FOR+MAC+OS+X%2FAU%2FVST%2FRTAS+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e1661ebc492431a9b310b889eb7547e13891be1","infoHashBuffer":{"type":"Buffer","data":[126,22,97,235,196,146,67,26,155,49,11,136,158,183,84,126,19,137,27,225]},"announce":[],"urlList":[]}}