{"title":"Greg Iles  - True Evil (Retail)","uid":10354312,"size":673136,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7e4af5ae3125b8211ebbffedd827e74a2526d285&amp;dn=Greg+Iles++-+True+Evil+%28Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"TheRose88","files":1,"time":1402710922,"description":"Greg Iles  - True Evil - Retail (epub)\n\n\n&quot;If you wanted to kill your spouse and get away with it, you had to do something truly ingenious: something that wouldn't even be perceived as murder. And that was the service that Andrew Rusk had found a way to provide. Like any quality product, it did not come cheap. Nor did it come quickly. And perhaps most important of all, it was not for those with weak constitutions. Demand was high, of course, but few people were truly suitable clients. It took a deep-rooted hatred to watch your spouse die in agony, knowing that you had brought about that pain. But on the other hand, some people bore up remarkably well.&quot;\n\nWith these words, New York Times bestselling author Greg Iles returns to his trademark Southern milieu in this terrifying thriller, an unnerving tale of evil lurking beneath the veneer of idyllic suburban life. Brimming with the masterful suspense and intense psychological drama that made Turning Angel, Blood Memory, and The Quiet Game bestsellers, True Evil tells the chilling story of a divorce attorney who may be orchestrating the deaths of his clients' spouses, bringing new meaning to the phrase &quot;'til death do us part.&quot;\n\nDr. Chris Shepard is thirty-six years old, newly married, and well on his way to a perfect life. Or so he believes. But that future is forever cast into doubt the day Special Agent Alexandra Morse walks into his office and drops a bombshell: Dr. Shepard's beautiful new wife is plotting his murder. Shepard is so shocked that he almost throws Agent Morse out of his office. Yet once he is alone, doubt begins to gnaw at him. Paranoia magnifies the small cracks in his marital relationship, and soon he can have no peace unless he knows the truth. When Agent Morse reappears, Chris agrees to act as bait to help her unravel the divorce lawyer's scheme, which may already have cost nine unsuspecting spouses their lives.\n\nAt the center of the mystery lies a maddeningly simple question: If these people really were murdered, why can't the FBI prove it? Rigorous autopsies have uncovered no forensic evidence of foul play, and the police believe no crimes have occurred. As Dr. Shepard and Agent Morse struggle against an invisible adversary, Shepard realizes that he's working with a desperate woman. The reason: the killer's last known victim was Alex Morse's sister, who from her deathbed accused her husband of murder and extracted a vow that Alex save her ten-year-old nephew from his father. This has driven Alex to risk both her life and her career to fulfill that vow. But Chris Shepard soon feels desperation of his own. As he probes his wife's hidden past, he is confronted by the probability that the woman he loves wants him dead.\n\nHe has adopted her son and given her everything he has to give, and yet somewhere out there, a killer with the brilliance to outwit the top forensic scientists in the world is closing in on him.","torrent":{"xt":"urn:btih:7e4af5ae3125b8211ebbffedd827e74a2526d285","amp;dn":"Greg+Iles++-+True+Evil+%28Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e4af5ae3125b8211ebbffedd827e74a2526d285","infoHashBuffer":{"type":"Buffer","data":[126,74,245,174,49,37,184,33,30,187,255,237,216,39,231,74,37,38,210,133]},"announce":[],"urlList":[]}}