{"title":"Joshua Redman - Discography FLAC","uid":11268003,"size":9699916804,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7e58456544934a05cda3fa134c2e4ffc46a0d158&amp;dn=Joshua+Redman+-+Discography+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"eika256","files":-1,"time":1414049472,"description":"Joshua Redman - Discography\n\nEvery few years it seems as if the jazz media go out of their way to hype one young artist, overpraising him to such an extent that it is easy to tear him down when the next season arrives. In the early '90s, Joshua Redman briefly became a media darling, but in his case, he largely deserved the attention. A talented bop-based tenor man, Redman (who will probably never be an innovator) is a throwback to the styles of Red Holloway and Gene Ammons, but also has an inquisitive spirit and can play intriguing music when inspired.\nThe son of the great tenor saxophonist Dewey Redman, Joshua graduated from Harvard and after debating whether to become a doctor, he seemed headed toward studying law at Yale. However, he came in first place at the 1991 Thelonious Monk competition, landed a recording contract with Warner Bros., and was soon on the cover of most jazz magazines. Pat Metheny was a guest on one of his albums (the Redman-Metheny interplay during their engagements was quite memorable), and although Redman has had success constantly touring with his own group, it is a pity that his apprenticeship period as a sideman was so brief.\nIn 1996, Joshua Redman recorded and briefly toured with Chick Corea's &quot;Tribute to Bud Powell&quot; sextet; the solo Timeless Tales (For Changing Times) followed in 1998, and in 2000 he returned with Beyond. Passage of Time appeared in early 2001 and was followed by a lengthy tour of the U.S. The next year, Elastic appeared in stores with an uncharacteristically humorous sight gag adorning the cover. That also reflected on the music, which was more adventurous and playful than in the past, owing a debt to his electronica and experimental rock influences. In 2005, Redman made the move to Nonesuch and released Momentum. Back East followed in 2007, with Compass arriving early in 2009. Two years later, Redman appeared on the debut album from the jazz quartet James Farm, and in 2013, he delivered the orchestral album Walking Shadows. In 2014, he returned with the concert album Trios Live, featuring tracks from two separate performances; one at N.Y.C.'s Jazz Standard and the other at Washington's Blues Alley. (AllMusic)\n\nAlbum list:\n1993 - Introducing Joshua Redman\n1993 - Joshua Redman\n1993 - Wish\n1994 - Blues For Pat\n1994 - Captured Live!\n1994 - MoodSwing\n1995 - Spirit Of The Moment\n1996 - Freedom in the Groove\n1998 - Timeless Tales (For Changing Times)\n2000 - Beyond\n2001 - Passage Of Time\n2002 - Elastic\n2002 - Yaya3\n2005 - Momentum\n2005 - SFJazz Collective\n2006 - SFJazz Collective 2\n2007 - Back East\n2009 - Compass\n2011 - James Farm\n2013 - Walking Shadows\n2014 - Trios Live\n\nSplit tracks.\nEnjoy and share!","torrent":{"xt":"urn:btih:7e58456544934a05cda3fa134c2e4ffc46a0d158","amp;dn":"Joshua+Redman+-+Discography+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e58456544934a05cda3fa134c2e4ffc46a0d158","infoHashBuffer":{"type":"Buffer","data":[126,88,69,101,68,147,74,5,205,163,250,19,76,46,79,252,70,160,209,88]},"announce":[],"urlList":[]}}