{"title":"Satisfaction.TV.Series.S01.Full.10.Episodes","uid":4360510,"size":4278779614,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7e5f76d57653b1585bbeef52eafcb9edc9dd7198&amp;dn=Satisfaction.TV.Series.S01.Full.10.Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":4,"uploader":"vickfred","files":71,"time":1219622012,"description":"Promo Flash-Video Clips - included in torrent.\nPictures - included in torrent.\n\nFrom the nightly traffic of a city brothel to high-class escorts and their clients, Satisfaction explores the world of prostitution. Satisfaction is set in and around '232', an up-market city brothel. The show is centered around six high class escorts and their manager as they juggle the pressures of their private lives with their secret profession. The serial has been very successfull and a second season has started being shot at the and of July 2008. Added are a directory with Promo FLV movies + link to FLV player, a directory of pictures, a directory with 2 Word documents about the actors, characters, etc. \n\nMain cast: \nChloe : Diana Glenn \nNatalie : Kestie Morassi \nTippi : Bojana Novakovic \nHeather : Peta Sergeant \nMel : Madeleine West \nLauren : Alison Whyte \n\n======================================== \nSatisfaction - Episode 1 - Running Girl \nChloe's world begins to unravel when a long standing regular, Warwick, fails to turn up for his monthly visit. Surprisingly, it's this meek man and his 'disappearance' which exposes Chloe's insecurity and shakes her relationship with her long-term but frequently absent boyfriend Josh. Questions about family from her 14-year-old daughter Bonnie propel Chloe back to where it all began, in a dusty town with a passing truck driver. \n======================================== \nSatisfaction - Episode 2 - Mrs.Hyde \nHigh class escort Mel finds herself challenged by Johnny Lake, a rock star client with a huge ego and some damaging sexual problems. A drug fuelled night of psychological game-playing ends in Johnny verging on death and Mel seeking out her elusive lover Tim Kronenberg. When Tim suggests she come away with him, Mel is tempted by the security of someone she knows and loves. But just as she's considering her options, Mel discovers a destructive side to Tim he seems unwilling to change. \nMadeleine's 'older' voice and 'younger' body never worked in Neighbours but is slightly less vexatious in this show. Another great episode but lacked the variety of episode 1. \n======================================== \nSatisfaction - Episode 3 \nHeather and her partner Ally want to have a baby, using Ally's good friend Gary. But when Gary's new partner Eadie's troublesome attitude comes to light and legal contracts get waved around, Heather and Ally angrily end the arrangement. Heather devises an unusual solution which sends Ally into a tailspin. \n======================================== \nSatisfaction - Episode 4 \nThe harsh reality of 232 hits newly initiated Lauren in the face, and sees her scurry back to the familiarity of suburbia. But when Chloe pursues her, Lauren realises sex work will help her confront the breakdown of her marriage to Phil and some uncomfortable sexual issues. Returning to 232, Lauren regains her confidence, gets herself a thankful regular and develops the steel to order Phil out of her life \n======================================== \nSatisfaction - Episode 5 \nTippi is perplexed by a client, Aiden, who seems to be suppressing his sexual urges. Chloe comes clean with Bonnie about her work and Bonnie promptly shuts down. Thinking it will help, Chloe decides to cool things with Josh, but Bonnie is doubly annoyed. Lauren discovers Heather is pregnant and lends her support. Finally, Tippi learns the shattering truth about her mystery client. \n======================================== \nSatisfaction - Episode 6 \nTippi negotiates her relationship with Aiden, but realises there's no room for him in her life. Surprisingly, Bonnie gives Chloe the okay to go back to work. Pregnant Heather is offered some on-going support from Alex while one of Lauren's clients brushes up on his seduction skills, which she misinterprets as intended for her. \n======================================== \nSatisfaction - Episode 7 \nA constant stream of regulars greets Chloe on her return to work, as well as an old friend who reminds Chloe of her achievements. But at home she's rocked to discover Bonnie's dangerous internet activities. Lauren is shaken when her children announce they're moving to America with their father, while Heather's under pressure to sell the home she shared with Ally.Satisfaction is a Showcase original series about friendships, family, lust and love and is a series unlike anything seen on Australian television. Set in and around 232, an up-market city brothel, it reveals the world of five high-class escorts and their manager as they juggle the pressures of their private lives with their secret profession. The superb cast includes Diana Glenn, Kestie Morassi, Peta Sergeant, Alison Whyte, Robert Mammone and Nicholas Bell. \n======================================== \nSatisfaction - Episode 8 \nTippi embarks on an unusual adventure with a long term client, which becomes life-threatening. Meanwhile Mel finds a significant amount of money mysteriously deposited in her bank account and is further perplexed when she's faced with Nick's shady past. Heather moves in with Lauren, while Chloe's confusion continues over her relationship with Josh and Bonnie's attitude to her work. Troubled by Nick's overnight disappearance, Nat worries about her father's activities. \n======================================== \nSatisfaction - Episode 9 \nChloe, Bonnie and Josh begin counselling sessions. Josh proposes marriage, which fails to appease Chloe's troubled mind, but it's an unusual client who provides an unexpected insight for Chloe. Nat and Nick are faced with a huge tax bill, which puts a strain on their relationship, while Mel's lover Tim reappears and makes a claim on her. Lauren's former husband Phil tells her he needs to sell the family home and Heather's decision about the baby appears to be cemented. \n======================================== \nSatisfaction - Episode 10 \nNews that 232 is on the market inspires Lauren to lobby the girls to form a syndicate. Mel's disappointment in Tim propels her to contemplate ownership of the brothel and a committed relationship with Nick. Heather's decision about the baby is taken out of her hands, while a client and his wife help Tippi rediscover the fun in her work. As Nick prepares to set up house with Mel, an unexpected visitor from his past changes the course of Nick's life. \n========================================","torrent":{"xt":"urn:btih:7e5f76d57653b1585bbeef52eafcb9edc9dd7198","amp;dn":"Satisfaction.TV.Series.S01.Full.10.Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e5f76d57653b1585bbeef52eafcb9edc9dd7198","infoHashBuffer":{"type":"Buffer","data":[126,95,118,213,118,83,177,88,91,190,239,82,234,252,185,237,201,221,113,152]},"announce":[],"urlList":[]}}