{"title":"Talking Heads - The name of this band is Talking Heads (1982)","uid":3579899,"size":262063646,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7eb9bd849ed6de7642c7f9c3c9099c01be1a0378&amp;dn=Talking+Heads+-+The+name+of+this+band+is+Talking+Heads+%281982%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"drgmdp","files":34,"time":1166557564,"description":"Talking Heads - The name of this band is Talking Heads (1982) / 33 songs, live\n\n\nThe Name of This Band Is Talking Heads is a double live album originally released in 1982. The first album featured the original quartet in recordings from 1977 and 1979, and the second album the expanded ten-piece Talking Heads that toured in 1980 and 1981. It contains live versions of songs that appear on Talking Heads: 77, More Songs about Buildings and Food, Fear of Music, and Remain in Light.\n\nThe title of the album is the group&amp;#039;s response to the general public&amp;#039;s constant and incorrect reference to the band as &quot;The Talking Heads.&quot;\n\nAn expanded version of the record, on CD in the United States for the first time, was released in 2004 by Sire/Warner Bros./Rhino. It duplicated the pattern of the original with the first disc featuring the quartet alone, and the second disc a ten-member band. Additional tracks from 1978 are among the eight extra songs on the first disc, and correct running order for the set from the larger band on the second disc.\n\nThe original quartet of Talking Heads is David Byrne (vocals, guitar), Chris Frantz (drums), Jerry Harrison (guitar and keyboards), and Tina Weymouth (bass and keyboards). The added members to the expanded band are Adrian Belew (guitar), Nona Hendryx (vocals), Michael &amp;#039;Busta&amp;#039; Jones (bass), Dollette McDonald (vocals), Steve Scales (percussion), and Bernie Worrell (keyboards).\n\n\nfrom http://en.wikipedia.org/wiki/The_Name_of_This_Band_Is_Talking_Heads","torrent":{"xt":"urn:btih:7eb9bd849ed6de7642c7f9c3c9099c01be1a0378","amp;dn":"Talking+Heads+-+The+name+of+this+band+is+Talking+Heads+%281982%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7eb9bd849ed6de7642c7f9c3c9099c01be1a0378","infoHashBuffer":{"type":"Buffer","data":[126,185,189,132,158,214,222,118,66,199,249,195,201,9,156,1,190,26,3,120]},"announce":[],"urlList":[]}}