{"title":"Miami Sound Machine - Primitive Love 320cbr (Big Papi) 1985","uid":9476944,"size":96618044,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7fd08d73fc697cb173f27b74240f3dee152b891a&amp;dn=Miami+Sound+Machine+-+Primitive+Love+320cbr+%28Big+Papi%29+1985&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"Big-Papi","files":-1,"time":1389719658,"description":"Miami Sound Machine - Primitive Love 320cbr (Big Papi) 1985 (Size: 92.14 MB)\n\nSource; 1985 CD\n\n\n \t\t\n01 Miami Sound Machine - Body to Body.mp3\t9.22 MB\n \t\t\n02 Miami Sound Machine - Primitive Love.mp3\t10.95 MB\n \t\t\n03 Miami Sound Machine - Words Get in the Way.mp3\t7.99 MB\n \t\t\n04 Miami Sound Machine - Bad Boy.mp3\t9.1 MB\n \t\t\n05 Miami Sound Machine - Falling in Love (Uh-Oh).mp3\t9.24 MB\n \t\t\n06 Miami Sound Machine - Conga.mp3\t9.8 MB\n \t\t\n07 Miami Sound Machine - Mucho Money.mp3\t11.02 MB\n \t\t\n08 Miami Sound Machine - You Made a Fool of Me.mp3\t6.79 MB\n \t\t\n09 Miami Sound Machine - Movies.mp3\t6.93 MB\n \t\t\n10 Miami Sound Machine - Surrender Paradise.mp3\t11.09 MB\n\n\n\n\n \nBy Andre\n\n\nNow that review title is definitely not an original sentiment but it does sum up exactly how I feel about this album. Basically marking the second full on English language album by Gloria/Emilio Estefan and the Miami Sound Machine,this album differs in so many important ways from the last. Gloria was always a gifted vocalist,with a strong and expressive sound capable (as so many of her female contemporaries were not) in handling primarily uptempo/rhythmic tunes extremely well. Also Eyes of Innocence found her and the band essentially re-recording some of their earlier music with English lyrics along with a couple new singles. This represents an entirely new and fresh album. With a fresh sound to boot. In latin communities of all sorts around the country in the mid 80's a new style of dance-pop was emerging in much the same way it had in the rock community in the 60's and early 70's. It was called freestyle. And this presents the 80's end of that. It could be many things in many peoples hands. What it represented in this case was a pop friendly,melodic sound were rhythm and Emilio's percussion would be the order of the day.\n\nWe start out right in that area with &quot;Body To Body&quot;. This and &quot;Movies&quot; are both hyperactive 80's latin freestyle dance jams if I ever heard them. And they represent the era kindly. Honestly,from this point on the album is more potent and diverse than you might expect from the surface. The title song comes in closer to being 80's boogie funk/pop,with even a mild Italo disco influence. This really showcases how the band wish to showcase music for every kind of dancing in this particular generation. Of course the song most will tend to come into this album for is &quot;Conga&quot;,probably the song they'll always be known for. And considering how much of a freestyle classic it's become.....nothing could be better on this end. As far as the ballads go this has four excellent ones. &quot;Words Get In The Way&quot; is a song melodically challenging enough to showcase Gloria's emotive voice to it's best ability. On &quot;Falling In Love (Uh-Oh)&quot; it's more of a mid tempo and there's a firey quality to the presentation,along with the updated latino doo-wop flavor from the previous album.&quot;You Made A Fool Out Of Me&quot; has a subtle,folksy and almost non mid 80's presentation. The same could be said for the closing &quot;Surrender Paradise&quot;,a lovely song with song great jazz styled chords Gloria just takes to the limit!\n\n&quot;Bad Boy&quot; takes on the Holland/Dozier/Holland Motown soul shuffle to the best possible effect. The lyrics definitely reflects Gloria's more youthful sensibility than the more adult themes found elsewhere on the album. &quot;Mucho Money&quot; is a smoking,funky early hip-hop/freestyle number with some breakdance friendly beats and a prominent cuban flavor to boot. Generally in the world you have two types of pop music-the kind where the artists intentions are respected and the kind that sound like committee thinking. Not that people in the mid 80's were thinking HALF as much about WHERE the music they listened to came from. But this album certainly has the flavor of an eager to please band at the ready,offering up songs that could appeal to many sorts of personalities. But ones that also represented their Cuban heritage as well. This pretty much took the Miami freestyle scene from the dance/club scene onto the radio and onto MTV. And it did so by presenting songs with enough timeless melodies to make it hold up well as years passed. There are all too many out there who seem to go hog wild on criticizing 80's pop music just to do it. And once and awhile this album has fallen under that spell. Every decade has some contains some embarrassing pop music. On the other hand,it depends largely on the person listening how one defines that. And in this listeners opinion,this album could easily be just as creative and commercially workable today as it was in 1985.","torrent":{"xt":"urn:btih:7fd08d73fc697cb173f27b74240f3dee152b891a","amp;dn":"Miami+Sound+Machine+-+Primitive+Love+320cbr+%28Big+Papi%29+1985","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fd08d73fc697cb173f27b74240f3dee152b891a","infoHashBuffer":{"type":"Buffer","data":[127,208,141,115,252,105,124,177,115,242,123,116,36,15,61,238,21,43,137,26]},"announce":[],"urlList":[]}}