{"title":"J.J. Voskuil - Het Bureau (compleet, 7 boeken), NL Ebook(ePub), ","uid":6426994,"size":4113471,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:808ce9d0c4a9b797d8c333a376435795940dabfa&amp;dn=J.J.+Voskuil+-+Het+Bureau+%28compleet%2C+7+boeken%29%2C+NL+Ebook%28ePub%29%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"MeMar","files":-1,"time":1306509313,"description":"J.J. Voskuil - Het Bureau (compleet, 7-delig), NL Ebook(ePub), DMT\nAuteur: Johannes Jacobus Voskuil\nNederlands\nGenre: roman\nJaren van uitgifte: 1996 - 2000\n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/J.J._Voskuil_%28schrijver%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/J.J._Voskuil_%28schrijver%29&lt;/a&gt;\n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Het_Bureau&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Het_Bureau&lt;/a&gt; &lt;a href=&quot;\nhttp://www.bol.com/nl/s/boeken/zoekresultaten/Ntt/j.j.voskuil+het+bureau/search/true/searchType/qck/N/8299/Ntk/books_all/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bol.com/nl/s/boeken/zoekresultaten/Ntt/j.j.voskuil+het+bureau/search/true/searchType/qck/N/8299/Ntk/books_all/index.html&lt;/a&gt;\n\nDeze torrent bevat de hele romancyclus van J.J. Voskuil: Het Bureau.\n\nJ.J. Voskuil - Het bureau - 01 Meneer Beerta.epub\nJ.J. Voskuil - Het Bureau - 02 Vuile Handen.epub\nJ.J. Voskuil - Het bureau - 03 Plankton.epub\nJ.J. Voskuil - Het bureau - 04 Het A.P. Beerta instituut.epub\nJ.J. Voskuil - Het bureau - 05 En ook weemoedigheid.epub\nJ.J. Voskuil - Het bureau - 06 Afgang.epub\nJ.J. Voskuil - Het Bureau - 07 De dood van Maarten Koning.epub\n\nJ.J. Voskuil - Het bureau - 01 Meneer Beerta\nMeneer Beerta is het eerste del van Het Bureau, een roman in zeven delen, die de menselijke verhoudingen op \nen rondom een wetenschappelijk instituut tussen de jaren 1957 en 1987 tot onderwerp heeft.\n\nJ.J. Voskuil - Het Bureau - 02 Vuile Handen\nHoe gaan mensen die dag in dag uit moeten samenwerken op een bureau of kantoor met elkaar om? Het Bureau, \neen roman in zeven delen die zich afspeelt tussen 1957 en 1987, stelt ÃƒÂ©n beantwoordt die veelomvattende vraag.\nDit tweede deel, Vuile handen, beschrijft de jaren tussen 1965 en 1973.\n\nJ.J. Voskuil - Het bureau - 03 Plankton\nHoe gaan mensen die dag in dag uit met elkaar om? In Het Bureau, een roman in zeven delen die zich afspeelt \ntussen 1957 en 1987, stelt ÃƒÂ¨n beantwoordt J.J. Voskuil die veelomvattende vraag. Hij bedt zijn verhaal in \neen veelvoud van kleinere voorvallen in, die ogenschijnlijk een onontwarbare chaos, maar in feite een strak \ngestructureerd geheel vormen, die de lezer vanaf het begin dwingend voortstuwen naar het einde. In dit derde \ndeel, Plankton, neemt de druk op Maarten Koning om zijn proefschrift te schrijven toe, zoals ook van hem en \nzijn afdeling verlangd wordt om meer in de openbaarheid te treden, twee zaken waarvoor hij allergisch is. \nIn weerwil van de bezuinigingsmaatregelen die volgen op de oliecrisis van 1974 breidt de bezetting van het \nBureau zich steeds uit en wordt de koffieruimte steeds meer een ontmoetingsplaats. Met pijn en moeite komt \nMaarten tot het inzicht dat het werk op het Bureau het grootste deel van zijn leven vult en dat er onherroepelijk \neen grootste deel van zijn \n\nJ.J. Voskuil - Het bureau - 04 Het A.P. Beerta instituut\nIn zijn ruim 5000 bladzijden tellende roman Het Bureau - voor zover bekend de omvangrijkste roman ter \nwereld - stelt en beantwoordt J.J. Voskuil de simpele maar veelomvattende vraag hoe mensen die met elkaar \nmoeten samenwerken met elkaar omgaan:\n\nJ.J. Voskuil - Het bureau - 05 En ook weemoedigheid\nEn ook weemoedigheid omspant de jaren 1979-1982. Terwijl hoofdpersoon Maarten Koning in zijn vak steeds \nmeer aanzien krijgt, ziet hij de bestuurlijke problemen op het wetenschappelijk Bureau waar hij werkt \nalleen maar groeien. Bezuinigingspogingen leiden tot toenemende bureaucratisering en centralisering, die \nde schijn moeten wekken dat er doelmatig en op hoog niveau wordt gewerkt. Intussen dwingt de Vakbeweging \neen systeem van periodieke beoordelingen af, die de bedoeling hebben eventuele ontslagprocedures te vertragen. \nOnder deze druk moet Maarten oplossingen vinden voor de doelmatige besteding van de steeds schaarser wordende \nfinanciÃƒÂ«le middelen. Met zijn radicale voorstellen maakt hij zich niet geliefd bij de andere afdelingen op \nhet Bureau. De eisen die hij aan de kwaliteit van de productie stelt, verdiepen ook de scheuren binnen zijn \neigen afdeling, doordat een aantal van zijn mensen hem niet wil of kan volgen. \n\n\nJ.J. Voskuil - Het bureau - 06 - Afgang\nMet HET BUREAU houdt J.J. Voskuil vele duizenden lezers in zijn greep. De eerste vijf delen, verschenen \ntussen 1996 en 1999, werden alle bestsellers en waren dat bij de verschijning van dit zesde deel nog.\nIn AFGANG, dat de periode 1982-1987 omspant, ontladen de opgehoopte spanningen zich op alle niveaus. Als \nhoofd van zijn afdeling op het A.P. Beerta-Instituut stuit hoofdpersoon Maarten Koning op lijdelijk ÃƒÂ©n \nopenlijk verzet tegen het door hem gevoerde beleid. Dit leidt met een aantal medewerke... \n\nJ.J. Voskuil - Het Bureau - 07 - De dood van Maarten Koning\nIn dit laatste deel van Het Bureau ziet Maarten Koning zich al op de eerste dag na zijn afscheid gesteld \nvoor de vraag wat hij met zijn leven moet aanvangen. Hij begint met kleine klusjes in huis, merkt dat hij \ndaarbij Nicolien in de weg loopt die het ontwend is om de hele dag met zijn tweeÃƒÂ«n te zijn, loopt een blokje \nom, pakt de fiets en gaat een keer bij het Bureau langs om de drukproeven terug te brengen van het Bulletin, \nwaarvoor hij tot het eind van het jaar nog de verantwoordelijkheid heeft. Geleidelijk vindt hij een evenwicht, \nwaarin gevoelens van onbestemdheid afgewisseld worden door die van gelukzaligheid en vrijheid. Af en toe \nbezoekt hij het Bureau, waar hij plaatsneemt aan het bureau van Beerta, op de zolderkamer die men hem als \neen pied ÃƒÂ  terre gelaten heeft om het werk af te ronden voor de commissies waarvan hij nog deel uitmaakt \nzolang zijn opvolger niet is aangewezen en ingewerkt. Als die opvolger eenmaal is aangetreden, sluipt \ngaandeweg een gevoel van vervreemding binnen. Het gedrag van zijn vroegere medewerkers begint geleidelijk \nte veranderen. En als op een dag zijn zolderkamer ontruimd blijkt te zijn, ontwikkelen de gebeurtenissen, \ndie leiden tot het onthutsende slot, waarop de titel van dit deel de lezer al enigszins heeft voorbereid, \nzich snel.\n\nCategorie: Beeld\nFormaat: ePub\nTaal: Nederlands \nGenre:  Roman\n\nDeze boeken worden u aangeboden door:\n\nDUTCH MOVIE THEATER\n\n","torrent":{"xt":"urn:btih:808ce9d0c4a9b797d8c333a376435795940dabfa","amp;dn":"J.J.+Voskuil+-+Het+Bureau+%28compleet%2C+7+boeken%29%2C+NL+Ebook%28ePub%29%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"808ce9d0c4a9b797d8c333a376435795940dabfa","infoHashBuffer":{"type":"Buffer","data":[128,140,233,208,196,169,183,151,216,195,51,163,118,67,87,149,148,13,171,250]},"announce":[],"urlList":[]}}