{"title":"Jello Biafra and the Guantanamo School of Medicine - The Audacit","uid":5141297,"size":111420592,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:809927b9d6500dd9f0b2ede6bbdcb151a1653275&amp;dn=Jello+Biafra+and+the+Guantanamo+School+of+Medicine+-+The+Audacit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"zibbik","files":10,"time":1256951710,"description":"\nArtist: Jello Biafra &amp; The Guantanamo School Of Medicine\nAlbum: The Audacity of Hype\nYear: 2009\nGenre: Punk\nBitrate: 256 kbps\n\nTracklist:\n\n01. &quot;Terror of Tinytown&quot; - (4:36)\n02. &quot;Clean As A Thistle&quot; - (4:14)\n03. &quot;New Feudalism&quot; - (2:38)\n04. &quot;Panic Land&quot; - (4:21)\n05. &quot;Electronic Plantation&quot; - (5:45)\n06. &quot;Three Strikes&quot; - (6:05)\n07. &quot;Strength Through Shopping&quot; - (3:54)\n08. &quot;Pets Eat Their Master&quot; - (5:03)\n09. &quot;I Won't Give Up&quot; - (21:13)\n\n\nband:\n\nJello Biafra - Vocals\nRalph Spight - Guitar\nJon Weiss - Drums\nBilly Gould - Bass\nKimo Ball - Guitar\n\n\n\nLP set to be released October 20, 2009 on Alternative Tentacles\n\nQuote:\nInspired by Iggy Pop's 60th birthday gig at the Warfield in San Francisco, Biafra laid plans for his own 50th birthday party and finally decided it was time to start a band of his own. Ten years before he had been attempting the same thing with the likes of guitarist Ralph Spight (Victims Family, Freak Accident, Hellworms) and drummer Jon Weiss (Sharkbait, Horsey). They had also previously worked with basist Billy Gould (Faith No More) who was tapped for the new group. After cramming rehearsal for a month the four piece band known as Jello Biafra and the Axis Of Merry Evildoers took the stage in a sold-out two night stand at San Francisco's Great American Music Hall and subsequently spent the next 9 months in rehearsal for an album project. Before entering the studio guitarist Kimo Ball (Freak Accident, Carneyball Johnson, Mol Triffid, Griddle) was recuited and the resulting twin guitar attack took the groups sound to new, noisier heights. The quintet now known as Jello Biafra and The Guantanamo School of Medicine began recording tracks for the upcoming LP/CD &quot;The Audacity Of Hype&quot; slated for release in October 2009, produced by Biafra and engineered by Hip Hop legend and long time Jello co-conspirator Matt Kelley (Hieroglyphics, Tupac, Digital Underground, Victims Family) at Prairie Sun Recording in Cotati, CA and San Francisco's Hyde Street Studios.\n\nThe band's sound retains some of the the spy-music-on-meth chaos of the DK's while adding a healthy dose of Detroit style proto-punk mixed with layers of sonic guitar noise, and Weiss' industrial excursions into metal percussion. Topically, the album explores how our forced Iraqnophobia and Homeland Insecurity continues to feed lawlessness at the top (&quot;The Terror Of Tiny Town&quot; ) vs. a runaway police state and class war towards the bottom (&quot;Three Stirkes&quot;, &quot;Electronic Plantation&quot; ) . &quot;Clean As A Thistle&quot; becomes more timely every day as &quot;Family Values&quot; blowhards get caught in sinful trysts, while album closer &quot;I Won't Give Up&quot; offers an age of Obama anthem on how change comes from agitation from below, not glamor and soundbites from the top.\n\nThirty years on, Jello Biafra has made an album that solidifies and expands his uncompromising vision and updates it for the new century, with a powerhouse band that promises to be a terrifying live machine, featuring Jon's brother Andrew Weiss (Rollins Band, Ween, Butthole Surfers) filling the live bass position recently left vacant by Billy Gould's return to Faith No More. \n\n\n\nAll references to the music, placed above, are presented only for fact-finding listening .. so if you like it - buy it !\n\nAlways Support The Artists And Buy The Original Material And Erase Downloaded Files in 24 hours or less, The Albums Are Not My Uploads...\n\n\n\n","torrent":{"xt":"urn:btih:809927b9d6500dd9f0b2ede6bbdcb151a1653275","amp;dn":"Jello+Biafra+and+the+Guantanamo+School+of+Medicine+-+The+Audacit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"809927b9d6500dd9f0b2ede6bbdcb151a1653275","infoHashBuffer":{"type":"Buffer","data":[128,153,39,185,214,80,13,217,240,178,237,230,187,220,177,81,161,101,50,117]},"announce":[],"urlList":[]}}