{"title":"Too Late to Say Goodbye (Unabridged) by Ann Rule","uid":12326478,"size":174754054,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:80e7de17c2d069a9f7be0945d3410d0e71efb489&amp;dn=Too+Late+to+Say+Goodbye+%28Unabridged%29+by+Ann+Rule&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"kristi2374","files":1,"time":1441119783,"description":"A charming and briliant dentist,\ntied to two murders nearly two decades apart....\nA twisting case in which past and present colide....\n\n\nGo inside one of the most compelling double homicide investigations of our time with Ann Rule, who was given exclusive access inside the case of Bart Corbin, the &quot;handsome twin&quot; responsible for murder times two.\n\nBart Corbin appeared to share an idyllic life with his pretty wife, Jennifer: a home in an upscale Atlanta suburb, two adorable young sons. But there were secrets below the surface -- including an affair of Bart's that drove Jenn to look for love on the Internet -- that would prove deadly on the December morning Jenn was found with a single gunshot wound to her head. Police suspected suicide, but her disbelieving family knew Jenn had been excited to move on from Bart with someone she had met online. As disturbing clues emerged, a relentless county investigator dredged up a shattering revelation: fourteen years earlier, Bart Corbin's former girlfriend, lovely dental student Dolly Hearn, also died -- a gunshot wound to her head that was ruled a suicide. It was a chilling link in the chain that would ensnare the remorseless killer behind both tragic deaths: Bart Corbin.\n\nAnd if you think you know everything about this outright shocking case, discover the truth behind the headlines -- and one incredible irony on which the entire case turned -- in\n\nToo Late to Say Goodbye","torrent":{"xt":"urn:btih:80e7de17c2d069a9f7be0945d3410d0e71efb489","amp;dn":"Too+Late+to+Say+Goodbye+%28Unabridged%29+by+Ann+Rule","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80e7de17c2d069a9f7be0945d3410d0e71efb489","infoHashBuffer":{"type":"Buffer","data":[128,231,222,23,194,208,105,169,247,190,9,69,211,65,13,14,113,239,180,137]},"announce":[],"urlList":[]}}