{"title":"Mastering Celtx {BBS}","uid":7295710,"size":9560948,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:813715dace8aefbf1eca091103de0b3552a6fab7&amp;dn=Mastering+Celtx+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1337878620,"description":"Until recently, available screenwriting tools--built around traditional discrete roles and tethered to paper output--have struggled to keep up with the rapid changes in industry practices and needs. However, a new tool called Celtx (pronounced kel-tx) has embraced the industry's evolution and created a preproduction workspace that erases the boundaries between different conceptualizing and narrative-building tasks, such as storyboarding, outlining, media asset management, and scriptwriting. This book is for small-shop media professionals, independent film and video makers, media arts professors and students, ad-hoc media production teams, &quot;pro-am&quot; media creators, and aspiring screenwriters, storyboard artists, or comic book creators who want to maximize their creativity using Celtx. You will be introduced to the essential Celtx toolset (as well as to the Celtx Script app, Celtx Studio, and Celtx add-ons) and will learn how to apply Celtx to a variety of projects and workflows. A companion website includes downloadable practice files and images so you can work through the book's many tutorials. This is the only book you need to master Celtx and take your screenwriting and storyboarding projects to the next level.\n\n\n\nPaperback: 322 pages\nPublisher: Course Technology PTR; 1 edition (May 18, 2011)\nLanguage: English\nISBN-10: 1435459016\nISBN-13: 978-1435459014","torrent":{"xt":"urn:btih:813715dace8aefbf1eca091103de0b3552a6fab7","amp;dn":"Mastering+Celtx+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"813715dace8aefbf1eca091103de0b3552a6fab7","infoHashBuffer":{"type":"Buffer","data":[129,55,21,218,206,138,239,191,30,202,9,17,3,222,11,53,82,166,250,183]},"announce":[],"urlList":[]}}