{"title":"Yes Prime Minister Complete series (lovely DivX)","uid":5156331,"size":3774318012,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:81427a59386f9f0008208a077bb8a174a580c855&amp;dn=Yes+Prime+Minister+Complete+series+%28lovely+DivX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"mrizzo2","files":-1,"time":1257873494,"description":"Im happy to say that we accomplished many completions on the re-launch\nof a consolidated &quot;Fawlty Towers&quot; complete collection quite literally &quot;overnight&quot;.\nWe hope for your continued seeding support as the torrent launch was an\ninstant success from all accounts.\n\nWith respect to our re-launches of complete series offerings, please note\nthat if you've previously downloaded these as individual episodes/volumes\nfrom our past torrent postings, You should consult someone if you need to\nlearn how to slip those folders into this torrent to help seed, (after you\nget anything more that you might have previously missed downloaded), so you\nhavent wasted a thing! In which case you'd need to use the torrent -recheck\nfacility in your software to verify anything thats missing for you to\nbegin to seed. ta!!\n\nSame goes for our re-launches of our best movie successes of the past,\nas in many cases we've only added a folder with an image of the DVD jacket, etc\nWe have however made them all multi-tracker enabled in our re-launch program.\n\n\n&quot;Yes Prime Minister&quot; is the best of comedy that thre is to be found - British!\nIt ranks with &quot;Fawlty Towers&quot; in its popularity among many if not most\nand is bloody great entertainment for which there can be no acceptable\nsubstitute of resempling quality.\n\nThis entire collection of ALL Yes Prime Minister episodes from the complete\nDVD collection is in efficient DivX format to save downloading time and bother.\nLovely picture and sound, and you could even downlod yourselves a software\nconverter (if needed) for your video ipod, perhaps! &quot;Yes Minister&quot; will also\nre-launch as a complete collection in due course once we are adequately seeding\non this torrent of Yes Prime Minister. Maigret will follow soon.\n\nPick and choose from the episodes on the torrent file, or go for all\nat once, its all the same (you can simply activate one episode at a time\nwhile going for the whole nine yards). Thanks for seeding to everyone\nthats wanting to be intitiated or to enjoy this whenever they wish!! ta!!\n\nMichael Rizzo Chessman\nReviews: moviesbyrizzo.info\n\nOptional Note: This is a multi-tracker torrent\nIf you use utorrent software, simply highlight the mounted torrent, then\nclick on &quot;trackers&quot; in your software, next, right click on the tracker that\nis showing, and select &quot;add tracker&quot; You should then then see all the trackers\nthat are alreay included atthe outset. Place a space (blank line) between each\ntracker showing, then click &quot;ok&quot; Your trackers will now show status and update\nmore easily when required (if desired, right click manually, on a selected\ntracker/DHT and select &quot;update&quot; for a better read).\n\nPS If you enable &quot;show alternating background color&quot; in your preferences\nmenu for &quot;UI settings&quot;, you'll find your screen easier on the eye and more\npleasing to read. Enjoy!","torrent":{"xt":"urn:btih:81427a59386f9f0008208a077bb8a174a580c855","amp;dn":"Yes+Prime+Minister+Complete+series+%28lovely+DivX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81427a59386f9f0008208a077bb8a174a580c855","infoHashBuffer":{"type":"Buffer","data":[129,66,122,89,56,111,159,0,8,32,138,7,123,184,161,116,165,128,200,85]},"announce":[],"urlList":[]}}