{"title":"Republic: The Revolution - GOG","uid":8357066,"size":864155417,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8152f362cd2ad1979abe1ac48d92c92bfbc10e95&amp;dn=Republic%3A+The+Revolution+-+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1365523734,"description":"Republic: The Revolution - GOG Release\nPublisher: EidosInc | Developer: ElixirStudios | Released: Aug 27 2003 | Size: 822 MB | Platforms: Windows\nGenre: Action Simulation\n\n\nIn Republic: The Revolution, you must rise to power in a former Soviet state using political and coercive means.\nThe game opens showing you the current dictator of the country of Novistrana, and what horrible acts he commits against the populace, including giving an order to abduct your entire family.\nYou are then presented with ten multiple choice questions.\nAnswer carefully! Your answers will determine who your character is and how he acts.\nAt the outset, you are a nobody.\nYour first job is to hire some henchmen you can order around.\nOnce you hire some people, you can instruct them to perform various acts to help gain support.\nSome of these acts include bribing officials (bribe the police chief so he'll look the other way), intimidate people, commit assault, arson, and even murder (only when you have to).\nThere are also peaceful ways of gaining support, such as attending charity gala's or donating money to a worthy cause.\nYou can hire someone to go around plasting posters, gaining political support, or you can hire a person to go door-to-door advertising you and what you stand for.\nYou can hire a boxer to fight for you, tell him how aggressive you want him to be, and if he wins, more support for you.\nIf not, well, there's always blackmail.\nThe main campaign has you trying to overthrow the current president so that you may take control of the country.\nYou'll have to go through three different cities to reach your ultimate goal, each one harder and larger than the one before it.\nMost of the game takes place in an open-ended 3D environment, where you can walk (or drive) around.\nEverybody in the game, from the man in the store to the old lady in the walker, has a name and political alignment, and it's your job to make sure they see things your way.\nWhen push comes to shove, and the current president tries to get rid of you, you can initiate a peaceful protest and stand in front of tanks, blocking their path.\nWhether they stop or not is dependent on how the military likes you.\nThere are multiple ways to finish the game, guaranteeing a couple of replays.\nYou can go through the game completely neutral, or you can go all out, committing terrorist acts and inciting national riots.\nVictory means the presidency.\nYou don't want to know what happens if you lose....\n\nMinimum System Requirements\n\nOS: Windows 98/ME/2000/XP\nProcessor: 800 MHz\nMemory: 512 Mb\nHard Drive: 1 Gb free\nVideo Memory: 32 Mb\nSound Card: DirectX CompatibleDirectX: 8.1\nKeyboard&amp;Mouse\n\nInstallation\n\n1. Install\n2. Play (NO DRM IN ANY GOG RELEASE! EVER!)\n","torrent":{"xt":"urn:btih:8152f362cd2ad1979abe1ac48d92c92bfbc10e95","amp;dn":"Republic%3A+The+Revolution+-+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8152f362cd2ad1979abe1ac48d92c92bfbc10e95","infoHashBuffer":{"type":"Buffer","data":[129,82,243,98,205,42,209,151,154,190,26,196,141,146,201,43,251,193,14,149]},"announce":[],"urlList":[]}}