{"title":"Mystery Jets - Discography (2006-2012) [FLAC]","uid":8750703,"size":1705499622,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:816fd35a931446b8ac1727d20c4e2c49df209c3e&amp;dn=Mystery+Jets+-+Discography+%282006-2012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"politux","files":-1,"time":1375024277,"description":"\n  Mystery Jets - Discography (2006-2012) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 800 - 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  2006 Making Dens\n  2007 Zootime\n  2008 Twenty One\n  2010 Serotonin\n  2012 Radlands\n\n  The Syd Barrett-worshiping indie outfit Mystery Jets formed in the early '90s when the group's shock-headed frontman, Blaine Harrison, was only 12. The band was initially called the Misery Jets, in honor of the Heathrow-bound jets that habitually roared over their native Eel Pie Island, but they changed their name when Blaine (who, again, was very young at the time) misspelled &quot;misery.&quot; The Mystery Jets were essentially a family project, with Blaine on drums; Blaine's dad, Henry Harrison, on bass; and Blaine's friend William Rees on guitar. Henry eventually switched from bass to guitar, Kai Fish joined up as the group's bassist, and Blaine switched from drums to keyboards. The group tried out a drum machine and a local kid named Max before finally latching onto drummer Kapil Trevedi. \n\n  Five Tracks EP, recorded soon after Trevedi joined the group, was released on 679 Records in 2005, and their first full-length album, Making Dens, was released the following year. Zootime, a collection of Making Dens tracks plus remixes and songs from 2006 EPs such as You Can't Fool Me Dennis and Diamonds in the Dark, was released by Dim Mak in spring 2007. Released in 2008, Twenty One peaked at number 42 on the U.K. albums chart and boasted the single &quot;Young Love,&quot; featuring indie folk queen Laura Marling. The band's third full-length, Serotonin, arrived in 2010. Following a secret show at the 2011 SXSW festival, the band set up a mobile studio and recorded the Texas-informed Radlands record, which was released in April of 2012. Shortly before the release of the album, Fish left the band, replaced by Pete Cochrane for their upcoming UK tour.","torrent":{"xt":"urn:btih:816fd35a931446b8ac1727d20c4e2c49df209c3e","amp;dn":"Mystery+Jets+-+Discography+%282006-2012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"816fd35a931446b8ac1727d20c4e2c49df209c3e","infoHashBuffer":{"type":"Buffer","data":[129,111,211,90,147,20,70,184,172,23,39,210,12,78,44,73,223,32,156,62]},"announce":[],"urlList":[]}}