{"title":"The Atlantics - Bombora 1963 [Instrumental Surf Rock]","uid":4863508,"size":43384070,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:81c77055df848a2f3048bd924a4c1d0cb95fd117&amp;dn=The+Atlantics+-+Bombora+1963+%5BInstrumental+Surf+Rock%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Iron_Horse","files":14,"time":1240366139,"description":"The Atlantics - Bombora 1963 [Instrumental Surf Rock]\nLP To Mp3 192 mbit/s\nIncluded: CD Front Cover and this Info\n\nThis is the best Instrumental Surf Rock you can get, if are tierd of all shadows and ventures records !!\n\nBiography by Richie Unterberger allmusic.com\nOne of the greatest instrumental surf groups did not even hail from America. The Atlantics, despite their name, were an Australian combo who not only emulated the sound of California surf music, but ranked among its very best practitioners. Featuring a reverb-heavy, extremely &quot;wet&quot; sound, the Atlantics attacked original material, standards, and movie themes with a nervy blend of precision and over-the-top intensity. As in Dick Dale's music, touches of Middle Eastern influences can be detected in the rhythms of melodies (some members of the group claimed Greek and Egyptian heritage). Their second single, &quot;Bombora,&quot; went to the top of the Australian charts in 1963, and the follow-up, &quot;The Crusher,&quot; was also a big hit. But Beatlemania spelled commercial death for the Atlantics, as it did for U.S. surf combos, in 1964 and 1965. After several albums and a few more equally fine instrumental singles, the Atlantics became a vocal group in the last half of the '60s, but are most renowned for their instrumental recordings.\n\nThe Atlantics were an Australian surf rock band in the early 1960s and arguably Australia's most successful of the genre. Most well-known for their classic hit, &quot;Bombora&quot;, their later recordings such as &quot;Come On&quot; are examples of 1960s garage rock. They were the first Australian rock band to write their own hits. In 2000 the group reformed with three of the original members, and they are still actively releasing new material and performing live.\n\nHistory Early years\nFormed in the southern beachside suburbs of Sydney, Australia in early 1961, the group began performing locally, and soon gained an enthusiastic following. Contrary to the accepted surfing connotations of their name they actually took their name from a local brand of petrol, Atlantic. In early 1962 they appeared on a local television show New Faces, where they were voted &quot;Most Promising Group of 1962.&quot; They signed a deal with booking agent Joan King, who convinced the members to quit their day jobs and produce a demo, which she shopped to a variety of record labels. After several rejections, they were signed to CBS Records in 1963. The A&amp;R representative for CBS, Sven Libaek, was especially impressed by the group's original compositions. Most Australian instrumental rock bands at the time merely aped and covered material from The Shadows or, to a lesser extent, The Ventures. The Atlantics had the advantage of having twin lead guitarists, both highly proficient on solo work and both capable of pushing the band along with a driving rythmn. It was this, together with the band members European cultural influences (largely Greek with some Yugoslav and Hungarian - all members came to Australia as child migrants) that gave their music that passionate edge over other local bands of their day.\n\nIn February 1963, CBS released the first single, &quot;Moon Man&quot; b/w &quot;Dark Eyes&quot;. &quot;Moon Man&quot; was an original song written by Peter Hood, and &quot;Dark Eyes&quot; was a traditional tune reinterpreted by the band. While the single was not a hit, it did gain enough attention for CBS to agree to continue to support the group.\nRead more on: http://en.wikipedia.org/wiki/The_Atlantics\n\nClassic lineup 1962-1970\nPeter Hood - Drums -1961 to present\nTheo Penglis - Lead &amp; Rhythm guitar, later Keyboards 1961-1970\nBosco Bosanac - Bass - 1961 to present\nJim Skiathitis - Lead &amp; Rhythm guitar 1962 - present\n\nOther members\nJohnny Rebb - Lead Vocals - 1965-1970\nEddie Matzenik - Guitar - 1961-1962\nBrian Burns - Guitar 1985\nMartin Cilia - Guitar- 1999 to present (new member, replaced Theo Penglis in current group)\n\nTracklist:\n01. Bombora\n02. Adventures in Paradise\n03. The Gremlin King\n04. Dark Eyes\n05. Glassy Walls\n06. Turista\n07. Surfer's Paradise\n08. Bluebottles\n09. The World Is Waiting for the Sunrise\n10. Free Fall\n11. Greensleeves\n12. Moon Man","torrent":{"xt":"urn:btih:81c77055df848a2f3048bd924a4c1d0cb95fd117","amp;dn":"The+Atlantics+-+Bombora+1963+%5BInstrumental+Surf+Rock%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81c77055df848a2f3048bd924a4c1d0cb95fd117","infoHashBuffer":{"type":"Buffer","data":[129,199,112,85,223,132,138,47,48,72,189,146,74,76,29,12,185,95,209,23]},"announce":[],"urlList":[]}}