{"title":"Billy Joel 2000 Years: Millennium Concert [Live] 2-CD Set","uid":9463335,"size":267462103,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:821b329fb14ba6d7d8c0ac2bc0d68c33d369a74c&amp;dn=Billy+Joel+2000+Years%3A+Millennium+Concert+%5BLive%5D+2-CD+Set&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Big-Papi","files":29,"time":1389392919,"description":"Source: 2000 2-Disc Set CD's\n\n\n\n\nFrom Ray\n\n2000 YEARS: THE MILLENNIUM CONCERT brings out the best of the legendary Long Island-born rocker and balladeer. Billy Joel has always been at his finest in live performance, and his shows have gotten even better over the years. This double-CD set captures the vitality and broad musical mastery that characterizes Joel's shows, as well as a very special moment in time, the turn of the millennium. (The crowd's countdown to the year 2000 immediately follows the performance of the song &quot;2000 Years.&quot;) Highlights include some choices in set selection that veer from the norm: &quot;2000 Years,&quot; &quot;Don't Ask Me Why,&quot; &quot;Big Man on Mulberry Street,&quot; &quot;This Night,&quot; and &quot;I Go to Extremes,&quot; and also rollicking covers of &quot;Dance to the Music&quot; and &quot;Honky Tonk Woman.&quot; What's missing? Well, &quot;Piano Man,&quot; Joel's signature song, is a big omission. (It's not on the KOHUEPT recording either; the only live performance of &quot;Piano Man&quot; officially released by Columbia House is on the bonus fourth CD of THE COMPLETE HITS COLLECTION set.) Still, Joel provides a set of brilliant performances on 2000 YEARS: THE MILLENNIUM CONCERT. The performances are energetic and crisp, and the recording's sound and Joel's voice are both in excellent form. This is an absolutely essential set for Joel's fans, a magnificent final release (if it indeed turns out to be that) of Joel's rock 'n' roll career, and a outstanding way for new fans to start a Billy Joel collection.","torrent":{"xt":"urn:btih:821b329fb14ba6d7d8c0ac2bc0d68c33d369a74c","amp;dn":"Billy+Joel+2000+Years%3A+Millennium+Concert+%5BLive%5D+2-CD+Set","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"821b329fb14ba6d7d8c0ac2bc0d68c33d369a74c","infoHashBuffer":{"type":"Buffer","data":[130,27,50,159,177,75,166,215,216,192,172,43,192,214,140,51,211,105,167,76]},"announce":[],"urlList":[]}}