{"title":"BBC The Hunt 7of7 Living with Predators 1080p x264 AAC HDTV MVGr","uid":12986864,"size":1778397178,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:824adc3f76746977d2d227ffee1ccec32b1b1aa0&amp;dn=BBC+The+Hunt+7of7+Living+with+Predators+1080p+x264+AAC+HDTV+MVGr&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"MVGroup","files":1,"time":1450090750,"description":"The Hunt (BBC)\r\n\r\nNature Documentary hosted by David Attenborough, published by BBC in 2015 - English narration. \nhttp://docuwiki.net/images/b/be/The-Hunt-BBC-Cover.jpg\r\n\r\nInformation\r\n------------------------------\r\nThe Hunt takes an intimate and detailed look at the strategies employed by hunters to catch their prey, and the hunted to escape. Contests between predators and prey are among the most dramatic events in nature.\r\n\r\n1)  The Hardest Challenge \r\nThis episode reveals the extraordinary range of techniques predators use to catch their prey - from a leopard using all its powers of stealth to stalk impala in broad daylight to wild dogs, whose tactic is to wear down their prey over long distances; from Nile crocodiles, perhaps the planet's most patient predators, to killer whales who use teamwork and intelligence to take on humpback whales. But even with these finely tuned strategies, the outcome is far from certain. Most predators fail most of the time.\r\n\r\n2)  In the Grip of the Seasons (Arctic) \r\nThis episode looks at the challenges of hunting in the Arctic, the most seasonal place on Earth. To a predator, seasonal change is a problem. It means that all the parameters of the hunt - the conditions, the strategies, the prey - change too. The only option for the Arctic's top predators, the wolf, the Arctic fox and the polar bear, is to continually adapt to their changing world, exploiting the good times and enduring the bad.\r\n\r\n3)  Hide and Seek (Forests) \r\nThis episode follows tigers, harpy eagles, chimpanzees, army ants and other predators as they rise to the challenge of hunting within the forest - a dense, confusing, three-dimensional world, one in which even finding prey is a maddening task. The prize for succeeding at nature's great game of hide-and-seek is one worth winning. Forests cover one third of the land surface, and concealed within are over half of the species on Earth.\r\n\r\n4)  Hunger at Sea (Oceans) \r\nThis episode follows blue whales, sharks, sea lions, frigatebirds, dolphins and albatrosses to reveal the strategies they use to hunt for prey in the big blue. The open ocean is an immense wilderness that covers more than half the surface of our planet, yet for the most part it's a watery desert, largely devoid of life. Predators face an endless search to find and catch food, yet these great tracks of ocean are home to some of the most remarkable hunters on the planet.\r\n\r\n5)  Nowhere to Hide (Plains) \r\nHalf of all land is desert or grassland. In these, the most exposed habitats on our planet, predators like cheetahs, bald eagles and lions can usually see their prey. But it works both ways: the prey can see them too. With nothing but open vistas the element of surprise is hard-won, and predators must make their own opportunities. Nowhere to Hide explores the strategies of predator and prey in the open arena.\r\n\r\n6)  Race Against Time (Coasts) \r\nThe coast is the dynamic border between land and sea. Powered by the tides and thrashed by waves, this is a world of continuous change. Opportunities never last long here, so hunters are always in a race against time. The coast is the only place on the planet where predators from air, land and sea come together. Dolphins that leave the safety of the sea to fish, walking octopuses, ingenious monkeys, fishing wolves and the greatest gathering of feeding humpback whales come to the coast to hunt. For all, timing is everything.\r\n\r\n7)  Living with Predators (Conservation) \r\nThis final episode of the series visits the frontline of the conflict with the world's top predators, meeting the scientists fighting to save them. Crossing five continents and combining landmark natural history footage with real-life human drama, it checks the pulse of the earth's iconic animals, including lions, tigers, polar bears and blue whales. With three-quarters of the planet's carnivores now in decline, can people find ways to live with predators before they disappear forever?\r\n\r\nScreenshots\r\n------------------------------ \nhttp://docuwiki.net/images/0/06/The-Hunt-BBC-Screen0.jpg \nhttp://docuwiki.net/images/1/13/The-Hunt-BBC-Screen1.jpg \nhttp://docuwiki.net/images/9/9e/The-Hunt-BBC-Screen2.jpg \nhttp://docuwiki.net/images/6/63/The-Hunt-BBC-Screen3.jpg \nhttp://docuwiki.net/images/0/0b/The-Hunt-BBC-Screen4.jpg \nhttp://docuwiki.net/images/9/91/The-Hunt-BBC-Screen5.jpg \nhttp://docuwiki.net/images/c/c0/The-Hunt-BBC-Screen6.jpg \nhttp://docuwiki.net/images/9/93/The-Hunt-BBC-Screen7.jpg \nhttp://docuwiki.net/images/1/1a/The-Hunt-BBC-Screen8.jpg \r\n\r\nTechnical Specs\r\n------------------------------\r\n * Video Codec: x264 CABAC   \r\n * Video Bitrate: CRF 24 (~4000Kbps)\r\n * Video Aspect Ratio: 16:9\r\n * Video Resolution: 1920x1080\r\n * Frames Rate: 25 FPS\r\n * Audio Codec: AAC-LC\r\n * Audio Bitrate: 192Kbps ABR 48KHz\r\n * Audio Channels: 6\r\n * Run-Time: 58 mins\r\n * Number of Parts: 7\r\n * Part Size: 1.80 GB (average)\r\n * Source: HDTV\r\n * Subtitles: Merged\r\n\r\nLinks\r\n------------------------------ \nhttp://www.bbc.co.uk/programmes/p0342d1x","torrent":{"xt":"urn:btih:824adc3f76746977d2d227ffee1ccec32b1b1aa0","amp;dn":"BBC+The+Hunt+7of7+Living+with+Predators+1080p+x264+AAC+HDTV+MVGr","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"824adc3f76746977d2d227ffee1ccec32b1b1aa0","infoHashBuffer":{"type":"Buffer","data":[130,74,220,63,118,116,105,119,210,210,39,255,238,28,206,195,43,27,26,160]},"announce":[],"urlList":[]}}