{"title":"Cinematic Mythmaking: Philosophy in Film - Irving Singer.pdf","uid":10534960,"size":2012928,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82537dd6d3653b4af63b1ffb773e7e5891cabebc&amp;dn=Cinematic+Mythmaking%3A+Philosophy+in+Film+-+Irving+Singer.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1405150874,"description":"Film is the supreme medium for mythmaking. The gods and heroes of mythology are both larger than life and deeply human; they teach us about the world, and they tell us a good story. \nSimilarly, our experience of film is both distant and intimate. Cinematic techniques--panning, tracking, zooming, and the other tools in the filmmaker's toolbox--create a world that is unlike reality and yet realistic at the same time. We are passive spectators, but we also have a personal relationship with the images we are seeing. \n\nIn Cinematic Mythmaking, Irving Singer explores the hidden and overt use of myth in various films and, in general, the philosophical elements of a film's meaning. Mythological themes, Singer writes, perform a crucial role in cinematic art and even philosophy itself. Singer incisively disentangles the strands of different myths in the films he discusses. \nHe finds in Preston Sturges's The Lady Eve that Barbara Stanwyck's character is not just the biblical Eve but a liberated woman of our times; Eliza Doolittle in the filmed versions of Shaw's Pygmalion is not just a statue brought to life but instead a heroic woman who must survive her own dark night of the soul. The protagonist of William Wyler's The Heiress and Anieszka Holland's Washington Square is both suffering Dido and an awakened Amazon. \n\nSinger reads Cocteau's films--including La Belle et la Bte, Orphe, and The Testament of Orpheus--as uniquely mythological cinematic poetry. He compares Kubrickean and Homeric epics and analyzes in depth the self-referential mythmaking of Federico Fellini in many of his movies, including 8. The aesthetic and probing inventiveness in film, Singer shows us, restores and revives for audiences in the twenty-first century myths of creation, of the questing hero, and of ideals--both secular and religious--that have had enormous significance throughout the human search for love and meaning in life.","torrent":{"xt":"urn:btih:82537dd6d3653b4af63b1ffb773e7e5891cabebc","amp;dn":"Cinematic+Mythmaking%3A+Philosophy+in+Film+-+Irving+Singer.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82537dd6d3653b4af63b1ffb773e7e5891cabebc","infoHashBuffer":{"type":"Buffer","data":[130,83,125,214,211,101,59,74,246,59,31,251,119,62,126,88,145,202,190,188]},"announce":[],"urlList":[]}}