{"title":"Ivan T. Berend - An Economic History of Twentieth-Century Europe","uid":10317190,"size":6534103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8264495b39ebb0463c3d7330090727087611f316&amp;dn=Ivan+T.+Berend+-+An+Economic+History+of+Twentieth-Century+Europe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Anette14","files":-1,"time":1402264595,"description":"Description\nProduct Details\nBook Title: An Economic History of Twentieth-Century Europe: Economic Regimes from Laissez-Faire to Globalization\t\nBook Author: Ivan T. Berend (Author)\nPaperback: 369 pages\nPublisher: Cambridge University Press (July 10, 2006)\nLanguage: English\nISBN-10: 0521672686\nISBN-13: 978-0521672689\n\n===================================================================================\nBook Description\nPublication Date: July 10, 2006\nA major new history of economic regimes and economic performance throughout the twentieth century. Ivan T. Berend looks at the historic development of the twentieth-century European economy, examining both its failures and its successes in responding to the challenges of this crisis-ridden and troubled but highly successful age. The book surveys the European economy's chronological development, the main factors of economic growth, and the various economic regimes that were invented and introduced in Europe during the twentieth century. Professor Berend shows how the vast disparity between the European regions that had characterized earlier periods gradually began to disappear during the course of the twentieth century as more and more countries reached a more or less similar level of economic development. This accessible book will be required reading for students in European economic history, economics, and modern European history.\n\n===================================================================================\nReview\n&quot;Ivan Berend raises important issues and makes stimulating arguments. The strongest part of his book is his analysis of the economies of the Soviet Union and Eastern Europe.&quot; -Alfred C. Mierzejewski, H-German\n\n===================================================================================\nBook Description II\nA major new history of economic regimes and economic performance in Europe throughout the twentieth century. Ivan T. Berend looks at the historic development of the twentieth-century European economy, examining both its failures and its successes in responding to the challenges of this crisis-ridden and troubled but highly successful age.\n\n===================================================================================\nAbout the Author\nIvan T. Berend is Distinguished Professor of History at the University of California Los Angeles. His numerous publications include Decades of Crisis: Central and Eastern Europe Before World War II (1998) and History Derailed: Central and Eastern Europe in the 'Long' Nineteenth Century (2003).\n======================================================================================================================================================================","torrent":{"xt":"urn:btih:8264495b39ebb0463c3d7330090727087611f316","amp;dn":"Ivan+T.+Berend+-+An+Economic+History+of+Twentieth-Century+Europe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8264495b39ebb0463c3d7330090727087611f316","infoHashBuffer":{"type":"Buffer","data":[130,100,73,91,57,235,176,70,60,61,115,48,9,7,39,8,118,17,243,22]},"announce":[],"urlList":[]}}