{"title":"Saber Rider And The Star Sheriffs (Complete, DVDRIP, xvid+vorbis","uid":9257444,"size":13730008049,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:82bcff67457b550766b5085ac0b14e7c05669717&amp;dn=Saber+Rider+And+The+Star+Sheriffs+%28Complete%2C+DVDRIP%2C+xvid%2Bvorbis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":null,"files":-1,"time":1385575609,"description":"The series is set In the distant future. Humans have spread beyond Earth and colonized planets across the universe, creating a New Frontier of man. In order to protect these new settlers and maintain laws and regulations in the New Frontier, Earth's Cavalry Command was created. Cavalry Command is a military organization, maintaining an army and fleet of ships to protect the New Frontier. Within Cavalry Command is a unit of special operatives known as Star Sheriffs that function as field agents, investigating crimes and plots against the security of the New Frontier.\n\nThe main foe of Cavalry Command and the Star Sheriffs is a race of non-human creatures known as Vapor Beings (also sometimes called Outriders) that jumped into our dimension in order to conquer it. They attack the settlers, destroy settlements, and kidnap humans, in order to mine various metals or crystals from the soil.\n\nOutriders are superior to humans in battle technology. They control a legion of gigantic robots with weapons greatly superior to the weapons and defenses of the space-going fleets of Cavalry Command. In response to the threat, Cavalry Command developed a prototype ship known as the &quot;Ramrod Equalizer Unit&quot; (or just Ramrod) that has the ability to turn from a spaceship into a powerful robot that can fight the Outriders on equal terms.\n\n\nDVD rip\n720x576 (at 25 fps)\nEnglish and german audio tracks\n","torrent":{"xt":"urn:btih:82bcff67457b550766b5085ac0b14e7c05669717","amp;dn":"Saber+Rider+And+The+Star+Sheriffs+%28Complete%2C+DVDRIP%2C+xvid%2Bvorbis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82bcff67457b550766b5085ac0b14e7c05669717","infoHashBuffer":{"type":"Buffer","data":[130,188,255,103,69,123,85,7,102,181,8,90,192,177,78,124,5,102,151,23]},"announce":[],"urlList":[]}}