{"title":"Project SAM - Orchestral Essentials","uid":8784231,"size":6953110814,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:82eca63dafd83dba2f3901aed4be2542d7adc2eb&amp;dn=Project+SAM+-+Orchestral+Essentials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"NewSky006","files":-1,"time":1375789070,"description":"Torrent info:\n==============\n\nThis is not cracked, no keygens included or anything. This is just downloaded from one of those free software download websites. I just saved you ~1 week of downloading, and being ultra-frustrated with the servers.\n\nI recommend using a cracked version of Kontakt 5 so that you can enjoy this without needing to constantly reload the library every 15 minutes :)\n\n\n\nProduct info:\n===============\n\nProjectSAM has carefully selected the essentials from each of their products, including the highly praised Symphobia series, True Strike series and Orchestral Brass Classic, and bundled them into one effective, incredibly versatile package. Moreover, new instruments not found in any other ProjectSAM products have been included.\n\n\n\nCovering full orchestra, string, brass and woodwind ensembles, classical and world percussion, Orchestral Essentials gives you the right ammo to start scoring for film, games or pop with the acclaimed ?cinematic SAM sound?. For each of the orchestral sections, an essential list of articulations is available, as well as one expressive legato instrument and an inspiring set of clusters, textures and effects. Apart from these orchestral elements, you will also find a concert harp, church organ, ProjectSAM?s renowned Dystopia sound design, and, exclusive to Orchestral Essentials, an enchanting grand piano and harpsichord.\n\n\n\nOrchestral Essentials follows ProjectSAM?s ensemble recording philosophy. Strings, brass and woodwinds were sampled as sections, as nothing beats the authentic blend of orchestral instruments in a concert hall. ProjectSAM captures this magic in various orchestrations; for example, imagine the noble sound of horns and trombones performing together naturally.\n\n\n\nBack in 2002, ProjectSAM set the benchmark for ambient recording and affordability with the release of SAM Horns. Now, ProjectSAM does it again with Orchestral Essentials.\n\n\n\nAn overview of the Orchestral Essentials features and technical specifications:\n\n\n\nEpic full orchestra articulations\n\nSymphonic string, brass and wind ensemble articulations\n\nLegato ensembles with real note transitions\n\nClassical, melodic and world percussion including timpani and Japanese drums\n\nCinematic effects, clusters and percussive hits\n\nPreviously unreleased Piano Mystique and Harpsichord\n\nGround-shaking Dystopia sound design\n\nInspiring and thematic Multis\n\n\n\n12 GB library pool (7 GB compressed NCW format)\n\n1 stereo mic set per instrument (see instrument list)\n\n44.1 kHz 24 bit audio pool\n\nKontakt Player 5 included with purchase\n\nInternet activation required using product serial number\n\nLicense allows for two simultaneous activations per licensee\n\n\n\nMin system requirements Mac:\n\nOS X 10.6 or 10.7 (latest update), Intel Core Duo, 2 GB RAM\n\n\n\nMin system requirements PC:\n\nWindows 7 (latest Service Pack, 32/64 Bit), Intel Core Duo or AMD Athlon 64 X2, 2 GB RAM\n\n\n\nSupported interfaces: Stand-alone, VST, Audio Units, RTAS (Pro Tools 9 or higher), ASIO, Core Audio, WASAPI\n\n\n\nNot compatible with PowerPC Macs\n\nNot compatible with Kontakt (Player) 4 - See more at: http://www.goaming.com/2013/06/projectsam-orchestral-essentials.html#sthash.DTtpjWAj.dpuf","torrent":{"xt":"urn:btih:82eca63dafd83dba2f3901aed4be2542d7adc2eb","amp;dn":"Project+SAM+-+Orchestral+Essentials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82eca63dafd83dba2f3901aed4be2542d7adc2eb","infoHashBuffer":{"type":"Buffer","data":[130,236,166,61,175,216,61,186,47,57,1,174,212,190,37,66,215,173,194,235]},"announce":[],"urlList":[]}}