{"title":"Afghan Whigs - Gentlemen (1993) [FLAC]","uid":8146479,"size":371523661,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8375b3f7568e3ee6c9cc5375cdb63ac2ed047441&amp;dn=Afghan+Whigs+-+Gentlemen+%281993%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"politux","files":24,"time":1360939930,"description":"The Afghan Whigs' sound was growing larger by the release during the days on Sub Pop, so the fact that Gentlemen turned out the way it did wasn't all that surprising as a result (&quot;cinematic&quot; was certainly the word the band was aiming for, what with credits describing the recording process as being &quot;shot on location&quot; at Ardent Studios). While Gentlemen is no monolith, it is very much of a piece at the start. While &quot;If I Were Going&quot; opens things on a slightly moodier tip, it's the crunch of &quot;Gentlemen,&quot; &quot;Be Sweet,&quot; and &quot;Debonair&quot; that really stands out, each of which features a tightly wound R&amp;B punch that rocks out as much as it grooves, if not more so. Greg Dulli's lyrics immediately set about the task of emotional self-evisceration at the same time, with lines like &quot;Ladies, let me tell you about myself -- I got a dick for a brain&quot; being among the calmer points. The album truly comes into its own with &quot;When We Two Parted,&quot; though, as sad countryish guitars chime over a slow crawling rhythm and Dulli's quiet-then-anguished detailing of an exploding relationship. From there on in, things surge from strength to greater strength, sometimes due to the subtlest of touches -- the string arrangement on &quot;Fountain and Fairfax&quot; or the unexpected, resigned lead vocal from Scrawl's Marcy Mays on &quot;My Curse,&quot; for instance. Other times, it's all the much more upfront, as &quot;What Jail Is Like,&quot; with its heartbroken-and-fierce combination of piano, feedback, and drive building to an explosive chorus. Dulli's blend of utter abnegation and masculine swagger may be a crutch, but when everything connects, as it does more often than not on Gentlemen, both he and his band are unstoppable.","torrent":{"xt":"urn:btih:8375b3f7568e3ee6c9cc5375cdb63ac2ed047441","amp;dn":"Afghan+Whigs+-+Gentlemen+%281993%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8375b3f7568e3ee6c9cc5375cdb63ac2ed047441","infoHashBuffer":{"type":"Buffer","data":[131,117,179,247,86,142,62,230,201,204,83,117,205,182,58,194,237,4,116,65]},"announce":[],"urlList":[]}}