{"title":"War of Attrition - William Philpott - Audiobook MP3","uid":10706606,"size":515376910,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8384f077ee6e96d14ae2f03f0c6e896a602e9e99&amp;dn=War+of+Attrition+-+William+Philpott+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1407298853,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nWar of Attrition: Fighting the First World War\n\nWritten by: William Philpott\nNarrated by: Derek Perkins\nLength: 17 hrs and 50 mins\nFormat: Unabridged\nRelease Date:06-30-14\n\nThe Great War of 1914-1918 was the first mass conflict to fully mobilize the resources of industrial powers against one another, resulting in a brutal, bloody, protracted war of attrition between the world's great economies. Now, 100 years after the first guns of August rang out on the Western front, historian William Philpott reexamines the causes and lingering effects of the first truly modern war.\n\nDrawing on the experience of front-line soldiers, munitions workers, politicians, and diplomats, War of Attrition explains for the first time why and how this new type of conflict was fought as it was fought, as well as how the attitudes and actions of political and military leaders, and the willing responses of their peoples, stamped the 20th century with unprecedented carnage on - and behind - the battlefield.\n","torrent":{"xt":"urn:btih:8384f077ee6e96d14ae2f03f0c6e896a602e9e99","amp;dn":"War+of+Attrition+-+William+Philpott+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8384f077ee6e96d14ae2f03f0c6e896a602e9e99","infoHashBuffer":{"type":"Buffer","data":[131,132,240,119,238,110,150,209,74,226,240,63,12,110,137,106,96,46,158,153]},"announce":[],"urlList":[]}}