{"title":"Aaron Clarey - Enjoy the Decline (pdf)","uid":9622386,"size":93398731,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:84637fde3d3efcc80875f5dba6f6b357b6eac5ba&amp;dn=Aaron+Clarey+-+Enjoy+the+Decline+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"AreciboMessage","files":1,"time":1392528366,"description":"READ THIS:\n\nAs far as I know, this is the only torrent of this book in existence. This is not an e-book, but a scanned copy of the physical book, so the quality is mediocre. You also need to flip your view counter-clockwise(in Acrobat Reader go to View, Rotate View). If someone has any of Clarey's other books (Worthless, Bachelor Pad Economics), or a better copy of Enjoy the Decline, please upload them.\n\n\nAmazon description: \n\nThe &quot;End of America?&quot; Most likely. The &quot;Demise of liberty?&quot; You betcha! The &quot;Destruction of Western Civilization?&quot; Of course! But why let all of the above get you down? Learn to &quot;Enjoy the Decline!&quot; &quot;Enjoy the Decline&quot; is mandatory reading for all conservatives, libertarians, Americans, and lovers of freedom who are mourning the slow, but sure death of their culture and their country. America is over. Freedom will be curtailed. Liberty is dead. And above all else, it is inevitable. But the answer is not to get depressed and give up hope. The answer is to change your attitude and learn how to &quot;Enjoy the Decline.&quot; You get one life on this planet and Aaron Clarey explains how to get the most out of it even though socialism and tyranny are all around you. From learning how to adapt your psychology to learning to let go and take advantage of the socialist system, &quot;Enjoy the Decline&quot; carries the freedom loving American through the 5 stages of grief and puts them on a path to enjoy their life regardless of what is happening to their beloved America. Dark, macabre, and morose, but truthful, helpful, and practical all the same, it is guaranteed to make you happier than your socialist counterparts even though they have everything they want. Make leftists, liberals, and progressives miserable. Enjoy the Decline!","torrent":{"xt":"urn:btih:84637fde3d3efcc80875f5dba6f6b357b6eac5ba","amp;dn":"Aaron+Clarey+-+Enjoy+the+Decline+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84637fde3d3efcc80875f5dba6f6b357b6eac5ba","infoHashBuffer":{"type":"Buffer","data":[132,99,127,222,61,62,252,200,8,117,245,219,166,246,179,87,182,234,197,186]},"announce":[],"urlList":[]}}