{"title":"Lonely Planet Yosemite, Sequoia and Kings Canyon National Parks","uid":14737479,"size":17568424,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8498edf9be037337005017f13719c8716b1e7f85&amp;dn=Lonely+Planet+Yosemite%2C+Sequoia+and+Kings+Canyon+National+Parks+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1464645574,"description":"Lonely Planet - Yosemite, Sequoia &amp; Kings Canyon National Parks (Travel Guide) - 4th Edition (2016).pdf Gooner\r\n\r\nPublisher: Lonely Planet; 4 edition (15 April 2016)\r\nLanguage: English\r\nISBN-10: 1742207448\r\nISBN-13: 978-1742207445\r\n\r\n# 1 best-selling guide to Yosemite, Sequoia &amp; Kings Canyon National Parks*\r\n\r\nLonely Planet Yosemite, Sequoia &amp; Kings Canyon National Parks is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Go fishing in Yosemite Valley; canoeing and kayaking in Mammoth Lakes, or horseback riding in King's Canyon; all with your trusted travel companion. Get to the heart of Yosemite, Sequoia &amp; Kings Canyon National Parks and begin your journey now!\r\n\r\nInside the Lonely Planet Yosemite, Sequoia &amp; Kings Canyon National Parks Travel Guide:\r\n\r\n* User-friendly highlights and itineraries help you tailor your trip to your personal needs and interests\r\n\r\n* Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices, emergency information, park seasonality, hiking trail junctions, viewpoints, landscapes, elevations, distances, difficulty levels, and durations\r\n\r\n* Honest reviews for all budgets - eating, sleeping, camping, sight-seeing, going out, shopping, summer and winter activities, and hidden gems that most guidebooks miss\r\n\r\n* Contextual insights give you a richer, more rewarding travel experience - history, geology, wildlife, conservation\r\n\r\n* Over 42 full-color trail and park maps and full-color images throughout\r\n\r\n* Useful features - Travel with Children, Clothing and Equipment, and Day and Overnight Hikes\r\n\r\n* Covers Yosemite National Park, Sequoia National Park, Kings Canyon National Park, King's Canyon Point, Badger Pass, Wawona, Tuolumne Meadows, Hetch Hetchy, Sierra National Forest and more\r\n\r\nThe Perfect Choice: Lonely Planet Yosemite, Sequoia &amp; Kings Canyon National Parks, our most comprehensive guide to these parks, is perfect for both exploring top sights and taking roads less traveled.\r\n\r\n* Looking to visit more national parks? Check out USA's National Parks, a new full-color guide that covers all 59 of the USA's national parks.\r\nAuthors: Written and researched by Lonely Planet.\r\n\r\nAbout Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveler community. Lonely Planet covers must-see spots but also enables curious travelers to get off beaten paths to understand more of the culture of the places in which they find themselves.\r\n\r\nTripAdvisor Travelers' Choice Awards winner in Favorite Travel Guide category for 2012, 2013, 2014 and 2015.\r\n\r\n*Best-selling guide to Yosemite, Sequoia and Kings Canyon National Parks. Source: Nielsen BookScan. Australia, UK and USA","torrent":{"xt":"urn:btih:8498edf9be037337005017f13719c8716b1e7f85","amp;dn":"Lonely+Planet+Yosemite%2C+Sequoia+and+Kings+Canyon+National+Parks+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8498edf9be037337005017f13719c8716b1e7f85","infoHashBuffer":{"type":"Buffer","data":[132,152,237,249,190,3,115,55,0,80,23,241,55,25,200,113,107,30,127,133]},"announce":[],"urlList":[]}}