{"title":"Continuity Comics Collection (- Nem -)","uid":11628402,"size":2341354024,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:84dafb71db0dc979e1f0bc54664864d07b4b3c1f&amp;dn=Continuity+Comics+Collection+%28-+Nem+-%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"nemesis43","files":136,"time":1417650118,"description":"Continuity Comics Collection\n\n\nContinuity's comics tended to be grittier than the mainstream Marvel or DC comics of their day, often depicting bloody, graphic violence. For instance, in one issue of Armor the title character has his hand chopped off and then the appendage is destroyed in a blender. Continuity was also part of a trend towards more eroticism in mainstream comics. For instance, the costume and the cover artwork for the character Samuree were often revealing, and she was sometimes drawn in sexy poses on the cover of her comic.\n\nDuring the 1990s &quot;variant cover&quot; craze, Continuity got into Tyvek (marketed as &quot;indestructible&quot;), die-cut, glow-in-the-dark, chrome-plated, and hologram covers; as well as pull-out posters, stickers, and trading cards; all of which are associated with the speculation bubble which burst in the mid-1990s. Continuity also bought into the crossover craze of the era with Deathwatch 2000 and Rise of Magic). Continuity's entire line was canceled during the Rise of Magic crossover in 1993.\n\nOver the course of its life as a publisher, Continuity was the subject of much criticism from comics retailers and fans for poor editorial oversight and the publisher's inability to ship its products on time or according to schedule.\n\nContinuity stopped publishing in 1994, embroiled in legal and financial troubles. Several of Continuity's later titles and characters wound up being picked up by other publishers. For instance, Samuree, Valeria and Knighthawk would be published by Valiant Comics' Windjammer line of creator-owned titles","torrent":{"xt":"urn:btih:84dafb71db0dc979e1f0bc54664864d07b4b3c1f","amp;dn":"Continuity+Comics+Collection+%28-+Nem+-%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84dafb71db0dc979e1f0bc54664864d07b4b3c1f","infoHashBuffer":{"type":"Buffer","data":[132,218,251,113,219,13,201,121,225,240,188,84,102,72,100,208,123,75,60,31]},"announce":[],"urlList":[]}}