{"title":"Glee S06E01-E06 HDTV NL Subs DutchReleaseTeam","uid":11782086,"size":3502305395,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:850cbaaf604d90559637a528a3d18a61516bb6b4&amp;dn=Glee+S06E01-E06+HDTV+NL+Subs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Boobin16","files":9,"time":1427641866,"description":"\nPlot:\n\nGlee is een Amerikaanse, komische en muzikale televisieserie uit 2009 van Fox. Het verhaal draait om een groep jongeren die,\nonder leiding van hun leerkracht, een koor beginnen op hun school. Dit is de fictieve William McKinley High School in Lima (Ohio).\nCentraal staan de gebreken van elk van hen en hoe ze moeten opboksen tegen de vooroordelen van hun medestudenten en enkele leerkrachten (zoals de gemene 'Sue Sylvester', die het koor als een bedreiging ziet voor haar cheerleaders).\n\n\nVertaling: Mandy\n\n\nSeizoen 6 Aflevering 1: Loser Like Me\n\nAfter Rachel's humiliating failure as TV actress, she comes home to Lima to figure out what she wants to do next. Upon discovering that Sue has banished the arts at McKinley, Rachel takes it upon herself to reinstate and lead the Glee Club. Meanwhile, Blaine, no longer in a relationship with Kurt, has moved home to coach the Warblers while Will is coaching rival Vocal Adrenaline, and Sam is the assistant coach for the McKinley football team.\n\nSeizoen 6 Aflevering 2: Homecoming\n\nPuck, Quinn, Santana, Mercedes, Brittany, Artie and Tina all return to McKinley for Homecoming and help Rachel and Kurt recruit for the new glee club.\n\nSeizoen 6 Aflevering 3: Jagged Little Tapestry\n\nRachel and Kurt struggle as they try to rebuild and co-direct the glee club at McKinley. Meanwhile, Sue is concerned when Becky brings her new boyfriend to town.\n\nSeizoen 6 Aflevering 4: The Hurt Locker (1)\n\nRachel hopes to form a deal in which Will's glee club purposefully underperforms at their invitational; Sue wants Sam to distract Rachel.\n\nSeizoen 6 Aflevering 5: The Hurt Locker (2)\n\nRachel and Kurt redouble their efforts to recruit new members to New Directions after new rules are announced for the Show Choir Invitational. Sue enacts an elaborate plan to try reunite Kurt and Blaine. Will and Rachel have a much needed heart-to-heart.\n\nSeizoen 6 Aflevering 6: What the World Needs Now\n\nBrittany and Santana plan their wedding. The Gleeks weekly assignment is the music of Burt Bacharach, and reigning diva Mercedes is recruited to act as a mentor for the new singers. Brittany learns a shocking family secret.\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nKom eens langs op  &lt;a href=&quot; http://www.hetmultimediacafe.nl/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.hetmultimediacafe.nl/&lt;/a&gt;\n\n\nDutchReleaseTeam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:850cbaaf604d90559637a528a3d18a61516bb6b4","amp;dn":"Glee+S06E01-E06+HDTV+NL+Subs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"850cbaaf604d90559637a528a3d18a61516bb6b4","infoHashBuffer":{"type":"Buffer","data":[133,12,186,175,96,77,144,85,150,55,165,40,163,209,138,97,81,107,182,180]},"announce":[],"urlList":[]}}