{"title":"The 33 Strategies of War (2007) [REFURBISHED]","uid":5041564,"size":868739641,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:858e2bd76aaf7aa21b1910f0a2ded886545d351c&amp;dn=The+33+Strategies+of+War+%282007%29+%5BREFURBISHED%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ThePrivateer","files":-1,"time":1249397006,"description":"MP3/192Kbps - English\nThis refurbished edition was made by using the files from the post &quot;The 33 Strategies Of War - Audiobook 192kbps - JackDilla&quot;. (Respect to the OP)\n\nRobert Greene is a prolific research and thinker who has made a habit out of writing masterpieces that explore all nuances of human behavior. In his latest tome he follows the same approach as in his previous bestsellers by leading off each chapter with a quick and easy to read summary that gives you the essence of the strategy and the stories that follow. Then he leads you on one fascinating historical excursion after another that brings each strategy to life through the exploits of some of histories most famous and notorious characters.\n\nThe beauty of his approach is that there is something for everyone in this book. You may read about a tactic that is highly amusing, but that you say to yourself, &quot;I could never do that.&quot; Then in the next chapter you may say, &quot;That's fits in with my personality. I can do that.&quot; That's how I felt about his strategies for laying back and appearing to not care, and about his strategy for taking an unassailable position.\n\nA brief story in chapter 4 on developing a sense of extreme urgency was well worth the cost of the book to me. It talks about Fyodor Dostoevsky and how a change in his perspective on the value of life lead to a greater appreciation for every moment, and to an era of rampant productivity that continued until his death. Because I'm an author I spend a good part of every day writing and thinking about my work. After reading about Dostoevsky I immediately felt an even higher sense of purpose and motivation.\n\nYou really can't go wrong with this book. It is very entertaining and educational. Beyond that, you could pick up some sage, time-tested advice for improving both your business and your life. Bravo!\n\nReview by an Amazon customer","torrent":{"xt":"urn:btih:858e2bd76aaf7aa21b1910f0a2ded886545d351c","amp;dn":"The+33+Strategies+of+War+%282007%29+%5BREFURBISHED%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"858e2bd76aaf7aa21b1910f0a2ded886545d351c","infoHashBuffer":{"type":"Buffer","data":[133,142,43,215,106,175,122,162,27,25,16,240,162,222,216,134,84,93,53,28]},"announce":[],"urlList":[]}}