{"title":"The Bread We Eat In Dreams - Catherynne M. Valente","uid":11659731,"size":858364,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85c7e588bd658c800d542012ea2b21aaccadc11b&amp;dn=The+Bread+We+Eat+In+Dreams+-+Catherynne+M.+Valente&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1417979803,"description":"Subterranean Press proudly presents a major new collection by one of the brightest stars in the literary firmament. Catherynne M. Valente, the New York Times bestselling author of The Girl Who Circumnavigated Fairyland in a Ship of Her Own Making and other acclaimed novels, now brings readers a treasure trove of stories and poems in The Bread We Eat in Dreams. In the Locus Award-winning novelette &quot;White Lines on a Green Field,&quot; an old story plays out against a high school backdrop as Coyote is quarterback and king for a season. A girl named Mallow embarks on an adventure of memorable and magical politicks in &quot;The Girl Who Ruled Fairyland For a Little While.&quot; The award-winning, tour de force novella &quot;Silently and Very Fast&quot; is an ancient epic set in a far-flung future, the intimate autobiography of an evolving A.I. And in the title story, the history of a New England town and that of an outcast demon are irrevocably linked. The twenty-six pieces collected here explore an extraordinary breadth of styles and genres, as Valente presents readers with something fresh and evocative on every page. From noir to Native American myth, from folklore to the final frontier, each tale showcases Valente's eloquence and originality","torrent":{"xt":"urn:btih:85c7e588bd658c800d542012ea2b21aaccadc11b","amp;dn":"The+Bread+We+Eat+In+Dreams+-+Catherynne+M.+Valente","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85c7e588bd658c800d542012ea2b21aaccadc11b","infoHashBuffer":{"type":"Buffer","data":[133,199,229,136,189,101,140,128,13,84,32,18,234,43,33,170,204,173,193,27]},"announce":[],"urlList":[]}}