{"title":"Temptation - Confessions of a Marriage Counselor.mp4","uid":8347859,"size":578233067,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:85eaeeac59f951163883dbdef3a8c7cb262441e9&amp;dn=Temptation+-+Confessions+of+a+Marriage+Counselor.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"globeplus","files":-1,"time":1365255956,"description":"* MP4  * CAM  * 01H46M24S  * 640x400  * 29.97 frames  * Audio: mp4a 48000Hz AAC~SBR\n\n\n* Plot :\n\nIn a run down office, a marriage counselor is working with a couple who is having problems. She suspects that the wife is attracted to someone else and is considering having an affair. The counselor proceeds to tell her a story about Judith (Jurnee Smollett-Bell)\n\nJudith is a therapist working at a match making company owned by Janice (Vanessa L. Williams). She is married to her childhood sweetheart Brice (Lance Gross). Judith and Brice attend the same church as her mother Miss Sarah (Ella Joyce). At the pharmacy where he works, Brice is introduced to new employee Melinda (Brandy Norwood) who soon reveals that she is in hiding from an abusive ex-husband. Judith confides in Brice that she wants to start her own marriage counseling business but Brice urges her to put it off until they are more financially established. After dinner one night, Judith becomes frustrated with Brice when he refuses to confront some men who make catcalls towards her.\n\nThe next day at work, Judith is introduced to Harley (Robbie Jones) a wealthy internet entrepreneur who is considering investing in Janice's company. Harley takes an interest in Judith, who has been assigned as his liaison, and the two realize they have seen each other jogging at a local park. Harley begins trying to seduce Judith, implying that her sex life with her husband is too bland and conventional. That night Judith attempts to spice up their lovemaking but is rebuffed by Brice.\n\n\n\n* enjoy ...  ","torrent":{"xt":"urn:btih:85eaeeac59f951163883dbdef3a8c7cb262441e9","amp;dn":"Temptation+-+Confessions+of+a+Marriage+Counselor.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85eaeeac59f951163883dbdef3a8c7cb262441e9","infoHashBuffer":{"type":"Buffer","data":[133,234,238,172,89,249,81,22,56,131,219,222,243,168,199,203,38,36,65,233]},"announce":[],"urlList":[]}}