{"title":"Aerosmith - Nine Lives (1997) [CD Rip] 320 vtwin88cube","uid":6184615,"size":152429628,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:85f0aa4edb08a5c3772d488e0578b8ba74c252f6&amp;dn=Aerosmith+-+Nine+Lives+%281997%29+%5BCD+Rip%5D+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1298076169,"description":"\n\nAerosmith\nNine Lives (1997)\n\nAerosmith was one of the most popular hard rock bands of the '70s, setting the style and sound of hard rock and heavy metal for the next two decades with their raunchy, bluesy swagger. The Boston-based quintet found the middle ground between the menace of the Rolling Stones and the campy, sleazy flamboyance of the New York Dolls, developing a lean, dirty riff-oriented boogie that was loose and swinging and as hard as a diamond. \n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tRock\nSource:\t\t\tRetail CD\n\nAerosmith signed a multi-million-dollar contract with Columbia Records before they had completed their deal with Geffen, which meant that a lot was riding on their Columbia debut, Nine Lives, when it was finally delivered in 1997. During recording, the band nearly broke up, and they worked with a number of producers -- including Glen Ballard, the man behind Alanis Morissette -- before settling on Kevin Shirley, an in-house producer responsible for Silverchair and Journey. Perhaps that's the reason why Nine Lives sounds so calculated, as if it was assembled by a band trying to sound like Aerosmith. In a sense, it is -- not one of the 13 songs were written without the assistance of professional songwriters. Of course, some of the best moments of Pump and Permanent Vacation were also written with professionals, but they had an appealing, slick surface that made them infectious. Nine Lives, in contrast, is overlabored, with Aerosmith making a conscious effort to sound hip and vibrant, which ironically simply makes them sound tired. Not only are the performances perfunctory, but the songs aren't catchy -- no matter how hard it tries, &quot;Falling in Love (Is Hard on the Knees)&quot; never develops a hook, and it is not an exception. A handful of cuts approximate the raunchy appeal of prime Aerosmith, but Nine Lives is hardly the triumphant comeback it should have been. \n\n01.Nine Lives\n02.Falling In Love (Is Hard On The Knees)\n03.Hole In My Soul\n04.Taste Of India\n05.Full Circle\n06.Something's Gotta Give\n07.Ain't That A Bitch\n08.The Farm\n09.Crash\n10.Kiss Your Past Good-Bye\n11.Pink\n12.Attitude Adjustment\n13.Fallen Angels\n\n\nCheers!","torrent":{"xt":"urn:btih:85f0aa4edb08a5c3772d488e0578b8ba74c252f6","amp;dn":"Aerosmith+-+Nine+Lives+%281997%29+%5BCD+Rip%5D+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85f0aa4edb08a5c3772d488e0578b8ba74c252f6","infoHashBuffer":{"type":"Buffer","data":[133,240,170,78,219,8,165,195,119,45,72,142,5,120,184,186,116,194,82,246]},"announce":[],"urlList":[]}}