{"title":"50 Ideas You Really Need to Know Universe by Joanne Baker","uid":9413185,"size":3556511,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86482f1ab65fdd4e76aad56b6ac039cdb1864c36&amp;dn=50+Ideas+You+Really+Need+to+Know+Universe+by+Joanne+Baker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":4,"uploader":"420weedman","files":-1,"time":1388360201,"description":"For millennia humanity has gazed in wonder at the night sky, tracked the motions of the planets and attempted to explain our place in the Universe. But only in our own time has the true scale, the astonishing variety and the remarkable strangeness of the cosmos come clearly into focus. The pace and sophistication of recent scientific discovery has been breathtaking, but breakthroughs are often difficult to understand and their impact is hard to fully appreciate. In 50 Ideas You Really Need to Know: Universe, Joanne Baker clearly and concisely explains all of the essential concepts, major discoveries and the very latest thinking in astrophysics, including: the basic principles of astronomy - from heliocentrism to Newton's theory of optics; the constituent parts of the Universe, its creation and evolution; the key concepts of cosmology including the theory of relativity, supermassive black holes and 'multiverses'; the very latest developments in our understanding of quasars, exoplanets and astrobiology. From dwarf planets to dark energy; and from the Big Bang to the death of stars, this book is the perfect introduction to the cutting-edge science that is shaping our understanding of our place in the Universe and that could lead to the next great discovery - the detection of life beyond Earth.","torrent":{"xt":"urn:btih:86482f1ab65fdd4e76aad56b6ac039cdb1864c36","amp;dn":"50+Ideas+You+Really+Need+to+Know+Universe+by+Joanne+Baker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86482f1ab65fdd4e76aad56b6ac039cdb1864c36","infoHashBuffer":{"type":"Buffer","data":[134,72,47,26,182,95,221,78,118,170,213,107,106,192,57,205,177,134,76,54]},"announce":[],"urlList":[]}}