{"title":"Workbook for Step-By-Step Medical Coding 2014 [PDF] [StormRG]","uid":9741042,"size":10690086,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8674aaa42ae5718f31fda50978573893b238e3cd&amp;dn=Workbook+for+Step-By-Step+Medical+Coding+2014+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":-1,"time":1394516675,"description":"Author: Carol J. Buck\nPaperback: 320 pages\nPublisher: Saunders; 1 Workbook edition (December 26, 2013)\nLanguage: English\nISBN-10: 1455746304\nISBN-13: 978-1455746309\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n_________________________________________________________________________________\n\n\nStrengthen your ability to code accurately and obtain optimal reimbursement for medical services! Corresponding to the chapters in Carol J. Buck's Step-by-Step Medical Coding, 2014 Edition, this workbook offers review and practice with more than 1,500 questions, activities, and terminology exercises, and includes complete coverage of ICD-10-CM. It also includes over 90 original source documents to familiarize you with the reports you will encounter in practice.\n\nComplete coverage of ICD-10-CM prepares you for the upcoming transition to ICD-10.\nDual coding addresses the transition to ICD-10 by providing coding answers in both ICD-9 and ICD-10.\nOver 90 original source documents provide real-world experience with reports you will encounter in practice.\nWorkbook questions follow the same format as the text, including multiple code icons.\nTheory, practice, and reporting exercises help you master key concepts and apply your knowledge.\nUpdated content includes the latest coding information available, promoting accurate coding and success on the job.","torrent":{"xt":"urn:btih:8674aaa42ae5718f31fda50978573893b238e3cd","amp;dn":"Workbook+for+Step-By-Step+Medical+Coding+2014+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8674aaa42ae5718f31fda50978573893b238e3cd","infoHashBuffer":{"type":"Buffer","data":[134,116,170,164,42,229,113,143,49,253,165,9,120,87,56,147,178,56,227,205]},"announce":[],"urlList":[]}}