{"title":"Bulk SMS Sender 2.8 (10 phones)","uid":7714688,"size":2681206,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:86b260fd30c215f4c67767855726cde62acf5a69&amp;dn=Bulk+SMS+Sender+2.8+%2810+phones%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1349897081,"description":"Bulk SMS Sender v2.8 is a software to send SMS in BULK for thousands of Mobile Phones from Your PC. You can send Thousands of SMS from your PC through connected Mobile Phones (GSM Mobile Phones).BULK SMS SENDER allows you to connect maximum 10 mobile phones for send SMS from your PC/LAPTOP. It also allows you to customize SMS with many fields such as (Mobile Number, Name etc).\n\nIt automatically detects all connected mobile phones and allows you to select mobile number through which you want to send SMSes from PC.BULK SMS SENDER allows you to send INTERNATIONAL SMS in BULK. This software also have feature of add country code as prefix to Mobile Numbers.BULK SMS SENDER includes many features such as delay in SMS to be delivered. You can load a list of mobile numbers from EXCEL file, TEXT file or manually one by one. It also keep Log file for sent SMS and failed SMS with number, correspond message and Date of SMS sent.\n\nKey Features :\nNo DND( Do not disturb) Restriction.\nSend SMS to individuals or list of phone numbers.\nLoad Contact Numbers from File\nSend unique or personalized SMS to every Contact using Excel File Data.\nSend message in many different Languages (Unicode).\nProvides facility to send SMS using Delayed Delivery Options\nAdd Custom Field value to generate unique SMS for Every Contact.\nSend Flash or Standard SMS.\nSent messages can easily be saved and viewed by the user.\nCompatible with USB GSM technology based mobile devices.\nNo internet connection is required to send SMS.","torrent":{"xt":"urn:btih:86b260fd30c215f4c67767855726cde62acf5a69","amp;dn":"Bulk+SMS+Sender+2.8+%2810+phones%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86b260fd30c215f4c67767855726cde62acf5a69","infoHashBuffer":{"type":"Buffer","data":[134,178,96,253,48,194,21,244,198,119,103,133,87,38,205,230,42,207,90,105]},"announce":[],"urlList":[]}}