{"title":"Far.Cry.4-SKIDROW","uid":11471712,"size":28683841872,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:86d5272404e56968e738e4faad72f01f1782aa8a&amp;dn=Far.Cry.4-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"thenoobish","files":2,"time":1416096773,"description":"S K I D R O W\nthe leading force\n\nproudly presents\nFar Cry 4 (c) Ubisoft\n\n15-11-2014......Release Date &lt;-&gt; Protection...........Ubisoft DRM\nFPS................Game Type &lt;-&gt; Disk(s).................1 BLURAY\n\nRELEASE NOTES\n\nHidden in the towering Himalayas lies Kyrat, a country steeped in\ntradition and violence. You are Ajay Ghale. Traveling to Kyrat to\nfulfill your mother s dying wish, you find yourself caught up in a\ncivil war to overthrow the oppressive regime of dictator Pagan Min\nExplore and navigate this vast open world, where danger and\nunpredictability lurk around every corner. Here, every decision counts\nand every second is a story. Welcome to Kyrat\n\nFeatures:\n\nEXPLORE AN OPEN WORLD FILLED WITH POSSIBILITIES\nDiscover the most diverse Far Cry world ever created. With terrain\nspanning from lush forests to the snowcapped Himalayas, the entire\nworld is alive and deadly\nFrom leopards, rhinos, black eagles, and vicious honey badgers, Kyrat\nis home to abundant wildlife. As you embark on your hunt for resources\nknow that something may be hunting you\nScout enemy territory from above in the all-new gyrocopter and then\nplummet back to earth in your wing suit. Climb aboard the back of a\nsix-ton elephant and unleash its raw power on your enemies\nChoose the right weapon for the job, no matter how insane or\nunpredictable that job might be. With a diverse arsenal, you ll be\nprepared for anything\n\nCO-OP: BRING A FRIEND\nNot every journey should be taken alone. Far Cry 4 allows for a second\nplayer to drop in and drop out at any point, re-imagining the\ncooperative experience in the true spirit of Far Cry for the next\ngeneration. You ll now be able to discover and explore the living open\nworld of Kyrat together\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy!\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups!\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix + irokos\ntitan artdivision","torrent":{"xt":"urn:btih:86d5272404e56968e738e4faad72f01f1782aa8a","amp;dn":"Far.Cry.4-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86d5272404e56968e738e4faad72f01f1782aa8a","infoHashBuffer":{"type":"Buffer","data":[134,213,39,36,4,229,105,104,231,56,228,250,173,114,240,31,23,130,170,138]},"announce":[],"urlList":[]}}