{"title":"Peter Frankopan - The Silk Roads Audiobook","uid":14683055,"size":701825216,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:898140a3299885f903a779899c3ad5fbe16061b4&amp;dn=Peter+Frankopan+-+The+Silk+Roads+Audiobook&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Ponleu9","files":28,"time":1464107307,"description":"The Silk Roads: A New History of the World\r\nby Peter Frankopan\r\n\r\nFrom the rise and fall of empires in China, Persia, and Rome itself to the spread of Buddhism and advent of Christianity and Islam, right up to Western imperialism and the great wars of the twentieth century, this epic, magisterial work illuminates how the Silk Roads--the crossroads of the world, the meeting place of East and West--perhaps more than anything else, shaped global history over the past two millennia. \r\n\r\nIt was on the Silk Roads that East and West first encountered each other through trade and conquest, leading to the spread of ideas, cultures, and religions, and it was the appetites for foreign goods that drove economies and the growth of nations. From the first cities in Mesopotamia to the emergence of Greece and Rome to the depredations by the Mongols, the transmission of the Black Death, the struggles of the Great Game, and the fall of Communism--the fate of the West has always been inextricably linked to the East. By way of events as disparate as the American Revolution and the world wars of the twentieth century, Peter Frankopan realigns the world, orienting us eastward, and illuminating how even the rise of the West five hundred years ago resulted from its efforts to gain access to and control of these Eurasian trading networks. In an increasingly globalized planet, where current events in Asia and the Middle East dominate the world's attention, this magnificent work of history is very much a work of our times.\r\n\r\nEnjoy &amp; Seed!","torrent":{"xt":"urn:btih:898140a3299885f903a779899c3ad5fbe16061b4","amp;dn":"Peter+Frankopan+-+The+Silk+Roads+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"898140a3299885f903a779899c3ad5fbe16061b4","infoHashBuffer":{"type":"Buffer","data":[137,129,64,163,41,152,133,249,3,167,121,137,156,58,213,251,225,96,97,180]},"announce":[],"urlList":[]}}