{"title":"Tony Judt - Postwar A History of Europe Since 1945 [64] 2005","uid":8736329,"size":1239839079,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:89cd456634265835ab5b86ecd38bb8c240c009bb&amp;dn=Tony+Judt+-+Postwar+A+History+of+Europe+Since+1945+%5B64%5D+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"rambam1776","files":-1,"time":1374689444,"description":"Tony Judt - Postwar: A History of Europe Since 1945\n\n64 kbps, Read by Ralph Cosham, Unabridged\n &lt;a href=&quot;\nhttp://www.barnesandnoble.com/w/postwar-tony-judt/1007283516?ean=9780143037750&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.barnesandnoble.com/w/postwar-tony-judt/1007283516?ean=9780143037750&lt;/a&gt;\n\nOverview\nNamed one of the Ten Best Books of the Year by the New York Times Book Review\n\nAlmost a decade in the making , this much-anticipated grand history of postwar Europe from one of the world's most esteemed historians and intellectuals is a singular achievement. Postwar is the first modern history that covers all of Europe, both east and west, drawing on research in six languages to sweep readers through thirty-four nations and sixty years of political and cultural change-all in one integrated, enthralling narrative. Both intellectually ambitious and compelling to read, thrilling in its scope and delightful in its small details, Postwar is a rare joy.\n\nPublishers Weekly\nThis is the best history we have of Europe in the postwar period and not likely to be surpassed for many years. Judt, director of New York University's Remarque Institute, is an academic historian of repute and, more recently, a keen observer of European affairs whose powerfully written articles have appeared in the New York Times, the New York Review of Books and elsewhere. Here he combines deep knowledge with a sharply honed style and an eye for the expressive detail. Postwar is a hefty volume, and there are places where the details might overwhelm some readers. But the reward is always there: after pages on cabinet shuffles in some small country, or endless diplomatic negotiations concerning the fate of Germany or moves toward the European Union, the reader is snapped back to attention by insightful analysis and excellent writing. Judt shows that the dire human and economic costs of WWII shadowed Europe for a very long time afterward. Europeans and Americans recall the economic miracle, but it didn't really transform people's lives until the late 1950s, when a new, more individualized, consumer-oriented society began to appear in the West. But Postwar is not just a history of Western Europe. One of its great virtues is that it fully integrates the history of Eastern and Western Europe, and covers the small countries as well as the large and powerful ones. Judt is judicious, even a bit uncritical, in his appraisal of American involvement in Europe in the early postwar years, and he's scathing about Western intellectuals' accommodation to communism. His book focuses on cultural and intellectual life rather than the social experiences of factory workers or peasants, but it would probably be impossible to encompass all of it in one volume. Overall, this is history writing at its very best.\n\nLibrary Journal\nJudt (European studies, NYU; The Burden of Responsibility), a prolific and respected historian of recent Europe, has written a massive but nonetheless lively and thoughtful historical overview of today's Europe from the end of World War II through the economic, social, cultural, and political changes and continuities of the last 60 years [â‰ˆ average human life expectancy at birth, 2011 estimate]. He includes the entire European continent in his consideration, and for American readers his view through this lens may serve to render familiar events differently, adding new dimensions to the America-focused narratives of the postwar years. From its opening chapter, a moving account of the devastation of Europe at the end of World War II, through the thoughtful analysis of the patterns and temper of the &quot;The Old Europe and the New,&quot; which provides the closing chapter, this book gives a well-rounded picture of the trends, events, and people that have made contemporary Europe. In less capable hands, it would have been easy for such a huge and all-encompassing work to become a boring slog through names, places, and events. But Judt sees the bigger picture and conveys it ably, making the book lively enough to be read from cover to cover. Not all historians will agree with every one of Judt's assertions, but this book is certain to be a major addition to postwar European studies.","torrent":{"xt":"urn:btih:89cd456634265835ab5b86ecd38bb8c240c009bb","amp;dn":"Tony+Judt+-+Postwar+A+History+of+Europe+Since+1945+%5B64%5D+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89cd456634265835ab5b86ecd38bb8c240c009bb","infoHashBuffer":{"type":"Buffer","data":[137,205,69,102,52,38,88,53,171,91,134,236,211,139,184,194,64,192,9,187]},"announce":[],"urlList":[]}}