{"title":"Windows PowerShell 2 for Dummies","uid":5286216,"size":5689958,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a4e77fcccc6a2c4ee609c3944c9407a1ecd3f1d&amp;dn=Windows+PowerShell+2+for+Dummies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"abhishes","files":1,"time":1263735289,"description":"Windows PowerShell 2 is the scripting language that enables automation within the Windows operating system. Packed with powerful new features, this latest version is complex, and Windows PowerShell 2 For Dummies is the perfect guide to help system administrators get up to speed.\n\nWritten by a Microsoft MVP with direct access to the program managers and developers, this book covers every new feature of Windows PowerShell 2 in a friendly, easy-to-follow format.\n\n    * Windows PowerShell 2 is the updated scripting language that enables system administrators to automate Windows operating systems\n    * System administrators with limited scripting experience will find this book helps them learn the fundamentals of Windows PowerShell 2 quickly and easily\n    * Translates the jargon and complex syntax of Windows PowerShell 2\n    * Covers script debugging improvements, the ability to invoke commands remotely, and the new user interface\n    * Uses real-world applications to clarify the theory, fundamentals, and techniques of the scripting language\n    * Written by a Microsoft MVP with direct access to the developers of Windows PowerShell 2\n\nWindows PowerShell 2 For Dummies makes this tool easily accessible to administrators of every experience level. ","torrent":{"xt":"urn:btih:8a4e77fcccc6a2c4ee609c3944c9407a1ecd3f1d","amp;dn":"Windows+PowerShell+2+for+Dummies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a4e77fcccc6a2c4ee609c3944c9407a1ecd3f1d","infoHashBuffer":{"type":"Buffer","data":[138,78,119,252,204,198,162,196,238,96,156,57,68,201,64,122,30,205,63,29]},"announce":[],"urlList":[]}}