{"title":"Big Thief - Masterpiece (2016) [16.44 FLAC]","uid":14736105,"size":215475174,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8aec8c098f58c2bad20549db05808251624e318d&amp;dn=Big+Thief+-+Masterpiece+%282016%29+%5B16.44+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"politux","files":13,"time":1464638377,"description":"\n  Big Thief - Masterpiece (2016) [16.44 FLAC]\r\n  \r\n  Genre: Rock\r\n  Style: Indie\r\n  Source: WEB\r\n  Codec: FLAC\r\n  Bit rate: ~ 800 kbps\r\n  Bit depth: 16\r\n  Sample rate: 44.1 kHz\r\n\r\n  01 Little Arrow \r\n  02 Masterpiece \r\n  03 Vegas \r\n  04 Real Love \r\n  05 Interstate \r\n  06 Lorraine \r\n  07 Paul \r\n  08 Humans \r\n  09 Velvet Ring \r\n  10 Animals \r\n  11 Randy \r\n  12 Parallels \r\n\r\n  Having taken the bold step of naming their first album Masterpiece, Big Thief deliver a suitably ambitious debut of disquieting indie rock that labors in self-examination and topics like the potential brutality of love. With the detachment of a hissing cassette demo, the opener, &quot;Little Arrow,&quot; introduces lead singer and songwriter Adrianne Lenker's brittle, emotive vocal delivery accompanied by only acoustic guitar as she sings the two-minute lament. When the title track follows with the weight of full production behind it, it takes us from Lenker's solo days to her new, fortified venture with a full band, though her vocal frailty and lyrical intimacy remain intact. The catchy &quot;Masterpiece&quot; showcases the band's loose disposition, with guitars sometimes seeming to spontaneously lose composure. A showstopper that radiates this quality is the sinuous &quot;Real Love,&quot; which begins with mere vocals and unison guitar as the singer recounts scenes with an abuser (&quot;Real love makes your lungs black/Real love is a heart attack&quot;). The guitar lines crack and cry along with her as the song gains momentum, ending with the musical equivalent of a shootout. In contrast but intense in its own way, &quot;Randy&quot; is an otherwise gentle ballad marked by dissonance and ambient noise that speak to the topic of dubious mental health. Elsewhere exploring the human condition, the ambling &quot;Parallels&quot; has her asking a caterpillar how to metamorphose (&quot;I can't say that I'll miss my human form much&quot;). Rhythmically a balanced mix of energetic grooves and melancholy explorations, the album is wall-to-wall artful expression that finds a songwriter thriving as part of a four-piece","torrent":{"xt":"urn:btih:8aec8c098f58c2bad20549db05808251624e318d","amp;dn":"Big+Thief+-+Masterpiece+%282016%29+%5B16.44+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aec8c098f58c2bad20549db05808251624e318d","infoHashBuffer":{"type":"Buffer","data":[138,236,140,9,143,88,194,186,210,5,73,219,5,128,130,81,98,78,49,141]},"announce":[],"urlList":[]}}