{"title":"Electrical and Electronic Principles and Technology, 4th Edition","uid":6772816,"size":33419463,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b08812ce20e296e938dde8042b6c543cada0b4e&amp;dn=Electrical+and+Electronic+Principles+and+Technology%2C+4th+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1319634034,"description":"Electrical and Electronic Principles and Technology, Fourth Edition by John Bird\nNewnes | English | 2010 | ISBN: 0080890563 | 440 pages | PDF\n\nIn this book John Bird introduces electrical principles and technology through examples rather than theory ? enabling students to develop a sound understanding of the principles needed by technicians in fields such as electrical engineering, electronics and telecommunications. No previous background in engineering is assumed, making this an ideal text for vocational courses at Level 2 and 3, foundation degree and introductory courses for undergraduates.\n\nThe book presents a logical topic progression rather than following the structure of a particular syllabus. However, the coverage of this new edition has been brought fully in line with the electrical and electronics units of the 2007 BTEC National specification. It is also designed to cover the requirements of the BTEC First specifications.\n\nNew material in this third edition includes brand new chapters on semiconductor diodes and transistors as well as added sections on batteries, fuel cells and alternative and renewable energies, relative and absolute voltages, self and mutual inductance, and virtual test and measuring instruments.\n\nSupport material for tutors is available as a free download via the Instructor Manual section on http://textbooks.elsevier.com:\n- Instructor?s manual with full solutions and suggested marking scheme for all 7 revision tests in the book\n- Solutions manual with worked solutions for about 400 of the further problems in the book\n- Electronic files for all illustrations in the book\n- New colour layout helps navigation and highlights key learning points, formulae and exercises\n- 400 worked problems and over 1,300 questions, all with answers\n- Fully up to date with the 2007 BTEC National specification\n- Free lecturer support material available via textbooks.elsevier.com","torrent":{"xt":"urn:btih:8b08812ce20e296e938dde8042b6c543cada0b4e","amp;dn":"Electrical+and+Electronic+Principles+and+Technology%2C+4th+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b08812ce20e296e938dde8042b6c543cada0b4e","infoHashBuffer":{"type":"Buffer","data":[139,8,129,44,226,14,41,110,147,141,222,128,66,182,197,67,202,218,11,78]},"announce":[],"urlList":[]}}