{"title":"Pearl Harbor (dublado) DVDrip .avi","uid":5079955,"size":1459769096,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8b850b349cef57c5acfc1d3ae8f1cfe92a170182&amp;dn=Pearl+Harbor+%28dublado%29+DVDrip+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Prathero","files":1,"time":1252201006,"description":"A trama ÃƒÂ© baseada na vida de dois ousados pilotos do Tennessee que se conheciam desde a infÃƒÂ¢ncia, Rafe McCawley e Danny Walker.\n\nAmbos se alistam no exÃƒÂ©rcito e treinam como pilotos de caÃƒÂ§a, e conhecem a bonita e dedicada enfermeira Evelyn (Kate Beckinsale). Rafe e Evelyn iniciam um romance.\n\nCom a guerra na Europa, Rafe se voluntaria para lutar juntamente com a Royal Air Force na Batalha da Inglaterra para defender o Reino Unido da Luftwaffe, insistindo para que seu amigo Danny ficasse nos Estados Unidos, cuidando de sua amada Evelyn.\n\nTanto Evelyn como Danny sÃƒÂ£o transferidos para o HavaÃƒÂ­, um lugar distante da guerra, com aparÃƒÂªncia paradisÃƒÂ­aca. Evelyn recebe a notÃƒÂ­cia de que o aviÃƒÂ£o de Rafe fora abatido, e por nÃƒÂ£o haver mais notÃƒÂ­cias, ele fora considerado morto em combate.\n\nApÃƒÂ³s algum tempo, Evelyn e Danny inciam um romance, e surpreendentemente Rafe reaparece. Ele sobrevivera ÃƒÂ  queda, sendo resgatado por um barco francÃƒÂªs e nÃƒÂ£o pode enviar notÃƒÂ­cias estar na FranÃƒÂ§a ocupada.\n\nRafe e Danny brigam em um bar, e acordam no dia seguinte com o inÃƒÂ­cio do ataque a Pearl Harbor. Com muita dificuldade, conseguem subir em seus aviÃƒÂµes, e abatem sete aviÃƒÂµes japoneses.\n\nOs trÃƒÂªs voltam para os Estados Unidos, e tanto Rafe como Danny sÃƒÂ£o convocados para um treino secreto, no que seria o Ataque Doolittle.\n\nAntes de partirem para o ataque secreto, Evelyn confidencia ÃƒÂ  Rafe que estÃƒÂ¡ grÃƒÂ¡vida de Danny. Com dificuldades, a incursÃƒÂ£o completa seus objetivos, e os aviÃƒÂµes tÃƒÂªm um pouso forÃƒÂ§ado na China ocupada, com falta de combustÃƒÂ­vel e sem pista de aterrisagem. Danny ÃƒÂ© preso e morto pelas tropas japonesas, e apenas Rafe volta com vida. Evelyn e Rafe casam, e dÃƒÂ£o o nome de Danny para seu filho.","torrent":{"xt":"urn:btih:8b850b349cef57c5acfc1d3ae8f1cfe92a170182","amp;dn":"Pearl+Harbor+%28dublado%29+DVDrip+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b850b349cef57c5acfc1d3ae8f1cfe92a170182","infoHashBuffer":{"type":"Buffer","data":[139,133,11,52,156,239,87,197,172,252,29,58,232,241,207,233,42,23,1,130]},"announce":[],"urlList":[]}}