{"title":"State-Sponsored Terrorism, Crimes, and Lies - Collection 13 (Fra","uid":9138839,"size":190118731,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b86d8c8bae6d267677edb684e604d9fba688ffe&amp;dn=State-Sponsored+Terrorism%2C+Crimes%2C+and+Lies+-+Collection+13+%28Fra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"moman73","files":27,"time":1383469781,"description":"State-Sponsored Terrorism, Crimes, and Lies - Collection 13 (France):\n\nFrance was one of the major colonizing nations that used to occupy large areas of Africa, the Middle East, Indochina, and the Caribbean.  Its atrocities and trails of blood in its colonies - especially in Algeria, and Western and Central Africa - are well documented. After suffering heavy losses in its wars in Indochina (Vietnam) it tricked and dragged the U.S. to take its place there; and the rest of the story is history.\n\nInterestingly, this great colonial, nuclear nation feels threatened by a piece of cloth called &quot;Hijab or Veil&quot;, that is part of the Muslim woman dress. Special laws to outlaw the Hijab were issued, and those women who wear Hijab were hunted, expelled from work or schools, inflicted with heavy fines, and sometimes were put in jail.\n\nWe have 27 titles here:\n\n-  Andress - Massacre at the Champ de Mars; Popular Dissent and Political Culture in the French Revolution (2000)\n\n-  Bloom - French Colonial Documentary; Mythologies of Humanitarianism (2008)\n\n-  Carroll - Blood and Violence in Early Modern France (2006)\n\n-  Desan - The Family on Trial in Revolutionary France (2004)\n\n-  Dopkin - A Concise History of the Haitian Revolution (2012)\n\n-  Dutailles - Feudal Monarchy in France and England (1936)\n\n-  Fotesque - France and 1848; the End of Monarchy (2005)\n\n-  Gildea - France Since 1945 (2002)\n\n-  Horne - A Savage War of Peace; Algeria, 1954-1962 (2006)\n\n-  HRW - Lost in Transit; Insufficient Protection for Unaccompanied Migrant Children at Roissy Charles de Gaulle Airport (2009)\n\n-  HRW - No Questions Asked; Intelligence Cooperation with Countries That Torture (2010)\n\n-  HRW - Preempting Justice; Counterterrorism Laws and Procedures in France (2008)\n\n-  HRW - The Root of Humiliation; Abusive Identity Checks in France (2012)\n\n-  Keaton - Muslim Girls and the Other France (2006)\n\n-  Laborde - Critical Republicanism; the Hijab Controversy and the Political Philosophy (2008)\n\n-  Logevall - Embers of War; the Fall of an Empire and the Making of America's Vietnam (2012)\n\n-  Magraw - France, 1800-1914; a Social History (2002)\n\n-  Mudimbe-Boyi (Ed.) - Empire Lost; France and its Other Worlds (2009)\n\n-  Naylor - France and Algeria; a History of Decolonization and Transformation (2000)\n\n-  Pears - Remnants of Empire in Algeria and Vietnam; Women, Words and War (2004)\n\n-  Porter - Eyes to the South; French Anarchists &amp; Algeria (2011)\n\n-  Scott - The Politics of the Veil (2007)\n\n-  Silverstein - Algeria in France; Transpolitics, Race, and Nation (2004)\n\n-  Taithe - The Killer Trail; a Colonial Scandal in the Heart of Africa (2009)\n\n-  Taylor - Soldiers of Christ; Preaching in Late Medieval and Reformation France (1992)\n\n-  Thomas - Nation-building, Propaganda, and Literature in Francophone Africa (2002)\n\n-  Wakefield - Hersey, Crusade and Inquisition in Southern France, 1100-1250 (1974)\n\n","torrent":{"xt":"urn:btih:8b86d8c8bae6d267677edb684e604d9fba688ffe","amp;dn":"State-Sponsored+Terrorism%2C+Crimes%2C+and+Lies+-+Collection+13+%28Fra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b86d8c8bae6d267677edb684e604d9fba688ffe","infoHashBuffer":{"type":"Buffer","data":[139,134,216,200,186,230,210,103,103,126,219,104,78,96,77,159,186,104,143,254]},"announce":[],"urlList":[]}}