{"title":"Stephen Moss - Fear the Survivors (The Fear Saga #2)","uid":13286627,"size":508966295,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8b9504437646f378390bdb4f35f373160c4c77d7&amp;dn=Stephen+Moss+-+Fear+the+Survivors+%28The+Fear+Saga+%232%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Cybotage","files":53,"time":1453545348,"description":"The earth lies shaken in the aftermath of a conspiracy. Some of the smartest minds on the planet have striven for and died in an effort to scour the skies of four vast alien satellites, but their success has brought a terrible vengeance down upon us.\r\n\r\nWhile alien Agents stalk the earth, a team of exhausted scientists and military outcasts struggle to fight them amongst a planet on the brink. The brink of plague, the brink of war, and the brink of an invasion larger than they can possibly imagine.\r\n\r\nBut they have allies. Two of the alien Agents have forsaken their homes, their families, their very species to stop the greatest act of genocide any of them has ever known. John and Shahim have great abilities. They carry with them the knowledge we need to save humanity and take us into a new and marvelous age.\r\n\r\nBut Lana and the remaining enemy Agents are far from defeated. As they begin to reap havoc among the diseased and bereft, Neal, Ayala, and Barrett must find a way to achieve the impossible, by fair means or foul they must unite the world’s disparate nations. And they must do so quickly, for the Armada is fast approaching, and behind the great fires of their decelerating engines, the huge fleet is readying itself for war. \r\n\r\n\r\n\r\n\r\nRead by R.C. Bray\r\nFormat: MP3\r\nBitrate: Variable\r\nUnabridged","torrent":{"xt":"urn:btih:8b9504437646f378390bdb4f35f373160c4c77d7","amp;dn":"Stephen+Moss+-+Fear+the+Survivors+%28The+Fear+Saga+%232%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b9504437646f378390bdb4f35f373160c4c77d7","infoHashBuffer":{"type":"Buffer","data":[139,149,4,67,118,70,243,120,57,11,219,79,53,243,115,22,12,76,119,215]},"announce":[],"urlList":[]}}