{"title":"Roky Erickson - You're Gonna Miss Me 1991","uid":6746724,"size":401952463,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8c1d1954e86f3be29fe782e3777d6704dc48280e&amp;dn=Roky+Erickson+-+You%5C%27re+Gonna+Miss+Me+1991&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"barber9","files":-1,"time":1318718966,"description":"Legendary rock n roll pioneer Roger Kynard Roky Erickson hails from Austin, Texas. He is, in the words of music writer Richie Unterberger, one of the unknown heroes of rock and roll. As singer, songwriter, and guitar player for the legendary Austin, TX band The 13th Floor Elevators, the first rock and roll band to describe their music as psychedelic, Roky had a profound impact on the San Francisco scene when the group traveled there in 1966.\n\nWhile bands such as The Grateful Dead and The Jefferson Airplane had their roots in traditional acoustic folk music, the Elevators unique brand of heavy, hard-rocking electric blues pointed to a new direction for the music of the hippie generation. The Elevators only had one chart hit, the Roky-penned You're Gonna Miss Me, but their influence was far reaching. R.E.M., ZZ Top, Poi Dog Pondering, The Judybats, T-Bone Burnett, Julian Cope, The Jesus and Mary Chain, The Cramps, The Minutemen, Television, The Cynics, The Lyres, Teisco Del Rey, The Fuzztones and Radio Birdman have all either recorded or played live versions of Roky's songs.\n\nIn addition to these performers, Roky is an acknowledged influence on such diverse musicians as Robert Plant, Janis Joplin, Patti Smith, Henry Rollins, Mike Watt, Sonic Youth, The Butthole Surfers, Jon Spencer, The Damned, Red Krayola, Pere Ubu, and current indie hit-makers The White Stripes. His songs have appeared on the soundtracks to the movies High Fidelity, Drugstore Cowboy, Boys Don't Cry, Hamlet (2000), and Return of the Living Dead. While he may not be a household name, Roky has enjoyed the support of a small but fiercely loyal cult following throughout his career. (rokyerickson.net)\n\n- - -\n\nThe title is not entirely truthful, as this compilation covers only Roky Erickson's '80s work for the Enigma/Pink Dust/Restless family of labels, and much of the Texas singer/songwriter's best work, including the title track (showcased here in a 1981 live performance in his hometown of Austin), was recorded in the '60s. Still, this is the best overview of a confusing period in Erickson's career, when the same basic set of songs were recorded several times and released on a variety of labels around the world. (Versions of these songs, most of them recorded in the early '80s, were still showing up in the late '90s.) The versions collected here tend to be the definitive ones, most of them produced by ex-Creedence Clearwater Revival bassist Stu Cook in the late '70s and early '80s. There's an unfortunate element of Hey! Lookit the weird crazy guy! in some circles of Erickson's admirers, a disturbingly voyeuristic quality that largely ignores the fact that although Erickson's legendary mental problems are part of his mystique, he's also an incredibly gifted songwriter. There are songs on here, particularly the remarkably catchy Buddy Holly tribute Starry Eyes, the manic rocker Don't Slander Me and the dreamy I Have Always Been Here Before, that would cement Erickson's place in the underappreciated pop genius category even without the legacy of his early '70s stay in a Texas state mental hospital. However, he will unfortunately always be better known for inferior but more lyrically provocative tunes like Creature With the Atom Brain and I Walked With a Zombie. Despite its flaws, You're Gonna Miss Me does a fair job of summarizing this sad state of affairs.\n(Stewart Mason, All Music Guide)\n\n\n- - -\n\nRoky Erickson -You're Gonna Miss Me - The Best of Roky Erickson  1991\n(Restless Records)\n\n 1. Don't Shake Me Lucifer\n 2. Bermuda\n 3. Nothing in Return\n 4. Click Your Fingers Applauding the Play\n 5. I am\n 6. I Have Always Been Here Before\n 7. White Faces\n 8. Night of the Vampire\n 9. Don't Slander Me\n10. Starry Eyes\n11. If You Have Ghosts\n12. Can't Be Brought Down\n13. Creature with the Atom Brain\n14. I Walked With a Zombie\n15. The Interpreter\n16. Two-Headed Dog (Red Temple Prayer) \n17. You're Gonna Miss Me (live)\n18. Wake up to Rock &amp; Roll (live)\n19. Gonna Die More (live) \n20. I am a Demon\n21. Leave My Kitten Alone\n","torrent":{"xt":"urn:btih:8c1d1954e86f3be29fe782e3777d6704dc48280e","amp;dn":"Roky+Erickson+-+You%5C%27re+Gonna+Miss+Me+1991","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c1d1954e86f3be29fe782e3777d6704dc48280e","infoHashBuffer":{"type":"Buffer","data":[140,29,25,84,232,111,59,226,159,231,130,227,119,125,103,4,220,72,40,14]},"announce":[],"urlList":[]}}