{"title":"Rehabilitation in Movement Disorders [PDF] [StormRG]","uid":10424204,"size":14107101,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8cc0edfd32ae58e27d447123504c6f63d58cf27f&amp;dn=Rehabilitation+in+Movement+Disorders+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":2,"time":1403680042,"description":"Author: Robert Iansek (Editor), Meg E. Morris (Editor)\nSeries: Cambridge Medicine\nHardcover: 261 pages\nPublisher: Cambridge University Press; 1 edition (June 28, 2013)\nLanguage: English\nISBN-10: 110701400X\nISBN-13: 978-1107014008\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nMovement disorders affect a growing patient population, but providing comprehensive care is extremely difficult. Several of these conditions are progressive and incurable; the basal ganglia has a complex role in movement control, with many potential malfunctions. This book focuses on rehabilitation approaches that have been developed and utilized internationally in an attempt to minimize impairment and maximize participation amongst these patients. Each chapter is written by movement disorder experts, rehabilitation specialists and health care professionals, giving a broad overview of current interventions and emphasizing the need for interdisciplinary management, focussing on deliverable outcomes. Common conditions such as Parkinson's disease, cerebral palsy, dystonia and Huntington's disease are comprehensively covered. This book gives neurologists, geriatricians and rehabilitation specialists an up-to-date, theoretically-based approach to managing movement disorders related to basal ganglia malfunction. Also valuable for physiotherapists, occupational therapists, speech pathologists, nurses and social workers seeking to develop and plan appropriate interventions.","torrent":{"xt":"urn:btih:8cc0edfd32ae58e27d447123504c6f63d58cf27f","amp;dn":"Rehabilitation+in+Movement+Disorders+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cc0edfd32ae58e27d447123504c6f63d58cf27f","infoHashBuffer":{"type":"Buffer","data":[140,192,237,253,50,174,88,226,125,68,113,35,80,76,111,99,213,140,242,127]},"announce":[],"urlList":[]}}