{"title":"EXPLOITED COLLEGE GIRLS - Ashley - Innocent Teen Messy Creampie ","uid":8818513,"size":420152651,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:8cde654b5435a8635b9dcfbecdf48b9765585930&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Ashley+-+Innocent+Teen+Messy+Creampie+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"beta2008x","files":1,"time":1376643438,"description":" &lt;a href=&quot;http://imgboxxx.com/viewer.php?file=1vmbq_ash.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imgboxxx.com/viewer.php?file=1vmbq_ash.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=r79oy_ecg_ashley3_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=r79oy_ecg_ashley3_s.jpg&lt;/a&gt;\n\n\nAnother week and I've managed to find another beautiful ASU girl whose got her heart set on getting into the porn business, this one has really got the skills, she fucks like a rabbit and takes a huge, messy creampie like a (soon to be?) pro. Ashley is a very well built 18 year old Latina who seems to really enjoy getting fucked on camera. Something tells me that if you are a fan, you should stay tuned to the internet because she's going to pop up again.\n\nI get in a good interview with Ashley as she touches up her make up and she hints at a very fun inner freak: she loves sex, loves being watched, loves girl on girl. In fact, she's into all of my favorites aside from anal (sigh?) As she tells me about how hot she gets dominating another girl I have her pull her shirt off to get things started. She reveals a very, very perky set of boobies. Is there anything that being a hot 18 year old can't solve?\n\nWhen I get Ashley situated on the bed she admits that she doesn't fully shave her bush, and I'm suddenly even more excited. It's been ages since I saw a legit furry pussy. She pulls her panties off and, real talk, she's got a neat little bush going on. Not bad! Just like Penthouse in the 80's! As soon as I apply some lube Ashley spreads her legs wide and gets started without me, this is always a good sign! I move in and take over and can feel her relax into my hand. I get the idea that she really wants to orgasm for me, and I get more aggressive. Before I know it, she's squeezing her thighs and bucking on the bed, it's hot. A great real orgasm.\n\nShe asks me to hold off because she thinks she's going to pee, however as a connoisseur of squirters, I know this means she's actually about to let loose with a squirting O for me. I encourage her and try to help her along but we can't quite get there, maybe next time? Instead I have her drop to her knees and suck me hard because I'm dying to get at that furry pie. When you hear the sexy noises Ashley makes as we start to fuck, it's pretty obvious she was dying to get to it, too.\n\nShe's really responsive and really likes getting fucked, she just might have a future in the industry after all. After getting her off in mish, I have her flip over and I pound her ass into the bed from behind. Combined with a few strategic ass slaps and hair pulls, it's hot stuff. I have a great idea for the big finish and it involves a huge creampie that I've been saving up for. I set Ashley on a chair at the perfect angle and pound her from behind until I blow a huge load in her furry pussy that she squeezes out like an expert. I hate to brag but this is possibly the greatest creampie ever captured on film.\n\nFor an 18 year old first timer I think Ashley was great. Aside from being afraid of anal, she was enthusiastic and sexy through the whole shoot. What do you guys think? ","torrent":{"xt":"urn:btih:8cde654b5435a8635b9dcfbecdf48b9765585930","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Ashley+-+Innocent+Teen+Messy+Creampie+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cde654b5435a8635b9dcfbecdf48b9765585930","infoHashBuffer":{"type":"Buffer","data":[140,222,101,75,84,53,168,99,91,157,207,190,205,244,139,151,101,88,89,48]},"announce":[],"urlList":[]}}