{"title":"A Culture of Stone - Inka Perspectives on Rock (Art Architecture","uid":8888111,"size":10543047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d3b711b937da6306ae44428803304d8facdd7f8&amp;dn=A+Culture+of+Stone+-+Inka+Perspectives+on+Rock+%28Art+Architecture&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"STBGD","files":-1,"time":1378516004,"description":"Carolyn Dean, &quot;A Culture of Stone: Inka Perspectives on Rock&quot;\nEnglish | 2010 | ISBN: 0822348071, 0822347911 | 320 pages | PDF | 10 MB\n\nA major contribution to both art history and Latin American studies, A Culture of Stone offers sophisticated new insights into Inka culture and the interpretation of non-Western art. \nCarolyn Dean focuses on rock outcrops masterfully integrated into Inka architecture, exquisitely worked masonry, and free-standing sacred rocks, explaining how certain stones took on a life of their own and played a vital role in the unfolding of Inka history. Examining the multiple uses of stone, she argues that the Inka understood building in stone as a way of ordering the chaos of unordered nature, converting untamed spaces into domesticated places, and laying claim to new territories. Dean contends that understanding what the rocks signified requires seeing them as the Inka saw them: as potentially animate, sentient, and sacred. \n\nThrough careful analysis of Inka stonework, colonial-period accounts of the Inka, and contemporary ethnographic and folkloric studies of indigenous Andean culture, Dean reconstructs the relationship between stonework and other aspects of Inka life, including imperial expansion, worship, and agriculture. She also scrutinizes meanings imposed on Inka stone by the colonial Spanish and, later, by tourism and the tourist industry. A Culture of Stone is a compelling multidisciplinary argument for rethinking how we see and comprehend the Inka past.","torrent":{"xt":"urn:btih:8d3b711b937da6306ae44428803304d8facdd7f8","amp;dn":"A+Culture+of+Stone+-+Inka+Perspectives+on+Rock+%28Art+Architecture","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d3b711b937da6306ae44428803304d8facdd7f8","infoHashBuffer":{"type":"Buffer","data":[141,59,113,27,147,125,166,48,106,228,68,40,128,51,4,216,250,205,215,248]},"announce":[],"urlList":[]}}