{"title":"Mexico and El Norte","uid":15935334,"size":203175170,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d4350643ebe5d16d4678d22ee6b8d516a0081b1&amp;dn=Mexico+and+El+Norte&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":5,"uploader":"jesus_malverde","files":92,"time":1475388128,"description":"Mexico and El Norte/the United States of America\r\nAnglos and Mexicans in the Making of Texas\r\nBeyond Borders: A History of Mexican Migration to the United States\r\nCannabis: A History\r\nDying for the Truth: Undercover Inside Mexico’s Drug War\r\nEl Narco: Inside Mexico’s Criminal Insurgency\r\nEmpire and Revolution: The Americans in Mexico Since the Civil War\r\nExecutioner’s Men: Los Zetas, Rogue Soldiers, Criminal Entrepreneurs, and the Shadow State They Created\r\nFight to Save Juarez: Life in the Heart of Mexico’s Drug War\r\nGangster Warlords: Drug Dollars, Killing Fields, and the New Politics of Latin America\r\nIn the Shadow of Saint Death: The Gulf Cartel and the Price of America’s Drug War in Mexico\r\nMexican American and Immigrant Poverty in the US \r\nMexican Labor Migrants and U.S. Immigration Policies: From Sojourner to Emigrant?\r\nMigra!: A History of the U.S. Border Patrol\r\nNarcoland: The Mexican Drug Lords and Their Godfathers\r\nNarconomics: How to Run a Drug Cartel\r\nOpium: A History\r\nPersistent Oligarchs: Elites and Politics in Chihuahua, Mexico, 1910-1940\r\nPolitics of Heroin: CIA Complicity in the Global Drug Trade\r\nRevolutionary Mexico: The Coming and Process of the Mexican Revolution\r\nSecurity in Mexico: Implications for U.S. Policy Options\r\nThe American Disease: Origins of Narcotic Control\r\nThe Beast: Riding the Rails and Dodging Narcos on the Migrant Trail\r\nThe Plan de San Diego: Tejano Rebellion, Mexican Intrigue \r\nThe Reaper’s Line: Life and Death on the Mexican Border\r\nThe Secret War in El Paso: Mexican Revolutionary Intrigue, 1906-1920\r\nThe Texas Rangers and the Mexican Revolution: The Bloodiest Decade, 1910-1920\r\nThey Called them Greasers: Anglo Attitudes toward Mexicans in Texas, 1821-1900\r\nWar Along the Border: The Mexican Revolution and Tejano Communities \r\nWhy Walls Won’t Work: Repairing the U.S.-Mexico Divide\r\nTo Die in Mexico: Dispatches from inside the drug war\r\nZapata and the Mexican Revolution","torrent":{"xt":"urn:btih:8d4350643ebe5d16d4678d22ee6b8d516a0081b1","amp;dn":"Mexico+and+El+Norte","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d4350643ebe5d16d4678d22ee6b8d516a0081b1","infoHashBuffer":{"type":"Buffer","data":[141,67,80,100,62,190,93,22,212,103,141,34,238,107,141,81,106,0,129,177]},"announce":[],"urlList":[]}}