{"title":"The Royals and the Nazis  (2015 - Unabridged)","uid":12089800,"size":159527100,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8dc9cedd5f6e06b6a70db69a5c22ad058f9b459c&amp;dn=The+Royals+and+the+Nazis++%282015+-+Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"davieboy1966","files":2,"time":1436007105,"description":"Written by Andrew Morton\nFormat: MP3\n\nHistorian Andrew Morton's 17 CARNATIONS combines his considerable research background with his proven talent for addictively readable narrative, giving us a true story steeped in intrigue, suspense and historical drama.\n\n17 CARNATIONS tells the story of the feckless Edward VIII, Duke of Windsor, and his wife Wallis Simpson, whose affair with Joachim von Ribbentrop embroiled the duke in a German plot to use him as a puppet king during their takeover of the British Empire. Although we know that the war ended with Hitler's defeat, Edward's story was far from over. The Duke's collaboration with Hitler had resulted in piles of correspondence between them; this damning correspondence, now hidden in a German castle that had fallen to American soldiers, could forever tarnish the reputation of the royal family. 17 CARNATIONS reveals, for the first time in history, the story of the cover-up of those letters, starting with a daring heist--by order of Churchill and the King themselves--to bring the letters back safely to England, out of American hands.\n\nMorton's unique experience and training make him the perfect person to tell this story as it's never been told before, fusing history and entertainment to create a vivid, atmospheric chronicle of the Windsors' darkest secrets. The shadowy connection between the House of Windsor, the German aristocracy, and Hitler has hovered on the edges of public consciousness for decades, but no royal biography or historical chronicle has been able to tell the full story-until now. Drawing on FBI documents, material from the German and British Royal Archives, and the personal correspondence of Churchill, Truman, Eisenhower, and the Windsors themselves, 17 CARNATIONS is a dazzling historical drama, full of adventure, intrigue, and startling revelations, written by a master of the genre.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:8dc9cedd5f6e06b6a70db69a5c22ad058f9b459c","amp;dn":"The+Royals+and+the+Nazis++%282015+-+Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dc9cedd5f6e06b6a70db69a5c22ad058f9b459c","infoHashBuffer":{"type":"Buffer","data":[141,201,206,221,95,110,6,182,167,13,182,154,92,34,173,5,143,155,69,156]},"announce":[],"urlList":[]}}