{"title":"Siberia - A Cultural History (gvn64)","uid":9743310,"size":18602328,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8dcd879be10b833c6ce67e1cd9e26132da42dc87&amp;dn=Siberia+-+A+Cultural+History+%28gvn64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"gnv65","files":-1,"time":1394549039,"description":"Siberia: A Cultural History (Landscapes of the Imagination) \nby Anthony J. Haywood\nSignal Books Limited | October 2010 | ISBN-10: 0199754187 | PDF | 340 pages | 17.7 mb &lt;a href=&quot;\nhttp://www.anthonyjhaywood.com/?page_id=93&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.anthonyjhaywood.com/?page_id=93&lt;/a&gt;\n\nBefore Russians crossed the Urals Mountains in the sixteenth century to settle their &quot;colony&quot; in North Asia, they heard rumors about bountiful fur, of bizarre people without eyes who ate by shrugging their shoulders and of a land where trees exploded from cold. This region of frozen tundra, endless forest, and humming steppe between the Urals and the Pacific Ocean was a vast, strange, and frightening paradise. It was Siberia.\nSiberia is a cradle of civilizations, the birthplace of ancient Turkic empires and home to the cultures of indigenes, including peoples whose ancestors migrated to the Americas. It was a promised land to which bonded peasants could flee their cruel masters, yet also a snow-covered &quot;white hell&quot; across which exiles shuffled in felt shoes and chains. In Stalin's era, Siberia became synonymous with the gulag; today, it is a vast region of bustling metropolises and magnificent landscapes: a place where the humdrum, the beautiful, and the bizarre ignite the imagination. Tracing the historical contours of Siberia, A. J. Haywood offers a detailed account of the architectural and cultural landmarks of cities such as Irkutsk, Tobolsk, Barnaul, and Novosibirsk.\nMagnificent Rivers And Lakes: Lake Baikal, the Ob, Irtysh, Yenisey, Angara, Lena and Amur rivers. Writer Anton Chekhov described some, polar explorer Fridtjof Nansen and the eccentric British merchant captain Joseph Wiggins navigated others.\nThe Cities And The Railway: High fashion and low life, traffic-choked streets, and chimney stacks. Siberia's cities bring a madding crowd far into the remote taiga-linked by the Trans-Siberian Railway, the nineteenth-century &quot;camel track.&quot;\nMystics, Mountains And Ancient Civilizations\nNikolay Rerikh sought the mystical kingdom of Shambhala here, Russian writer Valentin Rasputin was confused by its beauty, while local Altaians themselves see their republic of mountains and steppe as a Central Asian heaven on earth.\n\nAbout the Author\nAnthony Haywood was born in Fremantle, Western Australia and is a freelance author based in Germany. His work includes travel guidebooks, short stories, articles and other non-fiction. &quot;Siberia - A Cultural History&quot; was published in 2010 by Signal Books (UK) and Oxford University Press (USA). See www.anthonyjhaywood.com for more about the author and his books.\nJournalist and author whose published works includes guidebooks and articles on Russia, Austria, and Germany, as well as short stories and translations.","torrent":{"xt":"urn:btih:8dcd879be10b833c6ce67e1cd9e26132da42dc87","amp;dn":"Siberia+-+A+Cultural+History+%28gvn64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dcd879be10b833c6ce67e1cd9e26132da42dc87","infoHashBuffer":{"type":"Buffer","data":[141,205,135,155,225,11,131,60,108,230,126,28,217,226,97,50,218,66,220,135]},"announce":[],"urlList":[]}}