{"title":"Dr. Scott Hahn - Catholic for a Reason, Volumes 1-4","uid":15687928,"size":8755930,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8dd3aa2f0b0a79e5be619034c2a3e1e43cb7f401&amp;dn=Dr.+Scott+Hahn+-+Catholic+for+a+Reason%2C+Volumes+1-4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"catholicstuff","files":12,"time":1472363476,"description":"Catholic for a Reason, Volumes 1-4: Scripture and the Mystery of the Family of God, the Mother of God, the Mass, Marriage and Family Life. Edited by Scott Hahn. (4 books in EPUB/MOBI/PDF)\r\n\r\n\r\nCatholic for a Reason: Scripture and the Mystery of the Family of God\r\n\r\nImagine today's top Catholic authors, apologists, and theologians. Now imagine 12 of them collaborating on a book that answers common questions about and challenges to the teachings and doctrines of the Catholic Church. Imagine no more, it's a reality. Catholic for a Reason, edited by Dr. Scott Hahn and Leon J. Suprenant, with the forward by Archbishop Charles J. Chaput, will help Catholics and non-Catholics alike develop a better understanding of the Church. Each chapter goes to the heart of its topic, presenting the teachings of the Church in a clear, concise, and insightful way. The teachings on Mary, the Eucharist, Baptism, and Purgatory are explained in light of the relationship of God the Father to us. Catholic for a Reason is bound to become an apologetics classic. Authors: Scott Hahn, Jeff Cavins, Fr. Pablo Gadenz, Curtis J. Mitch, Richard A. White, Kimberly Hahn, Sean Innerst, Edward P. Sri, Timothy Gray, Leon J. Suprenant, Kris Gray, and Curtis A. Martin. Foreword by Archbishop Charles J. Chaput, O.F.M. Cap. About the Catholic for a Reason Series: This benchmark series brings together the expert knowledge and personal insight of today's top Catholic apologists on topics at the heart of the Catholic faith. Whether you're a non-Catholic who wants to learn about the Church's teaching, or a Catholic who wants to become a more articulate defender of the faith, the Catholic for a Reason series is for you.\r\n\r\n\r\nCatholic for a Reason II: Scripture and the Mystery of the Mother of God\r\n\r\nCatholic for a Reason II, Second Edition will introduce you more deeply to Mary, the Mother of God, as your mother. Nine well-known Catholics, including Scott and Kimberly Hahn, Jeff Cavins, Tim Gray, and Leon Suprenant-open the pages of God's family album (the Bible) to provide compelling explanations of Mary's role in salvation history and in our daily lives as Christians. The result is a moving tribute and convincing testimony that demolishes common misconceptions about Catholic teaching on Mary. You'll learn why the Catholic Church teaches that Mary was immaculately conceived, remained always a virgin, and was assumed body and soul into heaven. You'll understand how Mary is the fulfillment of the Old Testament images. Most of all, you'll discover what it means to be a child of Mary in the Church. This second edition has been expanded with over 40 pages of new material from Scott Hahn on the Luminous Mysteries and the biblical basis of the Marian dogmas. Authors: Scott Hahn, Curtis A. Martin, Curtis J. Mitch, Tim Gray, Edward P. Sri, Leon J. Suprenant, Kimberly Hahn, Sean Innerst, and Jeff Cavins. Foreword by Bishop James S. Sullivan. About the Catholic for a Reason Series: This benchmark series brings together the expert knowledge and personal insight of today's top Catholic apologists on topics at the heart of the Catholic faith. Whether you're a non-Catholic who wants to learn about the Church's teaching, or a Catholic who wants to become a more articulate defender of the faith, the Catholic for a Reason series is for you.\r\n\r\n\r\nCatholic for a Reason III: Scripture and the Mystery of the Mass\r\n\r\nCatholic for a Reason III explains the Sacrifice of the Mass in light of Scripture and Church teaching—a timely topic, since October 2004 begins a special Year of the Eucharist, declared by Pope John Paul II. Popular Catholic authors, including Scott and Kimberly Hahn, Jeff Cavins, and Tim Gray lend unique insight into topics like the &quot;The Mass and the Synoptic Gospels, &quot;The Eucharist in the Apostolic Church,&quot; and &quot;The Mass and Evangelization.&quot;\r\n\r\n\r\nCatholic for a Reason IV: Scripture and the Mystery of Marriage and Family Life\r\n\r\nMarriage and family life lived according to God s plan can change lives and change the world! Catholic for a Reason IV explores the Scriptural basis for the Catholic understanding of marriage. Join Scott and Kimberly Hahn, Mike Aquilina, and ten other well-known Catholic authors, who along with their spouses, present solid Biblical testimony to the joys, struggles, and sanctity found in the sacrament of Marriage. Essays include The World as Wedding, Lessons Learned at Nazareth, and Reflections on Pope Benedict XVI s First Encyclical.\r\n\r\n\r\n---\r\n\r\nIf you enjoy this media, please seed and purchase a physical copy to support the producers and share with family and friends. \r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.org/user/catholicstuff/","torrent":{"xt":"urn:btih:8dd3aa2f0b0a79e5be619034c2a3e1e43cb7f401","amp;dn":"Dr.+Scott+Hahn+-+Catholic+for+a+Reason%2C+Volumes+1-4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dd3aa2f0b0a79e5be619034c2a3e1e43cb7f401","infoHashBuffer":{"type":"Buffer","data":[141,211,170,47,11,10,121,229,190,97,144,52,194,163,225,228,60,183,244,1]},"announce":[],"urlList":[]}}