{"title":"Pink Floyd and Philosophy (Popular Culture and Philosophy) (pdf)","uid":11470644,"size":1464909,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8dd54fb4ca1bb9bd622ada80e910451c29a78687&amp;dn=Pink+Floyd+and+Philosophy+%28Popular+Culture+and+Philosophy%29+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"zombie_rox","files":1,"time":1416078019,"description":"Pink Floyd's sound and light shows in the 1960s defined psychedelia, but their later recordings combined rock, orchestral music, literature, and philosophy. Dark Side of the Moon and The Wall ignored pop music's usual strictures to focus on themes of madness, despair, brutality, and alienation. Here, 16 scholars set delve into the heart of Pink Floyd by examining ideas, concepts, and problems usually encountered not in a rock band's lyrics but in the pages of Heidegger, Foucault, and Sartre. These include the meaning of existence, the individual's place in society, the contradictions of art and commerce, and the blurry line between genius and madness. The band's dynamic history allows the writers to explore controversies about intellectual property, the nature of authorship, and whether wholes, especially in the case of rock bands, are more than the sum of their parts.\n\nReview\nA collection of 19 essays dissecting Floyd, musically, lyrically and conceptually, always informed, occasionally witty but sometimes, long-winded. Academics combine analytical techniques with their own appreciation, study and experience of enjoying Floyd... Educational, entertaining, at times perplexing, it had me playing those CDs with new insights; I would re-title it: Think Floyd! - &quot;Classic Rock Society&quot;, January 2009\n\nPublisher: Cricket Books, a division of Carus Publishing Co (28 November 2007)\nLanguage: English\nISBN-10: 0812696360\nISBN-13: 978-0812696363\n\nMost Helpful Customer Reviews\n\nShedding Light on the Dark Side of The Moon 3 February 2008\nBy J. J. Kwashnak -\nPink Floyd's music has always been a trippy joy for many, but unlike many of their contemporary counterparts in rock, many have found a unique deepness to their lyrics. Couple that with the stormy story of the band's existence and you have an area ripe for exploration. That is exactly what a number of writers do in this entry into the Popular Culture and Philosophy series. Most writers focus either on the &quot;classic&quot; period of Pink Floyd's music (Dark Side of the Moon, Wish You Were Here, Animals and The Wall) or upon the unfortunate breakdown of member Syd Barrett. As one might expect, Dark Side of the Moon is minded extensively for insights into alienation, madness and existence. If anything, too much time is spent on Dark Side of the Moon, often trying to mine the same set of lyrics. Some essays touch upon the other albums but not to the extent of Moon. Other essays look at the sad descent of Syd into alienation and madness, and bring connections of his experiences to the band's lyrics showing his influence even when not there.\n\nThis volume brings onboard a broad spectrum of writers, including several who are not philosophers or philosophy professors. As a result much of the book carries more discussion of Pink Floyd and the philosophy of life and existence as opposed to viewing the band's work in terms of classical philosophy. There are good examples of the latter - Nietzsche, Foucault and Camus are all mined for insight in essays, but are not used as heavily as earlier volumes. The result is a more accessible entry in the series for non-philosophers to enjoy, gain insight and hopefully listen to Pink Floyd's music in a new way.\n\nPink Floyd and Philosophy 13 December 2008\nBy James R. Sloan -\nIf you are Floyd fanatic like I am, and are into DEEP thinking like I am, you'll love this collection of essays.\n\nFloyd is deeply deconstructed by a number of different authors, who have taken seemingly every aspect there is to be had and dug to the very bottom of it, and then some. Turns out it is all very simple, put together by men who really had absolutely no formal musical training (except for Rick Wright, God rest his soul - Nick Mason couldn't read a drum score until 1987!), but with very precise ideas about what they wanted it all to say to those who really cared to listen.\n\nMuch of the material the authors haved gleaned in a dark room, some properly motivated by various intoxicants, just like it should be. Floyd is best experienced by itself, not as &quot;background noise&quot;. You put on a Floyd album and every time it's an event. Put everything down and just listen to the album: don't read the paper, or watch TV, or write product reviews like I am now while &quot;Dark Side&quot; is on. Just listen and nothing else.\n\nThen read this book and see how much of the material covered that you actually thought of while listening! It was shocking to discover that these authors had much the same interpretations of all aspects of Floyd than I did! Even saw the same things when they closed their eyes and just sunk into the whole thing!\n\nPink Floyd is truly the greatest band in rock and roll history, due to the intellect and angst of all sorts injected into the music and lyrics. Everything, and I mean EVERYTHING you hear, music and lyrics both, mean SOMETHING.\n\nThose at the mid-70's shows that hollered for &quot;Money&quot; had no business at the shows. They just spoiled it for any true Floydian around them.\n\nThe music of Pink Floyd is a total aural and visual experience, not just fluff. We need many more bands out there like that, but there will never be one.\n\nSo now we true Floydians just have to hang on in quiet desperation to what we have, keep replacing CD's that go bad, and keep thinking","torrent":{"xt":"urn:btih:8dd54fb4ca1bb9bd622ada80e910451c29a78687","amp;dn":"Pink+Floyd+and+Philosophy+%28Popular+Culture+and+Philosophy%29+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dd54fb4ca1bb9bd622ada80e910451c29a78687","infoHashBuffer":{"type":"Buffer","data":[141,213,79,180,202,27,185,189,98,42,218,128,233,16,69,28,41,167,134,135]},"announce":[],"urlList":[]}}