{"title":"Darkwatch [PS2][PAL][Multi5][English]","uid":3392131,"size":3202330927,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:8dd7dde358be2a5cae2eba420b1880870f0783c2&amp;dn=Darkwatch+%5BPS2%5D%5BPAL%5D%5BMulti5%5D%5BEnglish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"pctorrent","files":66,"time":1128449444,"description":"Darkwatch (PS2) \n \n Un shooter fant&amp;aacute;stico en primera persona y primer juego de High Moon Studios. \n\n\n\n \nInicialmente previsto para el a&amp;ntilde;o pasado por Sammy Studios, ?Darkwatch? viene a engrosar la lista de shooters en primera persona ya de por s&amp;iacute; abultada en los cat&amp;aacute;logos de PlayStation 2 y Xbox. Eso s&amp;iacute;, tiene algo especial: el &amp;eacute;xito cosechado en Estados Unidos. Se puso a la venta el pasado 16 de agosto y ha cosechado muy buenos resultados que lo convierten en una esperanzadora apuesta para el final de a&amp;ntilde;o, momento en el que presumiblemente llegue a Europa (si bien la versi&amp;oacute;n PS2 podr&amp;iacute;a aterrizar en PAL durante el mes de octubre). Capcom ha sido la distribuidora en EEUU de este lanzamiento finalmente desarrollado por High Moon Studios y que supone el debut de esta joven compa&amp;ntilde;&amp;iacute;a. Este equipo de desarrollo est&amp;aacute; formado por antiguos miembros de Rockstar, Midway, Oddworld y Sony, lo que da una clara dimensi&amp;oacute;n de lo que pueden ser sus futuros proyectos en la pr&amp;oacute;xima generaci&amp;oacute;n de consolas. De momento ya tienen un presente importante con ?Darkwatch?, del que os dejamos nuestras impresiones.\n\nEl Juego \n\n\n \nUno de los elementos en principio m&amp;aacute;s atractivos en ?Darkwatch? es el desarrollo argumental. Los ?Darkwatch? son una sociedad secreta que desde tiempos inmemoriales ha luchado contra las criaturas del mal en la Tierra. Nosotros encarnamos a Jericho Cross, un asaltador de trenes en el viejo Oeste que se dispone a robar un &amp;uacute;ltimo convoy. Por supuesto, es el menos apropiado, ya que en la c&amp;aacute;mara de seguridad del tren Darkwatch se encierra Lazarus, un legendario demonio. Tras una encarnizada lucha contra &amp;eacute;l su maldici&amp;oacute;n cae sobre ti y te convierte en medio vampiro haciendo peligrar tu alma. En ese momento arranca una cuenta atr&amp;aacute;s por salvar tu vida y regresar a una zona segura a caballo cruzando el desierto. Mientras tanto, Lazarus ha resucitado una legi&amp;oacute;n de seres indeseables, por lo que te convertir&amp;aacute;s r&amp;aacute;pidamente en un ?Darkwatch? m&amp;aacute;s para salvar el mundo, y a ti mismo. Descubriremos esta trama en muy pocos minutos de juego, un comienzo muy directo y trepidante que tiene buena culpa de que nuestra curiosidad por conocer el final de la historia siga creciendo. Las misiones del juego est&amp;aacute;n basadas en un esquema bastante cl&amp;aacute;sico de recorrer un escenario desde el punto A al B a excepci&amp;oacute;n de las que se desarrollan a caballo. No hay demasiadas complicaciones ni interminables objetivos secundarios. Es una apuesta m&amp;aacute;s cercana a lo visto en ?Painkiller? que en los ?Medal of Honor?, y es que la acci&amp;oacute;n no cesa en ning&amp;uacute;n momento. Continuamente descargamos nuestras armas para deshacernos de un interminable grupo de enemigos que surgen del subsuelo. En el fondo se trata de la conocida lucha entre el bien y el mal y como guerreros santos que somos tendremos un arsenal a la altura de las circunstancias: pistolas, doble rev&amp;oacute;lver, carabina, dinamita, escopeta, ballesta de flechas explosivas? Cada una de ellas tiene unas caracter&amp;iacute;sticas propias de da&amp;ntilde;o y alcance de disparo que las har&amp;aacute;n m&amp;aacute;s o menos convenientes para seg&amp;uacute;n qu&amp;eacute; situaciones. Lo que s&amp;iacute; tienen en com&amp;uacute;n es la posibilidad de realizar un ataque mele&amp;eacute;. Se trata simplemente de un golpe con la empu&amp;ntilde;adura del arma, la diferencia es que estas empu&amp;ntilde;aduras est&amp;aacute;n equipadas con filos cortantes y hachas que destrozan a los enemigos a corta distancia. Probablemente hay&amp;aacute;is jugado a alg&amp;uacute;n shooter con esta funci&amp;oacute;n, pero que no se vuelve tan esencial como en ?Darkwatch? dada la cantidad de enemigos. Lo peor que se puede se&amp;ntilde;alar en este caso es que s&amp;oacute;lo podemos llevar dos armas simult&amp;aacute;neamente, lo que nos tiene que hacer recordar en qu&amp;eacute; lugar del escenario hicimos los descartes por si la munici&amp;oacute;n escasea. A&amp;uacute;n as&amp;iacute;, es una buena manera de dosificar su uso. \n\n\n\n \nHasta aqu&amp;iacute; llegan las armas e instrumentos de nuestra condici&amp;oacute;n de ?Darkwatch?, pero como hemos dicho, tambi&amp;eacute;n somos medio vampiros y eso tiene serias consecuencias en nuestra condici&amp;oacute;n. La primera de ellas es la posibilidad de realizar un doble salto en el aire que nos dar&amp;aacute; varios segundos de vuelo y la posibilidad de alcanzar una plataforma m&amp;aacute;s elevada. Por otra parte tenemos la ?blood vision?, con la que identificar r&amp;aacute;pidamente a los enemigos y objetos interesantes de la pantalla. En un principio no destaca por su funcionalidad, pero desde luego acaba siendo m&amp;aacute;s frecuente de lo que parece. El &amp;uacute;ltimo punto de nuestro lado oscuro es la utilizaci&amp;oacute;n de poderes. Hay un total de ocho distintos, cuatro del bien y cuatro del mal &amp;iquest;C&amp;oacute;mo decidirnos ante un lado u otro? Al lo largo del juego encontraremos distintas almas atormentadas de Lazarus, si las liberamos estaremos escogiendo el camino del bien. Si por el contrario decidimos enriquecernos a nosotros mismos cada vez nos acercaremos m&amp;aacute;s al lado oscuro. Poco a poco iremos desbloqueando todos ellos. Por ejemplo, podremos disparar con balas de plata e incrementar nuestro da&amp;ntilde;o, hacernos invulnerables a algunos ataques o hacer esclavos a nuestros enemigos. Otro apartado que incrementa la adictividad en ?Darkwatch? es el sistema de guardado. Siempre conflictivo por su naturaleza en PC, esta vez ha sido todo un acierto. Cada nivel est&amp;aacute; dividido en varios puntos de control que no s&amp;oacute;lo sirven para empezar desde ah&amp;iacute; en caso de fracasar, sino tambi&amp;eacute;n para continuar desde ese punto una partida posterior. Se favorecen as&amp;iacute; las partidas r&amp;aacute;pidas y casuales e intentar una y otra vez la misma misi&amp;oacute;n sin desesperar. Adem&amp;aacute;s, una vez que has superado una misi&amp;oacute;n puedes rejugarla tantas veces quieras. \n\n\n\n \nEl modo historia del juego es lo suficientemente s&amp;oacute;lido como para sustentarse por s&amp;iacute; mismo y darnos algo m&amp;aacute;s de una decena de horas de entretenimiento, teniendo en cuenta adem&amp;aacute;s los distintos finales para completarlo. A&amp;uacute;n as&amp;iacute;, hoy d&amp;iacute;a en el mercado la aparici&amp;oacute;n de un shooter tiene la obligaci&amp;oacute;n de incorporar un modo multijugador que redondee el resultado final. ?Darkwatch? tambi&amp;eacute;n ha apostado por ello y nos permite participar en la opci&amp;oacute;n pantalla partida cooperando o compitiendo contra alg&amp;uacute;n amigo. Contamos con un repertorio considerable de mapas inspirados en el modo historia que se quedar&amp;aacute; corto si atendemos s&amp;oacute;lo a los tipos de partida, limitadas a los cl&amp;aacute;sicos del g&amp;eacute;nero. Mucho mejor resultado se obtiene en la versi&amp;oacute;n Xbox dado que cuenta con compatibilidades online que permiten la participaci&amp;oacute;n de hasta 16 jugadores conectados a trav&amp;eacute;s de Xbox Live. En cualquier caso salta a la vista que no es este punto en el que m&amp;aacute;s se apoye el t&amp;iacute;tulo. \n\nA Nivel T&amp;eacute;cnico \n\n\n \nUna de las primeras cosas que podemos adorar o repudiar en ?Darkwatch? es su est&amp;eacute;tica. Nos encontramos en un Western americano mezclado con un toque g&amp;oacute;tico propio de todo lo que rodea a los seres de ultratumba. El resultado es verdaderamente impresionante, no s&amp;oacute;lo por su originalidad, sino por su capacidad para sorprender. Los dise&amp;ntilde;os del juego destacan por su detallismo e influencias del c&amp;oacute;mic, algo que podemos ver en el espigado f&amp;iacute;sico de nuestro protagonista. La historia est&amp;aacute; salpicada de secuencias de v&amp;iacute;deo no recreadas con el motor habitual del juego de considerable calidad y a la altura de los &amp;uacute;ltimos lanzamientos de nivel que hemos visto en PlayStation 2. Durante la partida visitaremos escenarios muy variados, la mayor&amp;iacute;a nocturnos, con numerosos elementos decorativos que adem&amp;aacute;s reaccionan a nuestra presencia gracias a la inclusi&amp;oacute;n de la f&amp;iacute;sica del motor Havok. Encontraremos limitaciones en &amp;eacute;l, pero la sensaci&amp;oacute;n y la ambientaci&amp;oacute;n est&amp;aacute;n muy por encima de las expectativas. En el aspecto sonoro ?Darkwatch? no se queda corto y cumple con las expectativas. No cuenta con una banda sonora &amp;eacute;pica, pero el repertorio de melod&amp;iacute;as inquietantes es inacabable. Eso s&amp;iacute;, son muchas las veces que escucharemos gui&amp;ntilde;os sonoros al salvaje oeste. Con los efectos ocurre exactamente lo mismo y ser&amp;aacute;n constantes los gritos, susurros y explosiones que intenten desestabilizarnos. En la versi&amp;oacute;n americana del juego se ha contado con la presencia de Jennifer Hale, reputada actriz de doblaje que en esta ocasi&amp;oacute;n presta su voz a Cassidy, pero que ya trabaj&amp;oacute; en ?Doom 3?, ?Metroid Prime 2?, ?Metal Gear: Twin Snakes?, ?Killer7? o ?Shadow of Rome?. Por si fuera poco tambi&amp;eacute;n est&amp;aacute; en el reparto Rose McGowan, conocida en nuestro pa&amp;iacute;s por su papel en la serie de televisi&amp;oacute;n ?Embrujadas?. Se desconoce si la versi&amp;oacute;n PAL conservar&amp;aacute; ambas voces. \n\nConclusi&amp;oacute;n \n\n\n \nLos aficionados a los shooter est&amp;aacute;n de enhorabuena, porque con la llegada de ?Darkwatch? se vuelve a demostrar que no est&amp;aacute;n equivocados y que nos quedaba algo m&amp;aacute;s por ver lejos de la Segunda Guerra Mundial. Independientemente de la innovaci&amp;oacute;n argumental, nos encontramos con un juego de acci&amp;oacute;n pura y dura, constante, y que mantiene un nivel de intensidad importante durante toda la partida. Por otra parte, tiene poderes sobrenaturales, variedad de armas, visi&amp;oacute;n vamp&amp;iacute;rica, la lucha entre el bien y el mal? Multitud de componentes que no revolucionan este g&amp;eacute;nero tan visitado, pero que han sido conjugados con habilidad para ofrecer una jugabilidad accesible, divertida y adictiva. Posiblemente siga reservado a los fieles del shooter, pero tambi&amp;eacute;n sin duda es uno de los lanzamientos del a&amp;ntilde;o en este campo.\n \n \n \n \n \n\n","torrent":{"xt":"urn:btih:8dd7dde358be2a5cae2eba420b1880870f0783c2","amp;dn":"Darkwatch+%5BPS2%5D%5BPAL%5D%5BMulti5%5D%5BEnglish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dd7dde358be2a5cae2eba420b1880870f0783c2","infoHashBuffer":{"type":"Buffer","data":[141,215,221,227,88,190,42,92,174,46,186,66,11,24,128,135,15,7,131,194]},"announce":[],"urlList":[]}}