{"title":"The Papacy; Its History, Dogmas, Genius And Prospects - JA Wylie","uid":11714304,"size":32434918,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8dfef6c9ce9c27352703b57de1024f17dbac96e8&amp;dn=The+Papacy%3B+Its+History%2C+Dogmas%2C+Genius+And+Prospects+-+JA+Wylie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"starxteel","files":1,"time":1424484420,"description":"\n\nThis book was first published in 1851, and it still has relevance in the twenty-first century.\nAlthough the entire book is worthy of study, four quotes from this work summarize the essence:\n&quot;Were Lucifer to turn legislator, and indite a code of jurisprudence for the government of mankind, he would find the work done already to his hand in the canon canon law.&quot;\n&quot;...Popery, long after its day is over, will be seen towering across the interval of ages, a stupendous monument of the power for evil which lies in the human soul, and of the prodigious efforts the mind of man can put forth, when impelled to action by hatred to God and the desire of self-aggrandizement.&quot;\n&quot;The object of the Papacy is, in brief, to exalt a man, or rather a class of men, to the supreme, undivided, and absolute control of the world and its affairs.&quot;\n&quot;...Popery is not merely a defective system of Christianity, -- it is a system antagonistic to Christianity.&quot; \n\n\nAbout the author:\nRev. James Aitken Wylie (1808-1890) was a Scottish historian of religion and Presbyterian minister. He was a prolific writer and is most famous for writing The History of Protestantism. Wylie was born in Kirriemuir, Scotland and his father, James Aitken was an Auld Licht Antiburgher minister in the Original Secession Church. Wylie was educated at Marischal College, University of Aberdeen where he stayed for three years before studying at St. Andrews under Thomas Chalmers. He followed his father's example, entering the Original Secession Divinity Hall, Edinburgh in 1827, and was ordained in 1831. In 1852, after joining the Free Church of Scotland, Wylie edited their Free Church Record until 1860. He published his book The Papacy: Its History, Dogmas, Genius, and Prospects in 1851. The Protestant Institute appointed him Lecturer on Popery in 1860. He continued in this role until his death in 1890, publishing in 1888 his work The Papacy is the Antichrist. Wylie's classic work, The History of Protestantism (1878), went out of print in the 1920s. It has received praise from a number of influential figures.\n\nBuy:\n\n[img]http://imagizer.imageshack.us/a/img63/980/keepseeding.gif[/img]","torrent":{"xt":"urn:btih:8dfef6c9ce9c27352703b57de1024f17dbac96e8","amp;dn":"The+Papacy%3B+Its+History%2C+Dogmas%2C+Genius+And+Prospects+-+JA+Wylie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dfef6c9ce9c27352703b57de1024f17dbac96e8","infoHashBuffer":{"type":"Buffer","data":[141,254,246,201,206,156,39,53,39,3,181,125,225,2,79,23,219,172,150,232]},"announce":[],"urlList":[]}}