{"title":"ASG - Win Us Over","uid":5038318,"size":77807721,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8e637c0842db81b538ff9de204e9110d4979a02f&amp;dn=ASG+-+Win+Us+Over&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Baphom3t","files":14,"time":1249240999,"description":"Formed in the North Carolina coastline community of Wrightsville Beach in 2001, the riff-fueled, distortion-driven rock of ASG that can be found on their latest effort has actually been at the band's core since its inception.\n Initially forming as a three-piece instrumental project, due to the lack of a dedicated vocalist, ASG were intensely focusing on devising tight, driving guitar riffs, locking guitarist Jason Shi in with the rhythm section of bassist Andy Ellis and drummer Scott Key. \nBut as time passed and no vocalist was found, Shi was eventually forced to step up to the mic.\nWith Shi becoming more comfortable as a frontman, the group found themselves connecting with Volcom Entertainment, who signed the band and put them in the studio in 2003, to record their debut album, ...The Amplification of Self Gratification.\nIn 2005 ASG found themselves in a proper studio with proper producers, Matt Hyde and Phil Caivano, recording their sophomore album, Feeling Good Is Good Enough, an album that summoned all the band's potential and spawned a thunderous hard rock creation that equaled what the band had been working towards for the past 3 years.\nShortly after completing Feeling Good Is Good Enough, second guitarist, Jonah Citty, was added to help recreate the album's sounds live, which was none too soon as the band quickly found themselves on the road with the likes of The Sword, Torche, Dwarves, and CKY.\nIn June 2007 ASG returned to Los Angeles to record their fourth album, entitled Win Us Over, with Matt Hyde again.\nWin Us Over, is a vivid, psychedelic, and panoramic thrust that is just as much for the ears as it is for the aura; an experience in a colorful and dense cloth of abrasiveness.\nBig beefy guitar riffs and melodic foreboding are soaked in Southern roadhouse whiskey, that just might be laced with psilocybin, and are hazed out through a kaleidoscopic squall that packs a walloping sonic punch.\nWhile the ingredients of stoner rock, psychedelic metal, and angst-ridden punk rock are apparent, ASG doesn't fit under any particular category. Be you a fan of plain ol' rock and roll and don sleeveless flannels while sucking down 22 ouncers and gettin' rowdy - or enjoy waxin' deep on the bong, Win Us Over lives up to it's namesake and ensures that come January 22nd 2008, ASG won't be knocking on any doors; they'll be knocking them down.\n\nCurrent line-up\nJonah\nAndy\nScott\nJason\n\nReview:\nWas I missed? Your dear Solitary has been neglecting his duties, and his punishment, although not severe, was just. Now after the wounds have healed, I finally return to give you, dearest readers, more of what you need and what you can live without. But I digress, we're here to talk about ASG (short for Amplified Self Gratification) and their new album of whiskey soaked southern stoner metal, &quot;Win Us Over.&quot; \n\nThe record dropped on my birthday (Jan. 22), and it marks one of the first albums I've heard in the new year. Let me say that it's been a pleasing introduction to a new year of music. The boys in ASG have been together for about 5 years now, and have a cohesive musical mindset working in their corner due to the experience and road work. Their songs are bombastic, epically written with the almighty riff the centerpiece to just about all of their songs. Deftly mixing some punk angst and sludge into the mix, ASG leave little room in their sound for screwing around. \n\nThe first half of the disc is the more choice section, featuring four of my favorite tracks back to back to back to back. &quot;Right Death Before&quot; is a punchy mid-paced opener, utilizing sharp harmonics and a superb, melodic bridge and chorus to build sweet tension. Vocalist Jason Shi (who also represents 1/2 of the band's guitarists) has a hell of a voice, perfectly crafted for this style of melody-driven stoner metal. &quot;Dream Song&quot;, #2, is hands down the best song present, full of balls and extreme energy.\n\nI can't find much fault in &quot;Win Us Over&quot;, not much at all. When they drift off into softer, acoustic-driven ballads, their quality drops just a touch. It's not that they don't deserve credit for trying; this album definitely needed the variety in songwriting. They'll just have to keep working on their low-tempo material. They've got the heavy down, and they bring it with enough passion and creativity to leave you wanting more and more. Fans of the Sabbath, Kyuss, and any stoner/sludge/southern metal deserves to hear this solid album.  \n\nReviewed by: Kevin Sellers on 2008-02-17\n\nGenre = Stoner Metal / Stoner Rock\nFormat = Mp3\nBit Rate = Vbr\n\nTrack Listing\n1. Right Death Before \n2. Dream Song \n3. Low End Insight \n4. Glow \n5. Coffee Depression Sunshine \n6. Dull Blade, The \n7. Ballad of Richard K. \n8. Taking Me Over \n9. Number to Murder Two, A \n10. Gallop Song \n11. Palm Springs \n12. Win Us Over \n13. Bombs Away","torrent":{"xt":"urn:btih:8e637c0842db81b538ff9de204e9110d4979a02f","amp;dn":"ASG+-+Win+Us+Over","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e637c0842db81b538ff9de204e9110d4979a02f","infoHashBuffer":{"type":"Buffer","data":[142,99,124,8,66,219,129,181,56,255,157,226,4,233,17,13,73,121,160,47]},"announce":[],"urlList":[]}}