{"title":"Storycraft - The Complete Guide to Writing Narrative Nonfiction","uid":10588699,"size":3227712,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e7273210400ad677f30d2fc48ff6d07b9fec917&amp;dn=Storycraft+-+The+Complete+Guide+to+Writing+Narrative+Nonfiction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1405778160,"description":"From the work of the New Journalists in the 1960s, to the &quot;New Yorker&quot; articles of John McPhee, Susan Orlean, Atul Gawande, and a host of others, to blockbuster book-length narratives such as Mary Roach's &quot;Stiff&quot; or Erik Larson's &quot;The Devil in the White City&quot;, narrative nonfiction has come into its own. Yet writers looking for guidance on reporting and writing true stories have had few places to turn for advice. Now, Jack Hart, a former managing editor of the Oregonian who guided several Pulitzer Prize-winning narratives to publication, delivers &quot;Storycraft&quot;, which certainly will become the definitive guide to the methods and mechanics of crafting narrative nonfiction. Hart covers what narrative writers need to know, from understanding story theory and structure, to mastering point of view and such basic elements as scene, action, and character, to drafting, revising, and editing work for publication. Revealing the stories behind the stories, Hart brings readers into the process of developing nonfiction narratives by sharing tips, anecdotes, and recommendations he forged during his decades in journalism. From there, he expands the discussion to other well-known writers to show the broad range of texts, styles, genres, and media to which his advice applies. With examples that draw from magazine essays, book-length nonfiction narratives, film and broadcast documentaries, and radio programs, &quot;Storycraft&quot; will be an indispensable resource for years to come.\n\nAbout the Author\nJack Hart was formerly managing editor and writing coach at the Oregonian. He received a National Teaching Award from the American Society of Newspaper Editors and a University of Wisconsin Distinguished Service Award for his contributions to journalism, has taught on the faculties of six universities, and was named the Ruhl Distinguished Professor at the University of Oregon School of Journalism and Communication. He is the author of A Writer's Coach.","torrent":{"xt":"urn:btih:8e7273210400ad677f30d2fc48ff6d07b9fec917","amp;dn":"Storycraft+-+The+Complete+Guide+to+Writing+Narrative+Nonfiction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e7273210400ad677f30d2fc48ff6d07b9fec917","infoHashBuffer":{"type":"Buffer","data":[142,114,115,33,4,0,173,103,127,48,210,252,72,255,109,7,185,254,201,23]},"announce":[],"urlList":[]}}