{"title":"Sam Harris - Islam and the Future of Tolerance (mobi, epub)","uid":13315189,"size":398143,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8eb8c4ad2df5726ca16a2e92ea34cdb03764dd52&amp;dn=Sam+Harris+-+Islam+and+the+Future+of+Tolerance+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"KindHarpy","files":3,"time":1453821859,"description":"Sam Harris and Maajid Nawaz - Islam and the Future of Tolerance: A Dialogue (mobi, epub)\r\n\r\n\r\n&quot;How refreshing to read an honest yet affectionate exchange between the Islamist-turned-liberal-Muslim Maajid Nawaz and the neuroscientist who advocates mindful atheism, Sam Harris.... Their back-and-forth clarifies multiple confusions that plague the public conversation about Islam.&quot;--Irshad Manji, in the *New York Times Book Review*\r\n\r\n&quot;Provocative and profane ... *Islam and the Future of Tolerance* exemplifies the virtues of open dialogue.... All Harris and Nawaz seek is to give voice to the spirit of rebellion and reformation smoldering in the lands of Islam. Forcing it into flame will doubtless be a long time coming, but these two men should be lauded for endeavoring to provide a spark.&quot;--Brian Stewart, in the *National Review*\r\n\r\n&quot;A worthwhile read on the state of Islam and religious tolerance in the world today.... Those interested in a deferential and detailed dialogue about human rights, Islam, jihadism, and pluralism will find this book both enlightening and engaging.&quot;--*Publishers Weekly*\r\n\r\n&quot;In this conversation, Sam Harris and Maajid Nawaz achieve what so many who take part in the debate on Islam and the West fail to accomplish: a civil but honest dialogue. The result is as illuminating as it is fascinating. Courteous and at times even chivalrous, the two men address every thorny issue on Islam, issues that lead so many others into wild shouting matches, personal attacks, and accusations of Islamophobia. In this gem of a book the authors lay it all out and set the rest of us a great example: that an incisive debate on Islam between a believer and a non-believer is attainable. Given the importance and the urgency of the topic, we must all read it and follow in their footsteps.&quot;--Ayaan Hirsi Ali, author of *Infidel*\r\n\r\n&quot;Free thought and rational inquiry once characterized the relative liberalism and humanism of ancient Muslim societies and civilizations: the leading Sunni Imam, Abu Hanifa, would debate atheists inside the great mosques of Iraq; the Abbasid caliphs hosted debates amongst the leaders of Judaism, Christianity, and Islam at their courts in Baghdad; the Mughal emperors engaged in debate with Christians, Hindus, and Buddhists. Sam Harris and Maajid Nawaz should be commended for conducting a frank and wide-ranging conversation about a number of key issues around religion, reform, and Islam in the modern world. Nawaz's approach is based upon detailed familiarity with extremist worldviews, and with the history and tradition of reform theology and renewal within Islam that desperately needs to be amplified. I hope that this debate will be a fruitful endeavor, and illustrate that, in our increasingly-polarized world, it is possible and even normal for people with different viewpoints to have a civilized conversation and to learn from each other.&quot;--Sheikh Dr. Usama Hasan, Islamic scholar\r\n\r\n&quot;Back in Islam's formative centuries, the engagement of Muslims with their ideological opponents helped them to forge the doctrines and traditions of their nascent faith--and perhaps now, as Maajid Nawaz locks horns with Sam Harris, we are at the start of another stage in Islam's evolution. It is certainly a privilege to read their conversation, and to enjoy a flavor of those great debates between rival scholars that were once staged for the entertainment of the Caliph in Baghdad.&quot;--Tom Holland, historian and author of *In the Shadow of the Sword: The Birth of Islam and the Rise of the Global Arab Empire*\r\n\r\n&quot;The reform of Islam is shaping up to be the most important issue in political ideology of the twenty-first century. This honest and intelligent dialogue is a superb exploration of the intellectual and moral issues involved.&quot;--Steven Pinker, author of *The Better Angels of Our Nature*\r\n\r\nAlso see Harris and Nawaz's YouTube dialog, with the same title as the book.\r\n\r\n\r\nAuthors: Sam Harris and Maajid Nawaz\r\nPublisher: Harvard University Press\r\nPublication: October 6, 2015\r\n\r\nFormats:\r\n.mobi (compatible with Amazon Kindle, etc.)\r\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)","torrent":{"xt":"urn:btih:8eb8c4ad2df5726ca16a2e92ea34cdb03764dd52","amp;dn":"Sam+Harris+-+Islam+and+the+Future+of+Tolerance+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8eb8c4ad2df5726ca16a2e92ea34cdb03764dd52","infoHashBuffer":{"type":"Buffer","data":[142,184,196,173,45,245,114,108,161,106,46,146,234,52,205,176,55,100,221,82]},"announce":[],"urlList":[]}}