{"title":"Shirley Temple - Little Miss Marker (1934) Xvid 1cd - Adolphe Me","uid":9611186,"size":838537216,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8ec919be657d19bdb7b4a6a9dd03fb5faf741768&amp;dn=Shirley+Temple+-+Little+Miss+Marker+%281934%29+Xvid+1cd+-+Adolphe+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"SaM","files":-1,"time":1392322129,"description":"Shirley Temple - Little Miss Marker (1934) Xvid 1cd - Adolphe Menjou, Charles Bickford [DDR]\n\nLittle Miss Marker (1934)  (also known as The Girl in Pawn) is a drama film directed by Alexander Hall. The screenplay was written by William R. Lipman, Sam Hellman, and Gladys Lehman after a short story of the same name by Damon Runyon. The film stars Shirley Temple, Adolphe Menjou, and Dorothy Dell in a story about a little girl held as collateral by gangsters. The film was named to the United States National Film Registry and has been remade several times.\n\n    CAST:-\n    Adolphe Menjou as Sorrowful Jones\n    Dorothy Dell as Bangles Carson\n    Charles Bickford as Big Steve Halloway\n    Shirley Temple as Marthy &quot;Marky&quot; Jane\n    Lynne Overman as Regret. \n    Warren Hymer as Sore Toe\n    Sam Hardy as Benny the Gouge\n    John Kelly as Canvas Back\n    Frank McGlynn Sr. as Doc Chesley\n    John Sheehan as Sun Rise\n    Frank Conroy as Dr. Ingalls\n\nDirected by Alexander Hall\nProduced by B.P. Schulberg\nWritten by William R. Lipman, Sam Hellman, Gladys Lehman\nStory: Damon Runyon\n\nThe film was remade in 1949 as Sorrowful Jones with Bob Hope and Lucille Ball and again as Little Miss Marker in 1980 with Walter Matthau, Julie Andrews, Tony Curtis, Bob Newhart, Brian Dennehy, and Lee Grant. Another remake was 1962's 40 Pounds of Trouble, starring Tony Curtis as a casino manager who is left with an eight-year-old girl.\n\nIn 1998, Little Miss Marker was selected for preservation in the United States National Film Registry by the Library of Congress as being &quot;culturally, historically, or aesthetically significant&quot;.\n\nMOVIE REVIEW:- Little Miss Marker (1934)\nThe film tells the story of &quot;Marky&quot; (Temple), whose father gives her to a gangster-run gambling operation as a &quot;marker&quot; (collateral) for a bet. When the man loses his bet and commits suicide, the gangsters are left with the girl on their hands. They decide to keep her temporarily and use her to help pull off one of their fixed races, naming her the owner of the horse to be used in the race.\n\nMarky is sent to live with bookie Sorrowful Jones (Menjou). Initially upset about being forced to look after the girl, the gangster eventually begins to develop a father-daughter relationship with her. His fellow gangsters become fond of her and begin to fill the roles of her extended family. Bangles (Dell) - girlfriend of gang kingpin Big Steve (Bickford), who has gone to Chicago to place bets on the horse - also begins to care for Marky, and to fall in love with Sorrowful, whose own concern for Marky shows he has a warm heart beneath his hard-man persona. Sorrowful, encouraged by Bangles and Marky, gets a bigger apartment, buys Marky new clothes and himself a better cut of suit, reads her bedtime stories, and shows her how to pray.\n\nHowever, being around the gang has a somewhat bad influence on the child, and she begins to develop a cynical nature and a wide vocabulary of gambling terminology and slang. \n\nBangles and Sorrowful, worried that Marky's acquired bad-girl attitude means she won't get adopted by a &quot;good family&quot;, put on a party with gangsters dressed up as knights-of-the-round-table, to rekindle her former sweetness. Marky is unimpressed until they bring in the horse and parade her around on its back. Big Steve, returning to New York, frightens the horse which throws Marky, who is taken to hospital. Big Steve goes to the hospital to pay back Sorrowful for trying to steal his girlfriend, but is roped into giving Marky the direct blood transfusion she needs for her life-saving operation. Sorrowful, praying for Marky's survival, destroys the drug which, administered to the horse, would have helped it win the race but killed it soon after. Big Steve, told he has &quot;good blood&quot;, and pleased to have given life for a change, forgives Bangles and Sorrowful. They plan to marry and adopt Marky.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 79 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]\nDuration: 79 mins","torrent":{"xt":"urn:btih:8ec919be657d19bdb7b4a6a9dd03fb5faf741768","amp;dn":"Shirley+Temple+-+Little+Miss+Marker+%281934%29+Xvid+1cd+-+Adolphe+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ec919be657d19bdb7b4a6a9dd03fb5faf741768","infoHashBuffer":{"type":"Buffer","data":[142,201,25,190,101,125,25,189,183,180,166,169,221,3,251,95,175,116,23,104]},"announce":[],"urlList":[]}}