{"title":"Riptide GP Renegade v1.0.4 (Full) [Mod Money] Apk-XpoZ","uid":15727381,"size":98099362,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:8ee6e075751557a8444b1bd954ef522fa60c35a0&amp;dn=Riptide+GP+Renegade+v1.0.4+%28Full%29+%5BMod+Money%5D+Apk-XpoZ&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"meXpoZ","files":4,"time":1472733960,"description":"Riptide GP Renegade v1.0.4 (Full) [Mod Money] Apk-XpoZ\r\n\r\n | Category: Racing | | Requires : Android 4.1 and up |\r\n\r\nRenegade is the action-arcade water racer for a new generation.\r\n\r\n\r\nWhat is Mod:\r\n\r\n&gt;Money\r\n\r\n\r\nWhat is in this version :\r\n\r\n- Fixed Ultra graphics settings crash for Mali GPUs.\r\n- Minor bug fixes\r\n\r\n\r\n\r\nGame Review:\r\n\r\nExperience the future of illicit hydrojet racing, where armored riders kick out death-defying stunts over massive waterfalls, dodge cops through public waterways, and boost at breakneck speeds across surging waves.\r\nYou are a hydrojet rider, framed and cast out from the Riptide GP league, forced to race illegally through city waterways, flooded ruins, and churning factory machinery in an effort to reclaim your reputation and your title. Play through the single player career to unlock new vehicles, playable characters, and customization features as you take down bosses and build your crew.\r\n\r\nThen, take your skills online for the ultimate test as you battle opponents around the world in 8-player online matches. Challenge your friends for leaderboard supremacy in the ghost-racing challenge mode. You can even play locally in split screen races with up to 4 players!\r\n\r\nFeaturing thrill-ride race tracks packed with shortcuts, secrets, and interactive obstacles, Riptide GP: Renegade is the action-arcade water racer for a new generation.\r\n\r\n\r\n• • FEATURES\r\n\r\n• Thrill-Ride Environments - Blast across floating factory platforms, brave hurricane-strength waves, and infiltrate a military base in the midst of battle. Every race track is packed with interactive set pieces, dynamic obstacles and secret shortcuts.\r\n\r\n• Deep Career Mode - Battle your way through a variety of races and boss fights to reach the top of the underground hydro jet racing circuit. Earn cash and experience to upgrade and customize your hydro jet, unlock new stunts, and increase your rider's performance.\r\n\r\n• Online Multiplayer - Compete online in thrilling 8 player matchups against the best players from around the world.\r\n\r\n• Split Screen Multiplayer - Challenge your friends in local split-screen multiplayer championships. Play with up to 4 players on a single machine! (Additional gamepad controllers required.)\r\n\r\n• Challenge Mode - Take command of the leaderboards and test your skills against ghost recordings of your friends' best performances.\r\n\r\n• Transforming Vehicles - Collect and upgrade a garage full of blisteringly fast hydro jets that transform while you ride them. Win money to upgrade and customize each one.\r\n\r\n• State of the Art Water Racing - Riptide GP: Renegade brings dynamic water racing to a new level of excitement with breathtaking water physics, splash-tastic spray effects, and more! Every race is different because the surface you race on is always changing.\r\n\r\n• Google Play Games Enabled - Compete with your friends on leaderboards, unlock challenging achievements, and keep your game going from device to device with cloud data syncing.\r\n\r\n\r\nMore At GooglePlay:-https://play.google.com/store/apps/details?id=com.vectorunit.silver.googleplay\r\n\r\n\r\nHigh Quality Movies in Ultra compressed size \r\n\r\n\r\nwithout loss in Quality. \r\n\r\n&amp;&amp;&amp; \r\n\r\nFull Android Games &amp; App. \r\n\r\n\r\nXpoZ.Torrent \r\n\r\n\r\nPlz seed Back &amp; keep alive this torrent. \r\n\r\nIf You Need Seeder any of My torrent, Let me Know. \r\n\r\nI'm always there for Seeding. \r\n\r\nAnd Also If You Liked My Torrent, Plsz Don't Forget to Left FeedBack and Comment. \r\n\r\nMore Uploads &amp; For FeedBack Me..... \r\n\r\n\r\nFollow Me At Google+..........:- https://plus.google.com/+XpoZTorrent","torrent":{"xt":"urn:btih:8ee6e075751557a8444b1bd954ef522fa60c35a0","amp;dn":"Riptide+GP+Renegade+v1.0.4+%28Full%29+%5BMod+Money%5D+Apk-XpoZ","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ee6e075751557a8444b1bd954ef522fa60c35a0","infoHashBuffer":{"type":"Buffer","data":[142,230,224,117,117,21,87,168,68,75,27,217,84,239,82,47,166,12,53,160]},"announce":[],"urlList":[]}}