{"title":"Harmony Improvisator - new version - PC/MAC","uid":7043909,"size":1200953,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8efc45315d51ed22d094b12bf9ddb9921c3c084e&amp;dn=Harmony+Improvisator+-+new+version+-+PC%2FMAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"p1c3rd","files":1,"time":1329658445,"description":"The Genius of Harmony\nprod-impHarmony Improvisator is the most advanced harmonic composition tool on the market. It opens up the infinite world of harmonic theory by making centuries-old knowledge uniquely transparent.\n\n \n\nThe Harmony Improvisator VST Plugin provides:\n\n \n\n    Perfect harmonic improvisation\n    Composing with the rules of classical harmonic theory - no professional knowledge required\n    Complex cadences suitable for all styles of music\n    Unique concept of harmonic pattern sequencing\n    Automatic calculation of exciting harmonic suggestions\n    Critical time advantage for creating harmonic frames of songs, soundtracks, and arrangements.\n\n\nThe mathematical logic of harmonic theory, which has evolved within the art of composition over centuries, is rarely emphasized in today's music software. Even professional composers invest a remarkable amount of time in trying out chord progressions. Harmony Improvisator shortens this phase of work and provides you with the desired results quickly and accurately whether you are new to harmonic theory or a music professional.\n\n\nExplore unusual, contentful chords and harmonic ideas by just clicking the mouse. Whether pop-music or choral - correct harmonic progression is now accessible in your VST host.\n\n \n\n    Enlarge the harmonic diversity of your projects! Harmony Improvisator comes with a rich database of contentful and complex chords - the systematic naming of which relates to their function in a musical context\n    Harmony Improvisator automatically obeys voicing rules; it avoids 5th parallels, voice crossings etc.\n    Harmony Improvisator provides clever harmonic suggestions for continuing a train of harmonic functions\n    Creativity is stimulated by the opening up of unlimited space for harmonic experimentation.\n\n\nWith Harmony Improvisator it is easy to incorporate your creations into a project of any style. The plugin knows the mathematical logic of harmonic theory. Therefore one no longer has to learn functions and rules by heart in order to create classically correct, colorful music - Thus the composer can fully concentrate on the creative part of his or her work.\n\n\nInstall: PC OWNERS -- Just copy the .dll in the PC file to your vst folder \n        \nAll credits for this go to AEROKiller.  Found this on the web and decide to share it. ","torrent":{"xt":"urn:btih:8efc45315d51ed22d094b12bf9ddb9921c3c084e","amp;dn":"Harmony+Improvisator+-+new+version+-+PC%2FMAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8efc45315d51ed22d094b12bf9ddb9921c3c084e","infoHashBuffer":{"type":"Buffer","data":[142,252,69,49,93,81,237,34,208,148,177,43,249,221,185,146,28,60,8,78]},"announce":[],"urlList":[]}}