{"title":"Little Boots - Hands (2009) [mp3@320]","uid":5083010,"size":113901433,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:90aee3c757bcc5de24823984bf2f405804070ae6&amp;dn=Little+Boots+-+Hands+%282009%29+%5Bmp3%40320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"pr0zaq","files":16,"time":1252496180,"description":"Hotly-tipped electro-pop starlet Little Boots has arrived to exceed the ever-escalating hype with her hugely anticipated debut album, Hands. Oozing an effortless sense of cool, the Blackpool solo sensation combines unashamed pop stylistics with synth-heavy disco beats to present an eclectic and original album that will turn popular music on its head.\n\nIf the release of Lady GaGa and Lily Allen's acclaimed albums The Fame and It's Not Me, It's You hasn't convinced you that 2009 is the year of the quirky female soloist, then the arrival of 24-year-old Victoria Hesketh, aka Little Boots, is certain to change your opinion. The eccentric artist dabbles gloriously with a tenori-on, synthesizers and pianos, using her experience in indie-dance outfit Dead Disco to add an exciting new dimension to our preconceptions of pop. From the get go, Hands strikes a lightning sound with unorthodox techniques, dirty beats, and delectable breaks. Raucous single and guaranteed dancefloor filler 'New In Town' kicks everything off in a contagious electro whirl, with Hesketh layering her distinctively sweet vocals over pumping beats and grimy shrieks. Whilst 'Earthquakes' and 'Mathematics' keep up the momentum with their roaring synths and gigantic choruses, the pop-tastic stunners 'Hearts Collide' and 'Remedy' impact with infectious vintage keyboard buzzes and breathless lines, recalling Kylie at her best. The '80s vibe continues strong, reaching its pinnacle on the devilishly danceable 'Symmetry', where Boots duets with Phil Oakey of Human League. As the eerie 'Ghosts' continues to showcase Victoria's haunting vocal range, it's the colossal and tantalisingly unique sing-a-longs 'Meddle' and 'Stuck On Repeat', with their exquisite arrangements and straight up indie-pop appeal, that confirm Little Boots is one of the most musically diverse, talented, and captivating performers in the UK today.\n\nDespite its obvious pop sensibilities, Hands' distinctive twists and deceptively complex arrangements provide all of the intrigue and sass required to delight listeners of all genres. A captivating collection of perfectly formed pop portions, this exciting and accomplished debut sees Little Boots surpass expectations as she lays down her hand with triumphant success.\n\nBitrate:MP3@320kbps\n\nTrack Listing:\n\n01. New in Town\n02. Earthquake\n03. Stuck on Repeat\n04. Click\n05. Remedy\n06. Meddle\n07. Ghost\n08. Mathematics\n09. Symmetry\n10. Tune into my Heart\n11. Hearts Collide\n12. No Breaks\n13. Hands","torrent":{"xt":"urn:btih:90aee3c757bcc5de24823984bf2f405804070ae6","amp;dn":"Little+Boots+-+Hands+%282009%29+%5Bmp3%40320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90aee3c757bcc5de24823984bf2f405804070ae6","infoHashBuffer":{"type":"Buffer","data":[144,174,227,199,87,188,197,222,36,130,57,132,191,47,64,88,4,7,10,230]},"announce":[],"urlList":[]}}