{"title":"The Photographers Mind: Creative Thinking for Better Digital ","uid":6879035,"size":15787171,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:915ff6d496cf7369a4c82d90a4b145bb819027c6&amp;dn=+The+Photographers+Mind%3A+Creative+Thinking+for+Better+Digital+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"freaktorrent07","files":-1,"time":1323571685,"description":"The Photographers Mind: Creative Thinking for Better Digital Photos\nFocal Press (2011) | ISBN: 0240815173 | 193 pages | EPUB | 15.06 MB\n\n\nThe source of any photograph is not the camera or even the scene viewed through the viewfinder--it is the mind of the photographer: this is where an image is created before it is committed to a memory card or film. In The Photographer\\'s Mind, the follow-up to the international bestseller, The Photographer\\'s Eye, photographer and author Michael Freeman unravels the mystery behind the creation of a photograph.\n\nThe nature of photography demands that the viewer constantly be intrigued and surprised by new imagery and different interpretations, more so than in any other art form. The aim of this book is to answer what makes a photograph great, and to explore the ways that top photographers achieve this goal time and time again.\n\nAs you delve deeper into this subject, The Photographer\\'s Mind will provide you with invaluable knowledge on avoiding cliche, the cyclical nature of fashion, style and mannerism, light, and even how to handle the unexpected.\n\nMichael Freeman is the author of the global bestseller, The Photographer\\'s Eye. Now published in sixteen languages, The Photographer\\'s Eye continues to speak to photographers everywhere. Reaching 100,000 copies in print in the US alone, and 300,000+ worldwide, it shows how anyone can develop the ability to see and shoot great digital photographs.\n\n* Written by the author of The Photographer\\'s Eye.\n* Provides you with invaluable knowledge on avoiding cliche, the cyclical nature of fashion, style and mannerism, light and even how to handle the unexpected.\n* Contains over 400 breathtaking images from real photographic assignments, with schematic illustrations of how and why the images work. \n","torrent":{"xt":"urn:btih:915ff6d496cf7369a4c82d90a4b145bb819027c6","amp;dn":"+The+Photographers+Mind%3A+Creative+Thinking+for+Better+Digital+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"915ff6d496cf7369a4c82d90a4b145bb819027c6","infoHashBuffer":{"type":"Buffer","data":[145,95,246,212,150,207,115,105,164,200,45,144,164,177,69,187,129,144,39,198]},"announce":[],"urlList":[]}}