{"title":"Factory Man: How One Furniture Maker Battled Offshoring,","uid":10667308,"size":1475731,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9160d16beaae5861bff8234b05a99db9321ae45e&amp;dn=Factory+Man%3A+How+One+Furniture+Maker+Battled+Offshoring%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1406823918,"description":"Factory Man: How One Furniture Maker Battled Offshoring, Stayed Local - and Helped Save an American Town by Beth Macy\nEnglish | 2014 | ISBN: 0316231436 | 464 pages | MOBI | 1,5 MB\n\nOne man's battle to save hundreds of jobs by taking on China and demonstrating the greatness of American business\n\nWith over $500 million a year in sales, the Bassett Furniture Company was once the world's biggest wood furniture manufacturer. Run by the same powerful Virginia family for a century, it was also the center of life in Bassett, Virginia -- an unincorporated town that existed solely to fuel the business. But beginning in the 1980s, the Bassett company suffered from an influx of cheap Asian furniture as the first wave of imports struck, and ultimately moved nearly all its production to Asia.\n\nOnly one man fought back: John Bassett III, a shrewd and determined third-generation factory man who used grit, tenacity, and will to compete against China and ultimately save his family's company. In Factory Man, Beth Macy brings to life John Bassett's fascinating business, with wildly colorful stories from an American industry that once ruled the world and might again see better days. As Macy shows how he uses legal maneuvers, factory efficiencies, and sheer will to save hundreds of jobs, she also discovers the hidden history of industry in America.","torrent":{"xt":"urn:btih:9160d16beaae5861bff8234b05a99db9321ae45e","amp;dn":"Factory+Man%3A+How+One+Furniture+Maker+Battled+Offshoring%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9160d16beaae5861bff8234b05a99db9321ae45e","infoHashBuffer":{"type":"Buffer","data":[145,96,209,107,234,174,88,97,191,248,35,75,5,169,157,185,50,26,228,94]},"announce":[],"urlList":[]}}