{"title":"[Ebook-Ita-Pdf-Thriller]Dan Brown - Il simbolo perduto[survivalo","uid":5142380,"size":3119468,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91aef64a3d31db379ce821baebdc53500d08e510&amp;dn=%5BEbook-Ita-Pdf-Thriller%5DDan+Brown+-+Il+simbolo+perduto%5Bsurvivalo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mitimex","files":1,"time":1257016961,"description":"\n\nRobert Langdon, professore di simbologia ad Harvard, ÃƒÂ¨ in viaggio per Washington. ÃƒË† stato convocato d'urgenza dall'amico Peter Solomon, uomo potentissimo affiliato alla massoneria, nonchÃƒÂ© filantropo, scienziato e storico, per tenere una conferenza al Campidoglio sulle origini esoteriche della capitale americana. Ad attenderlo c'ÃƒÂ¨ perÃƒÂ² un inquietante fanatico che vuole servirsi di lui per svelare un segreto millenario. Langdon intuisce qual ÃƒÂ¨ la posta in gioco quando all'interno della Rotonda del Campidoglio viene ritrovato un agghiacciante messaggio: una mano mozzata col pollice e l'indice rivolti verso l'alto. L'anello istoriato con emblemi massonici all'anulare non lascia ombra di dubbio: ÃƒÂ¨ la mano destra di Solomon. Langdon scopre di avere solamente poche ore per ritrovare l'amico. Viene cosÃƒÂ¬ proiettato in un labirinto di tunnel e oscuri templi, dove si perpetuano antichi riti iniziatici. La sua corsa contro il tempo lo costringe a dar fondo a tutta la propria sapienza per decifrare i simboli che i padri fondatori hanno nascosto tra le architetture della cittÃƒÂ . Fino al sorprendente finale. Un nuovo capitolo de &quot;Il Codice da Vinci&quot;, un thriller dalla trama mozzafiato, che si snoda a ritmo incalzante in una selva di simboli occulti, codici enigmatici e luoghi misteriosi.\n","torrent":{"xt":"urn:btih:91aef64a3d31db379ce821baebdc53500d08e510","amp;dn":"%5BEbook-Ita-Pdf-Thriller%5DDan+Brown+-+Il+simbolo+perduto%5Bsurvivalo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91aef64a3d31db379ce821baebdc53500d08e510","infoHashBuffer":{"type":"Buffer","data":[145,174,246,74,61,49,219,55,156,232,33,186,235,220,83,80,13,8,229,16]},"announce":[],"urlList":[]}}