{"title":"National Geographic National Park Collection 7of7 Death Valley X","uid":11189961,"size":735164416,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:922e98ddf584a9aade233055cdbe5084c503c63d&amp;dn=National+Geographic+National+Park+Collection+7of7+Death+Valley+X&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"MVGroup","files":1,"time":1412977142,"description":"National Park Collection\n\nHistory, Nature Documentary hosted by Robert Wilson-Seymour &amp; Rodney Schumacher and published by National Geographic in 2009 - English narration\n\n\n\nInformation\n------------------------------\n\nNational Parks Collection\nThrill to the wonders of planet earth with National Geographic's National Parks Collection, a seven-disc compilation showcasing the hidden beauty of our national parks. From the Grand Canyon's unexplored back country to Hawaii's hidden coral reefs, this breathtaking anthology takes you beyond the tourist hot spots to explore these amazing places as never before. \n\nTrek to the high-altitude summit of Denali Park's Mount McKinley, kayak through the hidden secrets of the Everglades, and face the wild extremes of life in Death Valley. With stunning cinematography, National Parks Collection travels off-road to reveal the real Yosemite and Yellowstone. It's an awe-inspiring collection you'll want to journey to again and again. \n\nProduct Information\nRun Time: Approx. 330 mins on 7 discs\nRelease Date: 2009 \nWidescreen Version\n\n\n1)  Secret Yosemite \nYosemite National Park is the most visited National Park in the United States. National Geographic goes beyond the tourist hotspots and journeys deep into the dynamic and untamed wilderness behind 12,000 square miles of awe-inspiring natural wonders few have ever seen. Known for its steep granite cliffs, impressive waterfalls and the world's largest living trees-the Giant Sequoias-this beautiful haven attracts vacationers all year round. With more than 700,000 acres of land, this terrain is home to a host of wild creatures ranging from black bears, bobcats, foxes, snakes and a variety of bats. Discover this vast wilderness as National Geographic explores the life within the wilderness found beyond the postcard-perfect views.\n\n2)  Hidden Hawaii \nAmerica's newest marine sanctuary, Papahanaumokuakea Marine National Monument, encompasses the Northwestern Hawaiian Islands. The monument is bigger than all U.S. national parks combined-yet the majority of this environment has never been seen. What is in this vast marine conservation area? And, what will it take to protect it? National Geographic embarks on a month-long expedition to explore stunning coral reefs, shallow water environments, and rare species unique only to Hidden Hawaii.\n\n3)  Everglades \nIt is a World Heritage site, an International Biosphere Reserve, the most famous wetland on earth, and a cultural icon-featured in everything from Spiderman comics, to the classic movie African Queen. It's America's most controversial and endangered National Park, and-with $7.8 billion aimed at its restoration-it's also the most political. The Everglades is many things to many people, but above all else, it is a wilderness-1.5 million acres of the most extraordinary and unique habitat. More than 1,100 species of plants and 350 species of birds live here for at least part of the year, and some of those species live nowhere else on earth. We'll journey into this the Everglades on foot, by airboat, in a helicopter and by kayak to see what secrets this wild space is hiding.\n\n4)  Grand Canyon \nIt hosts nearly 5 million tourists a year, but visitors see only a tiny fraction of the Grand Canyon's true beauty. Some of its backcountry has almost never felt the tread of a human foot. Even scientists know precious little about the canyon's 91 mammal species and more than 350 types of birds, its vegetation, and how and when it was formed. Now, National Geographic joins a rare scientific expedition to explore the canyon's entire 277-mile length. Explore the canyon's geological history, study the microscopic colonies of vegetation that survive where no other plant can and examine its many unique creatures to unlock some of the mysteries of this wonder of the world.\n\n5)  Extreme Alaska Denali National Park \nLocated near the top of the world, Denali National Park is home to more than six million acres of extreme wilderness. Venture beyond the tourist hotspots and join National Geographic on a low-to-high-altitude trek through Denali's breathtaking ecosystems. Elevation sets the rules in this subarctic land where only the most hardy creatures-including man-can survive.\nWitness remarkable moose-on-moose combat in Denali's taiga forest, follow beautiful dall sheep through the tundra's craggy rocks, and climb alongside an expedition to the death-defying summit of Mount McKinley, North America's tallest mountain. Featuring cinematography of big game, glacier crevasses, and snowcapped mountains, Extreme Alaska: Denali National Park is an absorbing adventure through one of the Earth's most remarkable places.\n\n6)  Secret Yellowstone \nYellowstone is America's first and foremost National Park and its majestic beauty inspires more than 3 million visitors each year. National Geographic goes beyond the tourist hotspots and travels deep inside the 2 million acre national park to reveal the backcountry wilderness few have seen. Explore some of the 300 newly discovered waterfalls and learn how wolves, back after five decades of absence from Yellowstone, are helping restore the balance in the ecosystem alongside the grizzly bear and bison. Finally, discover how the geology of Yellowstone with its giant well of molten lava underneath the surface is sometimes more dangerous than the wildlife. So serene and yet so dangerous: this powerful drama comes alive through satellite imagery and CGI animation.\n\n7)  Death Valley \nDeath Valley National Park is a land of extremes. It's the driest place in the United States, the lowest place in the Western Hemisphere and, at one time, the hottest single location recorded on earth. Yet here-in this seemingly inhospitable chasm-life thrives. More than 1,000 species of plant call this park home. And, several animal species found here live nowhere else on Earth. Journey with National Geographic, from the park's highest peak, at 11,049 feet, to its lowest point, a staggering 282 feet below sea-level, and meet the scientists who are working to protect this wild place as the mercury rises\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: XviD\n * Video Bitrate: 1931 KB/s\n * Video Aspect Ratio: 1:76\n * Video Resolution: 704 x 400\n * Audio Codec: (Dolby AC3)\n * Audio Bitrate: 192 kb/s 48000Hz\n * Run-Time: 45mins\n * Framerate: 25FPS\n * Number of Parts: 7\n * Part Size: 700mb/s\n * Ripped by artistharry\n * Subtitles: none available\n * Source: DVD\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/List_of_areas_in_the_United_States_National_Park_System&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/List_of_areas_in_the_United_States_National_Park_System&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:922e98ddf584a9aade233055cdbe5084c503c63d","amp;dn":"National+Geographic+National+Park+Collection+7of7+Death+Valley+X","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"922e98ddf584a9aade233055cdbe5084c503c63d","infoHashBuffer":{"type":"Buffer","data":[146,46,152,221,245,132,169,170,222,35,48,85,205,190,80,132,197,3,198,61]},"announce":[],"urlList":[]}}