{"title":"French Film Collection(Film 42) GRADIVA (2006)","uid":6048282,"size":735344304,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:92a846da802ee9c191bb1dc7d930a67082ec5f25&amp;dn=French+Film+Collection%28Film+42%29+GRADIVA+%282006%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"forcefox","files":-1,"time":1292633495,"description":"ENGLISH SUBTITLES INCLUDED\n\nGradiva (2006)\n\nGradiva (C'est Gradiva quit vous appelle) was the final film of Alain Robbe-Grillet (writer:Last Year at Marienbad, director and writer:Trans-Europ-Express). As one might expect from a work written and directed by Robbe-Grillet, Gradiva explores the blurred lines between reality and fantasy, and eroticism and violence.\n\nIn Gradiva, a historian named John Locke (James Willby) travels to Morocco to research the paintings of Delacroix for a book. While there, Locke becomes aware of two lost Delacroix sketchbooks from the artist's six month stay in Morocco. Locke becomes obsessed with a woman (Arielle Dombasie) portrayed in the sketchbooks, and begins to see the woman everywhere he goes. His obsession leads him into the bizarre world of the Club of the Golden Triangle, a sadist's oasis where orientalist plays, bondage, and illegal acts take place. Mixed up in the intrigue is a young housekeeper named Belkis (Dany Verissimo) with whom Locker has an affair.\n\nThe film boasts a labyrinthine plot, which mixes Wilhelm Jensen's Gradvia with the story of Delacroix's time in Morocco. One might categorize the film as an erotic mystery but the traditional narrative markers are buried within layers of shifts in time and perspective. The narrative parallels and co-mingles the modern age with that of Romantic18th century visions of Morocco. For example, the relationship between John Locke and Belkis, whose dialog consists mostly of repeated utterances of &quot;I don't know, monsieur,&quot; and &quot;Yes, monsieur,&quot; is setup as an analogue to a relationship between a sultan and a harem girl. The story is rife with such parallels between modernity and the past.\n\nThere is a certain tension between the material and Robbe-Grillet's direction. Whereas one might expect a stylized approach to the subject matter, the direction is rather stagey as many scenes occur within four walls with simple setups. The film opens up when it hits the streets or other scenic locations. The stylistic approach leans on the actors to convey the dreamlike surrealism that the writing often seems to call for. Some of the acting putters at the edge of foppishness, which is arguably an artifact of some of Robbe-Grillet's florid dialog. However, the cast does a fine job of anchoring the scrambled narrative.\n\nMondo Macabro's DVD presents a gorgeous 1.85:1 widescreen transfer. Audio is in French with English subtitles created specifically for the release. The central extra feature is an extensive interview with Robbe-Grillet about the film and other topics. Gradiva is not perfect, but its brand of sophisticated deviance is very satisfying.","torrent":{"xt":"urn:btih:92a846da802ee9c191bb1dc7d930a67082ec5f25","amp;dn":"French+Film+Collection%28Film+42%29+GRADIVA+%282006%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92a846da802ee9c191bb1dc7d930a67082ec5f25","infoHashBuffer":{"type":"Buffer","data":[146,168,70,218,128,46,233,193,145,187,29,199,217,48,166,112,130,236,95,37]},"announce":[],"urlList":[]}}