{"title":"Idolatry in Judaism and Christianity","uid":5133051,"size":156678570,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:931def7ba6b219dd48e5d664bb08808e1ede2683&amp;dn=Idolatry+in+Judaism+and+Christianity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"moman73","files":21,"time":1256306233,"description":"Idolatry in Judaism and Christianity:\n\nIdolatry which is the worship of idols, images, objects or false gods was a common practice in ancient religions and among the pagans. In the Abrahamic faiths, however, idolatry is a major sin. The core theme of Abraham message is the worship of one God and abolition of all other deities. It is also the message of all the prophets after Abraham. Numerous verses in the Old Testament, the Gospels, and the Qur'an strongly prohibit and condemn idolatry. \n\nBut the practices of the followers of a certain religion do not always conform with the original teachings of the their prophets. The Jews, while Moses was still alive among them, took the Golden Calf as a god for them. Of course Moses was very angry when he returned, and he destroyed and burnt the idol. Idolatry practices increased gradually among the Jews despite the many prophets who were sent to them which led God to punish them repeatedly. \n\nThe Christians inherited many of the idolatrous practices of the Jews, and added to it many of their own in defiance to the teachings of Jesus. The concept of Trinity and that Jesus is God, the worship of Mary, of images, of the Cross, and other objects, are all innovations in idolatry practices.\n\nThis upload focuses on the idolatry practices in Judaism and Christianity. It contains 21 titles. For comparison purposes, the last two of these titles discuss the concept and fundamentals of monotheism (Tawheed) in Islam.\n\n","torrent":{"xt":"urn:btih:931def7ba6b219dd48e5d664bb08808e1ede2683","amp;dn":"Idolatry+in+Judaism+and+Christianity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"931def7ba6b219dd48e5d664bb08808e1ede2683","infoHashBuffer":{"type":"Buffer","data":[147,29,239,123,166,178,25,221,72,229,214,100,187,8,128,142,30,222,38,131]},"announce":[],"urlList":[]}}