{"title":"Too Many Crooks 1959 Terry-Thomas DvDRip x264-miKem","uid":8509914,"size":701588469,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:932a59c1be644a788369a9e57f91e14434fd26ab&amp;dn=Too+Many+Crooks+1959+Terry-Thomas+DvDRip+x264-miKem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"mikem777","files":14,"time":1369543128,"description":"Too Many Crooks (1959) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0052301&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0052301&lt;/a&gt;\n\nSAMPLE file included\n\nAccident-prone Fingers runs a pretty unsuccessful gang. They try and rob wealthy but tricky Billy Gordon - who distrusts banks and fears the Inland Revenue - but he sees Fingers and the boys off. So they decide to kidnap his daughter, only to end up with his wife Lucy. Gordon makes out he couldn't be more pleased, spuring Lucy to take charge of the hopeless bunch of villains.\n\nA wonderful British caper comedy from 1959, this film, along with School for Scoundrels (made the same year), probably stands as the most perfect vehicle for the caddish comic talent of Terry-Thomas. He plays wide boy entrepreneur Billy Gordon, who is targeted by the incompetent Fingers, or 'Mr X' (George Cole) and his criminal gang. When robbing the safe at Gordon's office proves unsuccessful, Fingers instead decides to kidnap Gordon's daughter, but things don't go according to plan... Too Many Crooks is a hilarious film, stylishly directed by Mario Zampi and featuring a wonderful script from Michael Pertwee. But it is the performances that really make it work, none more so than Terry-Thomas, who is a full-on tornado of one-liners, indignant snorts, impatient outbursts, and caddish cackles. Cole is also brilliant as a sort of proto-Arthur Daley, a bumbling no-mark with a taste for the lifestyle of a criminal mastermind, but almost no idea how to make it a reality. Further down the cast list, Bernard Bresslaw is memorably gormless as ex-wrestler Snowdrop (I love his Spike Milligan-style line 'I never heard of anything more precious than money. Except dollars.'), whilst Sidney James (a year away from achieving leading-man status with his first Carry On film) is as good as always as the frustrated professional crook fed up with Cole's fiascos; as is usual with James, his character is of course called Sid. The stunning Vera Day (who also appeared with Sidney James in the classic thriller Hell Drivers and Hammer's movie adaptation of the TV serial Quatermass II) plays Fingers' moll (or his 'nice little bit of X-certificate'), whilst such familiar faces as John Le Mesurier, Sidney Tafler, and Terry Scott have very funny cameos. About the only performance that doesn't quite work is that of Brenda De Banzie as Gordon's wife; a actress more noted for her dramatic turns in films like Hobson's Choice and The Entertainer, De Banzie does a good job as the meek housewife in the early scenes, but quite fails to convince as the re-invented crime boss and glamour puss later on; she plays these later scenes totally straight, and oddly, the script doesn't give her a single funny line. My favourite scene in the film has to be the one in which Fingers and Sid go to Gordon's office in the guise of police officers, which includes Cole's truly insane comic line 'A nod's as good as a wink to a blind horse. That's an old Latin quotation and it means 'is this your old woman's nightie?'', as well as Gordon's incandescent rage when the real police subsequently turn up and Gordon accuses the entire force of trying to blackmail him. The film is full of such wonderful episodes (the first attempted robbery and Gordon's appearance in court are also stand-outs), and it is a great reminder of a time when Britain used to make better comedy movies than any other country in the world.\n\n*** General Parameters ***\n- Name:  TOO_MANY_CROOKS.m4v \n- Container:  M4V - QuickTime \n- Size:  691.01 MB \n- Duration:  1h 21mn \n- Bitrate:  1 129 Kbps \n\n*** Video Track Parameters ***\n- Format:  H.264/MPEG-4 AVC \n- Bitrate:  Max.: Undefined / Average: 998 Kbps / Min.: Undefined \n- Frame rate (fps):  Max.: 25.000 / Average: 25.000 / Min.: 8.333 \n- Encoding profile:  &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;99d4f8f0f7d9d5aab7a9&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; \n- Image size:  720*544 \n- Pixel Aspect Ratio:  Undefined \n- Display Aspect Ratio:  4:3 \n- Interlacing:  Progressive \n\n*** First Audio Track Parameters ***\n- Format:  AAC - MPEG-4 audio \n- Bitrate:  126 Kbps \n- Resolution:  Undefined \n- Rate:  48.0 KHz \n- Channel(s):  2 (stereo) \n- Position:  Front: L R \n\ntags: comedy, crime, gang, crook, heist, courtroom, 1959, British, English","torrent":{"xt":"urn:btih:932a59c1be644a788369a9e57f91e14434fd26ab","amp;dn":"Too+Many+Crooks+1959+Terry-Thomas+DvDRip+x264-miKem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"932a59c1be644a788369a9e57f91e14434fd26ab","infoHashBuffer":{"type":"Buffer","data":[147,42,89,193,190,100,74,120,131,105,169,229,127,145,225,68,52,253,38,171]},"announce":[],"urlList":[]}}