{"title":"John Cassavetes - Minnie and Moskowitz (1971)","uid":5386390,"size":1703731200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:934b86858ca13200c9e0a549440c79b985060aa4&amp;dn=John+Cassavetes+-+Minnie+and+Moskowitz+%281971%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"lord_terabyte","files":-1,"time":1266909367,"description":"John Cassavetes - Minnie and Moskowitz (1971)\n\nEnglish dual audio with commentary\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0067433&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0067433&lt;/a&gt;\n\n[QUOTE]A museum curator falls in love with a crazy parking attendant.[/QUOTE]\n &lt;a href=&quot;\nhttp://img366.imageshack.us/img366/2839/467538ob.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img366.imageshack.us/img366/2839/467538ob.jpg&lt;/a&gt;\n\n[QUOTE]By Roger Ebert / February 14, 1972\n\nMinnie works in a museum and has never forgiven the movies for selling her a bill of goods. &quot;The movies lead you on,&quot; she tells her friend Florence. &quot;They make you believe in romance and love . . . and, Florence, there just aren't any Clark Gables, not in the real world. Still, Minnie dreams, and keeps a romantic secret locked in her heart: She's glad the movies sold her that bill of goods.\n\nSeymour is a car-hiker. He has a magnificent mustache, shoulder-length hair and very little else to show for his life so far. &quot;An Albert Einstein he's not,&quot; his mother exclaims. &quot;Pretty he's not. Look at that face. A future he doesn't have; he parks cars for a living.&quot;\n\nAnd yet, and yet ... love blossoms somehow between Minnie Moore and Seymour Moskowitz, during four crazy days and nights. Seymour thinks he might be able to improve his position; get a job in a larger garage, maybe. Minnie shakes her head and sighs when she looks at him: &quot;Seymour, look at that face. It's not the face I dreamed of, Seymour.&quot;\n\nConsumed by love, Seymour bangs his fist against the roof of his pick-up truck: &quot;Minnie, oh, Minnie! Oh, Minnie!&quot; Seymour is not very articulate. He only talks about three things, Minnie says, money, eating and cars. &quot;Cars are very important to Seymour,&quot; Minnie explains to her mother. Her mother nods, a little stunned. &quot;Seymour CARES about cars.&quot;\n\nAnd all of this is why love scores an altogether unreasonable triumph over common sense in &quot;Minnie and Moskowitz,&quot; the new comedy by John Cassavetes. The movie is sort of a fairy tale, Cassavetes says; it's dedicated to all the people who didn't marry the person they should have. It is a movie on the side of love, and it is one of the finest movies of the year.\n\nCassavetes has always been an interesting director, with an inspired unpredictability to his work. He likes to get the texture of real life in his films, and when his experiments succeed they produce brilliant work like &quot;Faces,&quot; which I thought was the best film of 1968. When they don't work, we get embarrassingly disconnected and obscurely personal work like &quot;Husbands,&quot; which was maybe the most overrated film of last year.\n\n&quot;Minnie and Moskowitz&quot; isn't much like anything Cassavetes has done before, except in its determination to go all the way with actors' performances - even at the cost of the movie's over-all form. Cassavetes, an actor himself, is one of the few American directors who is really sympathetic with actors. He lets them go, lets them try new things and take risks. This can lead to terribly indulgent performances, as it did in &quot;Husbands.&quot; But in &quot;Minnie and Moskowitz&quot; it gives us performances by Gena Rowlands and Seymour Cassel that are so beautiful you can hardly believe it.\n\nMiss Rowlands is a lovely, warm actress with a speaking voice that's round and interesting, and not as detached as most performers' voices. Cassel is one of the few actors who can let everything inside hang out, because he's got the stuff inside. A lot of actors throw aside caution and reveal their innermost being, only to raise the curtain on a void. Cassel makes Moskowitz into a convincing, dedicated, pure crazy Romantic, and that's why, even in dreary 1972, we can believe he could sweep Minnie off her feet.\n\nMiss Rowlands (who is Mrs. Cassavetes) played the prostitute in &quot;Faces,&quot; and Cassel got an Academy Award nomination for his performance as the hippie in that movie. There are a lot of other members of the Cassavetes circle in &quot;Minnie and Moskowitz&quot;: Cassavetes' mother plays Moskowitz's mother, Gena's mother plays Minnie's mother, Gena's father has a cameo as a minister, various children and family friends have walk-ons, and Cassavetes himself turns up, unbilled, as Minnie's loveless lover.\n\nThis kind of casting can't help but give the movie an intimate, familiar feeling, and maybe that's why the comedy works as human comedy and not just manufactured laughs. The casting also turns up the funniest mother performance of the year, by Mrs. Cassavetes, who is sort of a cross between Ruth Gordon and Mrs. Portnoy and should get several acting offers after this. &quot;Look at my son,&quot; she says. &quot;He's a bum. Where will they sleep? What food will they eat? Money will they make?&quot; Yes, but who, cares? Not Minnie, not Moskowitz, not love. [/QUOTE]\n &lt;a href=&quot;\nhttp://i768.photobucket.com/albums/xx323/little_itty_bitty/Clipboard01.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i768.photobucket.com/albums/xx323/little_itty_bitty/Clipboard01.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i768.photobucket.com/albums/xx323/little_itty_bitty/Clipboard02.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i768.photobucket.com/albums/xx323/little_itty_bitty/Clipboard02.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i768.photobucket.com/albums/xx323/little_itty_bitty/Clipboard03.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i768.photobucket.com/albums/xx323/little_itty_bitty/Clipboard03.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i768.photobucket.com/albums/xx323/little_itty_bitty/Clipboard04.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i768.photobucket.com/albums/xx323/little_itty_bitty/Clipboard04.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i768.photobucket.com/albums/xx323/little_itty_bitty/Clipboard05.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i768.photobucket.com/albums/xx323/little_itty_bitty/Clipboard05.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i768.photobucket.com/albums/xx323/little_itty_bitty/Clipboard06.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i768.photobucket.com/albums/xx323/little_itty_bitty/Clipboard06.png&lt;/a&gt;\n\n\n----my rip-------\n\n~~~~~~ Minnie and Moskowitz.avi ~~~~~~\n\nFile Size (in bytes):...........................1,669,142,528\n\n--- Video Information ---\nVideo Codec Name:...............................XviD ISO MPEG-4\nDuration (hh:mm:ss):............................1:55:21\nFrame Count:....................................165930\nFrame Width (pixels):...........................688\nFrame Height (pixels):..........................368\nAspect Ratio:...................................1.870\nFrames Per Second:..............................23.976\nVideo Bitrate (kbps):...........................1531\n......MPEG-4......B-VOP........................\nQuality Factor (bits/pixel)/frame:..............0.252&quot;\n\n--- Audio Information ---\nAudio Codec:....................................0x2000 (Dolby AC3) AC3\nAudio Sample Rate (Hz):.........................48000\nAudio Bitrate(kbps):............................192\nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR\nAudio Channel Count:............................2\n\n********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE\n","torrent":{"xt":"urn:btih:934b86858ca13200c9e0a549440c79b985060aa4","amp;dn":"John+Cassavetes+-+Minnie+and+Moskowitz+%281971%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"934b86858ca13200c9e0a549440c79b985060aa4","infoHashBuffer":{"type":"Buffer","data":[147,75,134,133,140,161,50,0,201,224,165,73,68,12,121,185,133,6,10,164]},"announce":[],"urlList":[]}}