{"title":"Radley Balko - Rise of the Warrior Cop - The Militarization of A","uid":15600477,"size":3123371,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:935b95c94304c8a10bfbd9b8d2837bcf84e71178&amp;dn=Radley+Balko+-+Rise+of+the+Warrior+Cop+-+The+Militarization+of+A&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1471632833,"description":"https://extraimago.com/images/2016/08/19/9e4d167c931ff65ea87b737e979edaa7-d.jpg\r\n\r\nRadley Balko - Rise of the Warrior Cop - The Militarization of America's Police Forces\r\n\r\nThe last days of colonialism taught America’s revolutionaries that soldiers in the streets bring conflict and tyranny. As a result, our country has generally worked to keep the military out of law enforcement. But according to investigative reporter Radley Balko, over the last several decades, America’s cops have increasingly come to resemble ground troops. The consequences have been dire: the home is no longer a place of sanctuary, the Fourth Amendment has been gutted, and police today have been conditioned to see the citizens they serve as an other—an enemy.\r\n\r\nToday’s armored-up policemen are a far cry from the constables of early America. The unrest of the 1960s brought about the invention of the SWAT unit—which in turn led to the debut of military tactics in the ranks of police officers. Nixon’s War on Drugs, Reagan’s War on Poverty, Clinton’s COPS program, the post–9/11 security state under Bush and Obama: by degrees, each of these innovations expanded and empowered police forces, always at the expense of civil liberties. And these are just four among a slew of reckless programs.\r\n\r\nIn Rise of the Warrior Cop, Balko shows how politicians’ ill-considered policies and relentless declarations of war against vague enemies like crime, drugs, and terror have blurred the distinction between cop and soldier. His fascinating, frightening narrative shows how over a generation, a creeping battlefield mentality has isolated and alienated American police officers and put them on a collision course with the values of a free society","torrent":{"xt":"urn:btih:935b95c94304c8a10bfbd9b8d2837bcf84e71178","amp;dn":"Radley+Balko+-+Rise+of+the+Warrior+Cop+-+The+Militarization+of+A","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"935b95c94304c8a10bfbd9b8d2837bcf84e71178","infoHashBuffer":{"type":"Buffer","data":[147,91,149,201,67,4,200,161,11,251,217,184,210,131,123,207,132,231,17,120]},"announce":[],"urlList":[]}}