{"title":"Game of Thrones S03 (English Subtitles)","uid":8640096,"size":4153485787,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:93ff7250b5851c40c368e5e06bcbb3fb5fac7e01&amp;dn=Game+of+Thrones+S03+%28English+Subtitles%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"spiralscorp911","files":-1,"time":1372867092,"description":"Game of Thrones is an American epic fantasy television drama series created for HBO by David Benioff and D. B. Weiss. It is an adaptation of A Song of Ice and Fire, George R. R. Martin's series of fantasy novels, the first of which is titled A Game of Thrones. Filmed in a Belfast studio and on location elsewhere in Northern Ireland, Malta, Croatia, Iceland, and Morocco, it premiered on HBO in the United States on April 17, 2011. The series has been renewed for a fourth season, to air in 2014.\n\nThe series, set on the fictional continents of Westeros and Essos at the end of a decade-long summer, interweaves several plot lines. The first follows the members of several noble houses in a civil war for the Iron Throne of the Seven Kingdoms; the second covers the rising threat of the impending winter and the mythical creatures of the North; the third chronicles the attempts of the exiled last scion of the realm's deposed dynasty to reclaim the throne. Through its morally ambiguous characters, the series explores the issues of social hierarchy, religion, civil war, crime, and punishment. It is the most recent big-budget work to have contributed to the popularity of the fantasy genre in mainstream media.","torrent":{"xt":"urn:btih:93ff7250b5851c40c368e5e06bcbb3fb5fac7e01","amp;dn":"Game+of+Thrones+S03+%28English+Subtitles%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93ff7250b5851c40c368e5e06bcbb3fb5fac7e01","infoHashBuffer":{"type":"Buffer","data":[147,255,114,80,181,133,28,64,195,104,229,224,107,203,179,251,95,172,126,1]},"announce":[],"urlList":[]}}