{"title":"The No-Grain Diet - Joseph Mercola","uid":11705064,"size":1752578,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9467abd6b550d48581debbb1de636c7ced6d420c&amp;dn=The+No-Grain+Diet+-+Joseph+Mercola&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"starxteel","files":1,"time":1424097396,"description":"A leading physician and natural wellness physician unveils a three-step program for losing weight-and keeping it off.\n\nIn this revolutionary guide by the director of the Optimal Wellness Center in Illinois who has a wildly successful natural health care Web site, readers will discover how to shed those unwanted pounds-healthfully and nutritiously.\n\nAccording to the latest research, the current USDA food pyramid is misleading and incorrect: It is primarily carbohydrates, not fats, that contribute to increased weight gain and lead to a variety of illnesses and disorders. With Dr. Mercola's grain-free diet, readers will discover the key to permanent weight loss and healthy living, beginning with:\n\n* The 3-Day Diet-Eating every two hours to rid the body of grains, sweets, and starches\n* The 50-Day Diet Plan-Eating four to six meals a day to normalize cholesterol levels\n* The Lifelong Maintenance Plan-Following specific food guidelines that allow certain grains to be slowly brought back into the diet\n* Plus: The Emotional Freedom Technique-a craving-busting tool for eliminating carbohydrate cravings and addictions once and for all.\n\nForget the pain and frustration of high-carb, low-fat diets that don't work and aren't even good for you. You'll watch the pounds come off as The No-Grain Diet takes you to the next level of health, fitness, and well-being.\n\n\nAbout the Author:\nDr. Joseph Mercola is trained as a family physician but now focuses exclusively on natural medicine education. He has been interviewed by the major television networks and dozens of nationally broadcast radio shows. His website, Mercola.com, is the leading natural health site on the Internet","torrent":{"xt":"urn:btih:9467abd6b550d48581debbb1de636c7ced6d420c","amp;dn":"The+No-Grain+Diet+-+Joseph+Mercola","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9467abd6b550d48581debbb1de636c7ced6d420c","infoHashBuffer":{"type":"Buffer","data":[148,103,171,214,181,80,212,133,129,222,187,177,222,99,108,124,237,109,66,12]},"announce":[],"urlList":[]}}