{"title":"Genetics and Neurology- Bundey [PDF] [StormRG]","uid":10564082,"size":42665692,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9469b374138981f2b206a4cf33c576d80e624201&amp;dn=Genetics+and+Neurology-+Bundey+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":-1,"time":1405496476,"description":"Author: Sarah Bundey\nSeries: Genetics in Medicine and Surgery Series\nHardcover: 360 pages\nPublisher: Churchill Livingstone (March 1985)\nLanguage: English\nISBN-10: 0443028184\nISBN-13: 978-0443028182\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nOffering guidance to clinical geneticists and neurologists about the mode of inheritance and genetic counselling risks for neurological conditions, this text groups subjects together under such headings as the muscular dystrophies, phakomatoses, peripheral neuropathies, and dementias. The author incorporates the advances in molecular biology that have occurred in the past 7 years and the localization of genes for many neurological disorders. A new chapter on mitochondrial diseases is included, as well as new sections on the Xp21 muscular dystrphies, the chronic spinal muscular atrophies, amyloid neuropathies, Rett's syndrome, torsion dystonia, trichothiodystrophy, early onset Cockayne syndrome and prion protein diseases. New descriptions of unusual genetic mechanisms are provided and 18 new illustrations and a map of the chromosomal locations of some neurological diseases are given.","torrent":{"xt":"urn:btih:9469b374138981f2b206a4cf33c576d80e624201","amp;dn":"Genetics+and+Neurology-+Bundey+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9469b374138981f2b206a4cf33c576d80e624201","infoHashBuffer":{"type":"Buffer","data":[148,105,179,116,19,137,129,242,178,6,164,207,51,197,118,216,14,98,66,1]},"announce":[],"urlList":[]}}