{"title":"The Effect of Temperature and Other Factors on Plastics and Elas","uid":15605186,"size":8161471,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:94b7790f10b9e4f5bc7dc3ad551d676885e2cd51&amp;dn=The+Effect+of+Temperature+and+Other+Factors+on+Plastics+and+Elas&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"clouderone","files":1,"time":1471711996,"description":"The Effect of Temperature and Other Factors on Plastics and Elastomers 2nd ed - Laurence W. McKeen (WA, 2008).pdf\r\n\r\nThis book is an update to the first edition compiled and published in 1990 by William Woishnis. A lot has changed in the field since 1990 and a lot has not changed. There are new plastic materials. There has been a huge turnover in ownership of plastics producing companies. There has been a lot of consolidation, which of course means discontinued products. Thus, this update is much more extensive than the usual &quot;next edition.&quot;\r\n\r\nIt has been reorganized from a chemistry point of view. Plastics of similar polymer types are grouped into nine chapters. Each of these chapters includes an introduction with a brief explanation of the chemistry of the polymers used in the plastics.\r\n\r\nAn extensive first chapter has been added as an introduction that summarizes the chemistry of making polymers, the formulation of plastics, testing and test methods, and plastic selection.\r\n\r\nMost plastic products and parts are expected to be used in environments other than room temperature and standard humidity conditions. Chapters 2-10 are a databank that serves as an evaluation of plastics as they are exposed to varying operating conditions at different temperatures, humidity, and other factors. Over 900 graphs for more than 45 generic families of plastics are contained in these chapters.\r\n\r\nChapter 11 contains extensive mechanical and electrical data in tabular form. The tables contain data on several thousand plastics. Similarly, Chapter 12 contains thermal data on several thousand plastics. \r\nData from the first edition have only been removed if those products were discontinued, and many products were. Product names and manufacturers have been updated. \r\n\r\n• Detailed introductions of plastics properties, testing procedures, and principles of plastics design. \r\n• The only &quot;databook&quot; available on the effects of temperature and humidity conditions on plastics and elastomers. \r\n• More than 1,000 graphs and tables allow for easy comparison between products. \r\n• Covers more than 70 types of plastics, and summarizes the chemistry of each type","torrent":{"xt":"urn:btih:94b7790f10b9e4f5bc7dc3ad551d676885e2cd51","amp;dn":"The+Effect+of+Temperature+and+Other+Factors+on+Plastics+and+Elas","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94b7790f10b9e4f5bc7dc3ad551d676885e2cd51","infoHashBuffer":{"type":"Buffer","data":[148,183,121,15,16,185,228,245,188,125,195,173,85,29,103,104,133,226,205,81]},"announce":[],"urlList":[]}}