{"title":"PrettyDirty - Kristen Scott (In Love With Daddy Part Two) NEW 28","uid":15907387,"size":666830899,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:95f5237c015adb808198c40c3af6fc6994cadf79&amp;dn=PrettyDirty+-+Kristen+Scott+%28In+Love+With+Daddy+Part+Two%29+NEW+28&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":4,"uploader":"xxxlavalxxx","files":2,"time":1475059556,"description":"Kristen Scott and stepfather Tommy Pistol have been sharing an idyllic love since beginning their sordid affair behind her mother's back. Now they're planning on running away together. But first, Tommy wants her to understand life won't always be picnics and strawberries. Tonight he reveals his darker, more dominant side, betraying selfish motives. Just like she's used to getting what she wants, at the mall from his bank account, he wants to fuck all of her holes with his cock, whenever he wants. But the naive girl loves being made to feel like a whore. Hands around her neck, fingers deep in her pussy, he squeezes her clit, and fucks her hard, showing her more of the real Tommy, and making her ask permission to cum. But when she forgets to ask in time, Daddy has to discipline her disobedience, smacking her face, and spitting on her pussy while she bounces on his cock, cumming uncontrollably as he pummels her teen pussy so tightly packed with cock, jerking his jizz onto her forehead. Because he cares.\r\nCategories Brunette, Natural Tits, Small Tits, Fingering, Tattoos, Pussy Licking, Petite, Family Roleplay, Pussy to mouth, Blowjob, Deepthroat, Open Mouth Facial, Big Dick, Stepdad, Ass\r\n \nhttp://imgdone.com/viewer.php?file=23316330342680588608.jpg\r\n \nhttp://imgdone.com/viewer.php?file=10907281496339615551.jpg","torrent":{"xt":"urn:btih:95f5237c015adb808198c40c3af6fc6994cadf79","amp;dn":"PrettyDirty+-+Kristen+Scott+%28In+Love+With+Daddy+Part+Two%29+NEW+28","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95f5237c015adb808198c40c3af6fc6994cadf79","infoHashBuffer":{"type":"Buffer","data":[149,245,35,124,1,90,219,128,129,152,196,12,58,246,252,105,148,202,223,121]},"announce":[],"urlList":[]}}