{"title":"Automatic Call Recorder Pro v4.30 (CTRC)","uid":13191386,"size":4242067,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:96b612834bd42bd60268ff0fb7bd8dc1c5e20a7d&amp;dn=Automatic+Call+Recorder+Pro+v4.30+%28CTRC%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Lion.King","files":2,"time":1452439077,"description":"[center]\r\n[img]http://i.imgur.com/BzSVm0p.png[/img]\r\n\r\n[b]Requirements:[/b] 2.1+\r\n\r\n[b]Overview:[/b] Automatic call recorder.\r\nIn this ad free pro version you can automatically save calls from a contact and add comment to a recorded call.\r\nrecord any phone call you want and choose which calls you want to save. You can set which calls are recorded and which are ignored. Listen to the recording, add notes and share it. Integration with Google Drive™ and Dropbox allows calls to be saved and synchronized to the cloud as well.\r\nGoogle Drive integration works on Android versions 3.0 and above.\r\nPlease note that call recording does not work on certain handsets and can result in inferior quality recordings. We therefore suggest that you try the free version before purchasing the paid app.\r\nIf you encounter any recording issues or wish to improve voice quality, try recording from a different audio source, or use auto-on speaker mode.\r\nRecorded calls are stored in the Inbox. You can change the destination recordings folder to an external SD card as well. You can set the size of the inbox. The number of saved calls is limited only by your device memory. If you decide that a conversation is important, save it and it will be stored in the Saved Calls folder. If not, old recordings will automatically be deleted when new calls fill up the inbox.\r\nYou can enable a Call Summary Menu with options to appear immediately after a call.\r\nSearch for recordings by contact, phone number, or note.\r\n\r\n[b]There are 3 default settings for automatic recording:[/b]\r\n\r\n[b]Record everything (default)[/b] – This setting records all calls except for contacts pre-selected to be ignored.\r\n[b]Ignore everything[/b] – This setting records no calls except for contacts pre-selected to be recorded.\r\n[b]Ignore contacts[/b] – This setting records all calls with people who are not contacts, except for contacts pre-selected to be recorded.\r\n[b]In the Pro version only[/b]: You can set calls from particular contacts to be automatically saved, and they will be saved in the cloud.\r\n\r\n[b]WHAT'S NEW[/b]\r\n\r\nAndroid 5.0 compatibility\r\nUI Improvements\r\nBug fixes[/center]\r\n\r\n[center][img]http://extraimago.com/images/2015/11/08/oPEExeG.png[/img][/center]","torrent":{"xt":"urn:btih:96b612834bd42bd60268ff0fb7bd8dc1c5e20a7d","amp;dn":"Automatic+Call+Recorder+Pro+v4.30+%28CTRC%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96b612834bd42bd60268ff0fb7bd8dc1c5e20a7d","infoHashBuffer":{"type":"Buffer","data":[150,182,18,131,75,212,43,214,2,104,255,15,183,189,141,193,197,226,10,125]},"announce":[],"urlList":[]}}