{"title":"Churchill and Empire - Lawrence James - Audiobook MP3","uid":10561264,"size":492074971,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:976d761225a10946615c43e035802273ccd6b177&amp;dn=Churchill+and+Empire+-+Lawrence+James+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1405459157,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nChurchill and Empire: A Portrait of an Imperialist\n\nWritten by: Lawrence James\nNarrated by: Michael Healy\nLength: 17 hrs and 4 mins\nFormat: Unabridged\nRelease Date:06-24-14\n\nOne of our finest narrative historians, Lawrence James has written an illuminating, genuinely new biography of Winston Churchill that focuses solely on his contradictory relationship with the British Empire. As a young army officer in the late 19th century serving in conflicts in India, South Africa, and the Sudan, his attitude toward the Empire was the Victorian paternalistic approach - at once responsible and superior. Conscious even then of his political career ahead, Churchill found himself reluctantly supporting British atrocities and held what many would regard today as prejudiced views, in that he felt some nationalities were superior to others; his (some might say obsequious) relationship with America reflected that view.\n\nThis outmoded attitude was one of the reasons the British voters rejected him after a Second World War in which he had led the country brilliantly. His attitude remained decidedly old-fashioned in a world that was shaping up very differently. This groundbreaking volume reveals the many facets of Churchill's personality: a visionary leader with a truly Victorian attitude toward the British Empire. ","torrent":{"xt":"urn:btih:976d761225a10946615c43e035802273ccd6b177","amp;dn":"Churchill+and+Empire+-+Lawrence+James+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"976d761225a10946615c43e035802273ccd6b177","infoHashBuffer":{"type":"Buffer","data":[151,109,118,18,37,161,9,70,97,92,67,224,53,128,34,115,204,214,177,119]},"announce":[],"urlList":[]}}