{"title":"Isaacs Army: A Story of Courage and Survival in Nazi-Occupied P","uid":15385380,"size":482809275,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:97d48a12a1e4f0c0f88695f4e0b0414051ba1893&amp;dn=Isaacs+Army%3A+A+Story+of+Courage+and+Survival+in+Nazi-Occupied+P&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Kane_krit","files":18,"time":1469287301,"description":"Isaac’s Army: A Story of Courage and Survival in Nazi-Occupied Poland - Matthew Brzezinski\r\n\r\nStarting as early as 1939, disparate Jewish underground movements coalesced around the shared goal of liberating Poland from Nazi occupation. For the next six years, separately and in concert, they waged a heroic war of resistance against Hitler's war machine that culminated in the Warsaw Ghetto Uprising. In Isaac's Army, Matthew Brzezinski delivers the first-ever comprehensive narrative account of that struggle, following a group of dedicated young Jews-some barely out of their teens-whose individual acts of defiance helped rewrite the ending of World War II. Based on first-person accounts from diaries, interviews, and surviving relatives, Isaac's Army chronicles the extraordinary triumphs and devastating setbacks that befell the Jewish underground from its earliest acts of defiance in 1939 to the exodus to Palestine in 1946. This is the remarkable true story of the Jewish resistance from the perspective of those who led it: Isaac Zuckerman, the confident and charismatic twenty-four-year-old founder of the Jewish Fighting Organization; Simha Ratheiser, Isaac's fifteen-year-old bodyguard, whose boyish good looks and seeming immunity to danger made him an ideal courier; and Zivia Lubetkin, the warrior queen of the underground who, upon hearing the first intimations of the Holocaust, declared: &quot;We are going to defend ourselves.&quot; Joined by allies on the left and right, they survived Gestapo torture chambers, smuggled arms, ran covert printing presses, opened illegal schools, robbed banks, executed collaborators, and fought in the two largest rebellions of the war. Hunted by the Germans and bedeviled by the &quot;Greasers&quot;-roving bands of blackmailers who routinely turned in resistance fighters for profit-the movement was chronically short on firepower but long on ingenuity. Its members hatched plots in dank basements, never more than a door knock away from summary execution, and slogged through fetid sewers to escape the burning Ghetto to the forests surrounding the city. And after the initial uprising was ruthlessly put down by the SS, they gambled everything on a bold plan for a citywide revolt-of both Jews and Gentiles-that could end only in victory or total destruction. The money they raised helped thousands hide when the Ghetto was liquidated. The documents they forged offered lifelines to families desperate to escape the horror of the Holocaust. And when the war was over, they helped found the state of Israel. A story of secret alliances, internal rivalries, and undying commitment to a cause, Isaac's Army is history at its most heart-wrenching. Driven by an unforgettable cast of characters, it's a true-life tale with the pulse of a great novel, and a celebration of the indomitable spirit of resistance.\r\n\r\n \nhttps://itunes.apple.com/us/audiobook/isaacs-army-story-courage/id572730291","torrent":{"xt":"urn:btih:97d48a12a1e4f0c0f88695f4e0b0414051ba1893","amp;dn":"Isaacs+Army%3A+A+Story+of+Courage+and+Survival+in+Nazi-Occupied+P","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97d48a12a1e4f0c0f88695f4e0b0414051ba1893","infoHashBuffer":{"type":"Buffer","data":[151,212,138,18,161,228,240,192,248,134,149,244,224,176,65,64,81,186,24,147]},"announce":[],"urlList":[]}}