{"title":"The Facts on File Dictionary of Proverbs.pdf","uid":9510836,"size":1935955,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97d47d16b20ee3e610dddb17fde2d0c0790a574f&amp;dn=The+Facts+on+File+Dictionary+of+Proverbs.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1390409407,"description":"The English language is enhanced by thousands of proverbs that make observations, impart life lessons, or give advice. With more than 1,500 entries, this dictionary explains the meanings and origins of short, memorable sayings that are widely recognized today, such as art is long and life is short; conscience does make cowards of us all; gather ye rosebuds while ye may; Homer sometimes nods; and still waters run deep.\nFeaturing both traditional and contemporary proverbs, entries include: a definition of the proverb; examples of usage, either drawn from English literature and biblical passages or specially compiled for this book; the origin of first recorded occurrence of the expression; variants or alternative forms of the proverb; cross-references from variant entries and a list of proverbs expressing similar or opposite meanings.\nThis dictionary also offers an extensive keyword index, enabling readers to look up proverbs by a significant word, as well as a thematic index, which lists proverbs by topic.\nEngaging and informative, The Facts On File Dictionary of Proverbs is a valuable resource for students, readers, and writers alike.","torrent":{"xt":"urn:btih:97d47d16b20ee3e610dddb17fde2d0c0790a574f","amp;dn":"The+Facts+on+File+Dictionary+of+Proverbs.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97d47d16b20ee3e610dddb17fde2d0c0790a574f","infoHashBuffer":{"type":"Buffer","data":[151,212,125,22,178,14,227,230,16,221,219,23,253,226,208,192,121,10,87,79]},"announce":[],"urlList":[]}}