{"title":"Metaphysics of Sex (gnv64)","uid":14347324,"size":41576617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:989af4d4a12e7b7b282a0d94d99a7753f428e3f9&amp;dn=Metaphysics+of+Sex+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"gnv65","files":4,"time":1460987269,"description":"The metaphysics of sex\r\nby Julius Evola\r\nInner Traditions International | 1983 | ISBN-10: 0892810254 | 322 pages | PDF | 39.6 mb \nhttps://en.wikipedia.org/wiki/Eros_and_the_Mysteries_of_Love\r\n\r\nA comprehensive work on the metaphysical aspects of sexuality. Julius Evola sheds new light on the mystical and spiritual expression of sexual love. This in-depth study explores the sexual rites of sacred traditions, and shows how religion, mysticism, folklore, and mythology all contain erotic forms in which the deep potentialities of human beings are recognized.\r\n\r\nAbout the Author\r\nJulius Evola (1898-1974) has been one of the most misunderstood and controversial authors of the Twentieth century. Born in Rome, Evola began his pursuit of truth as a Dadaist painter and an Idealist philosopher, but quickly lost his taste for modernism and moved on to metaphysics, religion, and the occult. Encountering the work of René Guénon, who became a lifelong friend, Evola embraced his concept of the Tradition and his critique of the modern world, and spent the remainder of his long career elaborating his own, more individualised variation of the principles first explicated by Guénon, offering a unique view of how one can put into practice the doctrines of a genuine spiritual path. \r\nHe remained almost entirely unknown in the English-speaking world until the 1990s, when Inner Traditions began publishing its translations of Evola's works. Since then, Evola's ideas have given rise to a new breed of spiritual seekers and anti-modernists in the English-speaking world. Arktos has published his books, Metaphysics of War, which is a collection of his essays from the 1930s and '40s; The Path of Cinnabar, which is his intellectual autobiography; Fascism Viewed from the Right, which is his post-war analysis of the positive and negative aspects of Italian Fascism; and Notes on the Third Reich, which performs a similar analysis upon German National Socialism\r\n\r\nCONTENTS\r\nINTRODUCTION\r\nI EROS AND SEXUAL LOVE 9\r\nII THE METAPHYSICS OF SEX 42\r\nIII PHENOMENA OF TRANSCENDENCY IN PROFANE LOVE 67\r\nIV GODS AND GODDESSES, MEN AND WOMEN 115\r\nV SACRED CEREMONIES AND EVOCATIONS 172\r\nVI SEX IN THE REALM OF INITIATONS AND MAGIC 216\r\nCONCLUSION 273\r\nNOTES 277\r\nINDEX 333\r\n \nhttps://s9.postimg.org/go5qf8p9r/Metaphysics+of+Sex.jpg","torrent":{"xt":"urn:btih:989af4d4a12e7b7b282a0d94d99a7753f428e3f9","amp;dn":"Metaphysics+of+Sex+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"989af4d4a12e7b7b282a0d94d99a7753f428e3f9","infoHashBuffer":{"type":"Buffer","data":[152,154,244,212,161,46,123,123,40,42,13,148,217,154,119,83,244,40,227,249]},"announce":[],"urlList":[]}}