{"title":"(Blues VA) Harmonica Blues - Great Harmonica Performances","uid":6406077,"size":103232642,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:98f589823642208288e1782dd212d0d2beb8f985&amp;dn=%28Blues+VA%29+Harmonica+Blues+-+Great+Harmonica+Performances&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1305811196,"description":"...Of The 1930s And '20s\n\n\nmp3   320kbps\n\n\nReleased: 1991\nLabel: Yazoo\nStyles: Country blues, Acoustic Chicago blues, Piedmont blues, Pre-war country blues, East Coast blues\nArt: Front\n\n\n(3:09) 1. Freeman Stowers - Railroad Blues\n(3:03) 2. State Street Boys - Crazy About You\n(3:02) 3. Carver Boys - Wang Wang Harmonica Blues\n(2:57) 4. Lee Brown - My Driving Wheel\n(2:57) 5. Ashley &amp; Foster - Bay Rum Blues\n(2:57) 6. Robert Hill - I'm Going To Write &amp; Tell Mother\n(2:57) 7. Chuck Darling - Blowin' The Blues\n(2:18) 8. Chuck Darling - Harmonica Rag\n(3:05) 9. Jaybird Coleman - Man Trouble Blues\n(3:30) 10. Jazz Gillum - I Want You By My Side\n(3:14) 11. Alfred Lewis - Friday Moan Blues\n(3:03) 12. Chicken Wilson - House Snake Blues\n(3:15) 13. Bobby Lecan - Need More Blues\n(3:21) 14. Deford Bailey - Davidson County Blues\n\nIt is perhaps a testament to the harmonica's status in music that even its finest practitioners remain relatively obscure. Compiling a disc of harp players, as Yazoo has done here, isn't going to turn up a bunch of familiar names. As an early document of an instrument that remained essential to the blues well after it became an electric medium, however, Harmonica Blues is excellent. The instrument served numerous roles during the 1920s and 1930s (the period covered here), showing up in dance music, solo showcases, and blues; on street corners and in juke joints. An example of the instrument's novelty appeal is as good a place to start as any. Though Freeman Stowers' recorded conventional blues, he also relished in comic fare like &quot;Railroad Blues.&quot;\n\nBidding his woman farewell as she steps aboard a train, Stowers builds to a blistering pace in his steam engine imitation. The harmonica's ability to bend notes and produce vibrato made it particularly expressive when applied to blues. It's dynamic range and unique timbre meant that it could cut through an acoustic ensemble in a manner similar to a violin or slide guitar. Harp men step into the spotlight for particularly spectacular solos on the otherwise tepid blues of &quot;I Want You By My Side&quot; and &quot;My Driving Wheel.&quot; Both De Ford Bailey and Jaybird Coleman, the two players to gain some degree of notoriety during their prime, are represented by a cut each. Bailey, a popular performer on Nashville's Grand Ole Opry displays his unparalleled technique on &quot;Davidson County Blues,&quot; while Coleman proves that he was an exceptional vocalist as well on &quot;Man Trouble Blues.&quot; Together, the artists gathered on Harmonica Blues represent the precursors to the great harp players of the electric era like Little Walter, Junior Wells, and Sonny Boy Williamson. ","torrent":{"xt":"urn:btih:98f589823642208288e1782dd212d0d2beb8f985","amp;dn":"%28Blues+VA%29+Harmonica+Blues+-+Great+Harmonica+Performances","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98f589823642208288e1782dd212d0d2beb8f985","infoHashBuffer":{"type":"Buffer","data":[152,245,137,130,54,66,32,130,136,225,120,45,210,18,208,210,190,184,249,133]},"announce":[],"urlList":[]}}