{"title":"Nanomachines - Fundamentals and Applications - Joseph Wang","uid":15391146,"size":7840147,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:998d2efd64aca19acdc73839efaa8a132a188f90&amp;dn=Nanomachines+-+Fundamentals+and+Applications+-+Joseph+Wang&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"clouderone","files":1,"time":1469345120,"description":"Nanomachines - Fundamentals and Applications - Joseph Wang (Wiley-VCH, 2013).pdf\r\n\r\nNanomachines represent one of the most fascinating topics in of nanotechnology. These tiny devices provide diverse opportunities towards a wide range of important applications, ranging from targeted delivery of drug payloads to environmental remediation. This book addresses comprehensively the latest developments and discoveries in the field of nano- and microscale machines. It covers the evolution of nanomachines in general from a historical perspective, the fundamental challenges for motion at the nanoscale, different categories of biological and synthetic nano/microscale motors based on different propulsion mechanisms, ways for controlling the movement directionality\r\nand regulated speed, followed by detailed of major areas for which nanomachines has the potential to make a transformational impact. It ends with a futuristic look at nano/microscale machines and into their impact on the society.\r\n\r\nKey Features:\r\n\r\n* The only nanomachine introductory textbook currently available.\r\n* Written with college graduate level in mind to appeal to a broad interdisciplinary audience.\r\n* Covers the fundamental challenges for nanoscale motion.\r\n* Covers the latest advances in the design and operaton of a wide range of small-scale machines.\r\n* Covers diverse biomedical, environmental and technological applications of nanomachines.\r\n* Written in review format with cited articles to cover latest research and developments","torrent":{"xt":"urn:btih:998d2efd64aca19acdc73839efaa8a132a188f90","amp;dn":"Nanomachines+-+Fundamentals+and+Applications+-+Joseph+Wang","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"998d2efd64aca19acdc73839efaa8a132a188f90","infoHashBuffer":{"type":"Buffer","data":[153,141,46,253,100,172,161,154,205,199,56,57,239,170,138,19,42,24,143,144]},"announce":[],"urlList":[]}}