{"title":"Star Trek (TOS) - Stagione 1 (ediz. rimasterizzata) - DVD Rip IT","uid":6225822,"size":13348576947,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9a5de6b982514e25dcfe81ffe25ef4a5a7195e42&amp;dn=Star+Trek+%28TOS%29+-+Stagione+1+%28ediz.+rimasterizzata%29+-+DVD+Rip+IT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":null,"files":31,"time":1299503867,"description":"&quot;Spazio, ultima frontiera... Questi sono i viaggi dell'astronave Enterprise...&quot;. Questa frase, ormai diventata mitica, ÃƒÂ¨ la descrizione perfetta di ciÃƒÂ² che costituiva l'ambiente in cui si vivevano le avventure dell'originale serie di Star Trek: una nave stellare in giro per la galassia ad esplorare nuovi mondi, ed aiutare i coloni sparsi per lo spazio.\n\nDiventati dei modelli non solo per l'intera fantascienza, ma anche per il mondo televisivo e cinematografico intero, i mitici personaggi originali hanno fatto da rompighiaccio per una serie di nuovi eroi moderni che, anche se invincibili, hanno paure e timori come ogni essere umano, limiti e difetti che li rendono profondi e non bidimensionali.\n\nLa prima serie di Star Trek ÃƒÂ¨ oramai conosciuta come Serie Classica, oppure, soprattutto in America, come TOS (The Original Series). Che la Serie Classica sia ormai entrata nella leggenda televisiva statunitense ÃƒÂ¨ risaputo. Kirk, Spock e McCoy sono personaggi entrati nel culto di milioni di appassionati, ma soprattutto fanno oramai parte della cultura americana.\n\nLa serie televisiva, pur rimanendo una serie d'intrattenimento, ha proposto temi importanti dal punto di vista sociale, etico e politico. Per la prima volta nella storia della televisione un giapponese, una donna di origine africana, diversi americani, uno scozzese, un alieno e un russo, nel momento in cui il mondo era spaccato in due dalla Guerra fredda, si trovavano a lavorare insieme nello stesso equipaggio, ad esplorare l'universo alla ricerca di nuove culture con cui dare vita a reciproci scambi in nome dell'uguaglianza e della pace.","torrent":{"xt":"urn:btih:9a5de6b982514e25dcfe81ffe25ef4a5a7195e42","amp;dn":"Star+Trek+%28TOS%29+-+Stagione+1+%28ediz.+rimasterizzata%29+-+DVD+Rip+IT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a5de6b982514e25dcfe81ffe25ef4a5a7195e42","infoHashBuffer":{"type":"Buffer","data":[154,93,230,185,130,81,78,37,220,254,129,255,226,94,244,165,167,25,94,66]},"announce":[],"urlList":[]}}