{"title":"Moby - Play 1999/2014 Official Digital Download 24bit/96kHz","uid":11770017,"size":1324479019,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9aa477c4bb10a7b23e27f7500e2b7bd836d50e37&amp;dn=Moby+-+Play+1999%2F2014+Official+Digital+Download+24bit%2F96kHz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"sidmal","files":21,"time":1427033137,"description":"Moby - Play (1999) [2014 Official Digital Download 24bit/96kHz]\n FLAC 24bit/96kHz (tracks) | Cover Only | 1.52 GB | 63:14 minutes\nElectronica | Studio Master, Official Digital Download | Hosted On: NirtoFlare &amp; Oboom\n\n Play is the fifth studio album by American electronica musician Moby. While some of Moby's earlier work garnered critical and commercial success within the electronic dance music scene, Play was both a critical success and a commercial phenomenon. It eventually became the biggest-selling album of its genre, with over 12 million copies sold worldwide.\n\n\n Following a notorious flirtation with alternative rock, Moby returned to the electronic dance mainstream on the 1997 album I Like to Score. With 1999's Play, he made yet another leap back toward the electronica base that had passed him by during the mid-'90s. The first two tracks, &quot;Honey&quot; and &quot;Find My Baby,&quot; weave short blues or gospel vocal samples around rather disinterested breakbeat techno. This version of blues-meets-electronica is undoubtedly intriguing to the all-important NPR crowd, but it is more than just a bit gimmicky to any techno fans who know their Carl Craig from Carl Cox. Fortunately, Moby redeems himself in a big way over the rest of the album with a spate of tracks that return him to the evocative, melancholy techno that's been a specialty since his early days. The tinkly piano line and warped string samples on &quot;Porcelain&quot; frame a meaningful, devastatingly understated vocal from the man himself, while &quot;South Side&quot; is just another pop song by someone who shouldn't be singing -- that is, until the transcendent chorus redeems everything. Surprisingly, many of Moby's vocal tracks are highlights; he has an unerring sense of how to frame his fragile vocals with sympathetic productions. Occasionally, the similarities to contemporary dance superstars like Fatboy Slim and Chemical Brothers are just a bit too close for comfort, as on the stale big-beat anthem &quot;Bodyrock.&quot; Still, Moby shows himself back in the groove after a long hiatus, balancing his sublime early sound with the breakbeat techno evolution of the '90s. Reviewed by John Bush of allmusic.com  \n\n\n\nTrack Listing:\n\n01. Honey\n02. Find My Baby\n03. Porcelain\n04. Why Does My Heart Feel So Bad?\n05. South Side\n06. Rushing\n07. Bodyrock\n08. Natural Blues\n09. Machete\n10. 7\n11. Run On\n12. Down Slow\n13. If Things Were Perfect\n14. Everloving\n15. Inside\n16. Guitar Flute and String\n17. They Sky Is Broken\n18. My Weakness\n\n\nAlbum Released: May 17, 1999","torrent":{"xt":"urn:btih:9aa477c4bb10a7b23e27f7500e2b7bd836d50e37","amp;dn":"Moby+-+Play+1999%2F2014+Official+Digital+Download+24bit%2F96kHz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9aa477c4bb10a7b23e27f7500e2b7bd836d50e37","infoHashBuffer":{"type":"Buffer","data":[154,164,119,196,187,16,167,178,62,39,247,80,14,43,123,216,54,213,14,55]},"announce":[],"urlList":[]}}