{"title":"Gurdjieff - Harmonic Development - The Complete Harmonium Record","uid":4997609,"size":647794490,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9abfa5fe4f5afa3cbc0097ad8fb462ebaaa999df&amp;dn=Gurdjieff+-+Harmonic+Development+-+The+Complete+Harmonium+Record&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":null,"files":1,"time":1247352792,"description":"GURDJIEFF &quot;HARMONIC DEVELOPMENT&quot;\nThe Complete Harmonium Recordings 1948-49\n\n136 recordings 19 hours on 1 MP3 disc format\nThis disc will play on any computer with MP3 software installed and on most recent DVD players.\n\nAn attractive and profusely illustrated 144-page book\nwith many previously unpublished photographs of Gurdjieff and recollections of people who were present when these recordings were made. (not included in upload)\n\nCompiled from 44 master-tapes containing Gurdjieff's complete recorded output from Mme. Sylvie Anastasieff, widow of Valentin Anastasieff, Gurdjieff's nephew.\n\nThe 113 recordings on these tapes were sequenced in four series:\nI: First Series - recorded between 1 April and 21 July 1949\nII: Mesoteric Series - recorded between 22 July and 18 August 1949\nIII: American Series - recorded between 25 August and 27 September 1949\nIV: Second Series - recorded between 27 September and 16 October 1949\n\nThese were recorded at Gurdjieff's apartment in Paris.\n\nAdditionally, the very first recordings of Gurdjieff's harmonium music - made at the Wellington Hotel, New York, between 25 December 1948 and early February 1949 - have been added to this collection with the consent of the Gurdjieff Foundation of New York. These New York recordings also include several talks and stories as told by Gurdjieff to his pupils.\n\nAn addenda section containing several interesting, albeit unlabeled pieces from the original wire recordings brings the grand total to 136 recordings, over 19 hours of music, all brought together in chronological sequence on a single disc in 'MP3' format. As a special bonus, a short 9-minute film made by Evelyn Sutta on several automobile trips with Gurdjieff during the summer of 1949 has been added. This disc will play on any computer with MP3 software installed and on most recent DVD players.","torrent":{"xt":"urn:btih:9abfa5fe4f5afa3cbc0097ad8fb462ebaaa999df","amp;dn":"Gurdjieff+-+Harmonic+Development+-+The+Complete+Harmonium+Record","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9abfa5fe4f5afa3cbc0097ad8fb462ebaaa999df","infoHashBuffer":{"type":"Buffer","data":[154,191,165,254,79,90,250,60,188,0,151,173,143,180,98,235,170,169,153,223]},"announce":[],"urlList":[]}}