{"title":"[ExploitedCollegeGirls] Anastasia (04.03.2015)","uid":11793954,"size":759125258,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9b4d74f1b9c28ccc9d18cf3d1876a9481fbac394&amp;dn=%5BExploitedCollegeGirls%5D+Anastasia+%2804.03.2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"chkm8te","files":1,"time":1428059038,"description":"[ExploitedCollegeGirls] Anastasia (04.03.2015)\n\nFrom her piercing blue eyes to her magical pink pussy, Anastasia is a gothy beauty that takes to Jay's cock as quickly as she did to black hair dye. This week's update is 44 minutes of intense sex that racks up 4 full body orgasms for Ana and one piping hot creampie for Jay (and you guys).\n\nThings start off in the car as Jay interviews 19 year old Ana. First of all, don't worry. She says &quot;hooping&quot; not &quot;pooping&quot; when she's describing her performances. You're forgiven for having that wtf moment, we had it to. No, we didn't know &quot;hooping&quot; was a thing either. Jay started things this way because he'd planned one of his famous road head shoots but things come to a crashing halt when Anastasia explains that she doesn't do oral. So, you have A cups, enough metal in your body to never make it through a TSA checkpoint in one go and you hate giving blowjobs. The marriage proposals must be rolling in! We sure hope you can't cook, too!\n\nFor some reason when people say &quot;circus&quot; your mind usually fills in &quot;freak&quot; as the next word. While Anastasia is definitely a freak in the sheets, she's actually a pretty talented circus performer and before the shoot gives Jay an impromptu demo in front of a local rapper's tastefully modified Bentley. Things finally get to the room for the actual shoot, a jacuzzi room with moody lighting no less! You know, we might be paying Jay too much.\n\nAs Anastasia's nerves subside, she strips and allows Jay to take control. Fortunately he knows exactly how to handle girls like Ana and in very short order he's got her tight little body writhing in orgasm. Despite her distaste for the greatest gift a girl can give a boy - the blowjob - she gets to her knees and starts sucking. All we can say is there's a reason it's called a blowJOB and not blowPARTY, Ana, you just have to put in the work. She does and does pretty well for a girl who's icked out by jizz.\n\nJay knows what Anastasia really needs and it's deep, hard fucking. He gets a hold of her hips and gives her a solid pounding that results in her second O. At one point he's fucking her so hard he sets the camera aside and really works it. From doggy to her back to sideshow, Jay pounds two more intense orgasms out of her and then, mission accomplished, he unleashes a mighty creampie in her tight vag.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=kg7zdtibgbt37czk07xd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=kg7zdtibgbt37czk07xd.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=83fk3kdn1evrpr6ofne1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=83fk3kdn1evrpr6ofne1.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:9b4d74f1b9c28ccc9d18cf3d1876a9481fbac394","amp;dn":"%5BExploitedCollegeGirls%5D+Anastasia+%2804.03.2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b4d74f1b9c28ccc9d18cf3d1876a9481fbac394","infoHashBuffer":{"type":"Buffer","data":[155,77,116,241,185,194,140,204,157,24,207,61,24,118,169,72,31,186,195,148]},"announce":[],"urlList":[]}}