{"title":"Chocolat - Music From The Motion Picture 320cbr 2000 Score","uid":9448764,"size":102506618,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9b506404ec9f6b71f8f649ca316162a8e905c945&amp;dn=Chocolat+-+Music+From+The+Motion+Picture+320cbr+2000+Score&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1389133336,"description":"Chocolat - Music From The Motion Picture - Rachel Portman 320cbr (Big Papi) 2000 Soundtrack\n\n\nBy Salvatore \nAcademy-Award nominated composer from last year's orphan or abortion drama &quot;The Cider House Rules&quot; and winner for 1996's &quot;Emma&quot; has made another masterpiece - &quot;Chocolat.&quot; Working again with director Lasse Hallstrom (The Cider House Rules,) she has created her own touching piece to one of the best movies of 2000.\nPortman is without a doubt one of the greatest composers of our time. Her music has so much passion that it is amazing to listen to. On top of that, her score fits in so well with the picture that it is just awe-inspiring. &quot;Chocolat&quot; is no different.\n\nUsing simple tunes and balanced orchestra pieces, the soundtrack is harmonious to the ears. Once you begin, Portman takes you on a journey that she has set up for you. A journey where you can almost taste the passions and desires that the film shows you. This is where Portman proves that she is a genius. Hallstrom can show you what is going on with his camera, but Portman is able to tell you by using an orchestra to express the feelings of the film.\n\nSome of the score may sound somewhat like &quot;The Cider House Rules,&quot; but that is understandable. They are both of the same time period. Even John Williams sometimes becomes redundant. Unlike &quot;The Cider House Rules,&quot; Portman has taken her vision &quot;Chocolat&quot; and changed it into fun and riveting melodies that include complex guitar pieces. There is more emotion placed in this album than her previous.\n\n&quot;Chocolat&quot; is definitely Portman's best work yet. Her Golden Globe nomination only adds more icing to the cake. It is obvious that Rachel Portman has serious talent and the world is very blessed by being able to experience it.","torrent":{"xt":"urn:btih:9b506404ec9f6b71f8f649ca316162a8e905c945","amp;dn":"Chocolat+-+Music+From+The+Motion+Picture+320cbr+2000+Score","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b506404ec9f6b71f8f649ca316162a8e905c945","infoHashBuffer":{"type":"Buffer","data":[155,80,100,4,236,159,107,113,248,246,73,202,49,97,98,168,233,5,201,69]},"announce":[],"urlList":[]}}