{"title":"Schubert - 8 Symphonies - Karl Bohm","uid":10745473,"size":1181666999,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9b61bd52df86ce76b1ae21ee6041108db206ebf0&amp;dn=Schubert+-+8+Symphonies+-+Karl+Bohm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"magneez","files":14,"time":1407809564,"description":"FLAC+CUE, covers\n\nOver the course of nearly a decade, the distinguished Austrian conductor Karl Bohm recorded all of Schubert's symphonies with the Berlin Philharmonic, yielding splendid recordings that have only been reissued recently by Deustche Grammophon. It's a pity that these haven't been remastered using the latest 24 bit digital technology, but nonetheless, the CD transfers still have a rich, warm sound due in part to the rich atmospheric sonority present in Berlin's Jesus Christ Kirche studio which Deutsche Grammophon used for virtually all of the Berlin Philharmonic's recordings in the 1960's and 1970's. Bohm leads the Berlin Philharmonic in richly textured, vibrantly warm performances; with the notable exception of the 1st Symphony, he adheres to brisk tempi. And yet, Bohm's interpretation of the 1st Symphony succeeds as an early orchestral precursor to Johann Strauss' Radetzky March, rich in regal bearing. Bohm's interpretation of the 4th &quot;Tragic&quot; Symphony is among the most emotionally gut-wretching versions I have heard. I was equally mesmerized by his fine versions of the 8th &quot;Unfinished&quot; and 9th symphonies. Although there are splendid, more recent, interpretations currently available from Abbado, Harnoncourt and Mackerras, to name but a few, Bohm's interpretations of Schubert's last two symphonies should still be regarded as among the most important ever recorded. Bohm draws upon his Austrian musical heritage to emphasize Schubert's ties to Mozart, and especially, Haydn, in the first 6 symphonies. In Bohm's riveting interpretation of the 9th symphony, the Berlin Philharmonic plays with as much passion as the Vienna Philharmonic, evoking rural Austrian folk tunes which must have inspired Schubert while he composed the symphony. Deutsche Grammophon deserves highest praise for reissuing this important Schubert symphony cycle at a price that is certainly a steal.","torrent":{"xt":"urn:btih:9b61bd52df86ce76b1ae21ee6041108db206ebf0","amp;dn":"Schubert+-+8+Symphonies+-+Karl+Bohm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b61bd52df86ce76b1ae21ee6041108db206ebf0","infoHashBuffer":{"type":"Buffer","data":[155,97,189,82,223,134,206,118,177,174,33,238,96,65,16,141,178,6,235,240]},"announce":[],"urlList":[]}}