{"title":"Survive Smart: Your Ultimate Guide for Outlasting Any Disaster","uid":15282533,"size":93428,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b705834a1c8e93dd18ccc10ecdc80bae93ece89&amp;dn=Survive+Smart%3A+Your+Ultimate+Guide+for+Outlasting+Any+Disaster&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1468357220,"description":"Survive Smart: Your Ultimate Guide for Outlasting Any Disaster\r\n\r\n\r\n\r\nSurvive Smart: Your Ultimate Guide for Outlasting Any Disaster is a must-read for survival enthusiasts and novices alike. This guide offers foolproof advice for preparing your home and assembling a portable survival kit, and offers real, indispensable tips for surviving any set of circumstances.\r\n\r\nIn this guide, you'll read about:\r\n\r\nThe bare essentials needed for a small, portable survival kit\r\nHow to construct the perfect bug-out bag\r\nAll of the items you'll need in your home stockpile\r\nThe four essential aspects of staying alive\r\nYou'll also discover all of the survivalist tips and tricks, such as how to prepare food for long-term storage (including canning and vacuum-sealing methods), how to fish with minimal resources, and how to assemble a snare for catching animals. You'll read about the fastest and easiest ways to build shelter, as well as some tips for selecting the best tools and supplies that serve multiple purposes. This guide also covers the difference between must-have resources, and those that you can live without.\r\n\r\nDownloading this book is perhaps the greatest form of insurance available in our world of uncertainty. From first-aid to self-defense, this guide arms you with all of the knowledge you'll need in order to survive any situation. Whether you're inside your house or stuck in the middle of nowhere, you can survive the aftermath of a disaster with the help of the resources available to you - but first, you have to know how","torrent":{"xt":"urn:btih:9b705834a1c8e93dd18ccc10ecdc80bae93ece89","amp;dn":"Survive+Smart%3A+Your+Ultimate+Guide+for+Outlasting+Any+Disaster","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b705834a1c8e93dd18ccc10ecdc80bae93ece89","infoHashBuffer":{"type":"Buffer","data":[155,112,88,52,161,200,233,61,209,140,204,16,236,220,128,186,233,62,206,137]},"announce":[],"urlList":[]}}