{"title":"Epoxy Polymers: New Materials and Innovations{BBS}","uid":6838526,"size":9015229,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b721648cd66ad7404f8e78ef171cb4d81332c21&amp;dn=Epoxy+Polymers%3A+New+Materials+and+Innovations%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1322088866,"description":"Epoxy polymers are one of the most versatile materials belonging to the family of thermosetting plastics. These plastics are produced by a so-called cure process, in which liquid precursors are converted into the final solid material by a polymerization reaction. Epoxy resins find important industrial applications in the fields of adhesives, coatings, carbon-fiber and glass-fiber composites, among many others. They are integral parts of PCs and other electronic equipment, cars, aircraft, floors, eolic-energy generators, and many other objects and structures found in our daily life.\n\nIn this only up-to-date book to focus on new developments and innovations in this hot field, international experts from industry and academia present everything scientists need to know on the topic.\n\nThe first section provides general concepts of the synthesis and properties of epoxy polymers and serves as a basis for the subsequent chapters. The second section covers new types of epoxy polymers recently commercialized or not yet present on the market, while the third section includes chapters related to the capacity of generating controlled nanostructures in epoxy-based materials. A fourth section is devoted to innovations in epoxy-based materials such as pre-pregs, structural foams, injection-molded products and self-healing epoxies. Concluding remarks and perspectives are discussed in a short final section.\n\nThe result is a one-stop reference source, collecting scientific and technological breakthroughs otherwise spread throughout hundreds of publications, patents and reports.\nAbout the Author\nProfessor Jean-Pierre Pascault is Emeritus from 2005 at National Institute of Applied Science (INSA) Lyon France. He was Professor in the same Institute from 1983 to October 2005; Director of the Laboratory of Macromolecular Materials (Associated to CNRS) from 1982 to 1998; Director of a CNRS Polymer Network Group (FR CNRS) from 2000 up to 2006; President of the French Polymer Group, GFP, and of the Polymer Division of the French Chemical Society, SFC from 2001 to 2004. He has authored over 300 scientific publications including several book chapters and one book and 32 patents.\n\nProfessor Roberto J. J. Williams is Head of the Polymer Division of the Institute of Materials Science and Technology (INTEMA), depending on the University of Mar del Plata and the National Research Council (CONICET), Argentina. He has authored over 200 scientific publications including several book chapters and two books (Thermosetting Polymers; Diffusion in Gases and Porous Media). His main contributions have been in the fields of thermosetting polymers and organic-inorganic hybrid materials. He has received several scientific awards and is a member of the National Academies of Engineering and Exact Sciences.\n\nProduct Details\n\n    * Hardcover: 387 pages\n    * Publisher: Wiley-VCH; 1 edition (March 16, 2010)\n    * Language: English\n    * ISBN-10: 3527324801","torrent":{"xt":"urn:btih:9b721648cd66ad7404f8e78ef171cb4d81332c21","amp;dn":"Epoxy+Polymers%3A+New+Materials+and+Innovations%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b721648cd66ad7404f8e78ef171cb4d81332c21","infoHashBuffer":{"type":"Buffer","data":[155,114,22,72,205,102,173,116,4,248,231,142,241,113,203,77,129,51,44,33]},"announce":[],"urlList":[]}}