{"title":"Mick Jagger - Primitive Cool (1987) WMA320","uid":6148435,"size":155945936,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9c15dcc382e48fbaece3c592d9024054b2f56775&amp;dn=Mick+Jagger+-+Primitive+Cool+%281987%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1296778232,"description":"Following the Stones' Dirty Work, bickering amongst the Stones prevented them from having the anticipated quinquennial tour. Both Mick Jagger and Keith Richards decided on solo albums, creating speculations whether the end of the Stones was nigh. Such wasn't the case however. \n\nBut Mick Jagger's second solo album, Primitive Cool, went more on a harder-edged guitar rock sound than the pop polishings of She's The Boss. All songs were produced by Mick himself, with assistance from Keith Diamond and Dave Stewart, and he brought back Jeff Beck on lead guitar. \n\nThat's not to say that some of the pop polish was gone. The first single, &quot;Let's Work,&quot; his simplistic solution on killing poverty, went to #39. The song seems to be a mean-spirited hit against welfare recipients, but maybe against those who take advantage of the system-&quot;can generosity bring you humility?&quot; \n\nThe second single, the #67 &quot;Throwaway,&quot; owes a bit to the Stones, but is more typical of Mick's new hard-driving sound, but the theme of a &quot;been there done that&quot; greasy Casanova who finally wants some true love has been done before. &quot;Radio Control&quot; is even better, featuring some hard guitar riffs. Living Colour's Vernon Reid has guitar chores, so I wonder if it's him here. \n\nThe title track is an amusing commentary on how the young ask those who lived in the 50's and 60's if they lived the history of those times, be it fashion or political upheavals, as they learned it in school or saw on TV. I shudder to think of the time when it comes my turn, when some whippersnappers ask me of the 80's, &quot;It all seems so primitive, how did you survive? It all seemed so different then. How did you stay alive?&quot; His easy answer is to tell them what they want to hear, &quot;Oh yeah,&quot; but sardonically telling the whippersnappers &quot;Well I think you've got it figured out/go check it out for yourself/cause I've had it playing teacher for today.&quot; \n\n&quot;Kow Tow&quot; is a song on taking a stand against a lover gone bad, refusing to be bound to the past or being blackmailed, with some crunching guitar on the chorus. The jumping &quot;Shoot Off Your Mouth&quot; comes closest to the Stones-like nastiness, and is a harder-edged Little Richard/Elvis-type song slamming another ex who not only puts him down but becomes like the proverbial rat on a sinking ship when things go bad. And when he gets stronger, &quot;who are you to shoot off your mouth?&quot; he demands. The most energetic song here and a fave. \n\nThe bittersweet ballad &quot;Party Doll&quot; sees Mick visiting country since &quot;Faraway Eyes.&quot; More an acoustic piece than country, it shows the disillusionment that sets in once the giddy party days are over, especially when the other half &quot;wants to live in clover.&quot; Paddy Maloney gives an Irish flavour with the Uileann pipes. Mary Chapin Carpenter later covered this on her greatest hits album. \n\n&quot;I was born in a war, that's why they call me a war baby&quot; sings Mick in the sobering anti-war &quot;War Babies. The poverty experienced by the Brits, the storming of Omaha Beach on D-Day is juxtaposed with the Cold War arms race, with a faint background sound effects of air raid sirens, bombs, and machine gun clatter. &quot;Why can't we hope to find a cure&quot; be it to war, poverty, and security, is an oft-cried question, with a solution that can be either an impossible dream or a darker one. \n\nA few filler songs fail to dampen a stronger solo album from Mick, who despite revisiting familiar themes, is has a reflective side on the title track and &quot;Party Doll.&quot; It would be after another Stones album before Mick would go for round three with Wandering Spirit. \n\nby Daniel J. Hamlow\n\nTRACKLIST:\n\n01 - Throwaway.wma                                          \n02 - Let's Work.wma                                         \n03 - Radio Control.wma                                      \n04 - Say You Will.wma                                       \n05 - Primitive Cool.wma                                     \n06 - Kow Tow.wma                                            \n07 - Shoot Off Your Mouth.wma                               \n08 - Peace For The Wicked.wma                               \n09 - Party Doll.wma                                         \n10 - War Baby.wma       \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:9c15dcc382e48fbaece3c592d9024054b2f56775","amp;dn":"Mick+Jagger+-+Primitive+Cool+%281987%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c15dcc382e48fbaece3c592d9024054b2f56775","infoHashBuffer":{"type":"Buffer","data":[156,21,220,195,130,228,143,186,236,227,197,146,217,2,64,84,178,245,103,117]},"announce":[],"urlList":[]}}