{"title":"Harlan Coben - De Schuilplaats &amp; Nu of nooit. NL Ebook (ePub","uid":8715970,"size":1149552,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c17dc7af1052db6f6f7ba57343a57ed8defe665&amp;dn=Harlan+Coben+-+De+Schuilplaats+%26amp%3B+Nu+of+nooit.+NL+Ebook+%28ePub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"BiWild","files":-1,"time":1374331399,"description":"Harlan Coben - De Schuilplaats &amp; Nu of nooit. NL Ebook (ePub). DMT\n\nAfbeelding\n\nAuteur: Harlan Coben \nPagina's: 256 / 336\nTaal: Dutch/Nederlands\nUitgever: Boekerij\nJaar van uitgifte: Juli 2012 / 2013\nGenre: Jeugd\n\nSamenvatting\n\nDe Schuilplaats\nDat Myron Bolitar een niet al te goede relatie met zijn broer had, was voor de fans al duidelijk. Dus wat moet hij als \nzijn neefje Mickey onder zijn toezicht wordt geplaatst? Voor Mickey Bolitar kan het leven niet veel ellendiger worden. \nNadat hij zijn vader heeft zien sterven en zijn moeder in een afkickkliniek is opgenomen, moet hij bij zijn wereldvreemde \noom Myron gaan wonen en tot overmaat van ramp moet hij ook nog naar een andere school!\n\nEen nieuwe school betekent nieuwe vrienden en nieuwe vijanden. Gelukkig voor Mickey betekent het ook een fantastische \nnieuwe vriendin, Ashley. Het lijkt erop dat Mickeys leven eindelijk weer in de lift zit - totdat Ashley spoorloos verdwijnt. \nMaar Mickey is niet van plan om nog iemand kwijt te raken en besluit Ashleys spoor te volgen. Zijn zoektocht leidt hem \nnaar een huiveringwekkende onderwereld en hij komt erachter dat Ashley niet is wie ze beweerde te zijn. En datzelfde \ngeldt voor zijn overleden vader. Al snel ontdekt Mickey een samenzwering die zo schokkend is dat zijn schoolzorgen \nerbij in het niets vallen. Het leven zoals hij dat kende, komt volledig op losse schroeven te staan...\n\n\n\nAfbeelding\n\nSamenvatting\n\nNu of nooit \nMickey doet zijn best om het hoofd boven water te houden op zijn nieuwe school, maar dat wordt bemoeilijkt door een \ngrote tragedie. Een van zijn klasgenoten, Rachel, wordt op koelbloedige wijze neergeschoten, en Mickey en zijn vrienden \nblijken opeens midden in een samenzwering te zitten. Mickey heeft al zijn slimheid en doorzettingsvermogen nodig om \nuit te zoeken wie Rachel heeft vermoord en om zichzelf en zijn vrienden te beschermen. \nHij weet alleen niet tegen wie of wat. \n\n\nDeze review wordt u aangeboden door\n\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:9c17dc7af1052db6f6f7ba57343a57ed8defe665","amp;dn":"Harlan+Coben+-+De+Schuilplaats+%26amp%3B+Nu+of+nooit.+NL+Ebook+%28ePub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c17dc7af1052db6f6f7ba57343a57ed8defe665","infoHashBuffer":{"type":"Buffer","data":[156,23,220,122,241,5,45,182,246,247,186,87,52,58,87,237,141,239,230,101]},"announce":[],"urlList":[]}}