{"title":"David Shade-Cure Nice Guy","uid":8639573,"size":224120357,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9c30021c4b2c794330896317490ae76043e6cff3&amp;dn=David+Shade-Cure+Nice+Guy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"acer47x","files":41,"time":1372852643,"description":"Written by David Shade \nFormat: MP3 \nBitrate: 128 Kbps \n\n\nSeems almost too simple doesn't it? The problem is, most guys don't have a clue on how to be the bad boy. (Actually, that's not quite correct, I'll tell you why in a minute)\n\nBut Curing Nice Guy isn't just about men, because fact is...\nWhat Women want\n\nMen's Health Magazine recently surveyed 1,600 women about their sexual desires....\n\n* 60% reported they wish they were having MORE sex!\n* Women rated &quot;pinning me against the wall for a long make-out session&quot; as the #1 sexy seduction move!\n\nThe following are the top four things they wanted their man to do...\n\n1. Ask her to pose naked!\n2. Talk dirty to her in bed!\n3. Kiss her passionately in front of her friends!\n4. Talk about sexual fantasies with her!\n\nWomen are frustrated!\n\nMost women can't find what they want. They either end up with a nice guy and boring lame sex, or they end up having great sex with a bad boy who ends up treating her like a used condom.\n\nWhen you hear a woman say a Good Man is HARD to find, this is what they mean. She wants a man who treats her with respect AND can ring her bell in the bedroom.\nMen are frustrated!\n\nYour whole life you've been doing what you were taught and have been nice... all the time, everywhere and to everybody.\n\nBut, you don't get the results with women you want, and bluntly the lets-just-be-friends thing sucks.\n\nMen aren't satisfied, women aren't satisfied. Modern society has let us down by creating so many nice guys. When the reality is...\nWomen Want More Sex!\n\nAnd what they really desire is a man who makes his woman feel appreciated, is sexually exciting and can give her wild screaming orgasms. Women fantasize about a man like this constantly. It's why they read 400 page romance novels.\n\nWomen write me all the time and tell me how hard it is to find a Masterful Lover, so the way I see it, Cure Nice Guy cuts two ways. Both men and women will have better sex and better relationships.","torrent":{"xt":"urn:btih:9c30021c4b2c794330896317490ae76043e6cff3","amp;dn":"David+Shade-Cure+Nice+Guy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c30021c4b2c794330896317490ae76043e6cff3","infoHashBuffer":{"type":"Buffer","data":[156,48,2,28,75,44,121,67,48,137,99,23,73,10,231,96,67,230,207,243]},"announce":[],"urlList":[]}}