{"title":"Awaken Your Intuition with Judith Orloff [MP3]","uid":11888815,"size":59530801,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9c31206d79a06283fce4d46e7855774bab92b53e&amp;dn=Awaken+Your+Intuition+with+Judith+Orloff+%5BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"elessedilgirl","files":3,"time":1430926928,"description":"This audio will show you how to:\n\nLearn to powerfully listen to your body's needs.\nMake sense of your life when it's most confusing.\nUse your body's subtle energies to heal pain, panic, depression and other symptoms.\nListen to your gut feelings\nFollow your dreams.\nLearn to balance the linear analytic mind with intuition.\nLearn what intuitions are most authentic.\n\nDr. Judith Orloff, a practicing psychiatrist who integrates intuition into her medical practice, asserts that intuition is a potent form of inner wisdom, not mediated by the rational mind. Accessible to us all, it's a still, small voice inside. It's an unflinching truth teller committed to our well-being. You may experience intuition as a gut feeling, hunch, a physical sensation, a snapshot-like flash, or a dream. Always a friend, it keeps a vigilant eye on our bodies, letting us know if something is out of synch.\n\nWe each possess an intuitive healing code within us that contains the blueprints for our health, happiness and survival of everything that is good here on earth. This code is written in a language of silence, metaphor, imagery, energy, and knowings that may seem alien until we are taught to decipher it. As you begin to understand its nuances, its secrets, the code will seem like the most familiar language of all, one you uttered before you ever had a memory of anything material, one that doesn't require a spoken voice to comprehend.\n\nAwaken Your Intuition Part 1 - 1:01:33\nAwaken Your Intuition Part 2 - 37:43\n\nMP3 - 80 kbps - CBR\n\nSource: WebRip","torrent":{"xt":"urn:btih:9c31206d79a06283fce4d46e7855774bab92b53e","amp;dn":"Awaken+Your+Intuition+with+Judith+Orloff+%5BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c31206d79a06283fce4d46e7855774bab92b53e","infoHashBuffer":{"type":"Buffer","data":[156,49,32,109,121,160,98,131,252,228,212,110,120,85,119,75,171,146,181,62]},"announce":[],"urlList":[]}}