{"title":"REM - Out Of Time 1991 [FLAC] - Kitlope","uid":4122065,"size":307280948,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9c4bd0b8aa90f1eda77ae99b76d9d79395564a1f&amp;dn=REM+-+Out+Of+Time+1991+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Kitlope","files":15,"time":1207604866,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: EAC 0.99 prebeta 3\nEAC Log: Yes\nCue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce \nTorrent Hash: 9C4BD0B8AA90F1EDA77AE99B76D9D79395564A1F\nFile Size: 293 Mb\nYear: 1991\nLabel: Warner \n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n[quote].E.M. reconvened in mid-1990 to record its seventh album, Out of Time. In a departure from previous albums, the band members often wrote the music with non-traditional rock instrumentation including mandolin, organ, and acoustic guitar.[47] Released in March 1991, Out of Time was the band&amp;#039;s first album to top both the US and UK charts.[20] The record eventually sold 4.2 million copies in the US alone,[48] and about 12 million copies worldwide by 1996.[44] The album&amp;#039;s lead single &quot;Losing My Religion&quot; was a worldwide hit that received heavy rotation on radio, as did the music video on MTV.[49] &quot;Losing My Religion&quot; was R.E.M.&amp;#039;s highest-charting single in the US, reaching number four on the Billboard charts.[20] &quot;There&amp;#039;ve been very few life-changing events in our career because our career has been so gradual,&quot; Mills said years later. &quot;If you want to talk about life changing, I think &amp;#039;Losing My Religion&amp;#039; is the closest it gets&quot;.[50] The album&amp;#039;s second single. &quot;Shiny Happy People&quot; (one of three songs on the record to feature vocals from Kate Pierson of fellow Athens band The B-52&amp;#039;s), was also a major hit, reaching number 10 in the US and number six in the UK.[20] Out of Time garnered R.E.M. seven nominations at the 1992 Grammy Awards, the most nominations of any artist that year. The band won three awards: one for Best Alternative Music Album and two for &quot;Losing My Religion&quot;, Best Short Form Music Video and Best Pop Performance by a Duo or Group with Vocal.[51] R.E.M. did not tour to promote Out of Time; instead the group played a series of one-off shows, including an appearance taped for an episode of MTV Unplugged.[52]\n\nOut of Time is the seventh album by the American band R.E.M. It was released on Warner Bros. in 1991.\n\nThe album won three Grammy Awards in 1992: one as Best Alternative Music Album, and two for the first single, &quot;Losing My Religion.&quot; It debuted at number 1 in the U.S. and returned to the position several weeks later.\n\nIn 1998 Q magazine readers voted Out of Time the 38th greatest album of all time; in their 2006 follow-up list it rose one place to 37. In 2006, the album was chosen by TIME Magazine as one of the 100 best albums of all time.[1]The album has been certified four times platinum in the U.S. and sold over ten million copies worldwide.[2]\n\nOut of Time combines elements of pop, folk and classical music heard on their Green album, with a new concentration on country elements that would continue on 1992&amp;#039;s Automatic for the People.\n\nPreceded by the release of &quot;Losing My Religion,&quot; which became R.E.M.&amp;#039;s biggest U.S. hit, Out of Time gave them their first U.S. and UK #1 albums. The band did not tour to support the release.\n\nIn 2005, Warner Bros. Records issued an expanded two-disc edition of Out of Time which includes a CD, a DVD-Audio disc containing a 5.1-channel surround sound mix of the album done by Elliot Scheiner, and the original CD booklet with expanded liner notes.\n[/quote]\n\n\n\nTracks:\n\n\nTime side\n\n&quot;Radio Song&quot; ? 4:12 \n&quot;Losing My Religion&quot; ? 4:26 \n&quot;Low&quot; ? 4:55 \n&quot;Near Wild Heaven&quot; ? 3:17 \n&quot;Endgame&quot; ? 3:48 \n\nMemory side\n\n&quot;Shiny Happy People&quot; ? 3:44 \n&quot;Belong&quot; ? 4:03 \n&quot;Half A World Away&quot; ? 3:26 \n&quot;Texarkana&quot; ? 3:36 \n&quot;Country Feedback&quot; ? 4:07 \n&quot;Me In Honey&quot; ? 4:06 \n\nEnjoy :)\n","torrent":{"xt":"urn:btih:9c4bd0b8aa90f1eda77ae99b76d9d79395564a1f","amp;dn":"REM+-+Out+Of+Time+1991+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c4bd0b8aa90f1eda77ae99b76d9d79395564a1f","infoHashBuffer":{"type":"Buffer","data":[156,75,208,184,170,144,241,237,167,122,233,155,118,217,215,147,149,86,74,31]},"announce":[],"urlList":[]}}