{"title":"Mass Spectrometry in Sports Drug Testing [tahir99] V.R.G.pdf","uid":10417750,"size":6493041,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c7a6eb65dbce1e31ff041907593f05cc3c890a1&amp;dn=Mass+Spectrometry+in+Sports+Drug+Testing+%5Btahir99%5D+V.R.G.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"tahir99","files":1,"time":1403608455,"description":"Mass Spectrometry in Sports Drug Testing: Characterization of Prohibited Substances and Doping Control Analytical Assays\n\n\nimage\n\nPublication Date: August 2, 2010 | ISBN-10: 0470413271 | ISBN-13: 978-0470413272 | Edition: 1\n\n\n\nEnables you to detect, identify, and characterize hundreds of drugs that may be used by athletes\n\nMass spectrometry has become essential to sports drug testing. This book examines both the principles of sports drug testing and the use of mass spectrometry techniques and mass spectral data to detect, identify, and characterize hundreds of known and unknown drugs that athletes may use to enhance their performance. The author provides a detailed overview of the mass spectrometry of numerous classes of therapeutics and agents, various analyzers to detect low- and high-molecular weight drugs, as well as techniques to discriminate between endogenously produced and synthetically derived compounds.\n\nMass Spectrometry in Sports Drug Testing begins with a full chapter dedicated to the history of sports drug testing. Next, the book provides the principles and techniques needed to maximize the specificity and sensitivity of mass spectrometric assays, including:\n\nDetailed, step-by-step assays with sample preparation\nDiscussion of both chromatographic separation and mass spectrometric analysis\nCharacterization of analytes in order to unequivocally identify banned substances\nMass spectrometric behavior of low- and high-molecular weight analytes\n\nThroughout the book, descriptive examples illustrate the principles, advantages, and limitations of different assays.\n\nMass Spectrometry in Sports Drug Testing not only sets forth the role mass spectrometry plays in detecting drug use among athletes, it also adds new insights into the health and ethical issues of doping in sports. ","torrent":{"xt":"urn:btih:9c7a6eb65dbce1e31ff041907593f05cc3c890a1","amp;dn":"Mass+Spectrometry+in+Sports+Drug+Testing+%5Btahir99%5D+V.R.G.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c7a6eb65dbce1e31ff041907593f05cc3c890a1","infoHashBuffer":{"type":"Buffer","data":[156,122,110,182,93,188,225,227,31,240,65,144,117,147,240,92,195,200,144,161]},"announce":[],"urlList":[]}}