{"title":"India Shastra - Shashi Tharoor","uid":11814818,"size":814457,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ca7a908370d527190618a1c8c161652c22a3c9b&amp;dn=India+Shastra+-+Shashi+Tharoor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1429041101,"description":"This has been a time of unprecedented change in the country. The transformation of Indias politics, economy, foreign policy, media, civil rights, governance and a myriad other aspects of our society and government has been swift and disruptive, sometimes brutally so. Narendra Modi, the nations new Prime Minister and his Bharatiya Janata Party, dominate the political scene, as the Congress once did and are attempting to change the way we work, think, pray and conduct ourselves as citizens of the planets most populous democracy. There are signs that the nation is moving in directions that will benefit its people-the economy has begun to revive, its foreign policy appears to be purposefully pursuing a visible place in the world, polls show that a significant percentage of the nations youth are optimistic about the future, at the same time, there are serious concerns about the rise of majoritarianism and religious fundamentalism (Often, this is one and the same thing), a disquieting intolerance of free speech, dissent and religious freedom, moreover, there appears to be no end to corruption, hate speech, criminals in politics, terrorism, violence against women, bureaucratic lethargy, governmental incompetence, endemic poverty, environmental degradation and a host of other problems that India has been struggling to overcome for decades.\n\nWhat does the future hold? Is the promise of good times a mere illusion? Have we forgotten the democratic, humane, secular and liberal values that our founding fathers endowed us with? Are high-speed trains and missions to Mars eclipsing the vital need to achieve universal literacy, eradicate poverty and provide food, shelter and health-care for all?\n\nShashi Tharoor, one of our most distinguished and insightful writers, attempts to answer these and other important questions and demystify the complex issues that have been thrown up by the ongoing transformation of the nation. After chronicling Indias transformation over the years in several previous books, he brings his insights into Indian society, economics and politics up to date in wide-ranging short essays that extend the narrative right up to the present time. Lucid, brilliantly argued, balanced and illuminating, India Shastra is required reading for anyone who wishes to understand todays India","torrent":{"xt":"urn:btih:9ca7a908370d527190618a1c8c161652c22a3c9b","amp;dn":"India+Shastra+-+Shashi+Tharoor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ca7a908370d527190618a1c8c161652c22a3c9b","infoHashBuffer":{"type":"Buffer","data":[156,167,169,8,55,13,82,113,144,97,138,28,140,22,22,82,194,42,60,155]},"announce":[],"urlList":[]}}