{"title":"Timothy Ferriss - The 4-Hour work Week discs 1-6 of 7","uid":3959207,"size":138222854,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9d5723d8d2ab0ea51e6a8697be035de9df98d516&amp;dn=Timothy+Ferriss+-+The+4-Hour+work+Week+discs+1-6+of+7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"plasmaview","files":136,"time":1199336388,"description":"This torrent contains discs 1-6 of 7.  Disc 7 of 7 is at http://thepiratebay.se/tor/4325156\n\n-------------\n\nThe small file size is due to the use of the speech optimized codec Ogg Speex rather than MP3, and is not due to compromised quality. The drawback is limited support on mobile devices. If your device doesn't support Ogg Speex you can always reencode it to MP3. File size will increase sevenfold (assuming 128kbit) but you'll still get decent audio quality, and no gaps/jumps/spikes/other disturbances.\n\nMPlayer and VLC should work out of the box, for Windows Media Player download the Directshow Filters from http://www.illiminable.com/ogg\n\n----------------\n\nThe 4-Hour work Week: Escape 9-5, Live Anywhere, and Join the New Rich (Audio CD)\n\nTim Ferriss is an extraordinary young man on a mission. The twenty-eight-year-old serial vagabond and successful entrepreneur has been teaching a wildly popular course at Princeton University for the past four years--a how-to and why-to guide to throwing out the old tools and methods for success (balancing life and work, retiring well, having a great nest egg) and replacing them with a whole new way of living. Readers can lead a rich life by working only four hours a week, freeing up the rest of their time to spend it living the lives they want.\n\nTIM FERRISS has a diverse background of experience, including working as an actor, speaking seven foreign languages, holding a world record in tango, and being a national Chinese kickboxing champion. He has written for Maxim and the Philadelphia Inquirer, has appeared on MTV and CBS radio, and has been interviewed or featured in such major publications as the New York Times, LA Times, Parade, Cosmopolitan, Entrepreneur Magazine, and National Geographic Traveler.\n\nProduct Details\n\n    * Audio CD: 200 pages\n    * Publisher: Blackstone Audio Inc.; Unabridged edition (April 24, 2007)\n    * Language: English\n    * ISBN-10: 0786158964\n    * ISBN-13: 978-0786158966\n\nWhether you're an overworked employee or an entrepreneur trapped in your own business, The 4-Hour Workweek is the compass for a new and revolutionary world.\n\nForget the old concept of retirement and the rest of the deferred-life plan?ÃƒÂ³??????there is no need to wait and every reason not to. Whether your dream is escaping the rat race, high-end world travel, monthly five-figure income with zero management, or just living more and working less, this book is the blueprint.\n\nYou can have it all?ÃƒÂ³??????really.\n\nJoin Tim Ferriss, popular guest lecturer in entrepreneurship at Princeton University, as he teaches you:\n\n    * How to outsource your life and do whatever you want for a year, only to return to a bank account 50% larger than before you left\n    * How blue-chip escape artists travel the world without quitting their jobs\n    * How to eliminate 50% of your work in 48 hours using the principles of little-known European economists\n    * How to train your boss to value performance over presence, or kill your job (or company) if it's beyond repair\n    * How to trade a long-haul career for short work bursts and frequent ?ÃƒÂ³??????mini-retirements?ÃƒÂ³??????\n    * What automated cash-flow &quot;muses&quot; are and how to create one in 2-4 weeks\n    * How to cultivate selective ignorance?ÃƒÂ³??????and create time?ÃƒÂ³??????with a low-information diet\n    * Management secrets of Remote Control CEOs\n    * The crucial difference between absolute and relative income\n    * How to get free housing worldwide and airfare at 50-80% off\n    * How to fill the void and creating meaning after removing work and the office\n\nThe 4-Hour Workweek also includes the sample e-mails, voicemails, and real-life deals (with dollar figures and all) you will need to master the new world of luxury lifestyle design.\n\nWho is Tim Ferriss?\nSerial entrepreneur and ultravagabond Timothy Ferriss has been featured in The New York Times, National Geographic Traveler, MAXIM, and other media. He speaks six languages, runs a multinational firm from wireless locations worldwide, and has been a world-record holder in tango, a national champion in Chinese kickboxing, and an actor on a hit television series in Hong Kong. He is 29 years old.","torrent":{"xt":"urn:btih:9d5723d8d2ab0ea51e6a8697be035de9df98d516","amp;dn":"Timothy+Ferriss+-+The+4-Hour+work+Week+discs+1-6+of+7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d5723d8d2ab0ea51e6a8697be035de9df98d516","infoHashBuffer":{"type":"Buffer","data":[157,87,35,216,210,171,14,165,30,106,134,151,190,3,93,233,223,152,213,22]},"announce":[],"urlList":[]}}