{"title":"Batgirl - Year One 01-09 (2003|Digital|TheHand-Empire)","uid":10081491,"size":93409066,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9d64d8cf91b3617bf13971179b162dec482b7b82&amp;dn=Batgirl+-+Year+One+01-09+%282003%7CDigital%7CTheHand-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"VikTSlick","files":-1,"time":1399013596,"description":"From School Library Journal:\n&quot;Her police captain father doesn't want her on the force. The FBI says she's too short to be a field agent. But Barbara Gordon is determined to find a place among crime fighters and transcend her existence as an &quot;Underpaid Librarian and Potential Defaulter of Student Loans.&quot; To annoy her dad, who's embarrassed by the help the police secretly receive from Batman, Barbara wears a Batman-inspired costume to the force's masquerade ball. When supervillain Killer Moth crashes the party, she drives him from the building-and a new caped crusader is born. The Moth christens her &quot;Batgirl&quot; (&quot;I'd have preferred 'Batwoman,'&quot; she remarks), and her action hits the news and attracts the attention of another disapproving father-type: Batman himself, who warns her that she's out of her league. Undaunted, Barbara buys herself some gear, and an admiring Robin sneaks her the rest of the equipment she needs. Many a panel later, triumph and the respect of both of her &quot;fathers&quot; ensue. Batgirl is a joy from start to finish, with smart, barbed dialogue; a dense (but not migraine-inducing) plot; exuberantly drawn action; and impressive characterization. Rejected by the mobsters he's offered his protection to, Killer Moth fails because he believesthose who say he's outclassed. Batgirl refuses such shallow bait. She's a heroine whom teens will embrace, and this volume may well be the best superhero comic of 2003.&quot;","torrent":{"xt":"urn:btih:9d64d8cf91b3617bf13971179b162dec482b7b82","amp;dn":"Batgirl+-+Year+One+01-09+%282003%7CDigital%7CTheHand-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d64d8cf91b3617bf13971179b162dec482b7b82","infoHashBuffer":{"type":"Buffer","data":[157,100,216,207,145,179,97,123,241,57,113,23,155,22,45,236,72,43,123,130]},"announce":[],"urlList":[]}}