{"title":"Microsoft SQL Server 2014 Business Intelligence Edition with SP1","uid":11953874,"size":3183425974,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9d78dac8fb7a467c5e0d5e575d773a93cb75c2e5&amp;dn=Microsoft+SQL+Server+2014+Business+Intelligence+Edition+with+SP1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":4,"uploader":"FirstUploads","files":2,"time":1432301771,"description":"Microsoft SQL Server 2014 Business Intelligence Edition with SP1-[FirstUploads]\n\n\nBusiness Intelligence Edition\n\nSQL Server Business Intelligence delivers a comprehensive platform empowering organizations to build and deploy secure, scalable and manageable BI solutions.\n\n\nCapabilities: \n\n*Rapid data exploration and visualization \nDiscover new insights at the speed of thought with Power View, an interactive, browser-based data exploration, visualization, and presentation experience. Power Pivot helps users access and mash-up data from virtually any source, including Big Data using familiar tools.\n\n*High performance analytics \nOur in-memory analytics engine provides a generational leap in performance while allowing an interaction with an unprecedented amount of data. In-memory capabilities are built right into the SQL Server analytics engines for flexibility and ease of use.\n\n*Credible, consistent data \nIT can better control and manage data through a BI Semantic Model, which provides consistent view across heterogeneous data sources, and enhancements to SQL Server Integration Services.\n\n\n*Robust data quality \nImprove data quality by using organizational knowledge and 3rd party reference data providers to profile, cleanse, and match data.\n\n\n*Master data management \nMaintain master data across the organization structures used for object mapping, reference data, and metadata management.\n\n*Basic availability, security and data management \nBusiness Intelligence edition also includes the core database capabilities of SQL Server Standard for departmental applications including Windows Server core support and user-defined roles for setting up separation of duties","torrent":{"xt":"urn:btih:9d78dac8fb7a467c5e0d5e575d773a93cb75c2e5","amp;dn":"Microsoft+SQL+Server+2014+Business+Intelligence+Edition+with+SP1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d78dac8fb7a467c5e0d5e575d773a93cb75c2e5","infoHashBuffer":{"type":"Buffer","data":[157,120,218,200,251,122,70,124,94,13,94,87,93,119,58,147,203,117,194,229]},"announce":[],"urlList":[]}}