{"title":"Mockingjay (The Hunger Games, Book 3) by Suzanne Collins [republ","uid":7753690,"size":1320019,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9dd9ce630884997b3e3564a88d1bca33cf255447&amp;dn=Mockingjay+%28The+Hunger+Games%2C+Book+3%29+by+Suzanne+Collins+%5Brepubl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"republicV","files":3,"time":1351029763,"description":"Mockingjay is the third installment of The Hunger Games trilogy by Suzanne Collins. Mockingjay was released on August 24, 2010, with an initial print run of 1.2 million copies which was bumped up from 750,000 copies.\n\nMockingjay by Suzanne Collins: After her rescue by rebels, Katniss reluctantly agrees to become &quot;the Mockingjay&quot;, a symbol of the rebellion against the Capitol. As part of a deal, she demands that the leader of District 13, President Coin, grant immunity to all of the victors of the Hunger Games. She also demands the right to kill President Snow herself. In a daring rescue, Peeta and other victors are rescued from the Capitol. However, Peeta has been brainwashed into hating Katniss, and tries to kill her upon their reunion in District 13.\nThe rebels take control of the districts and finally begin an assault on the Capitol itself, which Katniss is a part of. However, an assault on a &quot;safe&quot; Capitol neighborhood goes wrong, and Katniss and her team flee further into the Capitol with the intent of finding and killing President Snow. Eventually Katniss finds herself pressing on alone towards Snow's mansion, which has supposedly been opened to shelter Capitol children (but is actually intended to provide human shields for Snow). Afterwards, bombs placed in supply packages kill many of these children and a rebel medical team, including Katniss' sister Prim.","torrent":{"xt":"urn:btih:9dd9ce630884997b3e3564a88d1bca33cf255447","amp;dn":"Mockingjay+%28The+Hunger+Games%2C+Book+3%29+by+Suzanne+Collins+%5Brepubl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dd9ce630884997b3e3564a88d1bca33cf255447","infoHashBuffer":{"type":"Buffer","data":[157,217,206,99,8,132,153,123,62,53,100,168,141,27,202,51,207,37,84,71]},"announce":[],"urlList":[]}}