{"title":"Guns.Germs.And.Steel.2005.DVDRiP.XviD-CycLOPS","uid":3511517,"size":2180879679,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9e2810f4509137cb316770c2a600bfd76df5b591&amp;dn=Guns.Germs.And.Steel.2005.DVDRiP.XviD-CycLOPS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"BhangWalla","files":6,"time":1155320294,"description":"Guns.Germs.And.Steel.2005.DVDRiP.XviD-CycLOPS\n &lt;a href=&quot;\nhttp://www.pbs.org/gunsgermssteel/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/gunsgermssteel/&lt;/a&gt; &lt;a href=&quot;\nhttp://imdb.com/title/tt0475043/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0475043/&lt;/a&gt;\n\n3 Episodes\nEnglish Audio and Subtitles\n---------------------------\n\nA documentary concerning Jared Diamond\\\\\\&amp;#039;s theory on why there is such disparity between those who have advanced technology and those who still live primitively. He argues it is due to the acquisition of guns and steel and the changes brought about by germs\n\nBased on Jared Diamond\\\\\\&amp;#039;s Pulitzer Prize-winning book of the same name, Guns, Germs and Steel traces humanity\\\\\\&amp;#039;s journey over the last 13,000 years - from the dawn of farming at the end of the last Ice Age to the realities of life in the twenty-first century.\n\nInspired by a question put to him on the island of Papua New Guinea more than thirty years ago, Diamond embarks on a world-wide quest to understand the roots of global inequality.\n\n\n\nWhy were Europeans the ones to conquer so much of our planet?\nWhy didn\\\\\\&amp;#039;t the Chinese, or the Inca, become masters of the globe instead?\nWhy did cities first evolve in the Middle East?\nWhy did farming never emerge in Australia?\nAnd why are the tropics now the capital of global poverty?\n\n\n \t\t \n\tWomen farming in Papua New Guinea\t\n\nAs he peeled back the layers of history to uncover fundamental, environmental factors shaping the destiny of humanity, Diamond found both his theories and his own endurance tested.\n\nThe three one-hour programs were filmed across four continents on High Definition digital video, and combinied ambitious dramatic reconstruction with moving documentary footage and computer animation. They also include contributions from Diamond himself and a wealth of international historians, archeologists and scientists.\n\nGuns, Germs, and Steel is a thrilling ride through the elemental forces which have shaped our world ? and which continue to shape our future.\n\n--------------\nJared Diamond?s journey of discovery began on the island of Papua New Guinea. There, in 1974, a local named Yali asked Diamond a deceptively simple question: \n\n?Why is it that you white people developed so much cargo, but we black people had little cargo of our own?? \n\nDiamond realized that Yali?s question penetrated the heart of a great mystery of human history -- the roots of global inequality. \n\nWhy were Europeans the ones with all the cargo? Why had they taken over so much of the world, instead of the native people of New Guinea? How did Europeans end up with what Diamond terms the agents of conquest: guns, germs and steel? It was these agents of conquest that allowed 168 Spanish conquistadors to defeat an Imperial Inca army of 80,000 in 1532, and set a pattern of European conquest which would continue right up to the present day.\n\nDiamond knew that the answer had little to do with ingenuity or individual skill. From his own experience in the jungles of New Guinea, he had observed that native hunter-gatherers were just as intelligent as people of European descent -- and far more resourceful. Their lives were tough, and it seemed a terrible paradox of history that these extraordinary people should be the conquered, and not the conquerors. \n\nTo examine the reasons for European success, Jared realized he had to peel back the layers of history and begin his search at a time of equality ? a time when all the peoples of the world lived in exactly the same way. \n\nTime of Equality\n\nAt the end of the last Ice Age, around thirteen thousand years ago, people on all continents followed a so-called Stone Age way of life ? they survived by hunting and gathering the available wild animals and plants. When resources were plentiful, this was a productive way of life. \n\nBut in times of scarcity, hunting and gathering was a precarious mode of survival. Populations remained relatively small, and the simple task of finding food occupied every waking moment. \n\nAround eleven and a half thousand years ago, the world\\\\\\&amp;#039;s climate suddenly changed. In an aftershock of the Ice Age, temperatures plummeted and global rainfall reduced. The impact of this catastrophe was felt most keenly in an area known as the Fertile Crescent, in the modern Middle East. Here, hunter-gathers had thrived on some of the most useful and plentiful flora and fauna in the world. They had even developed semi-permanent settlements to exploit the resources around them. \n\nNow, with their food options disappearing from the menu on a daily basis, these people did something remarkable. They began to cultivate the hardiest species of surviving plants and animals, even bringing seeds back to their villages and planting new stock. \n\nThey were becoming farmers. \n\nAn Agricultural Revolution\n\n \t\t \n\tDevelopment of early farming in the Fertile Crescent\t\n\nDiamond learns that the act of transplanting a wild plant and placing it under human control totally transforms that plant\\\\\\&amp;#039;s DNA. Characteristics which aid survival in the wild, disappear in favor of qualities which suit human consumption. The plant becomes domesticated ? and wholly dependent on human control for survival. \n\nOnly a handful of places in the world played host to this agricultural revolution. In most cases, plant domestication was a precursor to the development of advanced civilizations. Along with the Fertile Crescent in the Middle East, independent domestication of wild plants is believed to have occurred in Ancient China, in Central and Southern America, in sub-Tropical Africa, and in the highlands of Papua New Guinea. \n\nSo, Diamond asks, why did each of these parts of the world go on to develop advanced civilizations, while the farmers of New Guinea were apparently left behind? \n\nThe luck of the draw\n\nDiamond discovers that the answer lies in a geographical luck of the draw ? what mattered were the raw materials themselves. \n\nOf all the plant species in the world, only a limited number are possible, or useful, to domesticate. To Diamond\\\\\\&amp;#039;s astonishment, most of these species are native to Europe and Asia ? species like wheat, barley and rice, which grew wild in abundance in only these parts of the world. \n\nTwo more species are native to Tropical Africa (sorghum and yams) while only one is native to the Americas (corn), and to Papua New Guinea (taro). Not a single domesticable plant grows wild in Australia. \n\n \t\t \n\t12 of the 14 domesticable animals in the world reside in Eurasia \t\n\nAnd that\\\\\\&amp;#039;s not all. Diamond discovers a similar dramatic inequality in the distribution of domesticable animals. \n\nAnimals dramatically increase the productivity of farming, through their meat, milk, leather, dung, and as beasts of burden. Without them, farmers are trapped in a cycle of subsistence and manual labor. \n\nOf all the animal species in the world, only 14 have ever been domesticated. 12 of these are native to Eurasia. One, the llama, is native to South America ? and the farmers of New Guinea managed to domesticate the pig. But pigs can\\\\\\&amp;#039;t pull plows, and until the arrival of Europeans in the 20th century, all New Guinean farming was still done by hand. \n\nFrom tools to cities\n\nDiamond realized that the development of successful and productive farming, starting nearly 12,000 years ago in the Fertile Crescent, was the critical turning point in the origins of global inequality. From this point on, one group of people ? the natives of Eurasia ? would have a head start on the path to civilization. \n\nSuccessful farming provides a food surplus, and allows some people to leave the farm behind and develop specialized skills ? such as metal-working, writing, trade, politics, and war-making. Plus, the simple geography of the continent of Eurasia ? one coherent landmass spread on an east-west axis, with universal latitudes and climates ? allowed these technologies and ideas to spread beyond the Middle East with ease. \n\nWithout the environment, or the time, to develop similar skills, the farmers of New Guinea became trapped in their highland isolation. \n\nDiamond concludes that from the end of the Ice Age, geography ensured that different societies around the world would develop at different speeds. If Yali\\\\\\&amp;#039;s people had had all the geographic advantages of Europeans, perhaps they could have conquered the world.\n\nEpilogue\n\nDiamond believes the blueprint for global inequality lies within the land itself, its crops and animals. But can this way of seeing the world really shed light on the great turning points of human history? \n\nCan Jared Diamond explain how a few hundred Europeans were able to conquer the New World, and begin an age of domination: the age of guns, germs and steel?\n\nHELP SEED THIS!!!\n\n- BhangWalla -","torrent":{"xt":"urn:btih:9e2810f4509137cb316770c2a600bfd76df5b591","amp;dn":"Guns.Germs.And.Steel.2005.DVDRiP.XviD-CycLOPS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e2810f4509137cb316770c2a600bfd76df5b591","infoHashBuffer":{"type":"Buffer","data":[158,40,16,244,80,145,55,203,49,103,112,194,166,0,191,215,109,245,181,145]},"announce":[],"urlList":[]}}