{"title":"Oliver Twist - Charles Dickens (Penguin Classics)","uid":10496278,"size":3914463,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e2df66c90809209ec314a215ecd01bf0a7cbc88&amp;dn=Oliver+Twist+-+Charles+Dickens+%28Penguin+Classics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ZamKhan","files":3,"time":1404643285,"description":"Charles Dickens's Oliver Twist is a gripping portrayal of London's dark criminal underbelly, published in Penguin Classics with an introduction by Philip Horne.\n\nThe story of Oliver Twist - orphaned, and set upon by evil and adversity from his first breath - shocked readers when it was published. After running away from the workhouse and pompous beadle Mr Bumble, Oliver finds himself lured into a den of thieves peopled by vivid and memorable characters - the Artful Dodger, vicious burglar Bill Sikes, his dog Bull's Eye, and prostitute Nancy, all watched over by cunning master-thief Fagin. Combining elements of Gothic Romance, the Newgate Novel and popular melodrama, Dickens created an entirely new kind of fiction, scathing in its indictment of a cruel society, and pervaded by an unforgettable sense of threat and mystery.\n\nThis Penguin Classics edition of Oliver Twist is the first critical edition to faithfully reproduce the text as its earliest readers would have encountered it from its serialisation in Bentley's Miscellany, and includes an introduction by Philip Horne, a glossary of Victorian thieves' slang, a chronology of Dickens's life, a map of contemporary London and all of George Cruikshank's original illustrations.\n\nAbout the Author\nCharles Dickens is one of the best-loved novelists in the English language, whose 200th anniversary was celebrated in 2012. His most famous books, including Oliver Twist, Great Expectations, A Tale of Two Cities, David Copperfield and The Pickwick Papers, have been adapted for stage and screen and read by millions.If you enjoyed Oliver Twist, you may like Nicholas Nickleby and Little Dorrit, also available in Penguin Classics.\n\n'His novels will endure as long as the language itself' Peter Ackroyd\n\n'He is our greatest novelist - every reread reveals more riches' Melvyn Bragg'\n\nWhen Dickens has once described something you see it for the rest of your life' George Orwell","torrent":{"xt":"urn:btih:9e2df66c90809209ec314a215ecd01bf0a7cbc88","amp;dn":"Oliver+Twist+-+Charles+Dickens+%28Penguin+Classics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e2df66c90809209ec314a215ecd01bf0a7cbc88","infoHashBuffer":{"type":"Buffer","data":[158,45,246,108,144,128,146,9,236,49,74,33,94,205,1,191,10,124,188,136]},"announce":[],"urlList":[]}}