{"title":"Non Lynda | Photography Essential Skills:  A Digital SLR Photogr","uid":11683687,"size":1265146608,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9e894d1cc01f2807e21743c444e7fc7db11f9ea8&amp;dn=Non+Lynda+%7C+Photography+Essential+Skills%3A++A+Digital+SLR+Photogr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":4,"uploader":"2boweb","files":16,"time":1423219067,"description":"[size=200][b]Photography Essential Skills with Your Digital SLR Photography for Beginners[/b][/size]\n\nEnglish | .mp4 | h264, yuv420p, 1280x720, 385 kb/s, 25.00 fps | aac, 44100 Hz, 2 channels\nGenre: eLearning | Uploaded in Feb 6, 2015 by 2boweb\n\n\n\nIntroduction to DSLR Photography for Beginners (newly updated with new examples, original image download and much more)\nMaster your camera and understand the basics of digital SLR photography with this Photography Course Online.\nThis downloadable step-by-step video series covers the basics of photography, from how your camera works, exposure, shutter speed and aperture, all the way to what inspires you and how to compose your images for maximum impact. \nYou will never have to shoot in auto mode again.\nPopular Photography eBook Included\n\nIncluded is a full manual (Essential Photography Skilles eBook 2nd edition) that goes with these videos, Print it out, especially the Exposure Chart, plus 2 bonus videos will help you shoot like a Pro.\n\nThis video series includes:\n- Over 18 lectures and 2 hrs of content!\n- How cameras work, and how light travels through your digital SLR.\n- Exposure explained: Simple to understand with diagrams. Studio portrait shoot demonstrating exposure.\n- Light and how critical it is to photography. How to modify light, and go on location for a sunset shoot.\n- Depth of Field and how Aperture and Focal Length contribute to DOF. When to use it and why.\n- Examples of Aperture &amp; Depth of Field.\n- Lenses, which lens to use for portraits or landscapes, why are some lenses more expensive than others.\n- Go on location with Brent to photograph a landscape, and discover the secrets behind capturing beautiful seascapes.\n- Shutter Speed. Go on location and discover how to add movement to you images.\n- Examples of how Shutter Speed is used to create great images\n- Learn about autofocus, and when to use the different autofocus settings.\n- ISO and how to use it properly. What about noise in your images?\n- Composition, and the rule of 3rds. Analyse the images we have taken so far. What makes an image good?\n- Inspiration. What inspires you to take pictures, and where Brent finds daily inspiration.\n- How to shoot in manual mode, as well as semi-automatic modes like shutter priority mode.Go along with Brent and see exactly how he creates these images","torrent":{"xt":"urn:btih:9e894d1cc01f2807e21743c444e7fc7db11f9ea8","amp;dn":"Non+Lynda+%7C+Photography+Essential+Skills%3A++A+Digital+SLR+Photogr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e894d1cc01f2807e21743c444e7fc7db11f9ea8","infoHashBuffer":{"type":"Buffer","data":[158,137,77,28,192,31,40,7,226,23,67,196,68,231,252,125,177,31,158,168]},"announce":[],"urlList":[]}}