{"title":"Terry Pratchett Stephen Baxter - The Long Earth epub mobi","uid":7391916,"size":1120656,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e9df81dd0aee14fc6ab272f6fe483c25f642df6&amp;dn=Terry+Pratchett+Stephen+Baxter+-+The+Long+Earth+epub+mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"nomad1980","files":-1,"time":1340807144,"description":"Overview: 2015: Madison, Wisconsin. Junior cop Sally Jansson is called out to the house of Willis Lynsey, a reclusive scientist, for an animal-cruelty complaint: the man was seen forcing a horse in through the door of his home. Inside there is no horse. But Sally finds a kind of home-made utility belt. She straps this on -- and 'steps' sideways into an America covered with virgin forest. Willis came here with equipment and animals, meaning to explore and colonise. And when Sally gets back, she finds Willis has put the secret of the belt on the internet. The great migration has begun...\n\nThe Long Earth: our Earth is but one of a chain of parallel worlds, lying side by side in a higher space of possibilities, each differing from its neighbours by a little (or a lot): an infinite landscape of infinite possibilities. And the further away you travel, the stranger the worlds get. The sun and moon always shine, the basic laws of physics are the same. However, the chance events which have shaped our particular version of Earth, such as the dinosaur-killer asteroid impact, might not have happened and things may well have turned out rather differently. But only our Earth hosts mankind.","torrent":{"xt":"urn:btih:9e9df81dd0aee14fc6ab272f6fe483c25f642df6","amp;dn":"Terry+Pratchett+Stephen+Baxter+-+The+Long+Earth+epub+mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e9df81dd0aee14fc6ab272f6fe483c25f642df6","infoHashBuffer":{"type":"Buffer","data":[158,157,248,29,208,174,225,79,198,171,39,47,111,228,131,194,95,100,45,246]},"announce":[],"urlList":[]}}