{"title":"In This Moment - A Star-Crossed Wasteland [Deluxe Edition] (2010","uid":11436521,"size":124626252,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9fd2d0e0b9d3a7644d0aab0e517523784e4ace4e&amp;dn=In+This+Moment+-+A+Star-Crossed+Wasteland+%5BDeluxe+Edition%5D+%282010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"analogkid6103","files":13,"time":1415759846,"description":"Current line-up:\nMaria Brink - Lead Vocals, Piano\nChris Howorth - Lead Guitar, Backing Vocals\nBlake Bunzel - Rhythm Guitar, Backing Vocals\nKyle Konkiel - Bass, Backing Vocals\nJeff Fabb - Drums\nQuote:\nIn This Moment is an American metalcore  band from Los Angeles, California  formed in 2005. They have released two albums to date, both on Century Media Records. The band's sound is recognizable mainly for female vocalist Maria Brink's use of a combination of screaming and clean vocals.\n\nIn August 2005, singer Maria Brink and guitarist Chris Howorth met through some common friends. After becoming acquainted, and finding that there was much in common between them, they began writing songs together. Soon thereafter they enlisted the help of Los Angeles drummer Jeff Fabb and formed the band Dying Star. Unhappy with where the band was headed, they decided to take on a new musical direction. By mid-2005, the lineup included Brink, Howorth, Fabb, guitarist Blake Bunzel, and bassist Josh Newell. The band recorded demos and posted them on MySpace, where they generated an internet following. The demos included rough versions of &quot;Ashes&quot;, &quot;The Legacy of Odio&quot;, &quot;Next Life&quot;, &quot;This Moment&quot;, and &quot;Prayers&quot;, as well as a cover of Slayer's &quot;Postmortem&quot;. During the summer of 2005, Newell departed from the band to focus on his other project, Ketaset, as well as his sound engineering work. Producer Pascual Romero (currently in Tinhorn) was then the bassist for a time before friend of the band Jesse Landry was eventually tapped to round out the band permanently. Rob &quot;Blasko&quot; Nicholson, the bassist for Ozzy Osbourne became the bands manager after discovering them through MySpace.In This Moment released their second album entitled The Dream on September 30, 2008, with the lead off single &quot;Forever.&quot; The album received mostly positive reviews and marked the band's debut on the Billboard Top 200, debuting at #70 in its first week of release. The album was produced by Kevin Churko and featured a less heavy approach, with a bigger focus on clean vocals from Brink.\n\nTo support the release, the band went on tour with Five Finger Death Punch, Mudvayne, Papa Roach, and Filter. They also appeared on the Give It a Name tour in the UK and were on the 2009 Warped Tour line-up, playing on the Ernie Ball Stage. They've also played at Download Festival 2009 in Donington UK.\n\nThe song 'Forever' has been released as a Downloadable track for the Harmonix 'Rock Band' games.\n\nThe second single off &quot;The Dream&quot; is a cover of Blondie's Call Me. The cover appears on the special edition of the album 'Ultraviolet' to coincide with Warped Tour, which included unreleased tracks and acoustic performances.\n\nIn the fall of 2009, Maria Brink and Chris Howorth announced that the band has begun writing for the next album which will be darker and heavier. Brink revealed the album title A Star-Crossed Wasteland on her official site in February.\n\nAfter being named the Hottest Chick in Metal at the Revolver Golden God awards in April 2010, Maria Brink stated in an interview that A Star-Crossed Wasteland will be released on July 13, 2010. The album's first single, The Gun Show was released to iTunes and premiered on their Myspace on June 1, 2010, and their Facebook a few days later. The band premiered another song, &quot;Just Drive&quot; on their official facebook page on July 3, 2010.\n\nIn the summer of 2010, the band will be playing Mayhem Festival 2010 alongside bands, Korn, Rob Zombie, Five Finger Death Punch, Hatebreed, Shadows Fall and many more.\n\n\n\nTracklist:\n01. The Gun Show\n02. Just Drive\n03. The Promise\n04. Standing Alone\n05. A Star-Crossed Wasteland\n06. Blazin\n07. The Road\n08. Iron Army\n09. The Last Cowboy\n10. World In Flames\n11. Remember\n12. A Star-Crossed Wasteland (Unplugged)\n\n\nEnjoy\nGenre:\tCore\nSubgenre:\tMetalcore\nBitrate:\t320 k\nSize:\t118.85 MB\nShow/Hide Files: \t\n13 files","torrent":{"xt":"urn:btih:9fd2d0e0b9d3a7644d0aab0e517523784e4ace4e","amp;dn":"In+This+Moment+-+A+Star-Crossed+Wasteland+%5BDeluxe+Edition%5D+%282010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fd2d0e0b9d3a7644d0aab0e517523784e4ace4e","infoHashBuffer":{"type":"Buffer","data":[159,210,208,224,185,211,167,100,77,10,171,14,81,117,35,120,78,74,206,78]},"announce":[],"urlList":[]}}