{"title":"Anamanaguchi - 2009 - Dawn Metropolis (V0)","uid":4750461,"size":51696722,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9fde61619e9119ef9290e3056d2a197a8a5579aa&amp;dn=Anamanaguchi+-+2009+-+Dawn+Metropolis+%28V0%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Sixb","files":-1,"time":1236157275,"description":"If the Chiptune movement ever crosses paths with the mainstream, the four fresh faces behind NYC's 8-bit punk outfit Anamanaguchi will be its poster boys. But don't be confused. Indeed these twenty somethings hack the sounds of vintage Nintendo to craft genuinely futuristic tunes via '80s video game nostalgia, but they also play drums, wield guitars and unleash an explosion of energy onstage during every performance. Since forming the group in the spring of 2003, the line-up of founding member Peter Berkman (guitar/NES), James DeVito (bass), Luke Silas (drums) and Ary Warnaar (guitar/GameBoy) leans more on the songcraft of Nick Lowe and/or Elvis Costello than on the Legend of Zelda when spilling their guts.\n\nThe group knows the appeal of crafting simple and charismatic hooks, but their instrumental jams are affecting on a vague, though deeply human level. The sputtering beats and animated melodies of Dawn Metropolis spell out instant nostalgia for anyone who lived through the Mario Bros. generation, and are, perhaps even more powerful for those who weren't quite old enough to play the first time around.\n\nOver the last seven years Anamanaguchi has amassed a huge Internet following and recently performed at the Blip Festival in Brooklyn and for 7,000 at the Penny Arcade Expo in Seattle. A member of the 8bitpeoples collective, their debut Power Supply EP was downloaded 50,000 times. Dawn Metropolis drops on March 3rd with vinyl/CD/download, and a website streaming the whole album along with a whole slew of videos.  You can also currently download all the tracks from their debut album Power Supply from 8BitPeoples. &lt;a href=&quot;\nhttp://www.dawnmetropolis.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dawnmetropolis.com&lt;/a&gt;\nhttp://www.normative.com (webstore and label)","torrent":{"xt":"urn:btih:9fde61619e9119ef9290e3056d2a197a8a5579aa","amp;dn":"Anamanaguchi+-+2009+-+Dawn+Metropolis+%28V0%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fde61619e9119ef9290e3056d2a197a8a5579aa","infoHashBuffer":{"type":"Buffer","data":[159,222,97,97,158,145,25,239,146,144,227,5,109,42,25,122,138,85,121,170]},"announce":[],"urlList":[]}}