{"title":"Onra - 3CD - Chinoiseries (2007-2008), Long Distance (2010), Chi","uid":6829592,"size":603166310,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a07a95cdd9b3abe2ee04c625257e25a77c4cd23b&amp;dn=Onra+-+3CD+-+Chinoiseries+%282007-2008%29%2C+Long+Distance+%282010%29%2C+Chi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"ianislavus","files":92,"time":1321736281,"description":"Onra released his first album with producer and friend Quetzal (Al Quetz) in 2006, A Hip-Hop Tribute to Soul Music, which was played several times by Gilles Peterson and Benji B and covered on Okayplayer.com.\n\nAt the same time, he began to collaborate with American keyboard player Byron the Aquarius and released an album under the name The Big Payback in 2007 on Japanese label Circulations. This project draws from various influences such as futuristic hip hop and spaced-out and jazzy broken beats. They also appeared on highly praised compilations such as Beat Dimensions and New Worlds.\n\nIn 2006 Onra went to Vietnam, where his grandparents are from, and brought back some 30 old Chinese and Vietnamese vinyl records. He then made a full album with this material, Chinoiseries, his most critically acclaimed album. Album cut &quot;The Anthem&quot; was chosen for a Coca-Cola commercial for the Beijing Olympics.\nIn 2008, he was selected to attend the Red Bull Music Academy in Barcelona. He is also part of the 7x7 series by Irish label All City. His &quot;1.0.8,&quot; project was inspired by Bollywood music and has been elected as album of the week by many record shops across Europe. In 2010, Onra released his latest LP Long Distance on All City. The album features tracks with Oliver DaySoul, fellow French beatmaker Walter Mecca, and T3 from Slum Village.\n\nOnra has performed in Canada, Japan, China, Spain, Scotland, Ireland, Lithuania, Poland, England,Germany, Austria, New Zealand, Vietnam, Switzerland, Netherlands, France and Quebec, Russia, Thailand, and throughout the United States, including New York and Los Angeles.","torrent":{"xt":"urn:btih:a07a95cdd9b3abe2ee04c625257e25a77c4cd23b","amp;dn":"Onra+-+3CD+-+Chinoiseries+%282007-2008%29%2C+Long+Distance+%282010%29%2C+Chi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a07a95cdd9b3abe2ee04c625257e25a77c4cd23b","infoHashBuffer":{"type":"Buffer","data":[160,122,149,205,217,179,171,226,238,4,198,37,37,126,37,167,124,76,210,59]},"announce":[],"urlList":[]}}