{"title":"Veronika Decides to Die by Paulo Coelho","uid":7826155,"size":3117079,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a0a3a4165e4ca98c0a666622912a3db2664d4de0&amp;dn=Veronika+Decides+to+Die+by+Paulo+Coelho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"acidr0p","files":5,"time":1352931957,"description":"Twenty-four-year-old Veronika seems to have everything she could wish for: youth and beauty, pleny of attractive boyfriends, a fulfilling job, and a loving family. Yet something is lacking in her life. Inside her is a void so deep that nothing could possibly ever fill it. So, on the morning of November 11, 1997, Veronika decides to die. She takes a handful of sleeping pills expecting never to wake up.\n\nNaturally Veronika is stunned when she does wake up at Villete, a local mental hospital, where the staff informs her that she has, in fact, partially succeeded in achieving her goal. While the overdose didn't kill Veronika immediately, the medication has damaged her heart so severely that she has only days to live.\n\nThe story follows Veronika through the intense week of self-discovery that ensues. To her surprise, Veronika finds herself drawn to the confinement of Villete and its patients, who, each in his or her individual way, reflect the heart of human experience. In the heightened state of life's final moments, Veronika discovers things she has never really allowed herself to feel before: hatred, fear, curiosity, love, and sexual awakening. She finds that every second of her existence is a choice between living and dying, and at the eleventh hour emerges more open to life than ever before.\n\nIn Veronika Decides to Die, Paulo Coelho takes reader on a distinctly modern quest to find meaning in a culture overshadowed by angst, soulless routine, and pervasive conformity. Based on events in Coelho's own life, Veronkia Decides to Die questions the meaning of madness and celebrates individuals who do not fit into patterns society considers to be normal. Poignant and illuminating, it is a dazzling portrait of a young woman at the crossroads of despair and liberation, and a poetic, exuberant appreciation of each day as a renewed opportunity.","torrent":{"xt":"urn:btih:a0a3a4165e4ca98c0a666622912a3db2664d4de0","amp;dn":"Veronika+Decides+to+Die+by+Paulo+Coelho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0a3a4165e4ca98c0a666622912a3db2664d4de0","infoHashBuffer":{"type":"Buffer","data":[160,163,164,22,94,76,169,140,10,102,102,34,145,42,61,178,102,77,77,224]},"announce":[],"urlList":[]}}