{"title":"Home Recording Studio - Build It Like the Pros (Malestrom)","uid":4825274,"size":12978166,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a0e72b6f357fd50c180793bf636fb6adf9384c6f&amp;dn=Home+Recording+Studio+-+Build+It+Like+the+Pros+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1238924263,"description":" &lt;a href=&quot;http://www.image-upload.net/images/02u11u405zwarhehvo09.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/02u11u405zwarhehvo09.jpg&lt;/a&gt;\n\nPaperback: 344 pages\nPublisher: Artistpro; 1 edition (March 8, 2006)\nLanguage: English\nISBN-10: 1598630342\nISBN-13: 978-1598630343\n\nProduct Description\nWith the advances in digital technology, musicians can now produce their own music. But the gear is only part of the equation when it comes to recording and mixing. The next part is finding a soundproof room that you can produce it in. Unfortunately, any old room in your house will not suffice for a quality recording. Without a decent room, you'l never be able to record a studio-quality recording you'll be proud of and excited to have other people hear. So how do you go about creating a space in your home that has similar acoustics to that of a world-class studio? How do you soundproof this room to keep your sound in and outside noise out? How do you construct or modify the room so that its size and shape best complement its function? Home Recording Studio: Build It Like the Pros teaches you how to do all these things, from building a professional home studio to saving thousands of dollars in the process. This book shows you how to design and understand your room-- how to treat it, wire it, and condition it while using widely available materials. Each step features visual aids to illustrate underlying concepts, as well as professional tips and examples from actual studios. Everything is covered, from room design to electrical considerations, room treatments to codes, permits, special needs, and more. With over 30 years of construction experience, Rod Gervais gives you a comprehensive and cost-effective plan for building that home studio that will have you building and recording in no time. A complete glossary of terms is also included, and a collection of handy tools to aid you in your design is available on the author's companion Web site. So what are you waiting for?\n\nAbout the Author\nRod Gervais is a multi-disciplined engineer who lives in northeast Connecticut. He is a member of the Acoustical Society of America, the Audio Engineering Society, and the National Fire Protection Association. His background in construction is wide ranging, from national museums to recording and movie studios. Rod is also an accomplished musician with over 40 years of experience playing percussion, guitar, bass guitar, and keyboards. His musical experience runs the gamut from classical to jazz, although the musical love of his life is the blues.","torrent":{"xt":"urn:btih:a0e72b6f357fd50c180793bf636fb6adf9384c6f","amp;dn":"Home+Recording+Studio+-+Build+It+Like+the+Pros+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0e72b6f357fd50c180793bf636fb6adf9384c6f","infoHashBuffer":{"type":"Buffer","data":[160,231,43,111,53,127,213,12,24,7,147,191,99,111,182,173,249,56,76,111]},"announce":[],"urlList":[]}}