{"title":"X-Men Legacy v2 01-24 (2012-2014, Digital, MM+E)","uid":9608365,"size":901511397,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a0f570366c23d564cb02f5715833450f4746634d&amp;dn=X-Men+Legacy+v2+01-24+%282012-2014%2C+Digital%2C+MM%2BE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1392259907,"description":"&quot;David. I'm David Haller. My father's Charles Xavier - closest thing my species has to a bloody living saint. I grew up on a wee island in the arse-end of Scotland, have spent much of my life in an induced coma, and exhibit a suite of Omega-level mutant skills almost without limit. My hair resists all attempt at restyling and I'm possibly one of the most powerful beings in the world. I'm also - to use the scientific term - #%#!%$ insane. But today...? Today I feel pretty good, all things considered.&quot;\n\nX-Men Legacy v2 is the story of David Haller, also known as Legion, as he attempts to cope with his father's death (in AvX) and embrace the legacy that Professor Xavier was defined by. Can he do it, or will the bazillion personalities in his &quot;prison for a brain&quot; take control and continue to destroy everything in his path - including himself? Simon Spurrier and Tan Eng Huat's combined work here (as storyteller and artist, respectively) is superb, and shows how much trauma David has had to deal with in his life - and how his journey to redemption will be no easy task. All 24 issues of this now complete run are presented here, in digital format thanks to Minutemen-InnerDemons and Meganubis + Zone-Empire. Please seed, enjoy! :-)","torrent":{"xt":"urn:btih:a0f570366c23d564cb02f5715833450f4746634d","amp;dn":"X-Men+Legacy+v2+01-24+%282012-2014%2C+Digital%2C+MM%2BE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0f570366c23d564cb02f5715833450f4746634d","infoHashBuffer":{"type":"Buffer","data":[160,245,112,54,108,35,213,100,203,2,245,113,88,51,69,15,71,70,99,77]},"announce":[],"urlList":[]}}