{"title":"CaptureWizPro v5.40 with Key [TorDigger]","uid":8167202,"size":3977799,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a1b0cde75b35f680f22e58fb807270b522ed6538&amp;dn=CaptureWizPro+v5.40+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"TorDigger","files":10,"time":1361353408,"description":"CaptureWizPro\n\nCapture or record anything easily!\n\nCapture or record anything on your PC fast.\nCaptureWizPro captures anything you see or hear on your PC. It even captures tricky items like large scrolling areas, Metro apps, drop-down lists, tool tips, mouse pointers and screen savers. There's also a high-performance recorder for capturing streaming video or creating demos. Output recordings to WMV, AVI or GIF. Innovative features make it fast and easy. \n\nScreen captures take just 5 seconds.\nCaptureWizPro will save you time and effort. Just start the tool, select a portion of your screen, then choose an output, like Save, Print, Copy or Email. That's it! \n\nScreen capture for everyone.\nCaptureWizPro enables everyone to capture whatever's on the screen and share it with others. It's like having digital scissors, use it to make perfect copies of anything from video presentations to computer settings or PDF files to treasure maps.\t\n\nEasy for beginners, powerful for pros.\nSimple tools, visible over any background, guide you through the steps. You'll love our pop-out capture bar, speedy predictive capture tool, scroll capture that works everywhere and full-screen preview. Send captured content to an incrementally numbered file (GIF, JPEG, PNG, or BMP), printer, email, image editor or desktop sticky note. Plus, a thumbnail viewer stores screen captures for later use. Advanced users will appreciate the customizable buttons and hot keys. \n\nYou'll use CaptureWizPro every day.\nCaptureWizPro will quickly become your favorite tool when you see how fast and handy it is. You'll use it every day to explain, remember and organize! \n\nSupported OS:\n\nWinAll\n\nHomepage: http://pixelmetrics.com/\n\nInstallations Instructions:\n\n- Install program.\n- Register application with given serial.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:a1b0cde75b35f680f22e58fb807270b522ed6538","amp;dn":"CaptureWizPro+v5.40+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1b0cde75b35f680f22e58fb807270b522ed6538","infoHashBuffer":{"type":"Buffer","data":[161,176,205,231,91,53,246,128,242,46,88,251,128,114,112,181,34,237,101,56]},"announce":[],"urlList":[]}}