{"title":"Thank You For Smoking 2005 1080p 6ch 3subs x265","uid":14996569,"size":922115857,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:a271f9197e35aafd99a11431652d56814fad7041&amp;dn=Thank+You+For+Smoking+2005+1080p+6ch+3subs+x265&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"bsg4you","files":3,"time":1466353395,"description":"Thank.You.For.Smoking.2005.1080p.6ch.3subs.x265.mkv\r\n\r\nTHIS TORRENT USES X265 HEVC (High Efficiency Video Coding) VIDEO\r\nPLEASE USE A PLAYER THAT SUPPORTS X265 HEVC VIDEO LIKE VLC, POTPLAYER, ETC\r\n\r\nThank You For Smoking (2005)\r\nvideo: 1920x800 HEVC crf=23.00 preset=medium ~1076Kbps 8-bit\r\naudio1 5.1 surround English HE-AAC 256Kbps\r\nsubs1: English\r\nsubs2: Spanish\r\nsubs3: French\r\nsubsX: plain text, built in, off by default\r\n1hour32min11sec 922,053,295bytes includes named chapters\r\n  http://www.imdb.com/title/tt0427944/  \r\n\r\nsource: 6.5GB Premiere-HD AVC/AC3 mkv\r\nvideo: German PrimereHD 1080i capture slowed and synched with audio (thanks to bob0r)\r\naudio: R1 DVD 5.1 Surround (thanks to stunk)\r\n\r\nNote: This film has not yet been released on Blu-ray so streaming or TV captures are the best HD options.\r\n\r\nIMDB: Tobacco industry lobbyist Nick Naylor has a seemingly impossible task: promoting cigarette smoking in a time when the health hazards of the activity have become too plain to ignore. Nick, however, revels in his job, using argument and twisted logic to place, as often as not, his clients in the positions of either altruistic do-gooders or victims. Nick's son Joey needs to understand and respect his dad's philosophy, and Nick works hard to respond to that need without compromising his lack of values. When a beautiful news reporter betrays Nick's sexually-achieved trust, his world seems in danger of collapsing. But there's always one more coffin nail in Nick's pack.\r\n\r\nWIkipedia: Thank You for Smoking is a 2006 comedy-drama film written and directed by Jason Reitman and starring Aaron Eckhart, based on the 1994 satirical novel of the same name by Christopher Buckley. It follows the efforts of Big Tobacco's chief spokesman, Nick Naylor, who lobbies on behalf of cigarettes using heavy spin tactics while also trying to remain a role model for his 12-year-old son. Maria Bello, Adam Brody, Sam Elliott, Katie Holmes, Rob Lowe, William H. Macy, J. K. Simmons and Robert Duvall appear in supporting roles.\r\n\r\nPlease check out other documentaries, Rifftrax, MST3K, Battlestar Galactica, Star Trek, Gotham, DC Comics, and more at:\r\n  https://thepiratebay.org/user/bsg4you/  \r\n  https://kat.cr/user/bsg4you/uploads/  \r\nand leave any corrections, criticism, comments and requests.\r\n\r\nThanks, bsg4you","torrent":{"xt":"urn:btih:a271f9197e35aafd99a11431652d56814fad7041","amp;dn":"Thank+You+For+Smoking+2005+1080p+6ch+3subs+x265","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a271f9197e35aafd99a11431652d56814fad7041","infoHashBuffer":{"type":"Buffer","data":[162,113,249,25,126,53,170,253,153,161,20,49,101,45,86,129,79,173,112,65]},"announce":[],"urlList":[]}}