{"title":"NCIS.S12E09.HDTV.x264-LOL","uid":11569193,"size":232238798,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a330226b53b7e868474a7fc97137e15079197b11&amp;dn=NCIS.S12E09.HDTV.x264-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Thhaque","files":2,"time":1416992241,"description":"[b]NCIS\n\n[IMG]http://i.imgur.com/MNMBxda.jpg[/IMG]\n\nGenre: Crime, Action, Drama, Thriller\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Donald P. Bellisario, Don McGill\nCast: Mark Harmon, Michael Weatherly, Pauley Perrette, David McCallum, Sasha Alexander, Sean Murray\n\n.: Plot :.\nIn a number of episodes on NCIS, Mark Harmon's character, Gibbs is seen wearing an old shirt with NIS written on it. This is not a mistake, as Navy veterans will often point out. Prior to it becoming NCIS, it was the Naval Investigative Service (NIS). This also effectively plays into the idea that Harmon/Gibbs has been with NCIS for quite some time longer than the others. The show employs NCIS retired agents as advisors.The ensemble acting approach means that the 'stars' include relatively minor characters and even extends to some characters currently merely labelled 'recurring characters'. There are 7 permanent characters credited at the beginning of season 5 and three recurring characters expected to be included in some or most episodes. Guest stars usually appear in only one episode. Mark Harmon is known to do entire scenes where he cuts out all of his own lines and merely shows what Gibbs is thinking by the way he reacts to the monologue of a co-star: notable examples are Tony's jail scene in Frame Up (series 3) and McGee's elevator scene in Twisted Sister (series 4).The filming style is as close to cinematographic style as possible on a weekly TV drama. Multiple camera filming requires actors to stay in character, unaware of which camera will be chosen for the final edit, a style devised by William Webb in conjunction with Donald Bellisario, \nas reported on special features on the Season 2 DVD.[/b]","torrent":{"xt":"urn:btih:a330226b53b7e868474a7fc97137e15079197b11","amp;dn":"NCIS.S12E09.HDTV.x264-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a330226b53b7e868474a7fc97137e15079197b11","infoHashBuffer":{"type":"Buffer","data":[163,48,34,107,83,183,232,104,71,74,127,201,113,55,225,80,121,25,123,17]},"announce":[],"urlList":[]}}