{"title":"The Century of Warfare [documentary]","uid":4399712,"size":20551102464,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a4235e3083bc18dfe2b98d602d3b7aef42d8cd2b&amp;dn=The+Century+of+Warfare+%5Bdocumentary%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"K1L0GR4m","files":-1,"time":1221620152,"description":"Ride into Aqaba with Lawrence of Arabia. Stand with Patton as his tanks lead the Allied breakout from the coast of Normandy. Patrol the nighttime jungles of Vietnam... A CENTURY OF WARFARE explores the pivotal battles, profiles the commanders and chronicles the myriad ways in which war has shaped the modern world. The 26 hour-long episodes in this monumental set feature an encyclopedic collection of archival film dating back to 1896, creating an unforgettable visual record of every major military engagement from the precursors of World War I to the liberation of Kuwait. THE HISTORY CHANNEL is proud to present this epic, landmark series, now available in its entirety and presented on DVD for the first time ever. DVD volumes:\n\nVolume 1: (3 hours, 28 minutes):\n--The Violent Century: THE CENTURY OF WARFARE opens with a look at the defining characteristics of modern war and the development of the weapons that revolutionized combat.\n--The World Goes to War: Explore the factors that led to the outbreak of World War I and see why efforts to prevent the coming conflict failed.\n--Blood and Mud: Harrowing photos and rare footage show the grim reality of trench warfare on the Western Front.\n--War of the Eagles: Three empires clash on the Eastern Front, until the Russian Revolution topples the Czar and the nation withdraws from the fight.\n\nVolume 2: (3 hours, 28 minutes)\n--Battle Fleets and U-Boats: Naval warfare in World War I, from submarine attacks and supporting forces on land to the Battle of Jutland.\n--Aces High: See how the plane became a weapon, fly with the pioneers of military aviation, and relive the exploits of legendary pilots like the Red Baron.\n--War to End All War?: The entry of the United States helped bring World War I to a close, but the harsh conditions of the Versailles Treaty paved the way for a greater conflict to come.\n--Enter the Dictators: The years between the World Wars were marked by the rise of totalitarian states in Europe and a growing militancy in the Far East.\n\nVolume 3: (3 hours, 28 minutes)\n--The War Clouds Gather: Conflicts in China, Spain and Africa presaged the horrors to come, while Hitler cemented his power and prepared for his bloody campaign of aggression.\n--Blitzkrieg: Germany's invasion of Poland introduced the world to a new brand of warfare. Less than a year later, the fall of France left Britain to face Hitler essentially alone.\n--Britain Stands Alone: The extraordinary heroism demonstrated by British citizens and soldiers and a vital lifeline from across the Atlantic kept England from falling into Nazi clutches.\n--Sand and Sea War: In and around the Mediterranean, Monty battled Rommel, American doughboys got their first real combat experience, and the Italian campaign gave the Allies a foothold in Europe.\n\nVolume 4: (3 hours, 28 minutes)\n--Hitler Turns East: Operation Barbarossa--the largest land invasion ever mounted--sent 3 million German troops and 3,300 tanks into the Soviet Union.\n--The Long Road Back: Defeated at Stalingrad and denied entry to Moscow, the Wehrmacht embarked on a two-year delaying action as it retreated to Germany.\n--Normandy to the Rhine: Follow the preparations for D-Day and the course of the war in Europe after the successful invasion.\n--The End in Europe: As Germany was squeezed in the vice of the Allied advance, the Big Three met at Yalta to plan for the aftermath of war.\n\nVolume 5: (3 hours, 28 minutes)\n--Oriental Blitzkrieg: Analyze the forces that drove Japan to war and relive the initial victories that gave the Imperial forces an air of invincibility.\n--Jungle and Ocean: The American island-hopping campaign drove the Japanese from their Pacific strongholds, but it would take a weapon of a different order bring the war to an end.\n--The War at Sea: This sweeping overview of World War II's naval engagements includes footage from Atlantic convoys, major Pacific battles and the amphibious landing at Normandy.\n--Air War: Fly in a B-17 on a harrowing daylight bombing raid, see how British aviators staved off the Luftwaffe, and watch as carrier-based fighters battle Zeros in the skies over Midway.\n\nVolume 6: (2 hours, 36 minutes)\n--Iron Curtain: Divided at the end of World War II, Europe was a potential flashpoint for 40 years as the superpowers maintained an uneasy peace built on deterrence.\n--Oriental Communism: From the withdrawal of the old Colonial powers to the conflict in Korea, instability, regional conflicts and the boiling over of Cold War tensions marked much of the 20th century in Asia.\n--Wars in Peace: The perennial problems of civil war, terrorism and bilateral wars have taken on a new urgency in the years since the end of the Cold War, and the international community is struggling to deal with them.\n\nVolume 7: (2 hours, 36 minutes)\n--Vietnam: It was a war that proved that might and money do not lead inevitably to victory, and its harsh lessons forced America to rethink its role in the world.\n--War in the Middle East: From Israel's continual battles to defend itself to inter-Arab squabbles and the role of oil, trace the many conflicts that have shaken this tumultuous region.\n--Gulf War and the Future: The Allied victory over Iraq showed showcased a new generation of weapons and tactics, but evolving threats--particularly from weapons of mass destruction--require a new approach to deterrence. \n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51MEJPQD5TL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51MEJPQD5TL._SS500_.jpg&lt;/a&gt;\n\n\n\n\n\n\na more detailed perspective on the world wars: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4555176/The_First_World_War_DVDrip_%5Bdocumentary%5D&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4555176/The_First_World_War_DVDrip_%5Bdocumentary%5D&lt;/a&gt;\nand &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4392822/World_War_2__The_Complete_History&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4392822/World_War_2__The_Complete_History&lt;/a&gt;","torrent":{"xt":"urn:btih:a4235e3083bc18dfe2b98d602d3b7aef42d8cd2b","amp;dn":"The+Century+of+Warfare+%5Bdocumentary%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4235e3083bc18dfe2b98d602d3b7aef42d8cd2b","infoHashBuffer":{"type":"Buffer","data":[164,35,94,48,131,188,24,223,226,185,141,96,45,59,122,239,66,216,205,43]},"announce":[],"urlList":[]}}