{"title":"Writing without Teachers 2nd edition - Peter Elbow.pdf","uid":11538669,"size":11595931,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a442cda65af0dad71b9258080b9cd7c4ded09098&amp;dn=Writing+without+Teachers+2nd+edition+-+Peter+Elbow.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1416652815,"description":"In Writing Without Teachers, well-known advocate of innovative teaching methods Peter Elbow outlines a practical program for learning how to write. His approach is especially helpful to people who get &quot;stuck&quot; or blocked in their writing, and is equally useful for writing fiction, poetry, and essays, as well as reports, lectures, and memos.\nThe core of Elbow's thinking is a challenge against traditional writing methods. Instead of editing and outlining material in the initial steps of the writing process, Elbow celebrates non-stop or free uncensored writing, without editorial checkpoints first, followed much later by the editorial process. This approach turns the focus towards encouraging ways of developing confidence and inspiration through free writing, multiple drafts, diaries, and notes. Elbow guides the reader through his metaphor of writing as &quot;cooking:&quot; his term for heating up the creative process where the subconscious bubbles up to the surface and the writing gets good.\n1998 marks the twenty-fifth anniversary of Writing Without Teachers. In this edition, Elbow reexamines his program and the subsequent influence his techniques have had on writers, students, and teachers. This invaluable guide will benefit anyone, whether in the classroom, boardroom, or living room, who has ever had trouble writing","torrent":{"xt":"urn:btih:a442cda65af0dad71b9258080b9cd7c4ded09098","amp;dn":"Writing+without+Teachers+2nd+edition+-+Peter+Elbow.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a442cda65af0dad71b9258080b9cd7c4ded09098","infoHashBuffer":{"type":"Buffer","data":[164,66,205,166,90,240,218,215,27,146,88,8,11,156,215,196,222,208,144,152]},"announce":[],"urlList":[]}}