{"title":"Il grido (1957)   Michelangelo Antonioni","uid":5001501,"size":1568877202,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a54e8dc5d8b3c0c01fb7885a69aa8d48eb402b9f&amp;dn=Il+grido+%281957%29+++Michelangelo+Antonioni&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"clone94","files":5,"time":1247541670,"description":"xvid\n1,495 MB (or 1,531,880 KB or 1,568,645,120 bytes)\n640x464 (1.38:1) [=40:29]\n1694 kb/s\n0.228 bits/pixel\n25.000 FPS\nac3 (0x2000) Dolby Laboratories, Inc\n192 kb/s (96/ch, stereo) CBR\n48000 Hz\n\nLegend: Portuguese - French - English\n\nEnjoy\n\n\nAfter living seven years with the mechanic Aldo, having a daughter with him, the simple woman Irma is informed that her absent husband had just died in Sydney. She becomes upset when Aldo proposes to marry her and she tells him that she is going to leave him. Unable to explain how much he loves her, Aldo takes their daughter Rosina and travels with her, meeting different women in different places, trying to establish a new relationship and fill the emptiness of his sentimental life. He visits his former lover Elvia; he meets and lives with the widow Virginia, who owns a gas station; he lives with the prostitute Andreina. But these relationships never complete the needy Aldo.  Written by Claudio Carvalho, Rio de Janeiro, Brazil\n\nAfter a seven-year relationship with a refinery mechanic named Aldo (Steve Cochran), Irma (Alida Valli) learns that her husband died in Australia. The news may sound tragic, but Aldo thinks that this may be a chance for them to &quot;legitimize&quot; their affair. Contrary to what he expects, Irma announces Aldo her love for another man. He tries hard to make Irma stay with him, but all his efforts find an uncompromising Irma. He even uses violence, thus ruining any chances of reunion. Aldo decides to leave his town, taking their daughter with him. He wanders endlessly visiting other towns around Po valley, emotionally and socially empty. During his journey he meets some women, who offer him home and love on occasions, but nothing can keep him steady, as the past and his love for Irma shall haunt him forever. Written by Aristoteles &quot;IronBruce&quot; Kostoulas","torrent":{"xt":"urn:btih:a54e8dc5d8b3c0c01fb7885a69aa8d48eb402b9f","amp;dn":"Il+grido+%281957%29+++Michelangelo+Antonioni","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a54e8dc5d8b3c0c01fb7885a69aa8d48eb402b9f","infoHashBuffer":{"type":"Buffer","data":[165,78,141,197,216,179,192,192,31,183,136,90,105,170,141,72,235,64,43,159]},"announce":[],"urlList":[]}}