{"title":"EA Koetting's New Complete eBook Collection All New Revised Edit","uid":9523135,"size":10908023,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a54e9e302d3a967ce90fe415dd71fbd934adb45c&amp;dn=EA+Koetting%27s+New+Complete+eBook+Collection+All+New+Revised+Edit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"EAtshitHOEtting","files":7,"time":1390681081,"description":"This is the brand new set of eBooks EA Koetting ha released, found here for $99: &lt;a href=&quot;\nhttp://www.becomealivinggod.com/completeworks/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.becomealivinggod.com/completeworks/&lt;/a&gt; \n\nThese are new, revised and corrected editions of 7 of his books:\n\n1. Kingdoms of Flame: A Grimoire of Evocation and Sorcery\nA completely secret grimoire of demons, that I myself brought to the surface - revelead to me through a series of deep, dark rituals - arcane spirits that you can call upon to perform any act and fulfill any desire you can imagine.\n\n2. Works of Darkness: A Guide to Advanced Black Magick\nRituals of the purest sorcery that enable you to self-initiate into the Left Hand Path, evoke your very first demon, and perform dark scrying with your own magick eyes.\n\n3. Baneful Magick\nAll the curses and hexes you need to cause illness and destruction inside any enemy's life - and a thorough top-to-bottom education on evil magick - I actually show you how to kill someone with black magick.\n\n4. Evoking Eternity: Forbidden Rites of Evocation\nMy crash course in succeeding with evocation - learn the absolute necessities for mastering this fine art with both angels and demons - everything from solo and group evocation, to summoning MULTIPLE entities at the same time.\n\n5. Questing After Visions: Making Conscious Contact\nMy personal story and journey from corporeal blindness to spiritual vision - including lists of exercises for enlivening your own magick perception.\n\n6. Ipsissimus\nAnother look into my own personal tale and experiences as I apprenticed under a master guru of the spiritual art of astral projection, soul travel, and extra-sensory perception.\n\n7. The Book of Azazel: Grimoire of the Damned\nThe titan of titans, the most important grimoire of our time - a headfirst dive into the study of pact-making and demonic dedication - learn all about my lifechanging transformation through my blood-pact with the godlike demon Azazel.\n- See more at: http://www.becomealivinggod.com/completeworks/#sthash.2qsKJttW.dpuf","torrent":{"xt":"urn:btih:a54e9e302d3a967ce90fe415dd71fbd934adb45c","amp;dn":"EA+Koetting%27s+New+Complete+eBook+Collection+All+New+Revised+Edit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a54e9e302d3a967ce90fe415dd71fbd934adb45c","infoHashBuffer":{"type":"Buffer","data":[165,78,158,48,45,58,150,124,233,15,228,21,221,113,251,217,52,173,180,92]},"announce":[],"urlList":[]}}