{"title":"I Cesaroni Tutti i Torrent Stagione 1 [SATrip ITA] TNT Village","uid":6251041,"size":255191,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a59da6a100c528152bb06d615bbd4c3b53c7310c&amp;dn=I+Cesaroni+Tutti+i+Torrent+Stagione+1+%5BSATrip+ITA%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"l.diliberto","files":13,"time":1300409158,"description":"I Cesaroni Tutti i Torrent Stagione 1 [SATrip ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=244400&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=244400&lt;/a&gt;\n\n.: Trama :.\n\nLa fiction racconta le vicende di una famiglia allargata, il cui cognome ÃƒÂ¨ Cesaroni, composta da due ex fidanzati, Giulio (ossia Claudio Amendola) e Lucia (interpretata da Elena Sofia Ricci), che si ritrovano, riscoprono il loro amore, si sposano e vanno a vivere a casa di lui, a Roma, con i tre figli di lui e le due figlie di lei; i Cesaroni sono inoltre circondati da parenti e amici. Tutti i componenti di questa grande famiglia sono il motore di tale commedia brillante basata sul conflitto comico, diverso in ogni episodio.\n\nPrima stagione\n\nLucia, dopo il divorzio, torna a Roma e incontra Giulio, suo ex fidanzato e ora vedovo. Tra i due si riaccende la passione e cosÃƒÂ¬ decidono di sposarsi. Lucia, poco prima del matrimonio, si trasferisce in casa Cesaroni insieme alle due figlie. Ha inizio cosÃƒÂ¬ la storia dei Cesaroni, famiglia allargata composta da ben sette membri. Il matrimonio di Giulio e Lucia ÃƒÂ¨ messo piÃƒÂ¹ volte alla prova.Poi le figlie della donna hanno un pessimo approccio con i ragazzi, tanto che Eva se ne vuole tornare a Milano, ma Giulio riesce a farla desistere. Anche Sergio, l'ex marito di Lucia, interferisce perchÃƒÂ© la donna ritorni con le figlie da lui, prima minacciando senza successo Giulio e la consorte, poi facendo finta di essere malato e quindi inducendo la donna a seguirlo a Milano per assisterlo. La messinscena viene perÃƒÂ² scoperta e i due possono finalmente sposarsi. Pure dopo il matrimonio la coppia viene insediata. Andrea, collega di Lucia, fa spesso delle avance alla donna e ciÃƒÂ² fa innervosire Giulio Marco ÃƒÂ¨ fin dal primo momento colpito da Eva, ragazza affascinante e sensibile. L'inizio della convivenza fra i due ÃƒÂ¨ perÃƒÂ² difficile: Marco, per colpa sua ma anche di Rudi e Walter, fa spesso delle brutte figure e appare spesso agli occhi di Eva come un rozzo cafone.La nuova situazione famigliare risveglia in Marco l'interesse per la musica, che aveva abbandonato quando era morta la madre. Proprio la musica sembra essere un punto di contatto tra i due fratellastro.Marco prende consapevolezza dei suoi sentimenti per la giovane Cudicini, ciÃƒÂ² lo porta in piÃƒÂ¹ occasioni ad avere degli scontri, venendo anche alle mani, con Walter, colpevole di tentare di sedurre Eva anche con mezzi illeciti. Marco cerca piÃƒÂ¹ volte, ma senza successo, di dichiararsi. Alla fine confida al padre la veritÃƒÂ ; Giulio, preoccupato per l'equilibrio famigliare, lo esorta a desistere. Il giovane perÃƒÂ² non riesce proprio a togliersi dalla testa la sorellastra fino a quando conosce Rachele, la sua nuova insegnante, con cui intraprende una relazione amorosa. Nello stesso momento Eva, che da tempo aveva una certa simpatia per Marco, capisce di amarlo e vorrebbe rivelarsi a lui.La relazione tra Marco e Rachele procede tra alti e bassi ed Eva cerca, senza successo, di dimenticare il ragazzo. Rachele lascia Marco perchÃƒÂ© ritiene che la loro storia non possa avere futuro.Eva cerca in tutti i modi di farsi notare, anche in maniera molto esplicita, ma l'unico risultato che ottiene ÃƒÂ¨ che Giulio scopre i suoi sentimenti. Proprio quest'ultimo cerca di convincerla di quanto sia sbagliato quell'amore. Arriva il tempo delle vacanze estive e Giulio, per prevenire ogni tentazione, manda i due figli in due posti diversi, ma per una serie incredibile di coincidenze Eva e Marco si ritrovano sullo stesso traghetto, pronti a partire solo loro due per una vacanza insieme. Giulio, preoccupatissimo per le possibili conseguenze, ha la sciagurata idea di fermare la nave con una telefonata anonima in cui dice che sul traghetto c'ÃƒÂ¨ una bomba. Cesare vorrebbe trovarsi anche lui una compagna. Cerca, senza fortuna, una donna durante tutta la stagione e proprio nell'ultimo episodio conosce Pamela con la quale sembra avere un certo feeling, tanto da partire con lei in vacanza. Ezio e Stefania sono grandi amici dei Cesaroni e spesso loro complici. Non mancano perÃƒÂ² gli screzi giungendo quasi al divorzio. Rudi, all'inizio della stagione, fa dei dispetti tremendi ad Alice, cercando di estrometterla dal suo ambiente. La ragazza un po' alla volta riesce ad integrarsi, ma Rudi persevera nella sua opera: in un'occasione addirittura costringe Alice ad essere sua schiava perchÃƒÂ© il Cesaroni ha fatto delle foto compromettenti della ragazza. A fine stagione perÃƒÂ² i due diventano amici e vanno insieme in vacanza.\n\n.: Cover :.\n\n\n.: Crediti :.\n\nPremi: * Telegatto 2007 alla miglior fiction\n* Premio Regia Televisiva 2008\n* Miglior Fiction al RomaFictionFest 2009 (giuria lettori TV Sorrisi e Canzoni)\n\nAnno: 2006\nProduttori: Publispei e R.T.I\nGenere: commedia, sentimentale\nEpisod: 26\nDurata episodi: 50 min\n\nCast: * Claudio Amendola: Giulio Cesaroni\n* Elena Sofia Ricci: Lucia Liguori\n* Antonello Fassari: Cesare Cesaroni\n* Max Tortora: Ezio Masetti\n* Rita Savagnone: Gabriella Liguori\n* Alessandra Mastronardi: Eva Cudicini\n* Matteo Branciamore: Marco Cesaroni\n* Elda Alvigini: Stefania Masetti\n* NiccolÃƒÂ² Centioni: Rudi Cesaroni\n* Micol Olivieri: Alice Cudicini\n* Federico Russo: Mimmo Cesaroni\n* Ludovico Fremont: Walter Masetti\n\n0=============================0\n\n.: Info Ripping :.\n\nDimensione........: 492 MB\nDurata............: 00:56:05\n\nVideo Codec.......: XviD\nVideo Bitrate.....: 1086 kb/s\nRisoluzione.......: 640x352 (1.82:1) [=20:11]\nFPS (Frames/sec)..: 25.000\nQF (Frame quality): 0.193 bits/pixel\n\nAudio Codec.......: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate.....: 133 kb/s (66/ch, stereo) VBR LAME3.90.\nFreq Audio........: 48000 Hz","torrent":{"xt":"urn:btih:a59da6a100c528152bb06d615bbd4c3b53c7310c","amp;dn":"I+Cesaroni+Tutti+i+Torrent+Stagione+1+%5BSATrip+ITA%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a59da6a100c528152bb06d615bbd4c3b53c7310c","infoHashBuffer":{"type":"Buffer","data":[165,157,166,161,0,197,40,21,43,176,109,97,91,189,76,59,83,199,49,12]},"announce":[],"urlList":[]}}