{"title":"[DvdRip-Divx-Ita-Mp3]Dragonheart[survivalofmisa]","uid":5154328,"size":1290094592,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a5a8618976c780e1d6206e7265eabb9e8fea9da3&amp;dn=%5BDvdRip-Divx-Ita-Mp3%5DDragonheart%5Bsurvivalofmisa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mitimex","files":1,"time":1257761057,"description":"\n\nLa storia ha inizio quando il giovane principe Einon (David Thewlis) durante una battaglia tenta di vendicare il padre rimanendo ferito con un paletto nel cuore. La madre, insieme al suo mentore, Bowen (Dennis Quaid), lo soccorre immediatamente e lo porta nella caverna di un drago, dove quest'ultimo fa giurare al principe che la tirannia ÃƒÂ¨ morta col padre e lui sfrutterÃƒÂ  la vita che gli sta regalando per fare del bene. Il principe naturalmente promette che sarÃƒÂ  cosi e il drago, fiducioso anche della parola di Bowen che ha insegnato al ragazzo L'Antico Codice dei cavalieri di Re ArtÃƒÂ¹, dona metÃƒÂ  del suo cuore al ragazzo che cosÃƒÂ¬ rimane vivo.\nIl ragazzo crescendo, perÃƒÂ², si dimostra ancora piÃƒÂ¹ crudele del padre, e Bowen, credendo che il suo cuore sia stato avvelenato dalla metÃƒÂ  del drago, si mette alla ricerca di quest'ultimo per ucciderlo. Passano diversi anni, e Bowen ÃƒÂ¨ ormai diventato un cacciatore di draghi, mentre re Einon ha schiavizzato il suo popolo.\nUn giorno Bowen riesce a incontrare un nuovo drago da uccidere, l'ultimo della sua specie, e lotta con lui per ore e ore fino a che, entrambi stremati, decidono per una tregua, durante la quale i due riescono a diventare amici. Bowen e Draco, come viene soprannominato dal cavaliere, iniziano a frodare i villaggi. I popolani, credendo di essere attaccati dal drago, vengono poi &quot;salvati&quot; da Bowen che finge di uccidere l'amico per poi fuggire insieme con un bel bottino donato dal villaggio riconoscente. Presto perÃƒÂ² il drago, convinto anche dalla contadina Kora, ex rivoltosa al dominio del padre di Einon, comincia a voler lottare contro la tirannia del re, visto la situazione disperata del popolo. Inizialmente Bowen non vuole aver nulla a che fare, ma poi ritorna a sperare nell'antico codice, e i due si mettono a capo di una rivolta contro il tiranno. Ma Einon non puÃƒÂ² essere ucciso direttamente, solo se Draco viene ucciso, anche Einon morirÃƒÂ . CosÃƒÂ¬ Bowen ÃƒÂ¨ costretto a scegliere tra l'amicizia col drago e la libertÃƒÂ  per il suo popolo.\n","torrent":{"xt":"urn:btih:a5a8618976c780e1d6206e7265eabb9e8fea9da3","amp;dn":"%5BDvdRip-Divx-Ita-Mp3%5DDragonheart%5Bsurvivalofmisa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5a8618976c780e1d6206e7265eabb9e8fea9da3","infoHashBuffer":{"type":"Buffer","data":[165,168,97,137,118,199,128,225,214,32,110,114,101,234,187,158,143,234,157,163]},"announce":[],"urlList":[]}}