{"title":"The Sandwitches' Debut album @320","uid":5710752,"size":94279051,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a62b8a2c8f474de821cced46e61d5cafd1d41b31&amp;dn=The+Sandwitches%5C%27+Debut+album+%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":null,"files":11,"time":1279885052,"description":"&quot;The Sandwitches came out of nowhere. Well. . . that's not quite right of course. . . but sometimes it happens, when you get three DNA's together doing their own tunes, you kind of forgot what they were up to before. Or at least that's what happened when I first wrapped ears around the sounds contained herein. A Holy Communion of Roky Erickson and Stevie Nicks. A lyrical beauty too. Strings bobbing around like loose wires on the headstock, chiming and picking away and baking the ambient sadcake. Tomorrows beat, learned yesterday or some time ago in band from back when. More jazzed up than the Moe Tucker and &quot;Be My Baby.&quot; Boom and crash - loose/tight - on time and free. When the daylight pop appears, upbeat introductions keep you comfortable for a spell, but the hopeful sun has soon gone down and there are now more questions and apologies amid the darkness - and the headline reads &quot;The Carter Family Goes Electric.&quot; But there are no taunts of &quot;Judas!&quot; this time, only &quot;Midas!&quot; = yeah the one with the golden touch. Something cool and beautiful and true is happening here. The Sandwiches are bringing this vision to life. Imagine a 60's Girl-group is on tour and their van breaks down near a gothic castle high on the hill, Dario Argento invites them in to perform a concert for his tweaked actors in a big dark red room inside and, if the dream is right, it's the Sandwiches - they'd fit right in with those misfits and speak the same language. I'd like to be there to dance. Close your eyes and you'll see what I mean. These are fab, haunting tunes wrapped in tender weird pop. That's what we got here. A heavy party you want to hang out at.&quot; - Kelley Stoltz (San Francisco musician and man extraordinaire).\n\n1.  Back to the Sea\n2.  Tarantula Army\n3.  Fire\n4.  No No\n5.  Relax at the Beach\n6.  Marry Me\n7.  Wicked Inger\t\n8.  Crabman\n9.  Kiss You Feet\t\n10. Mr. Promotion\n11. Thank You For Listening\n\n320 kbps","torrent":{"xt":"urn:btih:a62b8a2c8f474de821cced46e61d5cafd1d41b31","amp;dn":"The+Sandwitches%5C%27+Debut+album+%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a62b8a2c8f474de821cced46e61d5cafd1d41b31","infoHashBuffer":{"type":"Buffer","data":[166,43,138,44,143,71,77,232,33,204,237,70,230,29,92,175,209,212,27,49]},"announce":[],"urlList":[]}}