{"title":"Peace Is Every Breath - Thich Nhat Hanh (mobi)","uid":8366297,"size":1097986,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a65f08f0b340950d11d7eb2f30ab2523aef3e786&amp;dn=Peace+Is+Every+Breath+-+Thich+Nhat+Hanh+%28mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"zendozaz","files":-1,"time":1365778360,"description":"Description: In his travels around the world, Zen master and international bestselling author, Thich Nhat Hanh, witnessed a growing unhappiness among the many people he encountered. He saw the hectic pace of our day-to-day lives taking a toll. In response, the renowned teacher wrote Peace Is Every Breath. He does not suggest that we escape from reality and put our busy lives on hold. Far from it. Rather he provides the insight and tools we need to incorporate the practice of mindfulness into our every waking moment. We can transcend the mad rush of our days and discover that within the here and now, in the small rituals of our daily lives, we have the ability to experience inner peace and find happiness.\n\nOffering personal anecdotes, meditations and advice for mindfully connecting with our present experience, Thich Nhat Hanh guides us through the potential pitfalls along the way, to show how we can harness the joy and peace that is possible with every breath we take. Now more than ever, he believes that the power of mindfulness can heal us from the suffering caused by the many stresses that surround us. Peace Is Every Breath is therefore a timely book filled with timeless wisdom and practical advice that is destined to become a classic.\n\nAuthor: Thich Nhat Hanh\n\nPublisher: Rider\n\nYear released: 3 Mar 2011\n\nGenre: Non fiction/Buddhism\n\nFormat: mobi","torrent":{"xt":"urn:btih:a65f08f0b340950d11d7eb2f30ab2523aef3e786","amp;dn":"Peace+Is+Every+Breath+-+Thich+Nhat+Hanh+%28mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a65f08f0b340950d11d7eb2f30ab2523aef3e786","infoHashBuffer":{"type":"Buffer","data":[166,95,8,240,179,64,149,13,17,215,235,47,48,171,37,35,174,243,231,134]},"announce":[],"urlList":[]}}