{"title":"Thomas Moore - Care of the Soul and The Soul's Religion (pdf)","uid":8622273,"size":4531452,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a69b8b150fde6f9f1949ccd1682550cfe724c748&amp;dn=Thomas+Moore+-+Care+of+the+Soul+and+The+Soul%27s+Religion+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"pharmakate","files":-1,"time":1372408619,"description":"Two books by Thomas Moore:\n\nCare of the Soul (1992)\n\nThe Soul's Religion (2002)\n\nBoth are pdf files from a semi-retail source, generally good quality.\n\n\ndescriptions:\n\n\nCare of the Soul\n----------------\n\nA guide to finding spirituality, depth, and meaning in modern life proposes a therapeutic way in which readers can look more deeply into emotional problems and sense sacredness in ordinary things.\n\nReview\n\nCare of the Soul is considered to be one of the best primers for soul work ever written. Thomas Moore, an internationally renowned theologian and former Catholic monk, offers a philosophy for living that involves accepting our humanity rather than struggling to transcend it. By nurturing the soul in everyday life, Moore shows how to cultivate dignity, peace, and depth of character. For example, in addressing the importance of daily rituals he writes, &quot;Ritual maintains the world's holiness. As in a dream a small object may assume significance, so in a life that is animated by ritual there are no insignificant things.&quot; This is the eloquence that helped reintroduce the sacred into everyday language and contemporary values.\n\nFrom Publishers Weekly\n\nA radical and profoundly capacious view of human nature is the foundation for this eloquent discourse on living an imaginative, &quot;soulful&quot; life--one that embraces both body and spirit--in modern times. Challenging contemporary psychotherapy and its &quot;muscled, strong-willed pursuit of change,&quot; Moore ( Dark Eros ), a therapist and religious historian who trained as a Catholic monk but did not make final vows, poses an attentive, accepting approach to everyday life that emphasises &quot;modest care and not miraculous cure.&quot; Calling upon theories of C. G. Jung, Freud, Plato and such Renaissance thinkers as Marsilio Ficino and Paracelsus, the author reexamines Western archetypes and myths, citing Demeter and Persephone, Narcissus and Odysseus as well as Jesus for guidance in appreciating &quot;the paradoxical mysteries that blend light and darkness into the grandeur of what human life and culture can be.&quot; Taking issue with current psychological precepts, beginning with the assumption that we have control over much of our lives and including our reverence for innocence and a belief in the triumph of the good, Moore urges that &quot;we let the soul speak and show itself as it is, not as we wish it would be.&quot; His interpretations, particularly of myths, are not evenly persuasive, but all are well-considered and provocative. In graceful, deceptively gentle prose, he rejects formula, rigidity and a self-worth measured by accepted norms and thus upends contemporary spiritual and religious mores. The book is invigorating, demanding and revolutionary.\n\n\nThe Soul's Religion\n-------------------\n\nIn this, companion volume to his worldwide bestseller, Care of the Soul, Thomas Moore offers a way of living in this new and confusing century. Drawing on faiths from all over the world, as well as from his own vast well of knowledge and personal experience, Moore shows us how religion can be used to embrace others, rather than exclude them. He helps its become comfortable with our doubts, and reveals a liberating truth -- it is in the dark corners of the soul that true faith is born. Intimate and provocative, Moore writes with the compassion of a parent and the wisdom of a true teacher.","torrent":{"xt":"urn:btih:a69b8b150fde6f9f1949ccd1682550cfe724c748","amp;dn":"Thomas+Moore+-+Care+of+the+Soul+and+The+Soul%27s+Religion+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a69b8b150fde6f9f1949ccd1682550cfe724c748","infoHashBuffer":{"type":"Buffer","data":[166,155,139,21,15,222,111,159,25,73,204,209,104,37,80,207,231,36,199,72]},"announce":[],"urlList":[]}}