{"title":"Pat Travers-Live! Go For What You Know 320k mp3  ak1979","uid":10514092,"size":109759710,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a6d7e565ac9ab8a5094da8467ebcc1f214754162&amp;dn=Pat+Travers-Live%21+Go+For+What+You+Know+320k+mp3++ak1979&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"analogkid6103","files":9,"time":1404886439,"description":"Pat Travers-Live! Go For What You Know 320k mp3  ak1979 What we Really got Pat Travers Live Live! Go For What You Know is a live album by the Pat Travers Band, released in 1979 on Polydor Records. It reached platinum status in the US,[2] and was re-released on CD in 1993.\n\nContents\n\n    1 Background\n    2 Critical reception\n    3 Tracklist\n    4 Personnel\n    5 Production\n    6 References\n\nBackground\n\nThe album was recorded on tour in the US in early 1979, and featured the guitar tandem of Travers and Pat Thrall, who had joined the Pat Travers band in 1977 and had recorded Heat In The Street (1978) with them. According to Legends of Rock Guitar, on this album and the follow-up, Crash and Burn (1980), the duo of Travers and Thrall bridged the gap between what it calls &quot;dramatic changes&quot; in metal in the late 1970s: Travers emblematized &quot;the blues-rock sound of sixties and seventies metal&quot; whereas Thrall's playing represents the newer wave in metal (represented by Eddie van Halen): &quot;The combining of the two players' solos during this time showed a rare detente between two generations of hard rockers and, although short-lived, it was extremely exciting.&quot;[3]\n\nThe album was produced by Tom Allom, who had worked on the first five Black Sabbath albums as a sound engineer, had produced two albums by The Tourists, and would afterward produce nine albums by Judas Priest and the debut album On Through the Night by Def Leppard.[4] Besides praising the guitar playing of Travers and Thrall, critics have also hailed Tommy Aldridge, a drumming pioneer who after leaving the Pat Travers Band played with Ozzy Osbourne; one critic called him &quot;the definitive double bass drummer&quot; on the basis of this album.[5]\nCritical reception\nProfessional ratings\nReview scores\nSource \tRating\nAllmusic \t4.5/5 stars[6]\nAllmusic \t4.5/5 stars[7]\n\nThe album garnered positive reviews. It came recommended by Billboard magazine, and received positive reviews in the Los Angeles Times and the The Daily Collegian. Years after its release, the live album is often referred to by critics as the pinnacle of Pat Travers' career.Especially the &quot;live classic&quot; song &quot;Boom Boom (Out Go the Lights)&quot; (a Stan Lewis cover), which was released as a single,[15] is frequently associated with him and continues to be an audience favorite. The song was included on a 2001 compilation CD called Goin' South. In July 2007, a forum of Guitar Player magazine readers voted Live! Go For What You Know in their top 40 of live albums.\nTracklist\n\nSide One\n\n    &quot;Hooked on Music&quot; (Pat Travers) - 6:26\n    &quot;Gettin' Betta&quot; (Mars Cowling, Travers) - 4:52\n    &quot;Go All Night&quot; (Travers) - 4:02\n    &quot;Boom Boom (Out Go the Lights)&quot; (Stan Lewis) - 5:05\n\nSide Two\n\n    &quot;Stevie&quot; (Travers) - 6:21\n    &quot;Makin' Magic&quot; (Travers) - 4:00\n    &quot;Heat in the Street&quot; (Jeffrey Lesser, Travers) - 4:24\n    &quot;Makes No Difference&quot; (Travers) - 7:03\n\nPersonnel\n\n    Pat Travers - guitar, vocals\n    Mars Cowling - bass\n    Pat Thrall - guitar, backing vocals\n    Tommy Aldridge - drums\n   Now that I had to redo this I also threw in Snorting Whiskey cause I can't imagine listening to Pat Travers and not hearing it. Otherwise this is the same as the failed torrent sorry for the delay, but I tried to fix the other one it just would not take a fix guess I should have gave it some Whiskey,after this I think Ill find me some. Enjoy finally,               analogkid6103","torrent":{"xt":"urn:btih:a6d7e565ac9ab8a5094da8467ebcc1f214754162","amp;dn":"Pat+Travers-Live%21+Go+For+What+You+Know+320k+mp3++ak1979","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6d7e565ac9ab8a5094da8467ebcc1f214754162","infoHashBuffer":{"type":"Buffer","data":[166,215,229,101,172,154,184,165,9,77,168,70,126,188,193,242,20,117,65,98]},"announce":[],"urlList":[]}}