{"title":"Let There Be Range!: Crushing SSNL/MSNL No-Limit Hold'em Games","uid":5954613,"size":10016093,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a704b41aaad16d799b9b7082cc68dd4b335cf775&amp;dn=Let+There+Be+Range%21%3A+Crushing+SSNL%2FMSNL+No-Limit+Hold%5C%27em+Games+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"snuk11","files":2,"time":1289662084,"description":"Product Description\nWith Let There Be Range: Crushing SSNL/MSNL No-Limit Hold'em Games, authors Tri &quot;SlowHabit&quot; Nguyen and Cole &quot;CTS&quot; South offer serious-minded players a high-level yet accessible discussion of no-limit hold'em cash game strategy and theory. Assuming a basic understanding of the online NLHE game (as well as supplemental stat-tracking programs), Let There Be Range provides readers a wealth of advice and knowledge to help them crush low- and mid-stakes games. Let There Be Range consists of twenty chapters compiling numerous ideas and successful strategies employed by the authors, both of whom are long-term earners online at all stakes. The book begins with a brief discussion of fundamental concepts, including hand range, pot equity, fold equity, and expected value, then introduces and explains how to use hand combinations (&quot;combinatorics&quot;) to help establish opponents' likely hand ranges and proceed accordingly. From there the authors delve into a consideration of common mistakes made by low- and mid-stakes players as well as methods to exploit these frequently encountered errors. The rest of the book then takes the reader through the various stages of a hold'em hand -- preflop, flop, turn, and river -- taking several detours along the way to consider in detail many concepts and theories that inform winning players' decision-making. With its combination of lecture-like presentations and illustrative hand examples, reading Let There Be Range is much like sitting in on a sequence of study sessions led by two of online poker's most respected poker coaches.\nAbout the Author\nCole &quot;CTS&quot; South is one of the biggest winners in online high-stakes games. He taught members how to successfully play a creative, loose-aggressive style at CardRunners, the largest online poker instruction site. Cole is also a sponsored pro at Full Tilt Poker. Cole is currently a junior at Georgetown University and is majoring in Math. ","torrent":{"xt":"urn:btih:a704b41aaad16d799b9b7082cc68dd4b335cf775","amp;dn":"Let+There+Be+Range%21%3A+Crushing+SSNL%2FMSNL+No-Limit+Hold%5C%27em+Games+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a704b41aaad16d799b9b7082cc68dd4b335cf775","infoHashBuffer":{"type":"Buffer","data":[167,4,180,26,170,209,109,121,155,155,112,130,204,104,221,75,51,92,247,117]},"announce":[],"urlList":[]}}