{"title":"Defense of the Third Reich 1941-45","uid":11771212,"size":5912388,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a76056bc9443a75e1c2f3f9049b6e4cb41615a8b&amp;dn=Defense+of+the+Third+Reich+1941-45&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427088524,"description":"During World War II Germany was subjected to the growing threat of Allied bomber attack, from RAF night bombing to American daylight bombing. From flak artillery to fortified structures, this book focuses on the land-based infrastructure of Germany's defense against the air onslaught.\n\nThe Third Reich created the most lavish Flak defenses of any country in World War II. This book provides an overview of the Flak artillery, with a special emphasis on how Flak was deployed and some of the unique fortified structures that were created to enhance Flak performance such as the legendary Flak towers of the German cities. It also briefly examines the revolutionary potential of anti-aircraft missiles for Flak defense that were on the verge of deployment at the end of the war. Although the artillery element of Flak is the most widely known, Flak effectiveness was highly dependent on advanced electronic sensors, especially radar, for fire control and precise targeting. This book examines how the Third Reich deployed radar and other advanced sensors in its defensive belts such as the Kammhuber Line.\nBesides active defense against air attack, Germany also invested heavily in passive defense such as air raid shelters. While much of this defense was conventional such as underground shelters and the dual use of subways and other structures, Germany faced some unique dilemmas in protecting cities against night fire bomb raids. Some cities were located in regions where the soil conditions and lack of bedrock did not permit deep underground bunkers. As a result, German architects designed massive above-ground defense shelters which were amongst the most massive defensive structures built in World War II.\n\nThe success of the US Army Air Force offensive against Germany industry in early 1944 threatened to crush German military production. A program was initiated in the spring of 1944 to defend the industry by dispersion and fortification. An elaborate program was created to house the most vital industries in underground shelters. Some of these were located in caves or tunnels, but in other areas, large reinforced concrete structures were created where caves were not a practical solution. These structures were amongst the most advanced for their day, and in many ways presaged the heavily reinforced shelters created during the Cold War for protection against nuclear attack","torrent":{"xt":"urn:btih:a76056bc9443a75e1c2f3f9049b6e4cb41615a8b","amp;dn":"Defense+of+the+Third+Reich+1941-45","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a76056bc9443a75e1c2f3f9049b6e4cb41615a8b","infoHashBuffer":{"type":"Buffer","data":[167,96,86,188,148,67,167,94,28,47,63,144,73,182,228,203,65,97,90,139]},"announce":[],"urlList":[]}}