{"title":"The Last Unicorn (Mobi, Epub, PDF) [degos]","uid":8060253,"size":1329880,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a81004868d834063bc271224a03c8ce6c9fadfbe&amp;dn=The+Last+Unicorn+%28Mobi%2C+Epub%2C+PDF%29+%5Bdegos%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"deg0s","files":-1,"time":1359050995,"description":"Amazon.com Review\n__________________\n\nThe Last Unicorn is one of the true classics of fantasy, ranking with Tolkien's The Hobbit, Le Guin's Earthsea Trilogy, and Lewis Carroll's Alice in Wonderland. Beagle writes a shimmering prose-poetry, the voice of fairy tales and childhood:\nThe unicorn lived in a lilac wood, and she lived all alone. She was very old, though she did not know it, and she was no longer the careless color of sea foam but rather the color of snow falling on a moonlit night. But her eyes were still clear and unwearied, and she still moved like a shadow on the sea.\nThe unicorn discovers that she is the last unicorn in the world, and sets off to find the others. She meets Schmendrick the Magician--whose magic seldom works, and never as he intended--when he rescues her from Mommy Fortuna's Midnight Carnival, where only some of the mythical beasts displayed are illusions. They are joined by Molly Grue, who believes in legends despite her experiences with a Robin Hood wannabe and his unmerry men. Ahead wait King Haggard and his Red Bull, who banished unicorns from the land.\n\n\nAbout the Author\n_________________\n\nPeter S. Beagle, a World Fantasy Award nominee, is the bestselling author of the fantasy classic The Last Unicorn as well as many other highly acclaimed works. His novels and stories have been translated into sixteen languages worldwide, and his long and fascinating career has covered everything from journalism and stage adaptations to songwriting and performances. He has given readings, lectures, and concerts of his own songs from coast to coast, and has written several screenplays, including Ralph Bakshi's film version of The Lord of the Rings.","torrent":{"xt":"urn:btih:a81004868d834063bc271224a03c8ce6c9fadfbe","amp;dn":"The+Last+Unicorn+%28Mobi%2C+Epub%2C+PDF%29+%5Bdegos%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a81004868d834063bc271224a03c8ce6c9fadfbe","infoHashBuffer":{"type":"Buffer","data":[168,16,4,134,141,131,64,99,188,39,18,36,160,60,140,230,201,250,223,190]},"announce":[],"urlList":[]}}