{"title":"Wolfenstein 3D and Spear of Destiny (GOG)","uid":12522320,"size":37408865,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a821ff37061b1a28e57e7437688038cf391453e9&amp;dn=Wolfenstein+3D+and+Spear+of+Destiny+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mercs215","files":3,"time":1443902778,"description":"Install instructions:\r\n1. Run &quot;setup_spear_of_destiny_2.0.0.6.exe&quot;\r\n2. Run &quot;setup_wolfenstein3d_2.0.0.4.exe&quot;\r\n3. Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS GAME! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: WOLFENSTEIN 3D + SPEAR OF DESTINY\r\nGenre: Shooter - FPP - Horror\r\nWorks on: Windows (XP, Vista, 7, 8, 10)\r\nLanguages: Audio and text: English\r\nModes: Single-player\r\nReleased: May 5, 1992\r\nCompany: id Software / Bethesda Softworks LLC\r\nStore page: http://www.gog.com/game/wolfenstein_3d_and_spear_of_destiny\r\n\r\nAbout:\r\nFrom the masterminds of first-person shooters, id Software, comes the grandfather of the genre, Wolfenstein 3D, and its much-anticipated sequel, Wolfenstein Spear of Destiny\r\nWolfenstein 3D\r\nIt's World War II and you are William &quot;B.J.&quot; Blazkowicz, the Allies' most durable agent. Under the Iron-fist grip of Nazi German Rule, the evil Dr. Schabbs is suspected of cultivating a project, Operation Eisenfaust, for building a mighty mutant Nazi German Army. Your mission is to steal the secret plans, make your escape and sabotage their evil plot. As you begin your mission however, you are caught and hauled from Castle Hollehammer to the cells of Castle Wolfenstein.\r\nA lucky break gives you the chance to make your escape, only to find that Castle Wolfenstein is a maze of passages, bristling with trigger happy Nazi guards. Each level you break through brings you face to face with death. There's no time now to hold fire, it's kill or be killed...\r\nWolfenstein: Spear of Destiny\r\nIn the midst of the German Blitzkrieg, the spear that pierced the side of Christ is taken from Versailles by the Nazis and secured in the impregnable Castle Wolfenstein! According to legend, no man can be defeated when he posseses the Spear. Hitler believes himself to be invincible with the power of the Spear as his army of destruction sweeps across Europe.\r\nReturning as B.J. Blazkowicz, your mission is to recapture the Spear from an already unbalanced Hitler, with the hope that the loss of his most coveted weapon will push him over the edge! You must infiltrate the heavily guarded Nazi stronghold and time is running out!\r\nIn your quest to recover the Spear, you will encounter the exciting and hazardous challenges, secret doorways to hidden passages, gruesome mutants and powerful monster-like &quot;bosses&quot;. All this in the midst of the massive fire-power of well trained enemy soldiers through the castle! See if you have the &quot;right stuff&quot; to accomplish the most dangerous mission of the war.\r\nBattle Nazis, evil scientists, mutants and more with knives, pistols and machine guns\r\nRun, gun and fight your way through all 6 episodes of Wolfenstein 3D and the three missions of Spear of Destiny\r\nPlay an unforgettable experience that set the standards for the First-Person Shooter genre\r\n\r\nMinimum system requirements - Windows: XP/Vista/7/8/10 \r\nProcessor: 1.8 GHz Processor \r\nMemory: 512MB RAM (1 GB recommended) \r\nGraphics: 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended) \r\nHard Drive: 2GB HDD \r\nMouse, Keyboard","torrent":{"xt":"urn:btih:a821ff37061b1a28e57e7437688038cf391453e9","amp;dn":"Wolfenstein+3D+and+Spear+of+Destiny+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a821ff37061b1a28e57e7437688038cf391453e9","infoHashBuffer":{"type":"Buffer","data":[168,33,255,55,6,27,26,40,229,126,116,55,104,128,56,207,57,20,83,233]},"announce":[],"urlList":[]}}