{"title":"Death by Food Pyramid - How Shoddy Science, Sketchy Politics And","uid":9551171,"size":15844183,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a89be40ce171a21442003090b5de9d177a474951&amp;dn=Death+by+Food+Pyramid+-+How+Shoddy+Science%2C+Sketchy+Politics+And&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1391267792,"description":"Death by Food Pyramid: How Shoddy Science, Sketchy Politics and Shady Special Interests Have Ruined Our Health by Denise Minger\n\n\nFormat: mobi/epub/azw3\nLength: 300 pages\nGenre: Non-Fiction/Health\nDate: 1 January 2014\n\nShoddy science, sketchy politics and shady special interests have shaped American dietary recommendations - and destroyed our nation's health - over recent decades. \n\nThe phrase Death by Food Pyramid isn't shock-value sensationalism, but the tragic consequence of simply doing what we have been told to do by our own government - and giant food profiteers - in pursuit of health. \n\nIn Death by Food Pyramid, Denise Minger exposes the forces that overrode common sense and solid science to launch a pyramid phenomenon that bled far beyond US borders to taint the eating habits of the entire developed world. Denise explores how generations of flawed pyramids and plates endure as part of the national consciousness, and how the &quot;one-size-fits-all&quot; diet mentality these icons convey pushes us deeper into the throes of obesity and disease. \n\nRegardless of whether you're an omnivore or vegan, research junkie or science-phobe, health novice or seasoned dieter, Death by Food Pyramid will reframe your understanding of nutrition science, and inspire you to take your health, and future, into your own hands.\n\nAuthor:\n\nDenise Minger is a Portland, OR-based health writer and lecturer with a reputation for aggressively challenging today's leading voices of conventional wisdom. Her meticulously researched critiques decimating USDA guidelines and The China Study--published on her blog, RawFoodSOS.com--have made her a major player in the progressive health community, and a major thorn in the side of both mainstream nutritionists other health figures promoting flawed dietary dogma. ","torrent":{"xt":"urn:btih:a89be40ce171a21442003090b5de9d177a474951","amp;dn":"Death+by+Food+Pyramid+-+How+Shoddy+Science%2C+Sketchy+Politics+And","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a89be40ce171a21442003090b5de9d177a474951","infoHashBuffer":{"type":"Buffer","data":[168,155,228,12,225,113,162,20,66,0,48,144,181,222,157,23,122,71,73,81]},"announce":[],"urlList":[]}}