{"title":"Mimesis: The Representation of Reality in Western Literature","uid":8508812,"size":11875446,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9af044cc35fbeaf40785ed76c584c5c5bbd19e9&amp;dn=Mimesis%3A+The+Representation+of+Reality+in+Western+Literature&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"workerbee","files":-1,"time":1369506004,"description":"Erich Auerbach - Mimesis: The Representation of Reality in Western Literature, translated by Willard R. Trask (Princeton University Press, [1953] 2003).\n\nISBN: 9780691113364 | 616 pages | PDF\n\n\nA half-century after its translation into English, Erich Auerbach's Mimesis still stands as a monumental achievement in literary criticism. A brilliant display of erudition, wit, and wisdom, his exploration of how great European writers from Homer to Virginia Woolf depicted reality has taught generations how to read Western literature. \n\nThis expanded 50th anniversary edition includes a substantial introductory essay by Edward Said as well as an essay, never before translated into English, in which Auerbach responds to his critics.\n\nA German Jew, Auerbach was forced out of his professorship at the University of Marburg in 1935. He left for Turkey, where he taught at the state university in Istanbul. There he wrote Mimesis, publishing it in German after the end of the war. Displaced as he was, Auerbach produced a work of great erudition that contains no footnotes, basing his arguments instead on searching, illuminating readings of key passages from his primary texts. His aim was to show how from antiquity to the twentieth century literature progressed toward ever more naturalistic and democratic forms of representation. This essentially optimistic view of European history now appears as a defensive -- and impassioned -- response to the inhumanity he saw in the Third Reich. Ranging over works in Greek, Latin, Spanish, French, Italian, German, and English, Auerbach used his remarkable skills in philology and comparative literature to refute any narrow form of nationalism or chauvinism, in his own day and ours.\n\nFor many readers, both inside and outside the academy, Mimesis is among the finest works of literary criticism ever written.\n\n\nReviews\n\n&quot;The compass and the richness of the book can hardly be exaggerated. This is true too of the originality of Mr. Auerbach's critical method which is at once encyclopedic and microscopic, combining the disciplines of philology, literary criticism, and history.&quot; -- New York Times\n\n&quot;One of the most important and readable books in literary criticism of the past 15 years . . . The author, beginning with Homer and the Bible, traces the imitation of life in literature through the ages . . . touching upon every major literary figure in western culture on the way.&quot; -- Publishers Weekly\n\n&quot;One of the great works of literary scholarship. . . Auerbach's method is to fasten with fastidious sensitivity on some stray phrase or passage in order to unpack from it a wealth of historical insight. It is his combination of scholarly erudition and critical astuteness which is most remarkable.&quot; -- Terry Eagleton, London Review of Books\n\n&quot;Written with the authority that comes from deep learning and full of information worth knowing, Princeton's 50th anniversary edition of Mimesis has an introduction by the late literary and cultural critic Edward Said that by itself is worth the price of the book. It's the only preface I know of that I wish were longer, serving as both an analysis of Auerbach and a framework placing him in his scholarly and historical context. . . Princeton's reissue of Mimesis is both timely and symbolic.&quot; -- Guy Davenport, Los Angeles Times Book Review\n","torrent":{"xt":"urn:btih:a9af044cc35fbeaf40785ed76c584c5c5bbd19e9","amp;dn":"Mimesis%3A+The+Representation+of+Reality+in+Western+Literature","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9af044cc35fbeaf40785ed76c584c5c5bbd19e9","infoHashBuffer":{"type":"Buffer","data":[169,175,4,76,195,95,190,175,64,120,94,215,108,88,76,92,91,189,25,233]},"announce":[],"urlList":[]}}