{"title":"Scarves, Shrugs &amp; Shawls 22 Knitted Designs With Their Speci","uid":11233672,"size":288783630,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9b305f04f1cd39b08e74ac80f7a49618877e591&amp;dn=Scarves%2C+Shrugs+%26amp%3B+Shawls+22+Knitted+Designs+With+Their+Speci&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"KnitLady","files":-1,"time":1413568197,"description":"Scarves and wraps are the perfect canvases for experimenting with new stitches and practicing new techniques. From well-respected Rowan Yarn designer Sarah Hatton with Sharon Brant as the technical editor, Wraps, Shawls &amp; Scarves to Knit offers over twenty-five easy-to-make and fun-to-wear designs that explore a range of knitting techniquesï¿½from gorgeous textured and cabled stitches, to intricate openwork and lace patterns, to interesting and appealing shaping. A gallery of designs features the garments photographed in full color and includes a helpful and inspiring &quot;How to Wear It&quot; section, showcasing the myriad ways to wrap your shawl, twist your neck warmer, or tie your scarf. Making these popular accessories even more versatile so you can wear them over and over, and still keep them looking fresh! Step-by-step instructions and close-up photography are given for all the techniques coveredï¿½from knitting in the round, increasing and decreasing, making edgings, adding beading, and more. Plus, additional ideas and tips for tweaking the designs expands the options for creating your own customized adaptations. All the projects are knit with sumptuous Rowan yarn in a range of weights and types, so you can always throw on one of your designs, no matter what the season. For innovative knitters of all levels, this book is both a wonderful sourcebook of stunning designs and a handy reference to help you master the art of knitting","torrent":{"xt":"urn:btih:a9b305f04f1cd39b08e74ac80f7a49618877e591","amp;dn":"Scarves%2C+Shrugs+%26amp%3B+Shawls+22+Knitted+Designs+With+Their+Speci","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9b305f04f1cd39b08e74ac80f7a49618877e591","infoHashBuffer":{"type":"Buffer","data":[169,179,5,240,79,28,211,155,8,231,74,200,15,122,73,97,136,119,229,145]},"announce":[],"urlList":[]}}