{"title":"Why We Buy - The science of shopping - Paco Underhill [Qwerty80]","uid":7879082,"size":12166306,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa2f9e7f19330b7177eca2f2ff54a1dbca0608c4&amp;dn=Why+We+Buy+-+The+science+of+shopping+-+Paco+Underhill+%5BQwerty80%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"KatQwerty","files":3,"time":1354440671,"description":"Is there a method to our madness when it comes to shopping? Hailed by the San Francisco Chronicle as &quot;a Sherlock Holmes for retailers,&quot; author and research company CEO Paco Underhill answers with a definitive &quot;yes&quot; in this witty, eye-opening report on our ever-evolving consumer culture. Why We Buy is based on hard data gleaned from thousands of hours of field research -- in shopping malls, department stores, and supermarkets across America. With his team of sleuths tracking our every move, from sweater displays at the mall to the beverage cooler at the drugstore, Paco Underhill lays bare the struggle among merchants, marketers, and increasingly knowledgeable consumers for control.\n\nIn his quest to discover what makes the contemporary consumer tick, Underhill explains the shopping phenomena that often go unnoticed by retailers and shoppers alike, including:\n\nHow a well-placed shopping basket can turn a small purchase into a significant sale\nWhat the &quot;butt-brush factor&quot; is and how it can make sales plummet\nHow working women have altered the way supermarkets are designed\nHow the &quot;boomerang effect&quot; makes product placement ever more challenging\nWhat kinds of signage and packaging turn browsers into buyers\nFor those in retailing and marketing, Why We Buy is a remarkably fresh guide, offering creative and insightful tips on how to adapt to the changing customer. For the general public, Why We Buy is a funny and sometimes disconcerting look at our favorite pastime.","torrent":{"xt":"urn:btih:aa2f9e7f19330b7177eca2f2ff54a1dbca0608c4","amp;dn":"Why+We+Buy+-+The+science+of+shopping+-+Paco+Underhill+%5BQwerty80%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa2f9e7f19330b7177eca2f2ff54a1dbca0608c4","infoHashBuffer":{"type":"Buffer","data":[170,47,158,127,25,51,11,113,119,236,162,242,255,84,161,219,202,6,8,196]},"announce":[],"urlList":[]}}