{"title":"Stephen Broadberry - The Cambridge Economic History of Modern Eu","uid":10347629,"size":12727971,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa5cb7430906f074716502381369a58267583224&amp;dn=Stephen+Broadberry+-+The+Cambridge+Economic+History+of+Modern+Eu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Anette14","files":-1,"time":1402628466,"description":"Description\nProduct Details\nBook Title: The Cambridge Economic History of Modern Europe: Volume 1, 1700-1870\t\nBook Author: Stephen Broadberry, Kevin H. O'Rourke\nSeries: The Cambridge Economic History of Modern Europe (Book 1)\nPaperback: 344 pages\nPublisher: Cambridge University Press; 1 edition (July 26, 2010)\nLanguage: English\nISBN-10: 0521708389\nISBN-13: 978-0521708388\n\nProduct Details\nBook Title: The Cambridge Economic History of Modern Europe: Volume 2, 1870 to the Present\t\nBook Author: Stephen Broadberry, Kevin H. O'Rourke\nSeries: The Cambridge Economic History of Modern Europe (Book 2)\nPaperback: 488 pages\nPublisher: Cambridge University Press; 1 edition (July 26, 2010)\nLanguage: English\nISBN-10: 0521882036\nISBN-13: 978-0521882033\n\n===================================================================================\nBook Description\nPublication Date Volume I: July 26, 2010 | ISBN-10: 0521708389 | ISBN-13: 978-0521708388 | Edition: 1\nPublication Date Volume II: July 26, 2010 | ISBN-10: 0521882036 | ISBN-13: 978-0521882033 | Edition: 1\nUnlike most existing textbooks on the economic history of modern Europe, which offer a country-by-country approach, The Cambridge Economic History of Modern Europe rethinks Europe's economic history since 1700 as unified and pan-European, with the material organised by topic rather than by country. This second volume tracks Europe's economic history through three major phases since 1870. The first phase was an age of globalization and of European economic and political dominance that lasted until First World War. The second, from 1914 to 1945, was one of war, deglobalization, and depression and the third was one of growing integration not only within Europe but also between Europe and the global economy. Leading authors offer comprehensive and accessible introductions to these patterns of globalization and deglobalization as well as to key themes in modern economic history such as economic growth, business cycles, sectoral developments, and population and living standards.\n\n===================================================================================\nReviews\n&quot;The Cambridge Economic History of Modern Europe shows the power of economics to illuminate history. It adopts a continental standpoint that emphasizes the dominant patterns of European development as well as providing a comparative context that highlights national differences. The volume synthesizes the research of historical economists and growth theorists. The combination leads to a more profound understanding of the causes of economic success and failure than was previously available. This seriously good book is the first thing to read if you want to understand the economic history of Europe.&quot; - Robert C. Allen, Professor of Economic History, University of Oxford, and Fellow of Nuffield College\n\n&quot;The Cambridge Economic History of Modern Europe is well launched by this collective tour de force. This compendium is modern both in its subject matter and in its thoroughly up-to-date scholarship. The contributing authors have succeeded in distilling an often technical literature into an undergraduate-friendly interpretive synthesis.&quot; Peter H. Lindert, Distinguished Professor of Economics, University of California, Davis\n\n&quot;I strongly recommend this book to readers. It is first a magnificent, unequalled introduction to European economic history. Furthermore it is a plea for the development of not only comparative but also quantitative economic history. It is finally a splendid synthesis exercise, which aims at presenting a cultured audience with the lessons drawn from advanced research in the field of historical economics and/or econometric history devoted to Europe from the eighteenth century to the present day, using clear and understandable terms.&quot; -EH.Net\n\n&quot;Eleven papers provide a unified economic history of modern Europe.&quot; -Journal of Economic Literature\n\n===================================================================================\nBook Description II\nSetting European economic development within a unified, comparative and genuinely pan-European framework, this textbook surveys the transition to modern economic growth since 1700. Leading authors cover the major themes of modern economic history and compare economic development across countries in a clear and comprehensible way.\n\n===================================================================================\nAbout the Author\nStephen Broadberry is Professor of Economic History at the University of Warwick and a Co-ordinator of the Economic History Initiative at CEPR. His recent publications include The Economics of World War I (2005, as co-editor) and Market Services and the Productivity Race, 1850-2000: Britain in International Perspective (2006).\nKevin O'Rourke is Professor of Economics at Trinity College Dublin and a co-organiser of the CEPR's Economic History Initiative. His recent publications include The International Trading System, Globalization and History, 2 volumes (as editor, 2005) and Power and Plenty: Trade, War, and the World Economy in the Second Millennium (2007, with Ronald Findlay).\n===================================================================================","torrent":{"xt":"urn:btih:aa5cb7430906f074716502381369a58267583224","amp;dn":"Stephen+Broadberry+-+The+Cambridge+Economic+History+of+Modern+Eu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa5cb7430906f074716502381369a58267583224","infoHashBuffer":{"type":"Buffer","data":[170,92,183,67,9,6,240,116,113,101,2,56,19,105,165,130,103,88,50,36]},"announce":[],"urlList":[]}}