{"title":"Netter's Correlative Imaging, Abdominal and Pelvic [PDF] [StormR","uid":10939363,"size":210591281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa74228829c69f042689f89ba6d876d43c456410&amp;dn=Netter%27s+Correlative+Imaging%2C+Abdominal+and+Pelvic+%5BPDF%5D+%5BStormR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":2,"time":1409484837,"description":"Author: Drew A. Torigian MD MA (Author), Mary Kitazono Hammell (Author)\nSeries: Netter Clinical Science\nHardcover: 520 pages\nPublisher: Saunders; 1 Har/Psc edition (November 13, 2012)\nLanguage: English\nISBN-10: 1437736548\nISBN-13: 978-1437736540\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nVisualize normal anatomy of the abdomen and pelvis like never before with Netter's Correlative Imaging: Abdominal and Pelvic Anatomy. This outstanding radiology reference from Dr. Drew A. Torigian and Dr. Mary Kitazono Hammell features beautiful and instructive Netter paintings and illustrated cross-sections created in the Netter style, presented side by side with high-quality patient MR images to help you envision and review both gastrointestinal and genitourinary anatomy section by section.\n\nView organs, vessels, and peritoneal anatomy through MR, MRA, MRV, and MRCP imaging in a variety of planes, complemented with a detailed illustration of each slice done in the instructional and aesthetic Netter style.\nFind anatomical landmarks quickly and easily through comprehensive labeling and concise text highlighting key points related to the illustration and image pairings.\nCorrelate patient data to idealized normal anatomy, always in the same view with the same labeling system.","torrent":{"xt":"urn:btih:aa74228829c69f042689f89ba6d876d43c456410","amp;dn":"Netter%27s+Correlative+Imaging%2C+Abdominal+and+Pelvic+%5BPDF%5D+%5BStormR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa74228829c69f042689f89ba6d876d43c456410","infoHashBuffer":{"type":"Buffer","data":[170,116,34,136,41,198,159,4,38,137,248,155,166,216,118,212,60,69,100,16]},"announce":[],"urlList":[]}}