{"title":"Saints of the Shadow Bible by Ian Rankin","uid":9162914,"size":1022688,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa94842363d796c751f888251b444bfe9a43c01d&amp;dn=Saints+of+the+Shadow+Bible+by+Ian+Rankin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"maxdesolate","files":2,"time":1383904535,"description":"Rebus - book 19.\n\nRebus and Malcolm Fox go head-to-head when a 30-year-old murder investigation resurfaces, forcing Rebus to confront crimes of the past\n\nRebus is back on the force, albeit with a demotion and a chip on his shoulder. He is investigating a car accident when news arrives that a case from 30 years ago is being reopened. Rebus's team from those days is suspected of helping a murderer escape justice to further their own ends.\n\nMalcolm Fox, in what will be his last case as an internal affairs cop, is tasked with finding out the truth. Past and present are about to collide in shocking and murderous fashion. What does Rebus have to hide? And whose side is he really on? His colleagues back then called themselves &quot;The Saints,&quot; and swore a bond on something called the Shadow Bible. But times have changed and the crimes of the past may not stay hidden much longer -- and may also play a role in the present, as Scotland gears up for a referendum on independence.\n\nAllegiances are being formed, enemies made, and huge questions asked. Who are the saints and who the sinners? And can the one ever become the other?\nGenre: Thriller\n\nEPUB AND MOBI. ","torrent":{"xt":"urn:btih:aa94842363d796c751f888251b444bfe9a43c01d","amp;dn":"Saints+of+the+Shadow+Bible+by+Ian+Rankin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa94842363d796c751f888251b444bfe9a43c01d","infoHashBuffer":{"type":"Buffer","data":[170,148,132,35,99,215,150,199,81,248,136,37,27,68,75,254,154,67,192,29]},"announce":[],"urlList":[]}}