{"title":"Robert Ludlum's The Utopia Experiment By Kyle Mills","uid":8371861,"size":2268428,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aabb62e4bb158d4ab21d8946f70a317a3ed36727&amp;dn=Robert+Ludlum%27s+The+Utopia+Experiment+By+Kyle+Mills&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"maxdesolate","files":5,"time":1365897892,"description":"With U.S. intelligence agencies wracked by internal power struggles and paralyzed by bureaucracy, the president has been forced to establish his own clandestine group--Covert-One. It's activated only as a last resort, when the threat is on a global scale and time is running out.\nTHE UTOPIA EXPERIMENT\nWhen Dresner Industries unveils the Merge, a device that is destined to revolutionize the world and make the personal computer and smartphone obsolete, Covert-One operative Colonel Jon Smith is assigned to assess its military potential. He discovers that enhanced vision, real-time battlefield displays, unbreakable security, and near-perfect marksmanship are only the beginning of a technology that will change the face of warfare forever--and one that must be kept out of the hands of America's enemies at all costs.\nMeanwhile, in the mountains of Afghanistan, CIA operative Randi Russell encounters an entire village of murdered Afghans--all equipped with enhanced Merge technology that even the Agency didn't know existed. As Smith and Russell delve into the circumstances surrounding the Afghans' deaths, they're quickly blocked by someone who seems to have access to the highest levels of the military--a person that even the president knows nothing about.\nIs the Merge really as secure as its creator claims? And what secrets about its development is the Pentagon so desperate to hide? Smith and Russell are determined to learn the truth. But they may pay for it with their lives . . .\n\nepub,mobi and txt ","torrent":{"xt":"urn:btih:aabb62e4bb158d4ab21d8946f70a317a3ed36727","amp;dn":"Robert+Ludlum%27s+The+Utopia+Experiment+By+Kyle+Mills","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aabb62e4bb158d4ab21d8946f70a317a3ed36727","infoHashBuffer":{"type":"Buffer","data":[170,187,98,228,187,21,141,74,178,29,137,70,247,10,49,122,62,211,103,39]},"announce":[],"urlList":[]}}