{"title":"Private Black Label - The Uranus Experiment #3 (DVD.xvid)","uid":4752535,"size":681508864,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:aade2ddbf3d906c6980374e0a54f6f6860224bc2&amp;dn=Private+Black+Label+-+The+Uranus+Experiment+%233+%28DVD.xvid%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"pure_screens","files":1,"time":1236270440,"description":"Private Black Label 8 - The Uranus Experiment #3 (DVD.xvid)\n\n\n\n\n\nall 5 screens (+ DVD-covers):\n &lt;a href=&quot;\nhttp://wide.blogbugs.org/7583426/The-Uranus-Experiment-3---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wide.blogbugs.org/7583426/The-Uranus-Experiment-3---screens.html&lt;/a&gt;\n\n\n\n\n\n\nBack To Earth!\n\nThe Russian-American expedition to the planet Uranus has been a resounding success! Both teams have had sex in zero gravity, discovered alien life on the mysterious blue planet and also, explored sexual techniques with the insatiable inhabitants living there. The crew of astronauts returns joyously home to the planet Earth, celebrating their victory en route with an out-of-this-world orgy of stellar sex! Don't miss the colossal conclusion of Private's space odyssey!\n\n\nActresses\n\n    * Vanda Vitus (as Anita) [Anal]\n    * Carmen Moore [BJOnly]\n    * Christine [Anal Facial]\n    * Isabella (as Gabriella) [Anal DP]\n    * Julia Taylor [Anal]\n    * Silvia Saint [Facial]\n    * Wanda Curtis [Facial]\n\n   \nScene Breakdowns\n\n    * Scene 1. John Walton, Silvia Saint, Wanda Curtis\n    * Scene 2. Julia Taylor, Max Cortes, Vanda Vitus\n    * Scene 3. Andrew Youngman, Christine\n    * Scene 4. Christine, Silvia Saint\n    * Scene 5. Carmen Moore, Christine, Frank Major, Isabella, Julia Taylor, John Walton, Leslie Taylor, Nick Lang, Wanda Curtis\n\n\n\n\nStudio:    Private\nReleased:  1999\n\n\n\nREVIEW:\n\nWell my friends, we have finally reached the final leg of this three film odyssey into the sexy outer space world of John Millerman's Uranus Experiment. After an incredible start in part one, things cooled down a bit with second tape. Not that part two was bad mind you, it just couldn't quite reach the perfect mix of hot sex, gorgeous women and interesting plot that part one had. Will part three be the perfect end to a very interesting adult adventure? We don't get much of a story re-cap, so you'll have to check my other reviews or just sort of wing it if you want to keep up.\n\nWhen we left our crew, they had just made it to the planet's surface and one of the guys had banged a couple of blue space chicks. It didn't do much for me, but it has hormones on the ship flowing big time. Silvia Saint and a brunette woman team up on one of the lucky crew members. Any time we get to watch Silvia sucking cock, it's a good thing, even it's a sort, simulated zero gravity scene. Actually, that's about the only thing I really like in this scene. It's just to slow for my taste and not a good utilization of her incredible talents.\n\nBack on earth, the investigation is still movely slowly thanks to all of the sexual side trips. How do they ever expect to get any work done if every guy gets to pork the all too beautiful chicks running around these offices? Of course, this cute little brunette is well worth shagging silly so I guess we can excuse our overly horny friend. In the cramped confines between file racks, he even manages to bust her pretty little bum. I'm not entirely sure why, but when one girl finishes, another comes in to finish this guy off. Damn, those Russian spy babes are so good at what they do. This redhead sucks her partner's cum from this guy's cock like it's candy. Her ass is every bit as open for business as the brunette's and she is more than happy to finally suck a big load out of his sack for dessert.\n\nThe story returns to the ship where two more astronaughts have the uncontrollable hots for each other. Sure this blonde is no Silvia, but she's cute enough, especially with a big cock in her mouth. To fit with the space theme, the blowjob is shot sideways. Sorry, but this just doesn't work. All it does is hinder an otherwise nice looking oral scene. In fact, the whole scene is hindered by these odd angles. At this point in the film, why not let your assfucked hotties carry the load? I'm fine just watching this woman bob her butt up and down on his bone. A decent enough facial makes it a scene worth watching, but I think Millerman just tried too hard here.\n\nThe crew makes it back to earth, but Silvia and the other blonde still have their minds on a lesbian tryst that must have happened when we had our backs turned. By now, this slowly paced, couples type sex is beginning to bug me a bit. Once again we have the awesome Silvia Saint in a scene that really reins in her incredible sexual appeal.\n\nOK, things are so far off track, I don't know how we got here. A big party celebrating the return, turns into an orgy when the cocktail waitress takes her name a little too seriously. She moves around the room, sampling one dick after another while the party just goes on and on. Great eye contact from this filthy little hosebeast as she works the whole room into a frenzy. One couple heads off into another room and the guy can't help but fuck this sexy creature. (It frustrates me when a workable plot deteriorates like this.) He uses two fingers on her pussy and two more on her ass to get her warmed up for the main event. She straddles his cock and rides like she hasn't been laid in years. Eventually, everyone walks into the room and the first guy to take his cock out gets her tight asshole. Both guys fuck her super hard, but she takes every pounding stroke. By now, the whole room is groping and grabbing for the nearest hard or wet part they can find. The action moves around a little too quickly for my taste at this point, but everywhere you look, some hot little Euro-slut is getting the dicking of her young life, so just sit back and enjoy it. It isn't often a group scene gets this much praise from me, but it isn't often that the action is this evenly dispersed and so well shot either. Great anal shots of the redhead as she gets dorked doggy. Nicely mixed cumshots on asses, tits and faces to round out a very strokeable group bang.\n\nAs an added bonus we get the making of the Uranus Experiment. With such a great start, I have to say I am a little disappointed at how far downhill things went after that movie. There was a decent plot going, but by the end of this trilogy, it's just a basic Private movie with some mostly unrelated scenes thrown together. The women are still good looking and the sex is well shot for the most part. A few of the scenes are too soft and couplesy for me, but hey, we do get to see Silvia twice and those butt fucked Russian babes are hot. After a perfect ten for the first movie, Uranus Experiment had my hopes up. However, in the end, it falls short of the great Private films like Pyramid or Tatiana, but it's still a cut above your average fuck and suck flick.\n\n\n\n\n\n\n\n\n.\n","torrent":{"xt":"urn:btih:aade2ddbf3d906c6980374e0a54f6f6860224bc2","amp;dn":"Private+Black+Label+-+The+Uranus+Experiment+%233+%28DVD.xvid%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aade2ddbf3d906c6980374e0a54f6f6860224bc2","infoHashBuffer":{"type":"Buffer","data":[170,222,45,219,243,217,6,198,152,3,116,224,165,79,111,104,96,34,75,194]},"announce":[],"urlList":[]}}