{"title":"Black Sexual Politics: African Americans, Gender, and the New Ra","uid":8762213,"size":3493116,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aaef727f798af6fa124c09cf165e7ee4d630b8ca&amp;dn=Black+Sexual+Politics%3A+African+Americans%2C+Gender%2C+and+the+New+Ra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"blackatk","files":-1,"time":1375265320,"description":"\nPublication Date: July 14, 2005 | A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload | filetype: pdf |\n\n\nIn Black Sexual Politics, one of America's most influential writers on race and gender explores how images of Black sexuality have been used to maintain the color line and how they threaten to spread a new brand of racism around the world today.\n\n\nFrom Booklist\nDrawing on vivid images of hypersexual blacks and the sociological theses of strong black women and weak black men, Collins explores an astonishing range of ideas and images through history, sociology, and popular culture. Rather than debate the dominance of race versus sex in the history of social injustice to black men and women, Collins offers a theory of &quot;intersectionality,&quot; viewing race, gender, and sexuality together. She explores the social and personal implications of historical images (black men as rapists deserving of lynching and black women so immoral it was impossible to rape them) and more current concerns about the influence of prison culture on urban youth culture that glorifies connections between sex and violence. Demonstrating how the politics of race has traditionally neglected concerns about gender and sexual orientation, Collins explores a range of issues, advocating that black people &quot;ready up some honesty&quot; and redefine notions of masculinity and femininity. Vanessa Bush\nCopyright Â© American Library Association. All rights reserved\nReview\nPatricia Hill Collins' brilliant and ground-breaking analysis of the urgency of a more progressive Black sexual politics among African Americans is nothing short of a 'tour de force.' This book is sure to be a foundational text in Black gender studies and a corrective to the continued erasure of gender and sexuality as important issues in mainstream African American Studies scholarship. Her foray into popular culture is particularly insightful as is her sophisticated theoretical approach to Black gender discourse around a number of issues including class dimensions of masculinity, violence against women, and HIV/AIDS. She demonstrates with extraordinary skill the bankruptcy of gender-blind anti-racist politics in the 21st century. Her wake-up call to Black America and the nation is heart-felt and piercing. No more business-as-usual is the loud message! -- Beverly Guy-Sheftall, co-author of Gender Talk\nA leading scholar in the field of black feminist studies, Patricia Hill Collins once again challenges readers to think differently, this time about sexuality in black communities. Collins argues for a new black sexual politics, focused on liberating black women and men and highlighting the role of culture in this struggle. This book is sure to spark needed and timely debate. -- Cathy J. Cohen, author of The Boundaries of Blackness\nA pathbreaking exploration of complex intersections of racism, sexism, and heterosexism! Patricia Hill Collins shows how\nunhealthy sexual politics in black communities imbeds white-generated images of stereotyped masculinity, femininity, and sexuality. A well-documented argument for countering and replacing the sexist-racist views of hyper-sexual, too-strong black women and sexually irresponsible, too-weak black men both within and outside black communities. -- Joe R. Feagin, author of Racist America\nPatricia Hill Collins has done it again! In her brilliant new book, Collins deepens her analysis of the intersections and\nhierarchies of race, gender, sexuality and class, and extends her theoretical gaze with fresh and provocative interpretations of black popular culture. Black Sexual Politics charts the subtle evolution of a new racism that often goes undetected--and unaccounted for--while grappling with the complexities and contradictions within black life. This book is at once a theoretical tour de force and a must-read for all who care about the lives of black folk in the twenty-first century. -- Michael Eric Dyson, author of Why I Love Black Women\nCollins expands the horizons of feminist and anti-racist thinking about some of the most disturbing issues of the contemporary post-civil rights era. Her focus on historical specificity of African American conditions and struggles illuminates the contours of--and strategies for--social justice projects in global as well as local political contexts. This book makes a distinguished contribution to critical theory and to classroom resources. -- Sandra Harding, editor of The Feminist Standpoint Theory Reader\nThis well written text...[is] strongly recommend for public and academic libraries. -- Library Journal\nBlack Sexual Politics is one of the most steaming mad books on sexuality since the days of Andrea Dworkin...It constitutes a breakthrough. -- Village Voice\nFor the last 15 years Patricia Hill Collins has been one of the defining voices of contemporary feminist and race scholarship...As is true for many comparable works of such breadth, the primary contribution of 'Black Sexual Politics' is not so much the new data as it is the skillful synthesis and application of post civil rights scholarship on contemporary culture...The result is a race/class/gender/sexuality text-book on Black life that displays the ongoing relevance and utility of such scholarship when alchemically transformed through intersectionality. Indeed, I often thought while reading this book that it would be an excellent way to introduce students to race/class/gender/sexuality for it brings the principles and data up-to-date. -- Contemporary Sociology \n\n\n\nPrint Length: 385 pages\nPage Numbers Source ISBN: 0415930995\nPublisher: Routledge (July 14, 2005)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B000OT8B9O\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Black-Sexual-Politics-Americans-ebook/dp/B000OT8B9O/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Black-Sexual-Politics-Americans-ebook/dp/B000OT8B9O/&lt;/a&gt;\n\n\n\nTags: Politics, Social Sciences,Social Sciences, Sociology, Social Theory, racism, race, discrimination, oppression, memes, gender roles, hypersexuality, feminism, polarization, self-worth, self-hate, african studies, afro-centric, divide and conquer, colonialism, contested heritage, black, african american, sex, sexual, ","torrent":{"xt":"urn:btih:aaef727f798af6fa124c09cf165e7ee4d630b8ca","amp;dn":"Black+Sexual+Politics%3A+African+Americans%2C+Gender%2C+and+the+New+Ra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaef727f798af6fa124c09cf165e7ee4d630b8ca","infoHashBuffer":{"type":"Buffer","data":[170,239,114,127,121,138,246,250,18,76,9,207,22,94,126,228,214,48,184,202]},"announce":[],"urlList":[]}}