{"title":"PCSX 2 1.1.0 - ps2 emulator","uid":8344154,"size":7073775,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ab24cb5c32cbea1c7d283ce5a44a5f87d8fc9702&amp;dn=PCSX+2+1.1.0+-+ps2+emulator&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"netDOT","files":1,"time":1365162331,"description":"What is PCSX2?\n\nPCSX2 is a Playstation 2 'emulator', a free program that tries to replicate the Playstation 2 console to enable you to play PS2 games on your PC.\n\n \nAdvantages over the Playstation 2 console\n\n    Custom resolutions, up to 4096x4096, Anti Aliasing and Texture filtering to make your old PS2 games look better than their HD remakes!\n    Unlimited memory cards\n    Save states, enabling you to quick save and load practically anywhere in your game\n    Easy cheating using our pnach patching system\n    Use any controller (PS3,Xbox360 etc) that works on Windows, keyboards and mice\n    Increase or decrease the game speed by using the built-in frame-limiter for fast grinding or passing hard spots by slowing them down\n    Ability to record in full HD with the built-in video recorder (F12 using the GSdx plugin)\n\n \nSo how do I use it?\n\n    Download the version suited for you from our Downloads Section (for beginners, the full installer of the latest stable release is recommended)\n    Get the BIOS file from your Playstation 2 console. This is not included with PCSX2 since it is a Sony copyright so you have to get it from your console. Visit the tools section to find out how to do this.\n    Install PCSX2\n    Configure PCSX2. For beginners the Configuration Guide video and the Quick Start configuration guide should help you. For a detailed description of every single option you can always refer to the full guide.\n    Insert your PS2 game CD/DVD in your DVD rom. You can either run it directly from the disc or create an ISO image of your disc with a program like IMGburn for faster reads.\n    Enjoy!!!\n\n \nI can't make it work!\n\nPCSX2 is not the simplest program out there although we try to do it as user friendly as possible.\n\nIf you have problems running your game, first check our compatibility list. Is your game listed as Playable there? If not, PCSX2 does not support your game yet so you'll have to wait for a fix or try another game. If you can't find it in the list we don't know if it works or not since it has not been tested!\n\nIf your game is listed as playable, ask for help in our forum!\n\n \nIt works but its slow!\n\nThis is the most common problem users experience. PCSX2 is a very hardware intensive program, especially on your processor.\n\nIt is highly recommended you read the first post of this thread: Will PCSX2 run fast on my computer? and if you still have questions reply to the thread, there are many helpful members who will answer.\nSystem Requirements\nMinimum (most games will be unplayable slow)\n\n    Windows/Linux OS\n    CPU: Any that supports SSE2 (Pentium 4 and up, Athlon64 and up)\n    GPU: Any that supports Pixel Shader model 2.0, except Nvidia FX series (broken SM2.0, too slow anyway)\n    512MB RAM (note Vista needs at least 2GB to run reliably)\n\nRecommended\n\n    Windows Vista / Windows 7 (32bit or 64bit) with the latest DirectX\n    CPU: Intel Core 2 Duo @ 3.2 GHz or better OR i3/i5/i7 @ 2,8 GHz or better OR AMD Phenom II @ 3,2 GHz or better\n    GPU: 8800gt or better (for Direct3D10 support)\n    RAM: 1GB on Linux/Windows XP, 2GB or more on Vista / Windows 7","torrent":{"xt":"urn:btih:ab24cb5c32cbea1c7d283ce5a44a5f87d8fc9702","amp;dn":"PCSX+2+1.1.0+-+ps2+emulator","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab24cb5c32cbea1c7d283ce5a44a5f87d8fc9702","infoHashBuffer":{"type":"Buffer","data":[171,36,203,92,50,203,234,28,125,40,60,229,164,74,95,135,216,252,151,2]},"announce":[],"urlList":[]}}