{"title":"Sticky Password Premium 8.0.8.116 Incl Patch [SadeemPC]","uid":15577705,"size":29956425,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ab3375e08a96943e78580a5a3a67169a2bb97c9e&amp;dn=Sticky+Password+Premium+8.0.8.116+Incl+Patch+%5BSadeemPC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"SadeemPC","files":1,"time":1471361796,"description":"Sticky Password Premium 8.0.8.116\r\n\r\nSticky Password is a professional security tool with rich features for storing passwords to online accounts, applications and identity information in a single place. It facilitates quick access from any location, thanks to Cloud-based technology. \r\n\r\nFeatures:\r\n\r\nFill Out Forms Instantly\r\nSticky Password completes even the longest forms for you - automatically. No need to register every time you shop or download – once you’ve stored your information in the password manager, you can recall it instantly on any device whenever you need it.\r\n\r\nLog In Automatically\r\nWith all that you do online, it’s a challenge to create and remember passwords for your favorite sites and apps – whether it be email, social networks, shopping, banking, magazines and other subscriptions, or school and community.\r\n\r\nOnly One Password to Remember\r\nYour master password is the only one you need to remember - Sticky Password does the rest. If you have passwords set up already, just import them when you install the software. And whenever you need a new password, Sticky Password creates one for you - automatically.\r\n\r\nUnbeatable Security\r\nSticky Password creates the strongest possible passwords and stores them behind multiple layers of protection. Your password manager database is encrypted with powerful encryption algorithms, including military-grade AES encryption.\r\n\r\nSupport For All Your Devices\r\nSticky Password supports Windows, iPhones, iPads, and Android devices; support for Mac is also being considered. So no matter where you are or what device you use all your passwords and personal form-filling information are just a click or tap away.\r\n\r\nWhat Are You Waiting For?\r\nDownload a 30-day full-function trial version of Sticky Password today. We guarantee you’ll be so impressed, you’ll want it on hand in your browser for ever! After 30 days, the synchronization goes away, and you’ll be restricted to 15 accounts, so keep that in mind!\r\n\r\n8.0.8.116 Final\r\nImproved UI for extensions related dialogs. More intuitive autofill feature.\r\nfixed conflict between Sticky Password and IE on hi-dpi displays","torrent":{"xt":"urn:btih:ab3375e08a96943e78580a5a3a67169a2bb97c9e","amp;dn":"Sticky+Password+Premium+8.0.8.116+Incl+Patch+%5BSadeemPC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab3375e08a96943e78580a5a3a67169a2bb97c9e","infoHashBuffer":{"type":"Buffer","data":[171,51,117,224,138,150,148,62,120,88,10,90,58,103,22,154,43,185,124,158]},"announce":[],"urlList":[]}}