{"title":"The Good Wife 1x01 HDTV DVB Spanish","uid":5269355,"size":353785883,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ab345617a4d77da726c8b9bcf770d7d71dfa5a7c&amp;dn=The+Good+Wife+1x01+HDTV+DVB+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Mois20","files":2,"time":1262992944,"description":"Esta nueva serie presenta a Margulies (ER) como una madre y esposa que debe asumir toda la responsabilidad por su familia y regresar al mundo laboral luego de que el escandalo de corrupcion politica y un amorio muy publico lo llevan a prisiÃƒÂ³n.\n\nAlejÃƒÂ¡ndose de la traiciÃƒÂ³n y de la humillaciÃƒÂ³n publica causada por su esposo Peter (Chris Noth), Alicia Florrick (Margulies) decide retomar su carrera original como abogada defensora. Como una asociada junior en una prestigiosa firma, ella se une a su viejo amigo y socio Will Gardner (Josh Charles), quien esta interesado en ver como trabajarÃƒÂ¡ luego de 13 aÃƒÂ±os fuera de las cortes.\n\nAlicia esta agradecida que la abogada mÃƒÂ¡s importantes de la firma, Diane Lockhart (Christine Baranski), se ofrezca como mentor pero descubre que la oferta tiene ciertas condiciones por lo que se da cuenta que tendrÃƒÂ¡ que conseguir el ÃƒÂ©xito sola.\n\nLa mayor competencia dentro de los nuevos 20 reclutas de la firma es Cary (Matt Czuchry), un joven graduado de Harvard que parece bueno en la superficie, pero que utilizarÃƒÂ¡ todos los mÃƒÂ©todos posible para asegurar que el, y no Alicia, consiga la ÃƒÂºnica posiciÃƒÂ³n permanente disponible.\n\nGanando confianza cada dÃƒÂ­a, Alicia se transforma de la avergonzada esposa de un polÃƒÂ­tico en una poderosa abogada, especialmente con el objetivo de dar un hogar estable a sus hijos, Zach (Graham Phillips) y Grace (Makenzie Vega).","torrent":{"xt":"urn:btih:ab345617a4d77da726c8b9bcf770d7d71dfa5a7c","amp;dn":"The+Good+Wife+1x01+HDTV+DVB+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab345617a4d77da726c8b9bcf770d7d71dfa5a7c","infoHashBuffer":{"type":"Buffer","data":[171,52,86,23,164,215,125,167,38,200,185,188,247,112,215,215,29,250,90,124]},"announce":[],"urlList":[]}}