{"title":"Alan Moore - 25,000 Years of Erotic Freedom","uid":8604621,"size":91859891,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab37f969c26756ec730fdc37107d4718c733b62b&amp;dn=Alan+Moore+-+25%2C000+Years+of+Erotic+Freedom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1371981304,"description":"'25,000 Years of Erotic Freedom'\nAbrams, 2009, 96 pages\nWritten by Alan Moore\n\nWith each new technological advance, pornography has proliferated and degraded in quality. Today, porn is everywhere, but where is it art? 25,000 Years of Erotic Freedom surveys the history of pornography and argues that the success and vibrancy of a society relates to its permissiveness in sexual matters.\n\nThis history of erotic art brings together some of the most provocative illustrations ever published, showcasing the evolution of pornography over diverse cultures from prehistoric to modern times. Beginning with the Venus of Willendorf, created between 24,000-22,000 bce, and book-ended by contemporary photography, it also contains a timeline covering major erotic works in several cultures. 25,000 Years of Erotic Freedom ably captures the ancient and insuppressible creative drive of the sexual spirit, making this book a treatise on erotic art.\n\n&quot;Sexually progressive cultures gave us literature, philosophy, civilization and the rest, while sexually restrictive cultures gave us the Dark Ages and the Holocaust.&quot; - Alan Moore\n\nAlan Moore lives in Northampton, England, and is most famous for his influential work in comics, including the acclaimed comic books Watchmen, V for Vendetta, and From Hell. In 2006 Alan Moore and Melinda Gebbie released Lost Girls, an illustrated series of erotic art exploring the possible sexual meanings in Alice's Adventures in Wonderland, Peter Pan, and The Wonderful Wizard of Oz. He lives in Northampton, England. ","torrent":{"xt":"urn:btih:ab37f969c26756ec730fdc37107d4718c733b62b","amp;dn":"Alan+Moore+-+25%2C000+Years+of+Erotic+Freedom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab37f969c26756ec730fdc37107d4718c733b62b","infoHashBuffer":{"type":"Buffer","data":[171,55,249,105,194,103,86,236,115,15,220,55,16,125,71,24,199,51,182,43]},"announce":[],"urlList":[]}}