{"title":"Handbook of Nutrition, Diet and Sleep - Preedy, Patel &amp; Le -","uid":8902463,"size":5454672,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab513d5c2e55defb2b6c9e04f430b3f6b3600510&amp;dn=Handbook+of+Nutrition%2C+Diet+and+Sleep+-+Preedy%2C+Patel+%26amp%3B+Le+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"K-Slender","files":3,"time":1378836716,"description":"Emerging literature and research have currently shown that sleep, sleep disturbances, diet and nutrition are interlinked in numerous ways. For example, sleep deprivation alters food intake and snacking behaviour. On the other hand, dietary restriction and obesity alter sleep. Specific nutrients such as caffeine and alcohol also affect sleep. Furthermore, variations in these relationships differ with respect to age, gender and state of health. There is a connection between sleep and disordered nutrition as defined by conditions such as diabetes and metabolic syndrome. This book demonstrates that disruptive sleep patterns can be remedied by appropriate dietary or nutritional changes including the usage of supplements. The contribution of sleep to our daily lives is not yet fully understood, but it is clear that its impact should not be underestimated. This handbook discusses the important relationship between diet and nutrition and disruptive or abnormal sleep in the sub-clinical or clinical setting. Authorities in the field offer a wide range of scientifically sound perspectives and approaches of the link between sleep, nutrition and diet.\n","torrent":{"xt":"urn:btih:ab513d5c2e55defb2b6c9e04f430b3f6b3600510","amp;dn":"Handbook+of+Nutrition%2C+Diet+and+Sleep+-+Preedy%2C+Patel+%26amp%3B+Le+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab513d5c2e55defb2b6c9e04f430b3f6b3600510","infoHashBuffer":{"type":"Buffer","data":[171,81,61,92,46,85,222,251,43,108,158,4,244,48,179,246,179,96,5,16]},"announce":[],"urlList":[]}}