{"title":"Banished v1.0.2 Beta Build 3DM - KATODY","uid":10084253,"size":87253313,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ab725b0d9b5d842c91b1fdb07520ae93ea9b796c&amp;dn=Banished+v1.0.2+Beta+Build+3DM+-+KATODY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Katody","files":-1,"time":1399068906,"description":"Changelog:\n\n* Citizens are now more effective at fighting fires and putting them out.\n* When fires break out, citizens fighting the fire now run at high speed.\n* Citizens working in an area where a fire breaks out will now be interrupted to help fight the fire.\n* Fixed a bug that caused non-laborers to not fight fires.\n* Citizens fighting fires will only be interrupted by sickness, freezing, or starving.\n* Citizens will now only search for water in an area around the fire. Far inland areas need wells for fires to be fought.\n* Increased the number of citizens that can fight a single fire to 50.\n* Increased the area of effect for citizens fighting a fire.\n* If enough water is brought to a building on fire, the chance of the fire spreading is lowered.\n* Fixed a bug that caused buildings on fire not to be high priority.\n* Fixed a major slowdown in large towns when fires break out.\n* If citizens are already walking to get food at a distance location and become starved, theyÂ¡Â¯ll now interrupt the walk and get food at the closest market or storage barn.\n* If citizens are working far from home and become hungry, theyÂ¡Â¯ll eat food from their home as if they brought food with them. This will not interrupt the current task. If no food is available at home they will interrupt the walk and get food at the closest market or storage barn.\n* Because citizens can eat from home when far away, they can better deal with freezing, and visit a warm place when needed.\n* Fixed a bug that caused citizens not to warm up when eating at home in some cases.\n* Citizens now wonÂ¡Â¯t be assigned far away tasks without a specific profession (pickups, gathering, clearing, etc) unless the tasks have been around for a long time, or havenÂ¡Â¯t been assigned to someone local. This keeps citizens far away from walking across the map in most cases.\n* Citizens now limit the distance theyÂ¡Â¯ll walk in the winter when it is very cold.\n* Tombstones now decay in 4-6 years instead of 13-17.\n* Existing tombstones have had their decay time reduced by half.\n* The trading post volume was been increased to 60000. This allows larger auto purchases to occur without overflowing storage. Existing trading posts need to be removed and replaced for this change to take effect.\nHereÂ¡Â¯s the rest of the changes already posted:\n\n* Mouse buttons now obey system setting for flipped left/right buttons.\n* Input options now allow binding of mouse actions.\n* Input settings can now be bound to any of eight mouse buttons.\n* Fixed a bug that cause meat and other resources to show up in the corner of the map.\n* Fixed being able to pop a building back into existence after being damaged by using the cancel removal tool or reclaim button.\n* Fixed grave count on cemeteries when it is marked for removal then reclaimed.\n* Fixed crash at trading post when trading, dismissing trader, and then selecting a custom order.\n* Fixed a bug that allowed auto purchase to over fill the trading post.\n* Fixed a bug that caused cycling through laborers to show children and students.\n* Foresters no longer cut down orchards.\n* Fixed water showing inside merchant boat.\n* Builders will no longer walk the long way around to the other side of a bridge or tunnel when constructing it if itÂ¡Â¯s more than twice the distance to the closer side.\n* Fixed building pause icon staying up when a building completes construction after pausing construction.\n* Fixed a bug that caused starving or freezing people to get stuck in a loop doing the same job over and over if no food or warmth was available to resolve the starving or freezing issue.\n* Fixed a bug that caused pending roads to not be cancelable if they were under a tree, rock, ore, etc.\n* Fixed a bug that caused roads to be unremovable.\n* Fixed a bug that caused areas to be unusable after roads were removed in certain cases.\n* Dirt roads can no longer be quick removed by zoning over them with stone roads and then removing them. They now revert back to dirt roads and work has to be performed to remove them.\n* Placing stone roads over pending dirt roads no longer cause unusable areas.\n* Disasters are now disabled in tutorials.\n* Fixed several spelling and grammatical errors.\n* Fixed crash in audio streamer due to missing thread synchronization.\n* Fixed a crash that occurred if a video card doesnÂ¡Â¯t support sampling from a depth texture.\n* Fixed a bug that caused very wide screen displays to calculate an incorrect FOV.\n* Windowed mode now allows resizing of the window.\n* Window position is now remembered and restored on game shutdown/startup.\n* Graphics initialization now has better error handling and exception recovery.\n* Added a game launcher that allows changing video settings if the game doesnÂ¡Â¯t display properly on startup.\n* The game launcher only shows if an error occurred, on first time startup, ctrl is held on startup, or /launcher is on the command line.\n* Added selection of refresh rate to graphics settings\n* Added selection of graphics adapter to graphics settings.\n* Save games now check for truncation and crc validation to make sure save games havenÂ¡Â¯t been corrupted.\n* The scene shown on the background of the main menu now has better error checking in case the file has become corrupt. If the file is corrupt it will show the original scene that the game shows on first time startup.\n* Files are now created in a temp directory and are moved after writes complete. This stops partial files from being created if a thread crashes while a background thread is performing file I/O.","torrent":{"xt":"urn:btih:ab725b0d9b5d842c91b1fdb07520ae93ea9b796c","amp;dn":"Banished+v1.0.2+Beta+Build+3DM+-+KATODY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab725b0d9b5d842c91b1fdb07520ae93ea9b796c","infoHashBuffer":{"type":"Buffer","data":[171,114,91,13,155,93,132,44,145,177,253,176,117,32,174,147,234,155,121,108]},"announce":[],"urlList":[]}}