{"title":"Thomas Merton - The Wisdom of the Desert (pdf)","uid":8632375,"size":930950,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac3592ebe0c2101142657299397ba04cc5e70f17&amp;dn=Thomas+Merton+-+The+Wisdom+of+the+Desert+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"pharmakate","files":-1,"time":1372661910,"description":"Thomas Merton - The Wisdom of the Desert (New Directions, 1960). 81 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nShort book consisting of an essay on the early Christian desert fathers, followed by Merton's selection of excerpts from the classic work Sayings of the Desert Fathers.\n\ndescription:\n\nThe Wisdom of the Desert was one of Thomas Merton's favorites among his own books - surely because he had hoped to spend his last years as a hermit.\n\nThe personal tones of the translations, the blend of reverence and humor so characteristic of him, show how deeply Merton identified with the legendary authors of these sayings and parables, the fourth-century Christian Fathers who sought solitude and contemplation in the deserts of the Near East.\n\nThe hermits of Skete who turned their backs on a corrupt society remarkably like our own had much in common with the Zen masters of China and Japan, and Father Merton made his selection from them with an eye to the kind of impact produced by the Zen mondo.\n\nAbout the Author\n\nThomas Merton (1915-1968) entered the Cistercian Abbey of Gethsemani in Kentucky, following his conversion to Catholicism and was ordained Father M. Louis in 1949. During the 1960s, he was increasingly drawn into a dialogue between Eastern and Western religions and domestic issues of war and racism. In 1968, the Dalai Lama praised Merton for having a more profound knowledge of Buddhism than any other Christian he had known. Thomas Merton is the author of the beloved classic The Seven Storey Mountain.","torrent":{"xt":"urn:btih:ac3592ebe0c2101142657299397ba04cc5e70f17","amp;dn":"Thomas+Merton+-+The+Wisdom+of+the+Desert+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac3592ebe0c2101142657299397ba04cc5e70f17","infoHashBuffer":{"type":"Buffer","data":[172,53,146,235,224,194,16,17,66,101,114,153,57,123,160,76,197,231,15,23]},"announce":[],"urlList":[]}}