{"title":"Filmfare 100 Best Movies of All Time (gnv64)","uid":10587385,"size":91146732,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac73d704070623e8225e39cead0c9e74381b95b2&amp;dn=Filmfare+100+Best+Movies+of+All+Time+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"gnv65","files":-1,"time":1405762647,"description":"Filmfare 100 Best Movies of All Time\nEnglish | April 2003 | PDF | 81 pages | 86.9 mb\nscanned to PDF by me.\n\nThere's something about a 100 that makes us feel euphoric. The party for Indian cinema turning 100 began in 2012 and continues to ring in our ears even as a hundred more Indian films are being canned every month in 2013. Filmfare is celebrating 100 years of Indian cinema by compiling its list of best films. But the quantum seems inadequate and in all honesty unfair. In 100 years there have been so many movies we've held close to our hearts. There have been so many moments on the silver screen when all we could do was get emotional. But Filmfare has had to overlook many gems in an effort to put forth a definite 100 films that have stood the test of time. And we assume shall continue to do so. This isn't the list. Believe us, if we had a free hand we'd have compiled a 1000 movie list. Instead, we prefer a hot list that stands for what is the best of our cinema. Yes no amount of commiserations can console the runners up who didn't make the cut. But every single movie featured in the following list deserves its place at the top of the marquee. Movie maniacs DEVESH SHARMA and RACHIT GUPTA take you through a 100 blasts from the past.","torrent":{"xt":"urn:btih:ac73d704070623e8225e39cead0c9e74381b95b2","amp;dn":"Filmfare+100+Best+Movies+of+All+Time+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac73d704070623e8225e39cead0c9e74381b95b2","infoHashBuffer":{"type":"Buffer","data":[172,115,215,4,7,6,35,232,34,94,57,206,173,12,158,116,56,27,149,178]},"announce":[],"urlList":[]}}