{"title":"Michael Jackson 24 Bit Vinyl Pack","uid":9076022,"size":26111549059,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:acc86fb1e132b0f450d7cf109cde0e513f4c5752&amp;dn=Michael+Jackson+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":9,"uploader":"politux","files":-1,"time":1382291213,"description":"\n  Michael Jackson 24 Bit Vinyl Pack\n\n  Genres: R&amp;B, Pop/Rock\n  Styles: Motown, Pop, Soul\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,900 - 5,600 kbps\n  Bit Depth: 24\n  Sampling Rates: 96,000, 192,000 Hz\n\n  1979 Off the Wall (three versions)\n  1982 Thriller (Sony Mastersound)\n  1987 Bad (two versions)\n  1991 Dangerous\n  1993 Gone Too Soon (Single)\n  1995 HIStory\n  1997 Blood on the Dance Floor\n  2001 Invincible\n  2006 Smooth Criminal (Single)\n  2008 Thriller 25\n  2011 Behind the Mask (Single)\n\n  Michael Jackson was unquestionably the biggest pop star of the '80s, and certainly one of the most popular recording artists of all time. In his prime, Jackson was an unstoppable juggernaut, possessed of all the tools to dominate the charts seemingly at will: an instantly identifiable voice, eye-popping dance moves, stunning musical versatility, and loads of sheer star power. His 1982 blockbuster Thriller became the biggest-selling album of all time (probably his best-known accomplishment), and he was the first black artist to find stardom on MTV, breaking down innumerable boundaries both for his race and for music video as an art form. Yet as Jackson's career began, very gradually, to descend from the dizzying heights of his peak years, most of the media's attention focused on his increasingly bizarre eccentricities; he was often depicted as a man-child in a state of arrested development, completely sheltered from adult reality by a life spent in show business. The snickering turned to scandal in 1993, when Jackson was accused of molesting a 13-year-old boy; although he categorically denied the charges, his out-of-court settlement failed to restore his tarnished image. He never quite escaped the stigma of those allegations, and while he continued to sell records at superstar-like levels, he didn't release them with enough frequency (or, many critics thought, inspiration) to once again become better known for his music than his private life. Whether as a pop icon or a tabloid caricature, Jackson always remained bigger than life.","torrent":{"xt":"urn:btih:acc86fb1e132b0f450d7cf109cde0e513f4c5752","amp;dn":"Michael+Jackson+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acc86fb1e132b0f450d7cf109cde0e513f4c5752","infoHashBuffer":{"type":"Buffer","data":[172,200,111,177,225,50,176,244,80,215,207,16,156,222,14,81,63,76,87,82]},"announce":[],"urlList":[]}}