{"title":"Dire Straits - Making Movies (1980) 2012 SHM-SACD-DFF","uid":11019089,"size":1626342502,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ad781922d392973f86cc912808505a72b2253faf&amp;dn=Dire+Straits+-+Making+Movies+%281980%29+2012+SHM-SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"hal4000","files":-1,"time":1410543825,"description":"Dire Straits were a British rock band, formed in 1977 by Mark Knopfler (lead vocals and lead guitar), his younger brother David Knopfler (rhythm guitar and backing vocals), John Illsley (bass guitar and backing vocals), and Pick Withers (drums and percussion). Dire Straits' sound drew from a variety of musical influences, including jazz, folk, and blues, and came closest to beat music within the context of rock and roll. Despite the prominence of punk rock during the band's early years, the band's stripped-down sound contrasted with punk, demonstrating a more &quot;rootsy&quot; influence that emerged from pub rock. Many of Dire Straits' compositions were melancholic. Dire Straits' biggest selling album, Brothers in Arms, has sold over 30 million copies, and was the first album to sell a million copies on Compact Disc.\n\nWithout second guitarist David Knopfler, Dire Straits began to move away from its roots rock origins into a jazzier variation of country-rock and singer/songwriter folk-rock. Naturally, this means that Mark Knopfler's ambitions as a songwriter are growing, as the storytelling pretensions of Making Movies indicate. Fortunately, his skills are increasing, as the lovely &quot;Romeo and Juliet,&quot; &quot;Tunnel of Love,&quot; and &quot;Skateaway&quot; indicate. And Making Movies is helped by a new wave-tinged pop production, which actually helps Knopfler's jazzy inclinations take hold. The record runs out of steam toward the end, closing with the borderline offensive &quot;Les Boys,&quot; but the remainder of Making Movies ranks among the band's finest work.\n\nDFF files extracted with Scarletbook\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&lt;/a&gt;\n\nfrom the Japanese 2012 SHM-SACD.\n\nSHM-SACD-ISO-DFF-1Bit-2.8Mhz.","torrent":{"xt":"urn:btih:ad781922d392973f86cc912808505a72b2253faf","amp;dn":"Dire+Straits+-+Making+Movies+%281980%29+2012+SHM-SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad781922d392973f86cc912808505a72b2253faf","infoHashBuffer":{"type":"Buffer","data":[173,120,25,34,211,146,151,63,134,204,145,40,8,80,90,114,178,37,63,175]},"announce":[],"urlList":[]}}