{"title":"Operative Orthopedics of the Upper Extremity (McGraw Hill) [PDF]","uid":10600917,"size":79511465,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:adac05d394bf02da4cda3e0d7a79b06ab1220eb0&amp;dn=Operative+Orthopedics+of+the+Upper+Extremity+%28McGraw+Hill%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"tahir99","files":-1,"time":1405923554,"description":"Operative Orthopedics of the Upper Extremity\n\nby David Slutsky (Author)\n\nTRUE PDF, BOOKMARKED and INDEXED\n\nimage\n\nISBN-13: 978-0071789271 ISBN-10: 0071789278 Edition: 1st April 18, 2014\n\nFull-color, step-by-step instruction in the treatment of injuries and disorders of the upper extremity from the shoulder to the fingertip.\n\nWith nearly 100 outstanding international contributors and more than 1200 full-color photographs and illustrations, Operative Orthopedics of the Upper Extremity offers the latest, cutting edge treatment of the upper extremity from the shoulder to the fingertips.\n\nThe book covers injuries and disorders of the hand, carpus, distal radius, distal radioulnar joint, forearm, elbow, and shoulder. The chapters are organized both by level and anatomic structure starting with repair or reconstruction of the bone, joint and ligaments and progressing to the nerves, tendons and soft tissue. Each chapter includes the indications, contraindications, surgical techniques and postoperative management oftentimes by the originators of the technique, in addition to numerous pearls and possible pitfalls. When reconstruction is not possible, a section on salvage procedures covers the suitable options.\n\nOperative Orthopedics of the Upper Extremity provides a one-stop resource for the treatment of injuries of the upper extremity. It provides essential material for both certification and recertification and will prove to be invaluable to both the entry level surgeon as well as the seasoned operator.\n","torrent":{"xt":"urn:btih:adac05d394bf02da4cda3e0d7a79b06ab1220eb0","amp;dn":"Operative+Orthopedics+of+the+Upper+Extremity+%28McGraw+Hill%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adac05d394bf02da4cda3e0d7a79b06ab1220eb0","infoHashBuffer":{"type":"Buffer","data":[173,172,5,211,148,191,2,218,76,218,62,13,122,121,176,106,177,34,14,176]},"announce":[],"urlList":[]}}