{"title":"EXPLOITED COLLEGE GIRLS - Bella - Redhead Creampied Teen","uid":11697784,"size":637678472,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:add7b4fe68cd0e32a783a8c64473a2d59bcebaf5&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Bella+-+Redhead+Creampied+Teen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"beta2008x","files":1,"time":1423792893,"description":" &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=fjg78_blla.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=fjg78_blla.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=r3n7g_ecgbella_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=r3n7g_ecgbella_s.jpg&lt;/a&gt;\n\nAt the tender age of 18 innocent, shy Bella has decided to explore show business with the help of Ex Co Gi. While she isn't especially stunning in any particular way, she's very cute in a girl next door sort of way and what will captivate you is her genuine, enthusiastic sexiness. When she finally orgasms with Jay, it's possibly one of the cutest O's we've ever offered on the site. Jay find just the right angle to poke her g spot and she's almost taken by surprise when she cums. Before the big moment, however, let's get to know Bella a little better. She's a cute 18 year old girl from Average, USA so you know she's led a fascinating life that Jay can't help but get into. For example, there's her cute habit of taking sexy selfies. And then there's, uh. Lots of other stuff. Anyway, moving on, this ain't the Biography channel, let's get her naked! Her perky 18 year old titties and nicely shaped backside compliment her exotic skin and dark eyes, so if not a home run, she's a stand up double for Latina lovers. Bella isn't big on sex toys, but when Jay unveils a vibrator and demonstrates its proper use she's quickly sold on the idea and nearly orgasms from it. He doesn't quite get her off, most likely because of the way she bites her lower lip just taunts a man with the thought of a beej. The term 'dick sucking lips' applies here, and when she wraps them around Jay's, it's magical. From slow and steady to gagging on the whole thing, DSL. It's a thing. After trying every position he can think of to poke her g spot, Jay finally finds the target as he gets her on her side and hits her from behind. Bella then has the cutest, most non-porn orgasm in the history of recorded porn. Which then goes totally 100% porn when Jay follows up by unleashing a load in her for an awesome creampie ending. He gets several close ups of after explaining to Bella exactly what a creampie is and how it works, and there's a great replay for all you jizz lovers","torrent":{"xt":"urn:btih:add7b4fe68cd0e32a783a8c64473a2d59bcebaf5","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Bella+-+Redhead+Creampied+Teen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"add7b4fe68cd0e32a783a8c64473a2d59bcebaf5","infoHashBuffer":{"type":"Buffer","data":[173,215,180,254,104,205,14,50,167,131,168,198,68,115,162,213,155,206,186,245]},"announce":[],"urlList":[]}}