{"title":"Zooskool Collection Of 67 Videos! BEAST PORN","uid":4617809,"size":15398288912,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:addf987818d04df6f0509844f3805ca362784c0d&amp;dn=Zooskool+Collection+Of+67+Videos%21+BEAST+PORN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":15,"uploader":"cetipabo2","files":133,"time":1230911814,"description":"There it is the symbol of quality only Zooskool can provide in their video's. Sure we have all seen vids with Zooskool name, but why? Because people know Zooskool is best beast porn out there in my opinion. Real, raw, wet animal sex. Sure they have a few 'under par' vids out there but oh well no one's perfect.\nThis Collection took a tiresome long time to complete and I can swear on my hairy pussy that there are vids in this collection you have not seen yet. Take example of the screen, it is from the vid Timberwolf - Gothic Dog which is one I personally haven't seen on PB nor on any other site, but I managed to gather up (don't ask how just lucky,lol) Anyway like I said lotta new material or stuff they had lying around and finally brought out I dunno I could be wrong. Needless to say its a huge collection that took some sweat off my chest to complete so a little thanx goes a long way. Please remember to seed because if you don't it will swallow your ratio up. I've also included (of course duh!) the very 1st Zooskool exclusive horse vid which can be found here also and still has plenty of seeds \n\nDon't matter if you download whole collection or just a few video's I believe is worth the wait in download and seeding time so be patient. ENJOY!!!!!!!!!!!!!!!!!!  And screens have been separated so you can pick n choose or just check and see whjat your getting, and oops one screen had to be omitted because it was unviewable.","torrent":{"xt":"urn:btih:addf987818d04df6f0509844f3805ca362784c0d","amp;dn":"Zooskool+Collection+Of+67+Videos%21+BEAST+PORN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"addf987818d04df6f0509844f3805ca362784c0d","infoHashBuffer":{"type":"Buffer","data":[173,223,152,120,24,208,77,246,240,80,152,68,243,128,92,163,98,120,76,13]},"announce":[],"urlList":[]}}