{"title":"The Trip (lsd) [ classic Roger Corman 1967 ]","uid":3785254,"size":733063626,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:adf719aefb9e8356f3cdc9e88b8e4d29760ecb17&amp;dn=The+Trip+%28lsd%29+%5B+classic+Roger+Corman+1967+%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"LTDigilusion","files":2,"time":1188155516,"description":"Trip, The    \n\nYear    : 1967\n  \nDirector: Roger Corman\n  \nStars   : Peter Fonda, Susan Strasberg, Bruce Dern, Dennis Hopper,      \n\n     Salli Sachse, Barboura Morris, Judy Lang, Beach Dickerson,         \n\n  Luana Anders, Dick Miller, Michael Nader, Michael Blodgett,           \n\nAngelo Rossitto \n \nGenre   : Weirdo \n\nReview  : Paul (Peter Fonda) is a director of television commercials    \n\n       who feels the need to go on a journey of self-discovery now      \n\n     that his marriage is over. He meets up with John (Bruce Dern)      \n\n     and they go to a party so that Paul can try LSD for the first      \n\n     time, with John as his guide. Paul relaxes as the drug takes       \n\n    hold, but is unprepared for the barrage of images that he           \n\nsees, and ends up wandering the streets, stoned...\n\n          This famous attempt to put the full LSD experience onto film  \n\n         was written by Jack Nicholson (yes, that Jack Nicholson). As   \n\n        Roger Corman and American International Pictures moved          \n\n further into the sixties, they realised they had to cash in           \n\non the growing counterculture - sending up the beatniks in a           \n\nBucket of Blood style wasn&amp;#039;t going to work with the hippies.           \n\nSo we are offered this testament to dropping acid, complete           \n\nwith sober disclaimer at the start warning us of this problem           \n\n- they couldn&amp;#039;t be seen to be endorsing it, after all.\n\n          The Trip looks like a quaint relic of the times now, which is \n\n          why it&amp;#039;s strangely appealling to see Fonda undergo his        \n\n   consciousness expansion. We know when he&amp;#039;s hallucinating           \n\nbecause he is no longer wearing slacks and a V-neck jumper,           \n\nnow he is wearing a shirt with puffy sleeves, sandals and a           \n\nmedallion instead. The visions range from Tolkien-esque black           \n\nriders and a hobbit to Edgar Allen Poe Gothic castles, with           \n\nsome sex romps in between. The projection of abstract images           \n\nworks quite well, especially on faces, and may remind you of           \n\nthe Stargate sequence of 2001 on a low budget.\n\n          As a guide, John proves to be largely unhelpful, because      \n\n     after he has talked Paul through the first half of the trip,       \n\n    he proceeds to menace him with a chair and then accidentally        \n\n   let him escape into the night. Once outside, Paul breaks into        \n\n   a house to watch Vietnam news on TV, visits a launderette to         \n\n  gaze lovingly at the washing machines and tumble dryers, then         \n\n  ends up at a club where much dancing, body-painted naked           \n\nwomen and bongo playing is going on.\n\n          Although Paul has to stand trial in his own mind (with Dennis \n\n          Hopper as the judge!) as to the merits of his commercials,    \n\n       the apparent accusations of being part of selfish consumer       \n\n    culture ring hollow, considering he&amp;#039;s the one who&amp;#039;s being           \n\nself-centred enough to seek his own inner truth. And the           \n\nmusic is undistinguished, vaguely psychedelic rock played by           \n\nElectric Flag, when what you would rather hear is Piper at           \n\nthe Gates of Dawn or whatever. Watching The Trip is a bit           \n\nlike being told someone else&amp;#039;s dreams for over an hour -           \n\ninteresting for them, but you feel a little excluded. Still,           \n\nit&amp;#039;s experimental cinema by Roger Corman, and on that basis,           \n\nentertaining enough. Also with: a cheeky monkey. \n \nReviewer: Graeme Clark \n\nRoger Corman  (1926 - )\n\nLegendary American B-Movie producer and director who, from the fifties \n\nonwards, offered low budget thrills with economy and flair. Early films \n\ninclude It Conquered the World, Not of This Earth, Attack of the Crab \n\nMonsters, A Bucket of Blood, The Little Shop of Horrors and X. The \n\nIntruder was a rare attempt at social comment.\n\nCome the sixties, Corman found unexpected respectability when he \n\nadapted Edgar Allan Poe stories for the screen: House of Usher, The Pit \n\nand The Pendulum, The Masque of the Red Death and The Tomb of Ligeia \n\namong them, usually starring Vincent Price. He even tried his hand at \n\ncounterculture films such as The Wild Angels, The Trip and Gas!, before \n\nturning to producing full time in the seventies.\n\nMany notable talents have been given their break by Corman, such as \n\nFrancis Ford Coppola, Martin Scorcese, Monte Hellman, Jonathan Demme, \n\nJoe Dante, James Cameron and Peter Bogdanovich. Corman returned to \n\ndirecting in 1990 with the disappointing Frankenstein Unbound.\n\n&lt;=LT=&gt;","torrent":{"xt":"urn:btih:adf719aefb9e8356f3cdc9e88b8e4d29760ecb17","amp;dn":"The+Trip+%28lsd%29+%5B+classic+Roger+Corman+1967+%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adf719aefb9e8356f3cdc9e88b8e4d29760ecb17","infoHashBuffer":{"type":"Buffer","data":[173,247,25,174,251,158,131,86,243,205,201,232,139,142,77,41,118,14,203,23]},"announce":[],"urlList":[]}}