{"title":"Ramit Sethi - How To Talk To Anybody (Compressed Version)","uid":11780951,"size":3852215069,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ae02f65ff3f679068d6f076c8a21c57cb0fe12bf&amp;dn=Ramit+Sethi+-+How+To+Talk+To+Anybody+%28Compressed+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"acer47x","files":59,"time":1427570678,"description":"Trying to talk to people can be so stressful - how do we know what to say? \nWe think we have so much to offer, that if people just &quot;got us&quot; they'd LOVE us...but when we try to have a conversation, we put our foot in our mouth. \n\n\nRamit My name is Ramit Sethi and I'm the author behind I Will Teach You To Be Rich. Over the years, I've noticed that you can have the best technical skills in the world - but if you don't learn to communicate with the people around you, it doesn't matter. \nAfter years of figuring out what separates the social &quot;naturals&quot; from everyone else, I finally cracked the code. Now, I want to show you how you can talk to anyone, anywhere, anytime (even if you've always been socially awkward). \n&quot;How do I stop being so awkward?&quot; \nToday, I invite you to see the exact strategies, methods, and tactics you can use to improve your social skills IMMEDIATELY. Here's just some of what I'll share with you: How to make conversations fun and engaging, using social experiments the &quot;naturals&quot; have been using for years \nA simple framework to ensure you'll never run out of things to say again \nHow to entertain a group of people effortlessly (while overcoming challenges like interruptions, distractions, and large audiences) \nWhat restaurant desserts can teach you about social skills \nAnd much","torrent":{"xt":"urn:btih:ae02f65ff3f679068d6f076c8a21c57cb0fe12bf","amp;dn":"Ramit+Sethi+-+How+To+Talk+To+Anybody+%28Compressed+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae02f65ff3f679068d6f076c8a21c57cb0fe12bf","infoHashBuffer":{"type":"Buffer","data":[174,2,246,95,243,246,121,6,141,111,7,108,138,33,197,124,176,254,18,191]},"announce":[],"urlList":[]}}