{"title":"Android Gameboy Advance Emulator + 1666 ROMs","uid":13691510,"size":7310971590,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:ae4ad77b00331b871d509e96d56fd21a3bf02c48&amp;dn=Android+Gameboy+Advance+Emulator+%2B+1666+ROMs&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Androider","files":2,"time":1456621130,"description":"My Boy! is a super fast and full-featured emulator to run GameBoy Advance games on the broadest range of Android devices, from very low-end phones to modern tablets. It emulates nearly all aspects of the real hardware correctly.\r\n\r\nThis is by far the only emulator that supports link cable emulation with decent speed.\r\n\r\nHighlights:\r\n\r\n• Fastest emulation, therefore saves your battery to the MAX.\r\n• Very high game compatibility. Run nearly all games without a problem.\r\n• Link cable emulation either on the same device, or across devices over Bluetooth or Wi-Fi.\r\n• Gyroscope/tilt/solar sensor and rumble emulation through your Android's hardware sensors and vibrator!\r\n• Enter multilined GameShark/ActionReplay/CodeBreaker cheat codes and enable/disable them on the fly while the game is running.\r\n• High-level BIOS emulation. No BIOS file needed.\r\n• IPS/UPS ROM patching\r\n• OpenGL rendering backend, as well as normal rendering on devices without a GPU.\r\n• Cool video filters through the support of GLSL shaders.\r\n• Fast-forward to skip long stories, as well as slow down games to get past a level you cannot in normal speed.\r\n• Save games at any time with screenshot\r\n• On-screen keypad (multi-touch requires Android 2.0 or later), as well as shortcut buttons such as load/save.\r\n• A very powerful screen layout editor, with which you can define the position and size for each of the on-screen controls, as well as for the game video.\r\n• External controllers support, such as the MOGA controllers.\r\n• Clean &amp; simple yet well-designed user interface. Seamlessly integrated with the latest Android.\r\n• Create and switch to different screen-layout and key-mapping profiles.\r\n• Create shortcuts to easily launch your favorite games from your desktop.\r\n\r\nWhat's New:\r\n\r\n• [core] New alternative interpreter CPU emulation core. Not as fast as the DynaRec core (the default), but still very fast. Improves speed for a few games that depend heavily on self-modifying code.\r\n• Fixed crash on Marshmallow for certain devices with external SD card.\r\n• Fixed layout editor on devices that cannot auto rotate.\r\n• Always show menu button on default screen layout.\r\n\r\nMore Info:\r\n \nhttps://play.google.com/store/apps/details?id=com.fastemulator.gba","torrent":{"xt":"urn:btih:ae4ad77b00331b871d509e96d56fd21a3bf02c48","amp;dn":"Android+Gameboy+Advance+Emulator+%2B+1666+ROMs","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae4ad77b00331b871d509e96d56fd21a3bf02c48","infoHashBuffer":{"type":"Buffer","data":[174,74,215,123,0,51,27,135,29,80,158,150,213,111,210,26,59,240,44,72]},"announce":[],"urlList":[]}}