{"title":"Multilizer 2011 Enterprise 7.8.5-CORE","uid":6444960,"size":40677942,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ae67549cf13aeeb9c60aeab4e1ba7647ca54620d&amp;dn=Multilizer+2011+Enterprise+7.8.5-CORE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1307061064,"description":"Multilizer 2011 Enterprise 7.8.5\n\nMultilizer is a unique solution combining different localization methods. Multilizer grows and evolves together with your software. Multilizer can be used to localize almost any document or software. Currently there are over 30 different file formats that Multilizer supports. We are constantly integrating different technologies and file formats by providing plug-ins that expand and work seamlessly with Multilizer applications.\n\nMultilizer offers the following benefits:\n\n- Automatic validation and fixing translation errors multiple hotkeys, missing colons, etc.\n- Make Quality Assurance faster and interactive with WYSIWYG editors and translation status information.\n- Re-engineer the user interface with WYSIWYG editors to make translated texts fit in the user interface without modifying the source code.\n- Reduce translation work by importing translations from, for example, Microsoft glossary or by reusing translations.\n- Ship just one version of your software let your users switch application language during run-time.\n- Localize icons, bitmaps etc. without compiling or modifying the source code.\n- Outsource translations with the free Multilizer Translator Edition which creates packages containing either just all the material to be translated or also the actual free translation tool, Multilizer for Translators.\n- In addition these packages can be sent to unlimited number of translators for free.\n- Achieve faster time-to-market by integrating localization into your build process Localization and translation is typically a co-operation effort.\n- Multilizer tools are built to benefit all parties involved in the localization and translation project.\n\nHome Page - http://www.multilizer.com/\n\n","torrent":{"xt":"urn:btih:ae67549cf13aeeb9c60aeab4e1ba7647ca54620d","amp;dn":"Multilizer+2011+Enterprise+7.8.5-CORE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae67549cf13aeeb9c60aeab4e1ba7647ca54620d","infoHashBuffer":{"type":"Buffer","data":[174,103,84,156,241,58,238,185,198,10,234,180,225,186,118,71,202,84,98,13]},"announce":[],"urlList":[]}}