{"title":"Bridge to Haven by Francine Rivers","uid":10071973,"size":5105766,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:afe53e2875b172d5b8f3f6260717b4acfaa42e11&amp;dn=Bridge+to+Haven+by+Francine+Rivers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"PirateBook","files":1,"time":1398868826,"description":"\nTo those who matter in 1950s Hollywood, Lena Scott is the hottest rising star to hit the silver screen since Marilyn Monroe. Few know her real name is Abra. Even fewer know the price she's paid to finally feel like she's somebody.\n\nTo Pastor Ezekiel Freeman, Abra will always be the little girl who stole his heart the night he found her, a wailing newborn abandoned under a bridge on the outskirts of Haven. Zeke and his son, Joshua--Abra's closest friend--watch her grow into an exotic beauty. But Zeke knows the circumstances surrounding her birth etched scars deep in her heart, scars that leave her vulnerable to a fast-talking bad boy who proclaims his love and lures her to Tinseltown.\n\nHollywood feels like a million miles from Haven, and naive Abra quickly learns what's expected of an ambitious girl with stars in her eyes. But fame comes at an awful price. She has burned every bridge to get exactly what she thought she wanted. Now, all she wants is a way back home.\n\nIn this riveting and highly anticipated tale of temptation, grace, and unconditional love, &quot;New York Times&quot; best-selling author Francine Rivers delivers big-canvas storytelling at its very best.\n\nGenre: Fiction/Historical/Religious","torrent":{"xt":"urn:btih:afe53e2875b172d5b8f3f6260717b4acfaa42e11","amp;dn":"Bridge+to+Haven+by+Francine+Rivers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afe53e2875b172d5b8f3f6260717b4acfaa42e11","infoHashBuffer":{"type":"Buffer","data":[175,229,62,40,117,177,114,213,184,243,246,38,7,23,180,172,250,164,46,17]},"announce":[],"urlList":[]}}