{"title":"The Kentroversy Tapes - The Gerson Anti-Cancer Therapy (2007-07-","uid":3755968,"size":22164829,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b03c50fd0943e44a7047ae324f39f3f992b21bf4&amp;dn=The+Kentroversy+Tapes+-+The+Gerson+Anti-Cancer+Therapy+%282007-07-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"grinreaper_CCE","files":2,"time":1185647960,"description":"The seventh episode of THE KENTROVERSY TAPES podcast features an interview with Mr. Howard Straus, the grandson of Dr. Max Gerson, a general practitioner physician who was assassinated for being far too successful in the treatment of Cancer and many other ailments.\n\nEpisode # 07 of The Kentroversy Tapes features an interview with Mr. Howard Straus; the grandson of Dr. Max Gerson, a Cancer doctor who developed a holistic homeopathic therapy in the treatment of Cancer, and other ailments, such as Diabetes and Liver damage, plus many other conditions and diseases.\n\nI am highlighting this therapy, because I am participating in this for my own health reasons. I have Hepatitis-related liver damage, and the Gerson Therapy will be able to completely filter and regenerate this organ within a time period of eighteen to twenty-four months.\n\nDuring the next two years, as I make my way through this process, I will periodically update my listeners on my own progress, as I will hopefully show these same listeners a new and much more healthy way to eat and take care of themselves.\n\nDuring this hour-long interview, Howard and I talk about Dr. Max Gerson and his Gerson Therapy. We discuss what this therapy program consists of, and what it entails for one to follow the program. We also talked about HOW Dr. Gerson was attacked by his enemies who controlled the American Medical Association, and who was likely assassinated by his personal secretary, who had been bought off by agents of the Rockefeller family, who were hiding a BIG SECRET.\n\nThis conflict of interest on the part of the Rockefeller family was contained within the fact that this family controls the patents, copyrights, trademarks, and so forth to the entire chemotherapy process that had been developed through their own Memorial Sloan-Kettering Cancer Center, located in New York City.\n\nHoward also told me about how these people HATE to have their PROFIT POTENTIAL affected by competing therapy modalities.\n\nThen, we talk about the problems with the unsafe food supply, the overuse of antibiotics, and the Avian Flu hoax. \n &lt;a href=&quot;\nhttp://www.kentroversytapes.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kentroversytapes.net/&lt;/a&gt;\n\n------------------------------------------------\n\nTech specs:\n\nSize: 22162037 bytes\nHeader found at: 0 bytes\nEncoder Delay: 576, Zero Padding: 1344\nLength: 3714 seconds (62 minutes)\nMPEG-1 layer 3\n47kbit (VBR), 142207 frames\n44100Hz Mono\nCRCs: No, Copyrighted: No\nOriginal: Yes, Emphasis: None\n\n===============================================================================\nOur leaders lie, cheat, steal and kill seemingly without impunity. Find out why @ &lt;a href=&quot;\nhttp://conspiracycentral.net:6969/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.net:6969/index.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://conspiracycentral.info/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.info/index.php&lt;/a&gt;\n===============================================================================\n\n","torrent":{"xt":"urn:btih:b03c50fd0943e44a7047ae324f39f3f992b21bf4","amp;dn":"The+Kentroversy+Tapes+-+The+Gerson+Anti-Cancer+Therapy+%282007-07-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b03c50fd0943e44a7047ae324f39f3f992b21bf4","infoHashBuffer":{"type":"Buffer","data":[176,60,80,253,9,67,228,74,112,71,174,50,79,57,243,249,146,178,27,244]},"announce":[],"urlList":[]}}