{"title":"2015 Guide to Literary Agents [Epub &amp; Mobi] [StormRG]","uid":11572096,"size":6819658,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0d7a7cbf6365d73e9f6caf01662c97c8242ecc9&amp;dn=2015+Guide+to+Literary+Agents+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"krystine","files":-1,"time":1417040645,"description":"2015 Guide to Literary Agents: The Most Trusted Guide to Getting Published\nAuthor: Chuck Sambuchino \nPublished: 2014\nPublisher: Writer's Digest Books\nISBN: 9781599638430\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\n\nThe best resource available for finding a literary agent!\n\nNo matter what you're writing--fiction or nonfiction, books for adults or children--you need a literary agent if you want to get the best traditional publishing book deal possible. The 2015 Guide to Literary Agents is your essential resource for finding that literary agent and getting your book bought by a top publisher. Along with listing information for more than 1,000 literary agents who represent writers and their books, this new, updated edition of GLA includes:\n\n--&quot;10 Reasons Agents Reject Your Manuscript&quot;--helping you learn what not to do during the submission process\n--&quot;New Agent Spotlights&quot;--profiles of literary reps actively building their client lists right now\n--13 debut author success stories: Writers explain their paths to publication, so you can learn from their successes and see what they did right\n--Informative how-to articles on query letters, synopsis writing, voice and craft, platform and blogging, nonfiction book proposals, and more\n\n*Includes access to the webinar &quot;Everything You Need to Know About Getting an Agent&quot; from Chuck Sambuchino, editor of Guide to Literary Agents* In this 90-minute webinar, you'll learn how to compose a query letter, what makes up a compelling pitch, synopsis writing tips, how to research/find agents, and much more","torrent":{"xt":"urn:btih:b0d7a7cbf6365d73e9f6caf01662c97c8242ecc9","amp;dn":"2015+Guide+to+Literary+Agents+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0d7a7cbf6365d73e9f6caf01662c97c8242ecc9","infoHashBuffer":{"type":"Buffer","data":[176,215,167,203,246,54,93,115,233,246,202,240,22,98,201,124,130,66,236,201]},"announce":[],"urlList":[]}}