{"title":"Sex - Sex and Culture by J. D. Unwin","uid":4341114,"size":68403272,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1a53eba0468ea338f7a63e7d0f4047617065287&amp;dn=Sex+-+Sex+and+Culture+by+J.+D.+Unwin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"leraconteur","files":1,"time":1218600298,"description":"This is a zip file of an incredible book called &quot;Sex and Culture&quot; by J. D. Unwin published in 1934. The book analyzes 80 primitive cultures (anthropology) and a number of past empires (history) and finds that, without exception, the level of advancement or decline of all cultures is directly tied to the level of regulation of female sexuality. His historical examples include the Sumerians, Babylonians, Athenians, Romans, Teutons, and Anglo-Saxons (600s - 900s), and English (1500s - 1900s). In every example, these cultures began to rise when women were required to be virgins at marriage and to be monogamous for life. All of these cultures began to decline when women were given rights, were not required to be virgins at marriage, when divorce was common, and marriage was in decline.\n\n5 versions of the book in this zip file:\n\n    * Plain Text Format - readable but not too enjoyable, some strange characters due to conversion.\n    * Html, Mhtml, Word format - also not too enjoyable to read, single space between each character can be annoying.\n    * Original PDF - converted so text can be searched, selected, and copied - ** most enjoyable format to read IMO.\n\nFile Under:\nMGTOW, Men's Rights,mens rights, MRA, FRA, anti-feminism, feminism, mra, fra, Father's Rights, fathers rights, misandry, anti-misandry\n\nThe Essential Men's Right's Library - Torrent #1\n\n\n","torrent":{"xt":"urn:btih:b1a53eba0468ea338f7a63e7d0f4047617065287","amp;dn":"Sex+-+Sex+and+Culture+by+J.+D.+Unwin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1a53eba0468ea338f7a63e7d0f4047617065287","infoHashBuffer":{"type":"Buffer","data":[177,165,62,186,4,104,234,51,143,122,99,231,208,244,4,118,23,6,82,135]},"announce":[],"urlList":[]}}