{"title":"Eagles - Farewell 1 Tour (Live From Melbourne) 2CD","uid":6289876,"size":282357298,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b21674302a4e1895d6aa6fe66c27246628c80dc4&amp;dn=Eagles+-+Farewell+1+Tour+%28Live+From+Melbourne%29+2CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"brianmay2","files":41,"time":1301759711,"description":"Farewell 1 Tour-Live from Melbourne is a double DVD by Eagles, released in 2005 (see 2005 in music). It was filmed in Melbourne, Australia at the Rod Laver Arena on the 14, 15 and 17 of November 2004, in the same name tour, featuring two new songs. It's the second record as quartet, without Don Felder, but featuring a horn section.\nThe name 'Farewell Tour' has nothing to do with the band's plan to quit touring and this is confirmed by Glenn Frey's quote in the interview contained in the DVD: &quot;The longer this goes on, the better these songs sound. There is a 'sort of' honesty in calling the tour Farewell 1, with its implication that Farewell 2 will follow soon.&quot;\nThe show features some great light and sound effects apart from the great music that Eagles is renowned for. The 'five-part' harmony song, &quot;Hole in the World&quot; elicits a great crowd participation with the audience providing a 'clap rhythm' as the band sings. The song &quot;Life's Been Good&quot; features some antics by Joe Walsh and Frey with them staging a mock rivalry on stage and the latter having a hearty laugh at the former. The song also features a 'helmet cam' session where the crowd gets to see what the camera on Walsh's helmet points at. Also, the songs &quot;The Boys of Summer&quot; and &quot;Hotel California&quot; feature the first officially documented use by the Eagles of a drum machine in a live performance; in particular, during &quot;Hotel California&quot;, a pre-programmed track is used to simulate the muted guitar strums which provide a steady beat on the original studio recording of the song, and which are absent from all of the previous live performances of it.\nIn November 2006, the DVD was re-issued at Wal-Mart stores with a bonus 3-track CD which are tasters of the band's upcoming studio album. The tracks are a studio version of Frey's &quot;No More Cloudy Days&quot;, the Henley/Frey penned rocker &quot;Fast Company&quot; and the Henley/Schmit/Smith penned ballad &quot;Do Something&quot;.\n\nTHIS IS THE MPEG VERSION !!!!!!!","torrent":{"xt":"urn:btih:b21674302a4e1895d6aa6fe66c27246628c80dc4","amp;dn":"Eagles+-+Farewell+1+Tour+%28Live+From+Melbourne%29+2CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b21674302a4e1895d6aa6fe66c27246628c80dc4","infoHashBuffer":{"type":"Buffer","data":[178,22,116,48,42,78,24,149,214,170,111,230,108,39,36,102,40,200,13,196]},"announce":[],"urlList":[]}}