{"title":"(2011) Rush - Time Machine 2011-Live in Cleveland (2CD) [FLAC] {","uid":10061544,"size":1156322880,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b290fd8eca99c9c7b68df4fd7536e31deb6567f9&amp;dn=%282011%29+Rush+-+Time+Machine+2011-Live+in+Cleveland+%282CD%29+%5BFLAC%5D+%7B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"100.XY","files":-1,"time":1398739169,"description":"(2011) Time Machine 2011: Live in Cleveland\n\n\nWikipedia:\nRush is a Canadian progressive rock band originally formed in August 1968, in the Willowdale neighbourhood of Toronto, Ontario, currently composed of bassist, keyboardist, and lead vocalist Geddy Lee, guitarist Alex Lifeson, and drummer and lyricist Neil Peart. The band and its membership went through a number of line-up changes between 1968 and 1974, achieving their definitive form when Neil Peart replaced original drummer, John Rutsey, in July 1974.\nThe band released its eponymous debut album in March 1974, after which followed 19 additional studio recordings, 9 live albums and 11 compilations. As a group, Rush possesses 24 gold records and 14 platinum (3 multi-platinum) records, placing them fourth behind the Beatles, Rolling Stones, and Kiss for the most gold and platinum albums by a band in music history. According to the RIAA, Rush's sales statistics also place them third behind The Beatles and The Rolling Stones for the most consecutive gold or platinum albums by a rock band. Rush also ranks 79th in U.S. album sales with 25 million units. Although total worldwide album sales are not calculated by any single entity, as of 2004 several industry sources estimated Rush's total worldwide album sales at over 40 million units.\n\n\nReview:\nRush's career reached an important milestone in 2011 -- the 30th anniversary of the release of the band's masterpiece, Moving Pictures. Its U.S. sales of more than four million copies shows that this is the album that even casual fans like. (Even those who don't &quot;like&quot; Rush tend to like &quot;Tom Sawyer.&quot;) The Canadian trio celebrated the 1981 best-seller with the Time Machine tour, featuring a performance of the album in its entirety. The two-CD set Time Machine 2011: Live in Cleveland captures Rush's sold-out concert on April 15, 2011, at the Quicken Loans Arena in Cleveland, Ohio. Previous live albums were recorded outside the United States, so Rush decided to do this one in the first major city to embrace the band after its hometown of Toronto. In fact, Cleveland essentially launched Rush; the credits on the band's 1974 self-titled debut thank disc jockey/music director Donna Halper from Cleveland's WMMS-FM because she put &quot;Working Man&quot; into rotation. Time Machine 2011: Live in Cleveland chronicles a typically strong, consistent Rush show. Vocalist/bass guitarist/keyboardist Geddy Lee, guitarist Alex Lifeson, and drummer Neil Peart are so talented and technically proficient on their instruments that their herculean performances often seem almost effortless. There are some surprises in the set list and nuances in a few of their classic warhorses to freshen up the songs for themselves and their loyal fan base. The first set kicks off with &quot;The Spirit of Radio&quot; and then Rush immediately throw some unexpected curve balls with &quot;Time Stand Still,&quot; &quot;Presto,&quot; &quot;Stick It Out,&quot; &quot;Workin' Them Angels,&quot; &quot;Leave That Thing Alone,&quot; &quot;Faithless,&quot; and &quot;BU2B.&quot; Admittedly, the pacing lags a bit with this curious blend of a minor hit, album tracks, and a new song, but the energy picks up dramatically with &quot;Free Will,&quot; &quot;Marathon,&quot; and &quot;Subdivisions.&quot; The second set begins with Moving Pictures. The idea of playing the album in its entirety only adds a little extra excitement since side one's songs -- &quot;Tom Sawyer,&quot; &quot;Red Barchetta,&quot; &quot;YYZ,&quot; and &quot;Limelight&quot; -- have been concert staples for years. The big treats are the three rarely performed songs on side two: the spectacular epic &quot;The Camera Eye,&quot; prophetic &quot;Witch Hunt,&quot; and pulsating, reggae-inflected &quot;Vital Signs.&quot; Peart's solo showcase is always a Rush concert highlight and on this tour it's titled &quot;Moto Perpetuo (Featuring Love for Sale).&quot; The excitement grows exponentially as the concert winds up with &quot;Closer to the Heart,&quot; &quot;2112 Overture/The Temples of Syrinx,&quot; &quot;Far Cry,&quot; first encore &quot;La Villa Strangiato,&quot; and the appropriate finale, &quot;Working Man,&quot; which begins as a playful reggae workout before kicking into high gear in its all-out hard rock glory. As a listening experience, Time Machine 2011: Live in Cleveland only tells part of the story. A Rush concert is designed as an overall audio/video show with carefully designed lighting, rear-screen videos and animation, and filmed comedy bits. Therefore, as enjoyable as this live album is to listen to, you owe it to yourself to see the Blu-ray or DVD home video as well.\nReview by Bret Adams \n\n\nimage\n\n\n\nTrack List:\n\nCD1\n01 - The Spirit of Radio\n02 - Time Stand Still\n03 - Presto\n04 - Stick It Out\n05 - Workin' Them Angels\n06 - Leave That Thing Alone\n07 - Faithless\n08 - BU2B\n09 - Free Will\n10 - Marathon\n11 - Subdivisions\n12 - Tom Sawyer\n13 - Red Barchetta\n14 - YYZ\n15 - Limelight\n\nCD2\n01 - The Camera Eye\n02 - Witch Hunt\n03 - Vital Signs\n04 - Caravan\n05 - Moto Perpetuo (feat. Love for Sale)\n06 - O'Malley's Break\n07 - Closer to the Heart\n08 - 2112 Overture , The Temples of Syrinx\n09 - Far Cry\n10 - La Villa Strangiato\n11 - Working Man\n\n\n\nSummary:\nCountry: Canada \nGenres: Progressive rock, hard rock, heavy metal\n\n\nMedia Report:\nSource : CD\nFormat : FLAC\nFormat/Info : Free Lossless Audio Codec, 16-bit PCM\nBit rate mode : Variable\nBit rate : ~859-1000 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nBit depth : 16 bits","torrent":{"xt":"urn:btih:b290fd8eca99c9c7b68df4fd7536e31deb6567f9","amp;dn":"%282011%29+Rush+-+Time+Machine+2011-Live+in+Cleveland+%282CD%29+%5BFLAC%5D+%7B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b290fd8eca99c9c7b68df4fd7536e31deb6567f9","infoHashBuffer":{"type":"Buffer","data":[178,144,253,142,202,153,201,199,182,141,244,253,117,54,227,29,235,101,103,249]},"announce":[],"urlList":[]}}