{"title":"The Valley of Amazement - Amy Tan","uid":9234975,"size":727923,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b349693d4765a0bf7956620876ec435fe705c41c&amp;dn=The+Valley+of+Amazement+-+Amy+Tan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1385153183,"description":"The New York Times bestselling author and international sensation returns with her long-awaited novel, a magnificent family saga of fate and identity that moves from the lavish parlors of Shanghai courtesans to the fog-shrouded mountains of a remote Chinese village\n\nMoving between the dazzling world of courtesans in turn of the century Shanghai, a remote Chinese mountain village, and the rough-hewn streets of nineteenth-century San Francisco, Amy Tan's sweeping new novel maps the lives of three generations of women connected by blood and history-and the mystery of an evocative painting known as &quot;The Valley of Amazement.&quot;\n\nViolet is one of the most celebrated courtesans in Shanghai, a beautiful and intelligent woman who has honed her ability to become any man's fantasy since her start as a &quot;Virgin Courtesan&quot; at the age of twelve. Half-Chinese and half-American, she moves effortlessly between the East and the West. But her talents belie her private struggle to understand who she really is and her search for a home in the world. Abandoned by her mother, Lucia, and uncertain of her father's identity, Violet's quest to truly love and be loved will set her on a path fraught with danger and complexity-and the loss of her own daughter.\n\nLucia, a willful and wild American woman who was once herself the proprietress of Shanghai's most exclusive courtesan house, nurses her own secret wounds, which she first sustained when, as a teenager, she fell in love with a Chinese painter and followed him from San Francisco to Shanghai. Her search for penance and redemption will bring her to a startling reunion with Flora, Violet's daughter, and will shatter all that Violet believed she knew about her mother.\n\nSpanning fifty years and two continents, The Valley of Amazement is a deeply moving narrative of family secrets, the legacy of trauma, and the profound connections between mothers and daughters, that returns readers to the compelling territory Amy Tan so expertly mapped in The Joy Luck Club. With her characteristic wisdom, grace, and humor, she conjures a story of the inheritance of love, its mysteries and senses, its illusions and truths.","torrent":{"xt":"urn:btih:b349693d4765a0bf7956620876ec435fe705c41c","amp;dn":"The+Valley+of+Amazement+-+Amy+Tan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b349693d4765a0bf7956620876ec435fe705c41c","infoHashBuffer":{"type":"Buffer","data":[179,73,105,61,71,101,160,191,121,86,98,8,118,236,67,95,231,5,196,28]},"announce":[],"urlList":[]}}