{"title":"Delicious Deluxe-Dream Vacation Solitaire-Saints &amp; Sinners Bingo","uid":4704903,"size":78811962,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b396d7ee6d4d2755ee56bebcbfd4881430838b9c&amp;dn=Delicious+Deluxe-Dream+Vacation+Solitaire-Saints+%26+Sinners+Bingo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"no_cr","files":3,"time":1233831526,"description":"3 New Wildgames\n\nDelicious Deluxe\n\nRoll up your sleeves for fast fun in Delicious Deluxe, a tantalizing \nrestaurant challenge. Join Emily on her quest to make her dreams come \ntrue in two game modes and seven different restaurants. Success means \nmore tables, bigger restaurants, and a menu full of uniquely delectable \nitems. Tasty treats may keep your customers happy, but it's going to \ntake quick clicks and careful timing to get Emily's ambitions off the \nground. Take a bite out of Delicious Deluxe today!\n\nDream Vacation Solitaire\n\nSail from one beautiful location to the next as you play solitaire\nfor points and prizes in Dream Vacation Solitaire! Dream Vacation S\nolitaire features over 30 games including: Sea Towers, Grandfather, \nOld Clock, Scorpion, Big Forty, Easthaven, and Blind Alleys. Making \nmatches and combinations gives you access to power moves that let you \nclear the boards more easily. And if you do well enough, you'll earn \nmedals, trophies, and even new yachts to sail to the next vacation paradise. \nPlay 35 levels in 5 environments \n\nSaints and Sinners Bingo\n\nBINGO! As a new player on the championship bingo circuit, collect special, \nlucky, charms in order to beat a group of shady tricksters. Travel to 20 \nunique bingo venues and earn all 20 charms to win the day. A motley crew \nof 30 villainous opponents will try every trick to snatch your prize away, \nbut there are 3 game modes and 2 paths to ensure your shot at victory. \nSaints and Sinners Bingo is a fun spin on the classic, popular game.","torrent":{"xt":"urn:btih:b396d7ee6d4d2755ee56bebcbfd4881430838b9c","amp;dn":"Delicious+Deluxe-Dream+Vacation+Solitaire-Saints+%26+Sinners+Bingo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b396d7ee6d4d2755ee56bebcbfd4881430838b9c","infoHashBuffer":{"type":"Buffer","data":[179,150,215,238,109,77,39,85,238,86,190,188,191,212,136,20,48,131,139,156]},"announce":[],"urlList":[]}}