{"title":"The Teenage Brain - Frances E. Jensen - Audiobook MP3","uid":11694111,"size":272398875,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b3e786ea37ede5ede226796a44272bd9b607a65d&amp;dn=The+Teenage+Brain+-+Frances+E.+Jensen+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Squiddy82","files":20,"time":1423645546,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Teenage Brain: A Neuroscientist's Survival Guide to Raising Adolescents and Young Adults\n\nWritten by: Frances E. Jensen, Amy Ellis Nutt\nNarrated by: Tavia Gilbert, Frances E. Jensen\nLength: 9 hrs and 1 min\nUnabridged Audiobook\nRelease Date:01-30-15\n\nDrawing on her research, knowledge, and clinical experience, internationally respected neurologist--and mother of two boys--Frances E. Jensen, MD, offers a revolutionary look at the adolescent brain, providing remarkable insights that translate into practical advice both for parents and teenagers.\nDriven by the assumption that brain growth was almost complete by the time a child reached puberty, scientists believed for many years that the adolescent brain was essentially an adult one--only with fewer miles on it. Over the last decade, however, neurology and neuroscience have revealed that the teen years encompass vitally important stages of brain development.\nMotivated by her experience of parenting two teenagers, renowned neurologist Frances E. Jensen, MD, gathers what we've discovered about adolescent brain functioning and wiring and, in this groundbreaking, accessible audiobook, explains how these eye-opening findings not only dispel commonly held myths about teens but also yield practical suggestions for adults and teenagers negotiating the mysterious and magical world of adolescent biology.\nInterweaving clear summary and analysis of research data with anecdotes drawn from her years as a clinician, researcher, and public speaker, Dr. Jensen explores adolescent brain functioning and development in the context of learning and multitasking, stress and memory, sleep, addiction, and decision making. Examining data connecting substance use to lingering memory issues and sometimes a lower adult IQ, The Teenage Brain explains why teenagers are not as resilient to the effects of drugs as we previously thought; reveals how multitasking impacts learning ability and concentration; and examines the consequences of stress on mental health during and beyond adolescence","torrent":{"xt":"urn:btih:b3e786ea37ede5ede226796a44272bd9b607a65d","amp;dn":"The+Teenage+Brain+-+Frances+E.+Jensen+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3e786ea37ede5ede226796a44272bd9b607a65d","infoHashBuffer":{"type":"Buffer","data":[179,231,134,234,55,237,229,237,226,38,121,106,68,39,43,217,182,7,166,93]},"announce":[],"urlList":[]}}