{"title":"YOOTheme Edge - April 2016 Joomla Template","uid":14383982,"size":18080882,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b3f7b8aef018d7a319a5c10bd1f791c0d3bae9c2&amp;dn=YOOTheme+Edge+-+April+2016+Joomla+Template&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":null,"files":1,"time":1461259419,"description":"Back from the Easter holidays we are excited to present Edge, our April 2016 release. This theme comes with loads of useful features. For example, with our new additional block options you can align whole sections to the left or right. This offers entirely new possibilities for a variable and refreshing layout. Three custom widget plugins, a lot of attention to detail and a light, typography oriented design make it perfect for any blog or magazine website.\r\n\r\nCustom Widgets\r\n\r\nEdge theme comes with Widgetkit 2, our handy content creator toolkit. Apart from the default widget plugins, we've included a custom Slideshow Panel, Slider and a Slideshow widget.\r\n\r\nSlideshow Panel\r\n\r\nThis Slideshow Panel widget automatically applies an offset to the content panel, so that it overlaps the image. Media can be placed at the left, right or top of the content.\r\n\r\nSlider\r\n\r\nThe Slider Edge allows you to select a custom button that will be displayed inside the overlay. You can also display and link each item's title in its overlay.\r\n\r\nSlideshow\r\n\r\nThe custom Slideshow widget doesn't make use of the tradition overlay. Instead content will be displayed inside a panel on top of the image, which can be align to the left or right.\r\n\r\nAdaptive navbar\r\n\r\nEdge theme features four different layouts for the main navigation. The menu can be centered and aligned to the left or right and it can be centered with the logo above the menu. You can set the navbar fixed, so it will stay at the top of the browser window when scrolling. Additionally, you can extend the dropdown to the width of the entire browser window.\r\n\r\nBlock Appearance\r\n\r\nEach widget/module position of Edge theme can be styled differently. You can apply different background colors and vertical paddings and remove horizontal padding. Each block can have a default, large or full width layout. To add an interesting and varied touch to this theme, blocks can be aligned to the left or right.\r\n\r\nBlog Layout\r\n\r\nOf course we've also added a special blog layout. It places the featured image on alternating sides of the content. The title and meta data of the article are enhanced with a border that slightly overlaps the image.\r\n\r\nAdditions\r\n\r\nEdge theme comes with 6 style presets and a number of useful utility classes and theme components that will help you arrange your content. For a full list of these classes and a more detailed overview of the theme's features, check out the Theme page.\r\n\r\nSlideshow Panel Slider and Slideshow widgets\r\n4 different navbar layouts with many options\r\nDifferent block appearance settings\r\nCustom blog layout\r\nDemo pages built with Widgetkit 2\r\nFull UIkit components styling\r\n6 pre-built style variations\r\nEasy customizer and LESS integration\r\nWooCommerce support","torrent":{"xt":"urn:btih:b3f7b8aef018d7a319a5c10bd1f791c0d3bae9c2","amp;dn":"YOOTheme+Edge+-+April+2016+Joomla+Template","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3f7b8aef018d7a319a5c10bd1f791c0d3bae9c2","infoHashBuffer":{"type":"Buffer","data":[179,247,184,174,240,24,215,163,25,165,193,11,209,247,145,192,211,186,233,194]},"announce":[],"urlList":[]}}