{"title":"Il grande dittatore - Charles Chaplin [Divx Ita] [Tntvillage]","uid":5094849,"size":731952640,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b3f71c3c6643ab83a95c462ddedb726fe1a0d01e&amp;dn=Il+grande+dittatore+-+Charles+Chaplin+%5BDivx+Ita%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"darayava","files":1,"time":1253465343,"description":"Visit this info link: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=111976  Visit this link: http://img518.Imageshack.us/img518/2470/giornatamemoria288x150nx2.png\n IL GRANDE DITTATORE\n\n by akira04\n\n Visit this link: http://filmup.leonardo.it/posters/loc/500/ilgrandedittatore.jpg\n\n - Scheda del film - \n\nTitolo: Il grande dittatore\nTitolo originale: The Great Dictator\nNazionalitÃƒÂ : USA\nAnno: 1940                                    \nGenere: Commedia\nRegia:Charles Chaplin \nProduzione: Charles Chaplin Productions\nDistribuzione: BIM\nData di uscita: 20 Dicembre 2002 \nCast:Charles Chaplin, Jack Oakie, Reginald Gardiner, Henry Daniell \n\n - Contesto storico - \n\nDopo le scene iniziali che si svolgono nelle trincee della prima guerra mondiale, che stava volgendo al termine a favore degli Alleati, il film si svolge interamente nel periodo che va dal 1918 al 1939, in Germania, nella quale dopo la nascita della Repubblica di Weimar (che aveva posto le basi per una democrazia) ascese rapidamente al potere la dittatura piÃƒÂ¹ spietata dell'epoca: il nazismo, con a capo il dittatore Adolf Hitler, che in pochi anni conquistÃƒÂ² facilmente il parlamento tedesco (il Reichstag) grazie alle pressioni sui deputati compiute dalle sue squadre d'assalto (allora erano le SA, poi furono sostituite dalle piÃƒÂ¹ spietate SS, dopo l'assassinio nella &quot;notte dei lunghi coltelli&quot; di tutti i capi delle SA); si fece nominare &quot;Fuhrer&quot;, cioÃƒÂ¨ il capo assoluto a cui tutti dovevano prestare cieca obbedienza, quando salÃƒÂ¬ al potere completo dopo la morte del presidente Hindenburg. In pochi decenni quest'uomo ebbe nelle mani il controllo di quasi tutta l'Europa, grazie alla sua politica militarista e espansionistica che prima della guerra fu debolmente contrastata dalle potenze alleate. Durante la sua folle dittatura, Hitler perseguitÃƒÂ² tutti quelli non di razza &quot;ariana&quot;, in particolar modo gli Ebrei, considerati un popolo inferiore da spazzare via. Le violenze su di essi furono morali, a causa delle leggi razziste che gli tolsero molti dei diritti fondamentali di ogni cittadino e di ogni uomo, ma furono anche purtroppo fisiche. A milioni infatti vennero deportati nei terribili campi di concentramento nazisti dove venivano sterminati nelle camere a gas o morivano per il duro lavoro al quale erano stati affidati. Nei campi di concentramento vennero uccisi anche decine di migliaia di handicappati, di zingari, di slavi e di oppositori del regime hitleriano. Fortunatamente, con la sconfitta della Germania nella seconda guerra mondiale, questi orrendi crimini contro l'umanitÃƒÂ  furono bloccati.\n\n - Trama - \n\nLa pellicola mostra in parallelo la vita di un barbiere ebreo reduce dalla prima guerra mondiale e la vita del dittatore tedesco Hinkel (Hitler). Le prime scene mostrano il soldato ebreo che salva la vita ad un ufficiale tedesco ferito in trincea e che sta per morire. Dopo questo flashback, si passa a Hinkel, che fa un discorso ad una folla immensa impazzita per lui parlando male della democrazia e di tutte le libertÃƒÂ . Poi si passa al ghetto, nel quale il soldato ebreo fa ritorno prendendo di nuovo le vesti di barbiere. Qui ritrova i suoi amici e la bella Anna. Lui perÃƒÂ² non sa niente su ciÃƒÂ² che sta accadendo (cioÃƒÂ¨ la dittatura di Hinkel e le persecuzioni sugli ebrei) perchÃƒÂ© ÃƒÂ¨ rimasto per molto tempo in ospedale senza mai uscire, quindi quando le &quot;camicie grigie&quot; compiono violenze e lo immobilizzano, lui non capisce cosa stia succedendo, e comicamente ma non troppo, chiede spiegazioni, Le &quot;camicie grigie&quot; allora lo catturano, ma quando arriva il loro capo, Schultz (che guarda caso ÃƒÂ¨ l'ufficiale tedesco salvato dal barbiere nella guerra), ordina di liberarlo perchÃƒÂ© ÃƒÂ¨ un suo amico. Intanto viene mostrata la vita quotidiana di Hinkel e viene fatta vedere la crudeltÃƒÂ  del dittatore seppur in chiave comica, come abitudine del grande Charlie Chaplin. In una famosa scena il dittatore tedesco gioca a tirare in aria un mappamondo a forma di palloncino, come a significare che tenesse idealmente tutto il mondo nelle sue mani, ma poi gli scoppia in faccia ed effettivamente cosÃƒÂ¬ ÃƒÂ¨ successo. Hinkel a un certo punto accusa di tradimento Schultz e lo fa arrestare, quindi adesso le &quot;camicie grigie&quot; possono prelevare il barbiere, ma fortunatamente non lo fanno, anche perchÃƒÂ© Hinkel, che ha chiesto dei prestiti ad un ricco ebreo, ha ordinato di smettere le violenze per assicurarsi i soldi. Schultz comunque riesce a liberarsi e tiene una riunione segreta con il barbiere e i capi del ghetto per compiere un attentato contro il Fuhrer, ma alla fine non se ne fa niente. Intanto la Gestapo (la polizia segreta del Reich) cerca Schultz e lo trova insieme al barbiere: i due vengono rinchiusi in un campo di concentramento. A questo punto Anna e la sua famiglia, amici del barbiere, sono costretti a scappare in Austria, che ÃƒÂ¨ ancora un paese non sottomesso al Reich. Ma il pericolo incombe. Hinkel infatti riceve in Germania Napoloni (Mussolini, il capo del fascismo) per discutere sull'Austria e sul fatto che truppe italiane stazionino sul confine. I due trovano un accordo, ma alla fine Hinkel decide di invadere ugualmente l'Austria. Intanto Schultz e il barbiere si liberano e fuggono con uniformi tedesche, e cosÃƒÂ¬ quando passano davanti a un caposaldo dell'esercito tutti scambiano il barbiere per Hinkel data la loro estrema somiglianza (sono la stessa persona, Charlie Chaplin!), e cosÃƒÂ¬ lui fa buon viso a cattivo gioco. Nella bellissima scena finale si vede, mentre Anna viene catturata da truppe tedesche, il barbiere - dittatore parla davanti al mondo intero pronunciando un discorso bellissimo e commovente parlando di democrazia, di uscire dal buco nero (la dittatura feroce), di eliminare le barriere e i confini ideologici, di amarci l'uno con l'altro per avere un mondo migliore.\n\n - Il discorso finale - \n\nMi dispiace ma io non voglio fare l' Imperatore, non ÃƒÂ¨ il mio mestiere, non voglio governare e conquistare nessuno, vorrei aiutare tutti, ebrei, ariani, uomini neri e bianchi, tutti noi dovremo aiutarci sempre, dovremo soltanto godere della felicitÃƒÂ  del prossimo, non odiarci e disprezzarci l' un l' altro. In questo mondo c'ÃƒÂ¨ posto per tutti, la natura ÃƒÂ¨ ricca, ÃƒÂ¨ sufficiente per tutti noi, la vita puÃƒÂ² essere felice e magnifica, ma noi lo abbiamo dimenticato. L'aviditÃƒÂ  ha avvelenato i nostri cuori, ha precipitato il mondo nell' odio, ci ha condotti a passo d'oca a fare le cose piÃƒÂ¹ abbiette, abbiamo i mezzi per spaziare, ma ci siamo chiusi in noi stessi. La macchina dell' abbondanza ci ha dato povertÃƒÂ , la scienza ci ha trasformato in cimici, l'aviditÃƒÂ  ci ha resi duri e cattivi, pensiamo troppo e sentiamo poco. PiÃƒÂ¹ che macchinari ci serve umanitÃƒÂ , piÃƒÂ¹ che abilitÃƒÂ  ci serve bontÃƒÂ  e gentilezza, senza queste qualitÃƒÂ  la vita ÃƒÂ¨ violenza e tutto ÃƒÂ¨ perduto. L'aviazione e la radio hanno riavvicinato le genti, la natura stessa di queste invenzioni reclama la bontÃƒÂ  nell' uomo, reclama la fratellanza universale, l' unione dell' umanitÃƒÂ . Perfino ora la mia voce raggiunge milioni di persone nel mondo, milioni di uomini, donne e bambini disperati, vittime di un sistema che impone agli uomini di torturare e imprigionare gente innocente. A coloro che mi odono, io dico, non disperate! L'aviditÃƒÂ  che ci comanda ÃƒÂ¨ solo un male passeggero, l'amarezza di uomini che temono le vie del progresso umano. L'odio degli uomini scompare insieme ai dittatori e il potere che hanno tolto al popolo ritornerÃƒÂ  al popolo e qualsiasi mezzo usino la libertÃƒÂ  non puÃƒÂ² essere soppressa. Soldati! Non cedete a dei bruti, uomini che vi disprezzano e vi sfruttano, che vi dicono come vivere, cosa fare, cosa dire, cosa pensare, che vi irreggimentano, vi condizionano, vi trattano come bestie. Non vi consegnate a questa gente senza un anima, uomini macchina, con macchine al posto del cervello e del cuore. Voi non siete macchine, voi non siete bestie, siete uomini! Voi avete l' amore dell' umanitÃƒÂ  nel cuore, voi non odiate, coloro che odiano sono quelli che non hanno l' amore altrui. Soldati! Non difendete la schiavitÃƒÂ¹, ma la libertÃƒÂ ! Ricordate nel Vangelo di S. Luca ÃƒÂ¨ scritto - &quot;Il Regno di Dio ÃƒÂ¨ nel cuore dell'uomo&quot; - non di un solo uomo o di un gruppo di uomini, ma di tutti gli uomini. Voi, il popolo avete la forza di creare la macchina, la forza di creare la felicitÃƒÂ , avete la forza di fare che la vita sia bella e libera, di fare di questa vita una splendida avventura. Quindi in nome della democrazia uniamo questa forza, uniamoci tutti! Combattiamo per un mondo nuovo che sia migliore, che dia a tutti gli uomini lavoro, ai giovani un futuro, ai vecchi la sicurezza. Promettendovi queste cose dei bruti sono andati al potere, mentivano! Non hanno mantenuto quelle promesse e mai lo faranno! I dittatori forse sono liberi? PerchÃƒÂ© rendono schiavi il popolo. Allora combattiamo per mantenere quelle promesse, combattiamo per liberare il mondo, eliminando confini e barriere, eliminando l' aviditÃƒÂ , l'odio e l'intolleranza. Combattiamo per un mondo ragionevole, un mondo in cui la scienza e il progresso diano a tutti gli uomini il benessere. Soldati, nel nome della democrazia siate tutti uniti!\n\nAnna, puoi sentirmi? Dovunque tu sia, abbi fiducia, guarda in alto Anna, le nuvole si diradano, comincia a splendere il sole, primo poi usciremo dall'oscuritÃƒÂ  verso la luce e vivremo in un mondo nuovo, un mondo piÃƒÂ¹ buono in cui gli uomini si solleveranno al di sopra della loro aviditÃƒÂ , del loro odio, della loro brutalitÃƒÂ . Guarda in alto Anna, l'animo umano troverÃƒÂ  le sue ali e finalmente comincerÃƒÂ  a volare, a volare sull' arcobaleno, verso la luce della speranza, verso il futuro, il glorioso futuro che appartiene a te, a me, a tutti noi. Guarda in alto Anna, lassÃƒÂ¹!\n\n - Scheda tecnica del DivX - \n\nDimensione:715 MB \nDurata: 1h57m\n\nVideo Codec: dvix4 \nVideo Bitrate:699 kb/s \nRisoluzione:624x480 \nFPS (Frames/sec):25.000\nQF (Frame quality): 0.093 bits/pixel\n\nAudio Codec: MPEG-1 Layer 3\nAudio Bitrate:128 kb/s  \nFreq Audio:48000 Hz \n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:b3f71c3c6643ab83a95c462ddedb726fe1a0d01e","amp;dn":"Il+grande+dittatore+-+Charles+Chaplin+%5BDivx+Ita%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3f71c3c6643ab83a95c462ddedb726fe1a0d01e","infoHashBuffer":{"type":"Buffer","data":[179,247,28,60,102,67,171,131,169,92,70,45,222,219,114,111,225,160,208,30]},"announce":[],"urlList":[]}}