{"title":"Bon Iver - For Emma, Forever Ago [24 bit FLAC] vinyl","uid":8183663,"size":709366067,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b4747b6878f3789831e15ee3155b9cecdec1c378&amp;dn=Bon+Iver+-+For+Emma%2C+Forever+Ago+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"24.96","files":-1,"time":1361682763,"description":"  Bon Iver - For Emma, Forever Ago (2008) [24 bit FLAC] vinyl\n\n  Released: 2008\n  Genre: Pop/Rock\n  Style: Indie Rock, Singer/Songwriter\n  Codec: FLAC\n  Bit Rate: ~ 2,700 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  01. Flume 3:39\n  02. Lump Sum 3:21\n  03. Skinny Love 3:58\n  04. The Wolves (Act I and II) 5:22\n  05. Blindsided 5:29\n  06. Creature Fear 3:06\n  07. Team 1:56\n  08. For Emma 3:40\n  09. re: stacks 6:41\n\n  Bon Iver is the work of Justin Vernon. He isolated himself in a remote cabin in Wisconsin for almost four months, writing, and recording the songs on For Emma, Forever Ago, his haunting debut album. A few parts (horns, drums, and backing vocals) were added in a North Carolina studio, but for the majority of the time it's just Vernon, his utterly disarming voice, and his enchanting songs. The voice is the first thing you notice. Vernon's falsetto soars like a hawk and when he adds harmonies and massed backing vocals, it can truly be breathtaking. &quot;The Wolves (Acts I &amp; II)&quot; truly shows what Vernon can do as he croons, swoops, and cajoles his way through an erratic and enchanting melody like Marvin Gaye after a couple trips to the backyard still. &quot;Skinny Love&quot; shows more of his range as he climbs down from the heights of falsetto and shouts out the angry and heartachey words quite convincingly. Framing his voice are suitably subdued arrangements built around acoustic guitars and filled out with subtle electric guitars, the occasional light drums, and slide guitar. Vernon has a steady grasp of dynamics too; the ebb and flow of &quot;Creature Fear&quot; is powerfully dramatic and when the chorus hits it's hard not to be swept away by the flood of tattered emotion. Almost every song has a moment where the emotion peaks and hearts begin to weaken and bend: the beauty of that voice is what pulls you through every time. For Emma captures the sound of broken and quiet isolation, wraps it in a beautiful package, and delivers it to your door with a beating, bruised heart. It's quite an achievement for a debut and the promise of greatness in the future is high. Oh, and because you have to mention it, Iron &amp; Wine. Also, Little Wings. Most of all, though, Bon Iver.","torrent":{"xt":"urn:btih:b4747b6878f3789831e15ee3155b9cecdec1c378","amp;dn":"Bon+Iver+-+For+Emma%2C+Forever+Ago+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4747b6878f3789831e15ee3155b9cecdec1c378","infoHashBuffer":{"type":"Buffer","data":[180,116,123,104,120,243,120,152,49,225,94,227,21,91,156,236,222,193,195,120]},"announce":[],"urlList":[]}}