{"title":"Rachael Yamagata...Elephants Teeth Sinking Into Heart(2008)[FLAC","uid":6595995,"size":439498656,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b48fed2585fd38ffc8775d39046b0d6d7aba5eed&amp;dn=Rachael+Yamagata...Elephants+Teeth+Sinking+Into+Heart%282008%29%5BFLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"dickspic","files":18,"time":1313016494,"description":"Elephants...Teeth Sinking Into Heart [2008] Warner Bros. Records / 512764-2\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\nDisc 1\n01 Elephants (4:14)\n02 What If I Leave (5:03)\n03 Little Life (4:07)\n04 Sunday Afternoon (9:05)\n05 Elephants Instrumental (1:46)\n06 Duet (4:01)\n07 Over And Over (5:25)\n08 Brown Eyes (3:46)\n09 Horizon (15:33)\nDisc 2\n01 Sidedish Friend (3:00)\n02 Accident (4:10)\n03 Faster (3:50)\n04 Pause The Tragic Ending (4:42)\n05 Don't (3:05)\n\nRachael Yamagata's voice has made numerous appearances since her solo debut in 2004: on albums by Ray LaMontagne and Rhett Miller, on TV sitcoms, on Ryan Adams &amp; the Cardinals' acclaimed Cold Roses, and on a pair of Yamagata's own EPs. Despite such a flurry of activity, however, the songwriter found herself dropped from the RCA roster after Happenstance's release, a move that prolonged the finishing of her second studio LP. Arriving in 2008 on the Warner Bros. label, Elephants...Teeth Sinking Into Heart literally splits Yamagata's musical personality into two parts -- the first disc, Elephants, pitches its tent closer to the Happenstance camp with lushly textured ballads, while Teeth Sinking Into Heart plays up the singer's debt to rock artists like PJ Harvey. \n\nThe latter CD is the biggest surprise here, as it displays a swaggering confidence that wasn't as evident on Yamagata's previous releases. She raises her voice in volume and pitch, affecting a measured snarl during songs like &quot;Sidedish Friend&quot; and &quot;Faster.&quot; The potent set ends with &quot;Don't,&quot; a weary ballad that recalls Neko Case's Fox Confessor Brings the Flood and flaunts an expletive-filled refrain. While the song's lyrics are aligned with the rest of Teeth Sinking Into Heart, its sound still emphasizes Yamagata's strength as a master of slow-moving, wounded love songs. Elephant furthers that bittersweet style with ten songs (one of them hidden), effectively doubling the size of Teeth. The disc features a gorgeous cameo by Ray LaMontagne, whose Southern croon does a slow dance with Yamagata on the aptly named &quot;Duet.&quot; Like LaMontagne's most intimate material, Elephant moves in quiet circles, mining Yamagata's heartbroken past for melodic effect while dressing up her songs in layers of strings, woodwinds, and acoustic instruments. This is where her voice truly shines -- even when it seemingly hides from the spotlight, reducing itself to a cracked whisper while delivering Yamagata's lyrics. Fittingly, she matches such strong songcraft with equally strong content. &quot;So for those of you falling in love,&quot; she advises during the first disc's title track, &quot;keep it kind, keep it good, keep it right. Throw yourself in the midst of danger, but keep one eye open at night.&quot; Spoken like a true veteran of solitude and heartbreak, and performed like one of the strongest songwriters to emerge during the early 21st century. \n\ncd ripped by EAC by Zero0\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2011/08/06/rachael-yamagata/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2011/08/06/rachael-yamagata/&lt;/a&gt;","torrent":{"xt":"urn:btih:b48fed2585fd38ffc8775d39046b0d6d7aba5eed","amp;dn":"Rachael+Yamagata...Elephants+Teeth+Sinking+Into+Heart%282008%29%5BFLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b48fed2585fd38ffc8775d39046b0d6d7aba5eed","infoHashBuffer":{"type":"Buffer","data":[180,143,237,37,133,253,56,255,200,119,93,57,4,107,13,109,122,186,94,237]},"announce":[],"urlList":[]}}