{"title":"The Dark Citadel series by Michael Wallace","uid":9648957,"size":927082,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4a005b58d7fff187cfb8fc21eb7fe3ca65ad709&amp;dn=The+Dark+Citadel+series+by+Michael+Wallace&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"PirateBook","files":3,"time":1393044715,"description":"\nMichael Wallace: I've trekked across the Sahara on a camel, ridden an elephant through a tiger preserve in Southeast Asia, eaten fried guinea pig, and been licked on the head by a skunk. \n\nIn a previous stage of life I programmed nuclear war simulations, smuggled refugees out of a war zone, and milked cobras for their venom. I speak Spanish and French and grew up in a religious community in the desert.\n\nGenre: Fantasy\n\n\nBook #1 The Dark Citadel\nA slave boy named Darik falls in with a pair of spies as the great city of Balsalom comes under siege by the armies of a dark wizard. They flee west to enlist the aid of griffin riders, an order of wizards, and a band of ascetic knights to come to the city's defense.\n\nBook #2 The Free Kingdoms\nThe Dark Wizard marches against the Free Kingdoms while a wizard, warrior prince, and a freed slave boy mount a heroic defense. A young queen struggles behind enemy lines to keep her city free from the enemy's grasp. The second book of the epic fantasy series, The Dark Citadel, by Wall Street Journal bestselling author Michael Wallace, The Free Kingdoms combines a rich fantasy world with page-turning plot and flawed, heroic characters.\n\nBook #3 The Golden Griffin\nAfter suffering a crushing defeat, The Dark Wizard flees into the khalifates to regain his strength, pursued by an army from the Free Kingdoms. Meanwhile, the dark wizard's dragons range up and down the mountains, burning forests and attacking the griffin riders in their aeries. With her father dead, the young leader of the griffin riders must venture into the northern wilds to tame the powerful and elusive golden griffin. If she fails, her people will be scattered and destroyed. ","torrent":{"xt":"urn:btih:b4a005b58d7fff187cfb8fc21eb7fe3ca65ad709","amp;dn":"The+Dark+Citadel+series+by+Michael+Wallace","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4a005b58d7fff187cfb8fc21eb7fe3ca65ad709","infoHashBuffer":{"type":"Buffer","data":[180,160,5,181,141,127,255,24,124,251,143,194,30,183,254,60,166,90,215,9]},"announce":[],"urlList":[]}}