{"title":"O'Reilly's Killer Game Programming In Java","uid":8780279,"size":11710099,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4dd449dfe78116a81292dac22b0d65b27a2b477&amp;dn=O%27Reilly%27s+Killer+Game+Programming+In+Java&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"_TiVo444","files":-1,"time":1375694630,"description":"Although the number of commercial Java games is still small compared to those written in C or C++, the market is expanding rapidly. Recent updates to Java make it faster and easier to create powerful gaming applications-particularly Java 3D-is fueling an explosive growth in Java games. Java games like Puzzle Pirates, Chrome, Star Wars Galaxies, Runescape, Alien Flux, Kingdom of Wars, Law and Order II, Roboforge, Tom Clancy's Politika, and scores of others have earned awards and become bestsellers.\nJava developers new to graphics and game programming, as well as game developers new to Java 3D, will find Killer Game Programming in Java invaluable. This new book is a practical introduction to the latest Java graphics and game programming technologies and techniques. It is the first book to thoroughly cover Java's 3D capabilities for all types of graphics and game development projects.\n\nKiller Game Programming in Java is a comprehensive guide to everything you need to know to program cool, testosterone-drenched Java games. It will give you reusable techniques to create everything from fast, full-screen action games toA multiplayer 3D games. In addition to the most thorough coverage of Java 3D available, Killer Game Programming in Java also clearly details the older, better-known 2D APIs, 3D sprites, animated 3D sprites, first-person shooter programming, sound, fractals, and networked games. Killer Game Programming in Java is a must-have for anyone who wants to create adrenaline-fueled games in Java.\n\nFile - Killer_Game_Programming_in_Java.pdf\nRelease Date - 2005\nSize - 11.1 MB\nPages - 998\n\nEnjoy and seed.","torrent":{"xt":"urn:btih:b4dd449dfe78116a81292dac22b0d65b27a2b477","amp;dn":"O%27Reilly%27s+Killer+Game+Programming+In+Java","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4dd449dfe78116a81292dac22b0d65b27a2b477","infoHashBuffer":{"type":"Buffer","data":[180,221,68,157,254,120,17,106,129,41,45,172,34,176,214,91,39,162,180,119]},"announce":[],"urlList":[]}}