{"title":"Macrium Reflect 6.1.1196 Workstation (x86/x64)","uid":13828753,"size":74771335,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b4f86f0c03829e43336eaf440cae7422e7902e0c&amp;dn=Macrium+Reflect+6.1.1196+Workstation+%28x86%2Fx64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"jovo_bih","files":1,"time":1457727165,"description":"Macrium Reflect 6.1.1196 Workstation (x86 / x64)\r\n\r\nRelease date: 08/03/2016\r\n\r\nBased on our very successful v5 Professional product this new solution is designed for endpoint backup of business critical PCs and workstations.\r\nPeace of mind for organisations when backing up Windows PCs.\r\n\r\nSolution highlights\r\n\r\n- Ultra-fast Live imaging of windows systems, physical and virtual\r\n- Restore images to dissimilar hardware using Macrium ReDeploy\r\n- Greatly simplified administration including pre-defined Backup Plans for popular backup strategies\r\n- Fully featured file and folder level backup and recovery\r\n- Updated support for all the latest Windows Operating Systems and disk formats\r\n\r\nNew and Improved Features in v6\r\n- \r\n- WinPE 10 rescue environment\r\nIncludes the latest version of the Microsoft Windows Preinstallation Environment offering support for more devices along with USB 3.0 support (CD, DVD, USB or Boot Menu).\r\n\r\n- Delta Incremental Indexing\r\nProvides a more efficient way of saving incremental backup files by optimizing the size of the index saved with each incremental. Delta indexes only contain a list of changed blocks in the incremental itself.\r\n\r\n- Rapid Delta Restore (RDR)\r\nUsing advanced delta detection technology RDR can rapidly recover data from single, or multiple full backups. Cuts restore times by 90% or more.\r\n\r\n- Rapid Delta Clone (RDC)\r\nImproving further on the cloning capabilities using technology based on RDR to speed up disk cloning activities by 90% or more.\r\n\r\n- Template and Custom backup plans\r\nThe Macrium Reflect scheduling engine is pre-loaded with templates for traditional, Incremental forever, or you can create your own custom plan.\r\n\r\n- GFS with backup chain protection \r\nThe traditional GFS backup template has been pre-configured with monthly, weekly, daily activities, and retention rules. Simplifies management of backup chains.\r\n\r\n- Incrementals forever\r\nAn efficient method to continuously maintain a defined number of the most recent incremental backups. The oldest incremental files are consolidated into a single synthetic delta.\r\n\r\n- Virtual Image Boot (Technology Preview)\r\nThe ability to directly convert a Macrium System Image file into a running VM. Provides instant boot of failed systems for business continuity.\r\n\r\n- SSD Trim support\r\nThis features provides automated SSD optimization providing enhanced SSD performance and longevity.\r\n\r\nHomepage http://www.macrium.com/product/2/a-nameworkstationamacrium-reflect-v6-workstation.aspx","torrent":{"xt":"urn:btih:b4f86f0c03829e43336eaf440cae7422e7902e0c","amp;dn":"Macrium+Reflect+6.1.1196+Workstation+%28x86%2Fx64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4f86f0c03829e43336eaf440cae7422e7902e0c","infoHashBuffer":{"type":"Buffer","data":[180,248,111,12,3,130,158,67,51,110,175,68,12,174,116,34,231,144,46,12]},"announce":[],"urlList":[]}}