{"title":"Tactical Edged Weapons (Knife Combat) (AVI)","uid":4448699,"size":1439636755,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b5235a4704aff5ac6069e00ab23cee46d6b621a5&amp;dn=Tactical+Edged+Weapons+%28Knife+Combat%29+%28AVI%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"x_DontTreadOnMe_x","files":3,"time":1224169782,"description":"Apologies for the torrent I put up about a week ago...I had no idea it was damaged until I played it on WMP (worked just fine on VLC up until a certain point).  Anyways, these were just ripped from the DVD's and are guaranteed working.  To make up for wasting people's bandwidth, I'll be sure to upload a few more things throughout the day. :)\n\n~~~\n\nTactical Edged Weapons 1\n\nEdged weapons can be devastating at close quarter ranges and faster to deploy and implement than a firearm. Learn elements of defensive and offensive techniques for tactical self-defense with, and against, an edged weapon. Weapons selection, cutting techniques, grips, movement, targeting, defensive postures and safety are some of the many important topics covered in this informative and dynamic video.\n(about 35 minutes)\n\nTactical Edged Weapons 2\n\nTactical Edged Weapons II is the second video of the Gunsite Edged Weapons series. This video continues from the basic subject foundations of knowledge presented in Tactical Edged Weapons I. Join the instructors of Gunsite Academy Inc. and the West Coast Academy as they introduce you to the interface of reality training and real world counter attack methods.\n(about 55 minutes)\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!\n","torrent":{"xt":"urn:btih:b5235a4704aff5ac6069e00ab23cee46d6b621a5","amp;dn":"Tactical+Edged+Weapons+%28Knife+Combat%29+%28AVI%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5235a4704aff5ac6069e00ab23cee46d6b621a5","infoHashBuffer":{"type":"Buffer","data":[181,35,90,71,4,175,245,172,96,105,224,10,178,60,238,70,214,182,33,165]},"announce":[],"urlList":[]}}