{"title":"Audrey Hepburn: A Charmed Life by Robyn Karney","uid":10096948,"size":21100602,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b5ae9729e8639b1be84ed816baa92f0c4a4b45f6&amp;dn=Audrey+Hepburn%3A+A+Charmed+Life+by+Robyn+Karney&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"PirateBook","files":1,"time":1399318931,"description":"\nWith 177 superb photographs, Audrey Hepburn is a sumptuous celebration of Hepburn as a beloved fashion icon and actress. Karney tells the story of Hepburns life, from her childhood in Nazi-occupied Holland, through her early aspirations to become a ballet dancer, the instant and universal acclaim of her onscreen debut, and her years as one of Hollywoods most sought-after stars, to her later life working among the poorest children of the Third World. Karneys book gives fans a rare view into the life of a beloved star.\n\nHepburns acting career began after a series of minor revue and film roles in London. Hepburn was spotted by the writer Colette, who immediately cast her in the central role of a Broadway adaptation of her story, Gigi. Soon afterwards, Hepburn was offered a role alongside Gregory Peck in Roman Holiday, for which she collected an Oscar for Best Actress. \n\nThe book highlights all her success that followed: she won the Tony Award for Best Actress for Ondine, captivated audiences as Natasha in War and Peace, and was highly praised for her brilliance in a serious role in The Nuns Story. \n\nHepburns style was perfection and her clothesmany of them designed by Givenchy, who dressed her for Funny Face in 1957placed her on the worlds Best Dressed Women list for several consecutive years. Her personality and sensuous yet untouchable beauty made her irresistible to the public. On Hepburns death, Liz Taylor said, God has a most beautiful new angel now that will know just what to do in heaven.\n\nGenre: Non Fiction, Biography","torrent":{"xt":"urn:btih:b5ae9729e8639b1be84ed816baa92f0c4a4b45f6","amp;dn":"Audrey+Hepburn%3A+A+Charmed+Life+by+Robyn+Karney","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5ae9729e8639b1be84ed816baa92f0c4a4b45f6","infoHashBuffer":{"type":"Buffer","data":[181,174,151,41,232,99,155,27,232,78,216,22,186,169,47,12,74,75,69,246]},"announce":[],"urlList":[]}}