{"title":"5 prang (phobia 2) 2009 English Sub","uid":5239275,"size":790623034,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b5bc0b2d9b9d530b8a4092b902b5ed0a8333a0fe&amp;dn=5+prang+%28phobia+2%29+2009+English+Sub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"poothaijaa","files":-1,"time":1261677777,"description":"Title: Phobia 2\nAKA: 5 Prang\nYear: 2009\nDirector: Songyos Sugmakanan, Banjong Pisanthanakun, Parkpoom Wongpoom, Visute Poolvoralaks, and Paween Purikitpanya.\nGenre: Horror / Mystery\nRuntime: 120 mins\nCountry: Thailand\nAudio: Thai\nSubtitle: English\n\nCast:\nNovice: Jirayu La-ongmanee: Pey\nChumporn Teppitak: Senior Monk\nRay McDonald: Monk\nApasiri Nitipon: Mother\n\nWard: Worrawech Danuwong: Tee\nChatpawee Trichatchawanwong: Nurse\nGecha Pleanwitee: Old man\n\nBackpacker: Chalee Trairat: Joi\nSutheerut Channukul: Driver\n\nSalvage: Nicole Terio: Nuch\n\nIn The End: Masha Wattanapanich: Masha\nNuttapong Chatpong\nGuntapat Seeda\nWiwat Kongrasee\nPongsatorn Jongwilas\n &lt;a href=&quot;\nhttp://www.5prang.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.5prang.com/&lt;/a&gt;\n\nSource: DVD5 PAL\nFile Format: AVI\n\nSynopsis:\nPhobia 2 is dissected into 5 shorts stories; Novice, Ward, Backpackers, Salvage, and In The End\n\nNovice\na Film by Paween Purijitpanya\nthe story focusing on a 14 year old; Pey, who has committed a crime Pa-Hin (throwing rocks) (being on the motorcycle throwing rocks to the cars windshield waiting for the car to crashed then steal money and other valuable items from the owner) and in order to keep the news low his mom decided that Pey must get ordained to become a buddhist novice to escape the crime he committed, under the guide of a monk, Pey remains unnoticed as a criminal. However, something deep down inside is bothering him. As he spend the night in the woods trying to meditate something is bothering him, his thoughts and something else. The grip of fear tightens as he realizes that 'karma' has no friend or foe when deciding a man's fate or fortune.\n\nWard\na film by Visute Poolvoralaks\nArthit; a playful teenager crashes his bike and breaks both legs. At the hospital he has been moved from the ER room to a shared room. In the room, there is an old man in a coma who has been waiting for almost a month for his family to decide to pull the plug on his oxygen. What happens that night will make Arthit realize that being alone is always better that being around bad company.\n\nBackpackers\na film by Songyos Sugmakanan\nUpon graduation, a young Japanese couple decided to travel around Thailand by backpacking. After failed attempts to hitchhike from Samui island to Bangkok, the boyfriend waves a 1,000 Baht note in hopes to entice passing cars to pick them up. What is hiding inside the truck's trailer? Is there something deeper and darker that lurks behind the kind smiling face of the truck driver who lets them hop in? The answers to these questions will cause an adrenalin rush like no other.\n\nSalvage\na film by Parkpoom Wongpoom\nNuch is a car dealer. She makes her living by rebuilding severely damaged cars. But little do unsuspecting bargain hunters know, beneath the new upholstery and shiny repainted exteriors are cars with horror pasts. One night after closing the car garage she discovers her son is missing. Reviewing the security camera tapes she sees her son climb inside a car that she recently bought but nowhere on tapes has him climbing out &quot;Cemetary Garage&quot; where you drive off with more that you bargained for.\n\nIn The End\na film by Banjong Pisanthanakun\nTher, Phueak, Chin and Aeh are the movie crew of an upcoming horror movie. They are shooting their last scene. On the last night, Phueak is trying to be cool and tells one of the sick cast members that, &quot;the show must go on&quot;. So when that actress accidentally dies during the filming she makes sure to come back from the dead to finish her role. The four of them must shoot the movie that has a real ghost playing the role of ghost in the end. and the main actress must not know about this.","torrent":{"xt":"urn:btih:b5bc0b2d9b9d530b8a4092b902b5ed0a8333a0fe","amp;dn":"5+prang+%28phobia+2%29+2009+English+Sub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5bc0b2d9b9d530b8a4092b902b5ed0a8333a0fe","infoHashBuffer":{"type":"Buffer","data":[181,188,11,45,155,157,83,11,138,64,146,185,2,181,237,10,131,51,160,254]},"announce":[],"urlList":[]}}