{"title":"Murder By Death - Bitter Drink, Bitter Moon (2012) [FLAC]","uid":8153953,"size":286013404,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b5eb5dfd50fde29bfaa80c8f886586259e743d12&amp;dn=Murder+By+Death+-+Bitter+Drink%2C+Bitter+Moon+%282012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"politux","files":-1,"time":1361119652,"description":"\n  Murder By Death - Bitter Drink, Bitter Moon (2012) [FLAC]\n\n  Released: 2012\n  Duration: 44:22\n  Genre: Pop/Rock\n  Style: Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 700 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  \n  01 My Hill\n  02 Lost River\n  03 Straight at the Sun\n  04 No Oath, No Spell\n  05 I Came Around\n  06 Hard World\n  07 Ditch Lilly\n  08 The Curse of Elkhart\n  09 Ramblin'\n  10 Queen Mab\n  11 Go to the Light\n  12 Oh, to Be an Animal\n  13 Ghost Fields\n\n The night can be a scary place sometimes, with myriad dangers masked by a shroud of darkness that requires us to simply take a deep breath and head into the unknown. Most of the time, what's actually out there is fairly mundane, and the things we fear are living inside of our minds, tricks dreamt up by our subconscious to scare us. It's these imagined parts of the darkness that Murder by Death call home, peeling back the shadows to show not what is actually lying in wait in the darkness, but what we secretly wish was there. On their sixth album, Bitter Drink, Bitter Moon, Murder by Death continue in the tradition of their previous albums, delivering 13 ominous tracks of the band's brand of &quot;whiskey devil music.&quot; \n\n  While it's hard to deny the sinister nature of lyrics like &quot;Lost River&quot;'s opening salvo, &quot;Hush now creature, don't you cry/I know a place where a body can hide,&quot; Bitter Drink feels more exuberant than the band's earlier work, upping the tempo and grandeur of the songs in a way that shines a little light on the band's darkness without snuffing it out completely. This rollicking clash between light and dark gives the album a kind of macabre tent-revival feeling. You can almost imagine a dilapidated tent appearing in a vacant lot overnight, its occupants inviting all who'll listen to enter and hear the tales they've picked up on the long and lonely road before disappearing without a trace the next day. This level of immersion alone makes Bitter Drink, Bitter Moon worth the time it takes to give it a listen, and the fact that the album is filled with killer songs to slam bourbon to is really just icing on the (probably arsenic-laced) cake.","torrent":{"xt":"urn:btih:b5eb5dfd50fde29bfaa80c8f886586259e743d12","amp;dn":"Murder+By+Death+-+Bitter+Drink%2C+Bitter+Moon+%282012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5eb5dfd50fde29bfaa80c8f886586259e743d12","infoHashBuffer":{"type":"Buffer","data":[181,235,93,253,80,253,226,155,250,168,12,143,136,101,134,37,158,116,61,18]},"announce":[],"urlList":[]}}