{"title":"A Tanu (Witness)(1969)[H.264][AAC][mp4][HU][ENSub]","uid":4256116,"size":717328778,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b602f4841e9dac911ed04ea83bbbd8ebdaa901e5&amp;dn=A+Tanu+%28Witness%29%281969%29%5BH.264%5D%5BAAC%5D%5Bmp4%5D%5BHU%5D%5BENSub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"z247","files":3,"time":1214251220,"description":"A Tanu (Witness)(1969)[H.264][AAC][mp4][HU][ENSub]\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0065067/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0065067/&lt;/a&gt; (with rating 9.1/10!!!)\n\n\nPlot: Banned for over a decade for its outspoken criticism of the post-WWII communist regime in Hungary, PÃƒÂ©ter BacsÃƒÂ³&amp;#039;s &amp;#039;The Witness&amp;#039; has since then achieved unparalleled cult status in its native land. Known as the best satire about communism, &amp;#039;The Witness&amp;#039; has become a cult classic, which was also well received by critics and general audiences alike when it was finally released outside of Hungary. Its candid and realistic portrayal of the incompetent communist regime has earned great acclaim for both the director and the film itself when it was shown at Cannes Film Festival in 1981. &amp;#039;The Witness&amp;#039; takes place during the height of the RÃƒÂ¡kosi Era, which was closely modeled after the ruthless and brutal Stalin regime. The film follows the life of an ordinary dike keeper, JÃƒÂ³zsef PelikÃƒÂ¡n, who has been caught for illegally slaughtering his pig, Dezso. Instead of doing hard time for his &quot;heinous&quot; crime, PelikÃƒÂ¡n is elevated into an important position, generally reserved for the communist elite. Of course, PelikÃƒÂ¡n is utterly clueless about his newfound luck, not to mention his new job. Even his new benefactor, the mysterious Comrade VirÃƒÂ¡g, is reluctant to reveal the real reason behind PelikÃƒÂ¡n&amp;#039;s preferential treatment. Thus, begins PelikÃƒÂ¡n&amp;#039;s hilarious adventure deep within the &quot;sophisticated&quot; communist society. One failure after another the incompetent PelikÃƒÂ¡n is elevated higher and higher on the communist echelon, all the while remaining completely clueless about his promotions. Until one day, when he gets called for to return the &quot;favour&quot; by falsely testifying against his long-time friend in a mock-up show trial. \n\nVideo: x.264, High Profile 5.1@Q21, 720*304 pixels\nAudio: LC AAC, 129 kbps ABR, stereo, 48 kHz, Hungarian\nSubs: English\nContainer: mp4\n\n\nSome explanations:\n1. I decided that I will not release 1 or 2CD releases anymore (or at least it will be something exceptional). I prefer high and constant quality rather than constant size, therefore I prefer to use quantizers. Do not afraid, the size will be not typical but I guarantee the quality will be good (Q21 AVC or Q3 XviD)\n2. I prefer to use mp4 instead of Mkv (matroska). I do not deny that the Mkv container is flexible, the thing is that the container is problematic if you want to reencode the movie with DVD Flick or other such tools. Audio and video is almost always desynced. I will use Mkv for special multiaudio releases (e.g. with director&amp;#039;s comments, etc.)\n3. the release contains the English subs. My DVD was bought in Poland and it includes only the English subs. The Polish ones are missing, however, there is an awful lector instead (cholera jasna, czemu w Polsce nie robi sie porzadnego dubbingu?). I got rid of him because I am sick when I hear how he slaughters the movie.\n4. I had to input &quot;spoken language: English&quot; because there is no Hungarian in the poptions of TPB. Sorry! \n\nGreetings from Poland to all my dear Hungarian friends who download this movie!\n\n\nEnjoy! \n\n\nPS http://en.wikipedia.org/wiki/Pole%2C_Hungarian%2C_two_good_friends :-)","torrent":{"xt":"urn:btih:b602f4841e9dac911ed04ea83bbbd8ebdaa901e5","amp;dn":"A+Tanu+%28Witness%29%281969%29%5BH.264%5D%5BAAC%5D%5Bmp4%5D%5BHU%5D%5BENSub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b602f4841e9dac911ed04ea83bbbd8ebdaa901e5","infoHashBuffer":{"type":"Buffer","data":[182,2,244,132,30,157,172,145,30,208,78,168,59,187,216,235,218,169,1,229]},"announce":[],"urlList":[]}}