{"title":"Tiny and Big - Grandpa's Leftovers GOG","uid":7366535,"size":1266445026,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b647f4ceca64dca1ce1f201705ed58cb62761d2a&amp;dn=Tiny+and+Big+-+Grandpa%27s+Leftovers+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ontotita","files":-1,"time":1340121668,"description":"genre: action / adventure / platformer\nrelease date: June 19, 2012\ncompatible with: Windows XP, Windows Vista, Windows 7 (32 &amp; 64 bit)\nlanguages: English, French, Italian, German, Spanish.\ndeveloper / publisher: Black Pants Studio / Black Pants Studio\ngame modes: single-player\n\nBonus content included for FREE with purchase:\n6 wallpapers\ngame track\n7 avatars\nartbook\nposter\nmap\n\nWhat's cool about it:\n\n    Unique sandbox gameplay ï¿½ use a grappling rope, advanced rocket science, and sophisticated laser surgery to slice ï¿½nï¿½ dice the entire world, overcoming all obstacles in your own unique fashion.\n    Follow Tiny into a bizarre and hilarious adventure and embark on an epic quest to get back grandpa's underwear. Yes, you read that correctly.\n    Lovingly hand-crafted textures, superb crosshatch-styled shading, and dynamic sound and text effects put you right in the middle of a graphic novel!\n\nOverview:\n\nThe game is set in a land where common physics apply, but everything else looks different. You are Tiny, a nerdy inventor with a ray cutter, a gripping-device, a ton of rockets, and a fine attitude towards the world. But now your arch-nemesis Big stole the only thing your beloved grandpa left you: a nice pair of white, finely ribbed underpants! And heï¿½s surely up to no good. Why else would he take them to that forsaken desert? No one ever goes there, itï¿½s called ï¿½that forsaken desertï¿½ for a reason. Sure, no one remembers why. But still--up to no good!\n\nAnyway, now itï¿½s up to you to save the worl--erm. Save the underpants! So fire up that homemade raygun (You invented it!) and take your annoying jibber-jabbering backpack to accompany you. The taxi to the desert is waiting! Meet mysterious creatures, a taxi robot, and your arch enemy: Big!\n\nImmerse yourself in this comic-styled jump-and-slice indie platformer that gives you the unique ability to shape the whole world at your will. So run, jump, drag, push, and laser your way through ancient scenery and get back those undergarments before Big accomplishes something thatï¿½s No Good!\n\nMinimum system requirements: Windows XP / Windows Vista / Windows 7, Core 2 Duo / Athlon X2, at least 2 GHz, 2GB RAM, ATI Radeon 2400 or better / NVIDIA GeForce 8600 or better, 2GB HDD, OpenAL compatible soundcard, 3 button mouse or Xbox 360 controller recommended. Requires Open GL drivers.\n\nInstallation\n\nInstall and play","torrent":{"xt":"urn:btih:b647f4ceca64dca1ce1f201705ed58cb62761d2a","amp;dn":"Tiny+and+Big+-+Grandpa%27s+Leftovers+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b647f4ceca64dca1ce1f201705ed58cb62761d2a","infoHashBuffer":{"type":"Buffer","data":[182,71,244,206,202,100,220,161,206,31,32,23,5,237,88,203,98,118,29,42]},"announce":[],"urlList":[]}}