{"title":"Her First Lesbian Sex 14 (Pink Visual) [DVDRip]","uid":11900741,"size":1463316480,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b6539f57b15c734dff388e3ac2e744d18b02a6f1&amp;dn=Her+First+Lesbian+Sex+14+%28Pink+Visual%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"chkm8te","files":2,"time":1431300498,"description":"Her First Lesbian Sex 14 (Pink Visual) [DVDRip]\n\nTyler Faith, Valerie Herrera, Ginger Lee, Franchezca Valentina, Isabella Sky, Emily Evermore, Krystal Jordan, Chelsea Ray, Kelly Divine, Kyra Steele, Kayla Paige, Aurora Chase\n\n2009 AVN Award Nominee for Best All-Girl Series\nLured in by our classified ad for models, picked up off the street, or called in for some personal training, these young, beautiful babes have never known the sweet taste of pussy. Though at first reluctant and shy, our sexy lezzie trainer shows the sapphic virgins the ropes, instructing them in the use of their mouths, fingers, toys, and strap-ons for their first lesbian sex experience!\n\nSome lesbians can't get their greedy little hands on enough wet pussy, so we kick things off with a threesome starring Franchezca Valentina, Chelsea Ray, and eighteen year old Aurora. You'll see one pillow queen get fucked with a vibrator while her friend sits on her face. Watching Valentina squirm while her Aurora buries her pretty little face between her thighs is amazing.\n\nIn scene two Emily Evermore inducts Valerie Herrera into the Sapphic sisterhood. She starts by stripping down a reluctant Herrera and revealing her gorgeous C cup tits. Soon Valerie gets her fine ass up in the air and Evermore starts ramming her tight pussy with a dildo, things really heat up. Watching both sluts riding a double dong as they scream with ecstasy is a fine way to cap off any JO session.\n\nThe girls in the third scene go at it hardcore as Ginger Lee bounces up and down on Isabella Sky's big rubber cock. These strap-on sluts are relentless as they lick, fuck and suck for thirty minutes.\n\nIf two girls isn't enough, the FFF threesome up next shows just how horny girls can be. Kayla Paige, Kelly Divine, and Kyra Steele screw until their exhausted. These carpet munchers take turns licking box on the living room couch before getting out the sex toys.\n\nFinally, there's one more lesbo seduction in store for you as Tyler Faith and Krystal Jordan break out the toy box. Faith does Jordan doggie style with her big rubber cock before both girls writhe on opposite ends of a double-ended dildo.\nCovers: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=s04wugkkgxh8jgzhth0t.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=s04wugkkgxh8jgzhth0t.jpg&lt;/a&gt;\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=alxdwd1lwzst2nns81uv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=alxdwd1lwzst2nns81uv.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=1atw893knled9dozgfss.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=1atw893knled9dozgfss.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:b6539f57b15c734dff388e3ac2e744d18b02a6f1","amp;dn":"Her+First+Lesbian+Sex+14+%28Pink+Visual%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6539f57b15c734dff388e3ac2e744d18b02a6f1","infoHashBuffer":{"type":"Buffer","data":[182,83,159,87,177,92,115,77,255,56,142,58,194,231,68,209,139,2,166,241]},"announce":[],"urlList":[]}}