{"title":"PC Ã‚Â» STREET FIGHTER IV Full Game directplay by globe@","uid":5247116,"size":1780151269,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b8280664af8e69620400ad6850e89ead23cfa1f4&amp;dn=PC+%C3%82%C2%BB+STREET+FIGHTER+IV+Full+Game+directplay+by+globe%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"globeplus","files":5,"time":1262028656,"description":"* Hello PC great games fans ...\n\n* Play the latest street fighter PC game ...\n\n* NOTE : This game use the Games For Windows Live\n\n\n* GAMEPLAY :\n\n* While Street Fighter IV features models and backgrounds rendered in 3D, the gameplay remains on a traditional 2D plane, with the camera having freedom to move in 3D at certain times during fights, for dramatic effect. Producer Yoshinori Ono has stated that he wanted to keep the game closer to Street Fighter II. A new system called &quot;Focus Attacks&quot; (&quot;Saving Attack&quot; for the Japanese version) has been introduced, as well as Ultra moves. The traditional six-button control scheme returns, with new features and special moves integrated into the input system, mixing classic gameplay with additional innovations.\nStephen Kleckner of 1UP.com has stated the game has a similar feel to Super Street Fighter II Turbo, but also has a few features from Street Fighter III 3rd Strike As in Street Fighter III, throwing is performed by pressing both light attack buttons, while pressing both heavy attack buttons performs the character's personal action or taunt. Pressing both medium attack buttons performs a character's focus strike. Dashes and quick standing are also in the game. C.Viper is the only character who can perform a high jump.\nIt was intended that bonus rounds such as the car-smashing stage from earlier Street Fighter games would return. Ono later stated that the bonus stages would not be in the arcade game, citing the reason to be that the time players spend on bonus stages is time during which they have no chance of losing, which ultimately takes money from arcade operators.\n\n\nMinimum PC System Requirements :\n================================\n\nOS:XP/Vista\nProcessor: 2GHZ or higher\nMemory: 1GB RAM or higher\nHard Drive: 7GB Free harddrive space\nVideo Memory: 7900GT or higher with shader 3.0\nSound Card: N/A\nDirectX: DX9\nKeyboard &amp; Mouse: N/A\n\n\n\n***** enjoy ... *****\n","torrent":{"xt":"urn:btih:b8280664af8e69620400ad6850e89ead23cfa1f4","amp;dn":"PC+%C3%82%C2%BB+STREET+FIGHTER+IV+Full+Game+directplay+by+globe%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8280664af8e69620400ad6850e89ead23cfa1f4","infoHashBuffer":{"type":"Buffer","data":[184,40,6,100,175,142,105,98,4,0,173,104,80,232,158,173,35,207,161,244]},"announce":[],"urlList":[]}}