{"title":"Kirk-Othmer Chemical Technology of Cosmetics","uid":15580795,"size":19674486,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b842d92df19e85c5c11eca5e42d173e99f46f894&amp;dn=Kirk-Othmer+Chemical+Technology+of+Cosmetics&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"clouderone","files":1,"time":1471401199,"description":"Kirk-Othmer Chemical Technology of Cosmetics - Kirk-Othmer, Arza Seidel (Wiley, 2013).pdf\r\n\r\nEducating professionals and students about the chemistry, formulation technology, and related regulatory aspects of cosmetics and perfume\r\n\r\nCosmetics and perfume comprise a multibillion-dollar global industry. Kirk-Othmer Chemical Technology of Cosmetics provides authoritative information on the substances and processes involved, including key product groups, ingredients, formulation technology, packaging, and regulatory topics in twenty-two articles.\r\n\r\nThis resource makes sense of a vast group of consumer products designed to improve the health, cleanliness, and physical appearance of the human exterior. It identifies natural and synthetic ingredients and gives details on formulation of the product so that the cosmetic is safe, easy to use, and performs as described. Particular attention is paid to the technologies that have been developed to produce them, including emulsification, stick technology, powder blending, and aerosol technology. Packaging is also addressed, as it must be attractive to the consumer, be environmentally friendly, and keep the product safe as well. Regulatory information reinforces the safety aspect.\r\n\r\nBased on Wiley's renowned Kirk-Othmer Encyclopedia of Chemical Technology, this book presents new and carefully updated articles, and features the same breadth and quality of coverage and clarity of presentation found in the original. This comprehensive guide is a valuable resource for chemists, R&amp;D professionals, dermatologists, patent attorneys, regulatory agencies, and other professionals in the field of personal care products. It is also a must-have reference for students who plan to enter the field","torrent":{"xt":"urn:btih:b842d92df19e85c5c11eca5e42d173e99f46f894","amp;dn":"Kirk-Othmer+Chemical+Technology+of+Cosmetics","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b842d92df19e85c5c11eca5e42d173e99f46f894","infoHashBuffer":{"type":"Buffer","data":[184,66,217,45,241,158,133,197,193,30,202,94,66,209,115,233,159,70,248,148]},"announce":[],"urlList":[]}}