{"title":"Kitty, Daisy &amp; Lewis-Kitty, Daisy &amp; Lewis-2008","uid":4569720,"size":72120708,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b871f7bf4252c7d1aaf472f5e817c0c155e46eba&amp;dn=Kitty%2C+Daisy+%26+Lewis-Kitty%2C+Daisy+%26+Lewis-2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1229014337,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nKitty Daisy &amp; Lewis are a three-piece band comprising the teenage siblings of the Durham family. Their music is influenced heavily by R&amp;B, swing, jump blues, country and Western, blues, Hawaiian and rock 'n' roll. They are all multi-instrumentalists playing guitar, piano, banjo, lapsteel guitar, harmonica, double bass, ukulele, drums, trombone, xylophone and accordion between them.\nKitty Durham (15) is the youngest of the group and primarily sings and plays drums, harmonica, ukulele, banjo, trombone and guitar. Lewis Durham (18) is the middle child who sings and plays guitar, piano, banjo, lapsteel and drums. He collects and plays/DJ's 78rpm records and has built a home studio for the band to record in. It consists of 1940's and 50's recording equipment such as 8 track tape machines and vintage BBC and RCA microphones. Kitty, Daisy and Lewis do not use computers or any digital format during the recording process. Daisy Durham (20) is the eldest of the group, who primarily sings and plays drums, piano, accordion and xylophone. They live in Kentish Town, north London and have all left school apart from Kitty who attends Acland Burghley School and is currently in her final year of GCSEs.\nThe band are signed to the Sunday Best record label who released their second single &quot;Mean Son Of A Gun&quot;, a song originally cut by Johnny Horton in the 50s, with the B-side &quot;Ooo Wee&quot; which they first heard on a 78rpm record sung by Louis Jordan. This was released on 45rpm, CD and a limited edition 78rpm vinyl. The tracks were recorded at home. The vinyl was also cut by Lewis using his own equipment (though possibly at The Exchange Mastering Studios, which is owned and run by his father Graeme). They have supported artists such as Jools Holland, Mika, Billy Bragg, Mark Ronson and Razorlight at London's Earls Court Arena. They also played the main stage at Bestival in 2006, 2007 and 2008 and played twice at Glastonbury in 2007 and 2008. They have featured in Vogue and performed on Blue Peter. The band also featured in the 2008 documentary We Dreamed America about the influence of American roots music on British musicians.\nWhen performing live their parents, Ingrid Weiss and Graeme Durham play double-bass and guitar respectively. Ingrid Weiss is the former drummer of The Raincoats and was made to play the double bass by Kitty Daisy &amp; Lewis.\nTheir 2008 self-titled album received a positive review from The Times, who said &quot;the vibe is irresistible&quot; Their new Christmas double AA single '(Baby) Hold Me Tight' and 'Buggin' Blues' will be released on 15th December 2008.\n\n","torrent":{"xt":"urn:btih:b871f7bf4252c7d1aaf472f5e817c0c155e46eba","amp;dn":"Kitty%2C+Daisy+%26+Lewis-Kitty%2C+Daisy+%26+Lewis-2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b871f7bf4252c7d1aaf472f5e817c0c155e46eba","infoHashBuffer":{"type":"Buffer","data":[184,113,247,191,66,82,199,209,170,244,114,245,232,23,192,193,85,228,110,186]},"announce":[],"urlList":[]}}