{"title":"uTorrent PRO v3.4.8 build 42576 Stable Multilingual","uid":15990853,"size":29508256,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b8a441c09fe5c8dfeea3220472c45e4e9b8b3385&amp;dn=uTorrent+PRO+v3.4.8+build+42576+Stable+Multilingual&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"maaknietuit","files":1,"time":1476015431,"description":"UTorrent PRO v3.4.8 build 42576 Stable Multilingual=========================================================================\r\n\r\nµTorrent - a quick, easy and compact torrent klent. Client µTorrent, today, is one of the most popular solutions for network BitTorrent. The program combines optimum functionality with a small amount. Supports the work regardless of the trekkers, lets you download multiple files at once, has a customizable bandwidth, rapid restoration of interrupted downloads, and more.\r\n\r\nOne of the best uTorrent has become a convenient, well thought out, very nice interface and fast response to user actions. It supports all the necessary functions for operation in BitTorrent P2P-network.\r\n\r\nThere are some features:\r\n- uTorrent supports parallel loading;\r\n- Rational use of bandwidth and allows you to customize it;\r\n- Built-in scheduler uTorrent manages tasks;\r\n- uTorrent has the ability to set the priority of traffic and adjust the speed;\r\n- It has features a quick stop and resume downloads;\r\n- uTorrent supports UPnP and NAT-PMP, as well as popular protocol extensions;\r\n- It has low memory consumption and small size of the program;\r\n- Supports reading RSS-feeds and download torrent-announcements;\r\n- Interacts with other customers without the need for the main tracker (DHT);\r\n- uTorrent supports the Protocol Encryption;\r\n- Interface uTorrent has supported the change order and the possibility of translation into other languages;\r\n- In uTorrent integrated remote control via HTTP-protocol, using web-interface (WebUI);\r\n- uTorrent works in all versions of OS Windows;\r\n- It is also possible to use uTorrent in Linux using Wine.\r\n\r\nµTorrent PRO\r\n\r\n- Stream Instantly\r\nWatch or preview torrents as they download, without waiting for the completed file.\r\n\r\n- Convert, download and play in many formats\r\nµTorrent Pro includes an HD media player or convert to play on any mobile device.\r\n\r\n- Premium New Features\r\nµTorrent Pro is always adding new features. Enjoy them at no extra cost.\r\n\r\n- Anti-Virus Protection\r\nKeep your PC safe by automatically scanning downloads for viruses and malware.\r\n\r\n- Early Access\r\nGain access to updates and cutting-edge features before anyone else.\r\n\r\n- No Ads\r\nAs a Pro user and a supporter of µTorrent, you can enjoy an ad-free experience.\r\n\r\nLangpacks:\r\nAlbanian, Arabic, Azerbaijani, Basque, Belarusian, Bosnian, Bulgarian, Catalan, Chinese (Simplified), Chinese (Traditional), Croatian, Czech, Danish, Dutch, Estonian, Finnish, French, Frisian, Galician, German, Greek, Hebrew, Hungarian, Icelandic, Italian, Japanese, Korean, Latvian, Lithuanian, Macedonian, Malay, Norwegian, Persian, Polish, Portuguese (Brazil), Portuguese (Portugal), Romanian, Russian, Serbian (Cyrillic), Serbian (Latin), Slovak, Slovenian, Spanish, Swedish, Taiwan, Thai, Turkish, Ukrainian, Valencian, Vietnamese.\r\n\r\nRealese Notes:\r\n\r\n2016-08-31: Version 3.4.8 (build 42576) Stable\r\n\r\n=========================================================================","torrent":{"xt":"urn:btih:b8a441c09fe5c8dfeea3220472c45e4e9b8b3385","amp;dn":"uTorrent+PRO+v3.4.8+build+42576+Stable+Multilingual","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8a441c09fe5c8dfeea3220472c45e4e9b8b3385","infoHashBuffer":{"type":"Buffer","data":[184,164,65,192,159,229,200,223,238,163,34,4,114,196,94,78,155,139,51,133]},"announce":[],"urlList":[]}}