{"title":"American Apartheid Segregation and the Making of the Underclass ","uid":8807055,"size":35794672,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b8ba17867f2c0cd434e78f35b22ae86d81300fd9&amp;dn=American+Apartheid+Segregation+and+the+Making+of+the+Underclass+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"blackatk","files":-1,"time":1376362457,"description":"American Apartheid: Segregation and the Making of the Underclass\n\n\nPublication Date: 1993 | ISBN-10: 0674018214 | ISBN-13: 978-0674018211\n\nThis powerful and disturbing book clearly links persistent poverty among blacks in the United States to the unparalleled degree of deliberate segregation they experience in American cities.\n\nAmerican Apartheid shows how the black ghetto was created by whites during the first half of the twentieth century in order to isolate growing urban black populations. It goes on to show that, despite the Fair Housing Act of 1968, segregation is perpetuated today through an interlocking set of individual actions, institutional practices, and governmental policies. In some urban areas the degree of black segregation is so intense and occurs in so many dimensions simultaneously that it amounts to &quot;hypersegregation.&quot;\n\nThe authors demonstrate that this systematic segregation of African Americans leads inexorably to the creation of underclass communities during periods of economic downturn. Under conditions of extreme segregation, any increase in the overall rate of black poverty yields a marked increase in the geographic concentration of indigence and the deterioration of social and economic conditions in black communities. As ghetto residents adapt to this increasingly harsh environment under a climate of racial isolation, they evolve attitudes, behaviors, and practices that further marginalize their neighborhoods and undermine their chances of success in mainstream American society. This book is a sober challenge to those who argue that race is of declining significance in the United States today.\n\n\nAmazon.com Review\n&quot;During the 1970s and 1980s a word disappeared from the American vocabulary,&quot; begins American Apartheid &quot;. . . That word was segregation.&quot; But the practice of segregation certainly has not disappeared, as Douglas S. Massey and Nancy A. Denton glaringly expose. One-third of all American blacks live in one of just 16 urban areas, in neighborhoods so racially segregated they have almost no chance at interracial contact. The authors argue that segregation--and disassocation from not only other cultures, but other ways of life--is at the root of many problems facing African-Americans today.\nFrom Scientific American\nA major contribution to our understanding of both racism and poverty. One hopes that the book will be read, not only by other scholars and policy analysts, but by a broad spectrum of citizens and by all the leaders of the nation. \n\n\nPaperback: 312 pages\nPublisher: Harvard University Press (1993)\nLanguage: English\nISBN-10: 0674018214\nISBN-13: 978-0674018211\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/American-Apartheid-Segregation-Making-Underclass/dp/0674018214/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/American-Apartheid-Segregation-Making-Underclass/dp/0674018214/&lt;/a&gt;\n\n\n\n\nTags: linguistics, apartheid, segregation, seperate but equal,  race, racism, white, NLP, psychology, sociology, frame, framing, Tags: race, racism, oppression, cyber, digital, white supremacy, white power, 88, narrative, media, pr, viewpoint, 88, ss, nsdp, aryan, nation, white narrative, contested, space, superiority, inferiority, subtle, racism, thought, logic, sociology, psychology, ethics, african, african american studies, AA, obama, militia, right, wing, mccain, bush, romney, tea, party, white anxiety, white rage, white guilt, inaction, complicity, slave, slavery, jim crow, segregation, knight, ku klux, inequality, Jim, Crow, race, racism, right, wing, republican, race coding, racially coded, subtle, doublespeak, George W Bush, George H.W Bush, Nixon, John Locke, William F Buckley, barack, obama, barry, black, biracial, IR, multiracial, preseident, bush, war, afghanistan, 2008, change, yes, we, can, hope, biden, china, afghanistan, tea, party, republican, democrat, politics, nobel, prize, war, peace, diplomacy, command, military, race, relations, racism, chicago, senator, white guilt, white anxiety, african, american, african american, black, racism, sociology, social mobiility, social climbing, mentor, race relations, race, militia, hate, nazi, white anxiety, oppression, tea party, fundamentalist, fundementalism, political science, hate group, ghettoization, blacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery, experimentation, tuskeegee, unconscious, subconscious,","torrent":{"xt":"urn:btih:b8ba17867f2c0cd434e78f35b22ae86d81300fd9","amp;dn":"American+Apartheid+Segregation+and+the+Making+of+the+Underclass+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8ba17867f2c0cd434e78f35b22ae86d81300fd9","infoHashBuffer":{"type":"Buffer","data":[184,186,23,134,127,44,12,212,52,231,143,53,178,42,232,109,129,48,15,217]},"announce":[],"urlList":[]}}