{"title":"EWQL - Voices of Passion","uid":8850357,"size":8194570294,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b915cb3b4f44e5e4a8ca343abeeb6c8d0d8621df&amp;dn=EWQL+-+Voices+of+Passion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":4,"uploader":"NewSky006","files":-1,"time":1377505361,"description":"Torrent Info:\n==============\n\nThis is not my own torrent!\n\n\nTorrent Contents:\n==================\n\n2 DVD .ISO's\nCrack directory\n\n\nInstallation:\n==============\n\nNote: I haven't been able to make this work, due to the PACE drivers not working under WINE (Windows emulation software for Linux). These instructions are not guaranteed to work at all!\n\nSecond note: These instructions are not available in the torrent, as this is not my own torrent. These are my instructions, which I hope will be clearer than the ones provided in the torrent.\n\n\n1) Extract or mount &quot;VOP Disk 1.toast&quot;, located in &quot;DVD1&quot; (this is actually an ISO)\n2) Run &quot;Voices of Passion Installer x32.msi&quot;.\n2.1) Select Custom installation (not typical).\n2.2) Make sure all components (Standalone, VST, Authorization Wizard, and Library) are installed entirely (&quot;Install entire feature&quot;).\n2.3) Take a note of each directory you set (e.g. Library install folder, VST Install folder, etc...). This is VERY important!\n3) Run &quot;setup.exe&quot; located in &quot;64-bit PACE Drivers&quot;.\n\n4) Extract or mount &quot;VOP Disk 2.toast&quot;, located in &quot;DVD2&quot; (the above applies here; this is an ISO)\n5) Run &quot;VOP D2.EXE&quot;, located in _Data\n6) Run &quot;VOP D1.EXE&quot;, located in _Data, in the first DVD (not the second). When it asks for you to enter the second DVD in, just hit cancel/abort.\n\n7) Go to the main crack directory (crackVOP v2.0Quantum Leap Player Unlock Method Test)\n8) Run &quot;Voices of Passion Installer x32.msi&quot;, located in &quot;SETUP &amp; UPDATES PC only&quot;\n9) Copy the contents of &quot;In-Documents and Settings-All Users-Application Data&quot; to Documents and SettingsAll UsersApplication Data. (Sorry if this is incorrect, I do not have an actual windows machine)\n10) Copy the contents of &quot;In-Program Files&quot; to C:Program Files (you might need to add &quot;(x86)&quot;, depending on where Voices of Passion was installed).\n11) Copy &quot;TPkd.sys&quot; from &quot;In-WINDOWS-system32-drivers&quot; to C:WINDOWSsystem32drivers.\n\n12) COPY (not rename... this is important!) &quot;VOP-Edit-yours.reg( rename-in  .reg and clic).txt&quot; to &quot;VOP-Edit-yours.reg( rename-in  .reg and clic).reg&quot;.\n13) Open &quot;VOP-Edit-yours.reg( rename-in  .reg and clic).reg&quot; in notepad (or any other plain-text editor).\n14) Find &quot;VOP Library&quot; in the file, and change each path (e.g. &quot;C:VOP Library&quot;) to the path where the Voices of Passion library was installed. For example, if you installed the library to &quot;C:Program FilesVOP Library&quot;, you would replace each instance of &quot;C:VOP Library&quot; to &quot;C:Program FilesVOP Library&quot;.\n15) Run regedit (Start Menu -&gt; Run -&gt; regedit.exe). Don't close the text editor though!\n16) Find the LAST folder under HKEY_USERS (should start somewhat like &quot;S-1-5-21-&quot;, and then it will contain more digits).\n17) In the text editor, find &quot;HKEY_USERSS-1-5-21&quot;. As I wrote in the previous step, there should be numbers after it (but probably not the same numbers that you saw in &quot;regedit&quot;). Delete that sequence of numbers, and replace it by the sequence of numbers you saw in &quot;regedit&quot;. For example, if you saw &quot;HKEY_USERSS-1-5-21-2052111302-1960408961-682003330-1000&quot;, you would replace the &quot;S-1-5-21-205...&quot; part by the part you saw in &quot;regedit&quot; (for me, it's &quot;S-1-5-21-0-0-0-1000&quot;). Repeat this for every instance of the &quot;HKEY_USERSS-1-5-21-...&quot; sequence, until everything is replaced. Tip: Use &quot;Replace All&quot;!\n18) Save the file\n19) Under &quot;regedit&quot;, select Registry -&gt; Import Registry File, and navigate to &quot;VOP-Edit-yours.reg( rename-in  .reg and clic).reg&quot; (and click on &quot;Import&quot;).\n\n20) Reboot.\n\n\nProduct Info:\n==============\n\nVOICES OF PASSION is a tool designed to use vocal samples as the foundation for creating new instruments, and includes female vocals from Wales, Syria, India, Bulgaria and America. It includes ethereal, passionate, flowing, mysterious, wailing and whispering vocals for Film, TV and Game composers as well as songwriters, new age artists and zen horticulturists. Altos and Sopranos. VOICES OF PASSION is not designed to replace a live singer in your studio.\n\nVOICES OF PASSION features 5 stunning female artists singing vowels, words, morphing vowels, effects, phrases, calls, whispers and breath noises. This is the first virtual instrument created specifically for use in the film/TV/game genre. This is also the first virtual instrument or sample library created specifically for use in ambient or new age music.\n\nVOICES OF PASSION is the first virtual instrument to feature true legato intervals (American and Wales only). The Middle Eastern and Indian phrases are presented in a construction kit format allowing users to create very long consistent performances. Mod-wheel controls entry point on ethnic phrases.\n\nQUICK FACTS\nProduced by NICK PHOENIX\nOver 7 GBs of vocals\nFemale Vocalists from Wales, Syria, India, Bulgaria and America\nAll singers recorded with great attention paid towards pitch\nOo, oh and ah true legato intervals (American and Wales only)\nOver 1000 ethnic phrases with a great deal of passion\nPhrase generator for Welsh vocals\nExpressive samples, non vibrato, delayed vibrato\nEthereal style, breathy vocals\nNew Age vocal performances, staccato and swells\nPLAY features allow for very quick and intuitive sound loading and organization\nAll singers recorded with a Telefunken Elam 251 and a RCA 44 ribbon mic for tonal variation","torrent":{"xt":"urn:btih:b915cb3b4f44e5e4a8ca343abeeb6c8d0d8621df","amp;dn":"EWQL+-+Voices+of+Passion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b915cb3b4f44e5e4a8ca343abeeb6c8d0d8621df","infoHashBuffer":{"type":"Buffer","data":[185,21,203,59,79,68,229,228,168,202,52,58,190,235,108,141,13,134,33,223]},"announce":[],"urlList":[]}}