{"title":"Viaggio in Italia (1954) - Roberto Rossellini","uid":4192187,"size":1285278669,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b9303549f295985a35dd3bbe658050ee2971d4e9&amp;dn=Viaggio+in+Italia+%281954%29+-+Roberto+Rossellini&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"freegoodcinema","files":2,"time":1211025102,"description":"Viaggio in Italia, 1954\n\nRoberto Rossellini\n\n\n[This information and file were posted by raydel in Cinema Obscura. My intention was to make this milestone film available to everyone. Thanks raydel for making it available to me.]\n\n\nReview: &lt;a href=&quot; http://www.filmref.com/directors/dirpag&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.filmref.com/directors/dirpag&lt;/a&gt; ? llini.html\n\nVoyage in Italy opens to a shot of a reserved British couple, Alex (George Sanders) and Katherine Joyce (Ingrid Bergman) traveling in silence down a long, empty, narrow road on the Italian countryside. They are awaiting the sale of an inherited villa in Naples, and have decided to seize the occasion and spend undivided time together by touring the regional attractions. But away from the structure and familiarity of their comfortable life in London, the trip begins to expose the tedium and strain of their relationship. As Alex&amp;#039;s demeanor turns from complacent boredom to outward hostility towards the unfamiliar customs of a foreign land, it is evident that he indirectly lashes out at Katherine&amp;#039;s misguided, romantic ideas that led them to their lonely, uncomfortable journey. One day, Katherine melancholically recounts the story of a former suitor who became gravely ill after risking his health in order to see her (a thematic reference to James Joyce&amp;#039;s The Dead), but Alex remains unmoved by the incident, and dismisses the folly of the young man&amp;#039;s actions. As an emotional defense, Katherine withdraws from Alex, wounded by his disaffection for her tale of lost, unrequited love. When Alex shows disinterest in Katherine&amp;#039;s touring plans, the two agree to make independent plans during their remaining days in Naples. As Alex joins a company of idle British tourists in Capri, Katherine occupies herself by visiting natural wonders, and symbolically, finds a reflection of her own surfacing emotional conflict over her eroding marriage.\n\nRoberto Rossellini creates a graceful, understated portrait on the dissolution of marriage in Voyage in Italy. A stylistic influence on the bleak industrial landscapes of Michelangelo Antonioni, Rossellini introduces the environment as a relevant, dynamic character in the lives of a married couple in crisis, and provides a visual metaphor for suppressed emotions. The echo of the Greek fortress caves and the ionization of the craters near Vesuvius become literal reflections of Katherine&amp;#039;s physical actions. Moreover, the contained eruption just beneath the surface of &quot;small Vesuvius&quot;, the catacombs of a village church, and the uncovered casts of human bodies at Pompeii further represent Katherine&amp;#039;s inner turmoil and marital disillusionment. The final scene shows Katherine figuratively swept away by an environmental tide of emotional abandonment. It is in this confusion that they find themselves desperately searching for each other - hopelessly lost and unable to be together - and realize their own incompleteness and mutual need. It is a resigned reconciliation\n\n\nCast:\n\n    Ingrid Bergman    ...     Katherine Joyce\n    George Sanders    ...     Alexander &amp;#039;Alex&amp;#039; Joyce\n    Maria Mauban    ...     Marie (as Marie Mauban)\n    Anna Proclemer    ...     La prostituta\n    Paul Muller    ...     Paul Dupont\n    Anthony La Penna    ...     Tony Burton (as Leslie Daniels)\n    Natalia Ray    ...     Natalie Burton (as Natalia Rai)\n    Jackie Frost    ...     Betty\n\n\n\n\nGenre: Drama\nCountry: Italy\nLanguage: English\nSubtitles: none\nSource: BFI dvd\nRipper: raydel\n\n\nIMDB: &lt;a href=&quot; http://imdb.com/title/tt0046511/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imdb.com/title/tt0046511/&lt;/a&gt;\n\nVideo\nFile Name .............: Viaggio.in.Italia-1954-Roberto. Rossellini.avi\nFile Size..:1,225 MB  (1,285,273,600 bytes)\nRuntime (# of frames) .: 1:21:43 (122,560)\n\nVideo Codec ...........: XviD ISO MPEG-4\nFrame Size ............: 640x480 (AR: 1.333)\nFPS ...................: 25.000\nVideo Bitrate .........: 1872 kb/s\nBits per Pixel ........: 0.244 bpp\nB-VOP, N-VOP, QPel, GMC ......: [B-VOP]...[]...[]...[]\n\nAudio\nAudio Codec ...........: 0x0055 MPEG-1 Layer 3\nSample Rate ...........: 48000 Hz\nAudio bitrate .........: 101 kb/s [2 channel(s)] VBR audio\nInterleave ............: 40 ms\nNo. of audio streams ..: 2\n\nNote: The secondary audio stream is the commentary.\n\n\n********************************* FREAKYFLICKS ***********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;","torrent":{"xt":"urn:btih:b9303549f295985a35dd3bbe658050ee2971d4e9","amp;dn":"Viaggio+in+Italia+%281954%29+-+Roberto+Rossellini","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9303549f295985a35dd3bbe658050ee2971d4e9","infoHashBuffer":{"type":"Buffer","data":[185,48,53,73,242,149,152,90,53,221,59,190,101,128,80,238,41,113,212,233]},"announce":[],"urlList":[]}}