{"title":"Resolume Avenue 4.5.2 Revision 56350 + Keygen [SadeemPC]","uid":13894825,"size":1007838982,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b96359d7a17c86c8f4db8308e1f457d4a2c858dc&amp;dn=Resolume+Avenue+4.5.2+Revision+56350+%2B+Keygen+%5BSadeemPC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"SadeemPC","files":1,"time":1458238798,"description":"Resolume Avenue 4.5.2 Revision 56350 Multilingual | 961.16 MB\r\n\r\nResolume Avenue VJ Software - Avenue is an instrument for VJs, AV performers and video artists. Avenue puts all your media and effects right at your fingertips, so you can quickly play and improvise your live visuals.\t\r\n\r\nScreen Warping &amp; Video Mapping Arena\r\nIn the advanced output window you can now create as many slices from your composition and position and transform them to your liking. This is perfect for projection mapping on many surfaces. Your surfaces do not have to be rectangular anymore either, you can warp your video onto curved screens with the advanced bezier transformations.\r\n\r\nGenerative Content\r\nResolume plays all your interactive Quartz Composition and Flash animations including AS2 and AS3 scripting. Use it to display text input from Resolume and with parameters you can gain even more control over your animations and tweak your content while VJ-ing. Watch the Resolume &amp; Flash Video. Watch the Quartz Composer Video. If you're feeling really adventurous your can even code your own generative content in openGL by compiling FFGL source plugins. \r\n\r\nOther New Features in Resolume 4\r\n• You configure every layer to automatically start the first clip when the composition has loaded. This is very handy for installations where Resolume needs to start playing clips automatically in combination with the Auto Pilot.\r\n• Ignore Column Trigger, prevents clip from being triggered when the column triggers are used.\r\n• Scale to Fit button for clip now cycles through 4 modes, first it will scale taking into account ratio and fill to the hight or the width, then it will just match the composition size and the fourth time it's back to default, this also works when multiple clips are selected.\r\n• Recent compositions menu for quick access to last opened compositions.\r\n• New version of DXV Codec (2.2) compresses files faster by utilizing multiple processors.\r\n• Invert checkbox for mouse mapped controls.\r\n• Type ahead selection in File,Effect and Composition browser.\r\n• Position of windowed output is remembered.\r\n• Windowed output position can be changed with the arrow keys.\r\n• Show Display Info (option in the menu to identify the different displays).\r\n• Global Clip Start offset to compensate for clip trigger latency via MIDI or OSC.\r\n• Tailored MIDI support for Akai APC Midi controller.\r\n• Invert option for masks.\r\n• Value editor popup for parameters.\r\n• Ease in-out for all parameters.\r\n• Drop effect directly on layer thumbnail.\r\n• Drag file on video or audio track zone in clip properties panel to replace video or audio track without resetting parameters.\r\n• Property panel sizes and layout is remembered.\r\n\r\nResolume 4 Enhancements\r\n• Smaller composition files for quicker loading of decks.\r\n• Great reduction of memory usage.\r\n• Effect presets are stored in separate files, this makes it easier to import and share user presets.\r\n• Improved recording performance.\r\n• Preview panel checkerboard backdrop for better transparency viewing.\r\n• Faster OSC input.\r\n• Flash text field transparency fix on Windows.\r\n• Better FFGL Syphon support.\r\n• Much faster thumbnailing and analysis of audio clips.\r\n• ArtNet DMX fixes.\r\n• Improved rendering of odd sized files.\r\n\r\nNew Plugins in Resolume 4\r\nCrop, Delay RGB, Infinite Zoom, Terrain, Line Scape (source), Lines (source), Cut (mixer). Plugin Mixer pack is now included in version 4.\r\n\r\nMinimum System Requirements\r\n• Windows 7 or XP: ATI Radeon 9600 or better. NVIDIA GeForce FX 5200 or better. 2GB RAM.\r\n• Mac OSX 10.4.9 or later. Intel processor. Quartz Extreme graphics card (Resolume is not compatible with integrated Intel graphics processors). 2GB RAM.\r\n\r\nNew in Version 4.5.2:\r\nNEW:\r\n•\tNew effects: ParticleSystem, PolarKaleido and Sparkles\r\n•\tChinese interface translation by Antonio Sou\r\n•\tGerman interface translation by Walter Riemenschneider\r\n•\tCopy/Cut/Paste Slices &amp; Fixtures\r\n•\tActivate advanced output Pan Tool with middle mouse click\r\n•\tBPM ticker is highlighted on every 16th beat, starting with the 1st\r\n•\tOSC input can take doubles as well as floats\r\n\r\nFIXED:\r\n•\tInserting any USB device can cause Resolume to hang for a few seconds\r\n•\tCrash with USB display device on OSX\r\n•\tEnttec USB device support for OSX El Capitan\r\n•\tEdge blending applies wrong blending when slices get stretched out\r\n•\tAdvanced Output defaults to nearest neighbor scaling\r\n•\tWhen in Output Transform tab, click through shouldn't select slices from other screens\r\n•\tFlash colors shown incorrect on El Capitan\r\n•\tUser is prevented from entering same port for OSC input and output on the same IP\r\n•\tGive some more info when trying to load an 4 screen setup preset in 5\r\n•\tImmediate deselect for warped slices\r\n•\tAdvanced output UI does not like non-latin characters\r\n•\tSelection of Screen is heavy and causes output to stop for a moment\r\n•\tRemove 'Lumiverse 1' from the DMX input name\r\n•\tAV fader doesn't pick up A and V slider when controlled via dmx/osc/midi\r\n•\tMatch Shape on multiple polygon slices\r\n•\tImprove copy naming behaviour\r\n•\tSMPTE offset for clip has wrong calculation when set to 29.97\r\n•\tFixture editor doesn't function with non-latin characters in user name\r\n•\tOutput masks are not re-rendered when reordered in the treeview\r\n•\tScrambled Japanese characters in output setup\r\n•\tInput mask outputs black on non-masking area instead of transparent\r\n•\tOnly draw fixture contents if its Lumiverse is selected\r\n•\tFixture Path is constructed from FileName, but our paths should only contain ASCII characters\r\n•\tRemove match output shape for DMX Fixtures\r\n•\tWarping header is only visible when it has anything to show","torrent":{"xt":"urn:btih:b96359d7a17c86c8f4db8308e1f457d4a2c858dc","amp;dn":"Resolume+Avenue+4.5.2+Revision+56350+%2B+Keygen+%5BSadeemPC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b96359d7a17c86c8f4db8308e1f457d4a2c858dc","infoHashBuffer":{"type":"Buffer","data":[185,99,89,215,161,124,134,200,244,219,131,8,225,244,87,212,162,200,88,220]},"announce":[],"urlList":[]}}