{"title":"All Joy and No Fun - The Paradox of Modern Parenthood - EPUB","uid":9672194,"size":346136,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b9ca141ce8355833386be35b140fba21751c8840&amp;dn=All+Joy+and+No+Fun+-+The+Paradox+of+Modern+Parenthood+-+EPUB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"AtomTPB","files":1,"time":1393485099,"description":"Language: English\nFormat: EPUB\nISBN-10: 0062072226\nASIN: B00DB2WQAQ\nPublished: 2014\nPages: 320 pages\n\nThousands of books have examined the effects of parents on their children. In All Joy and No Fun, award-winning journalist Jennifer Senior now asks: what are the effects of children on their parents? In All Joy and No Fun, award-winning journalist Jennifer Senior tries to tackle this question, isolating and analyzing the many ways in which children reshape their parents'lives, whether it's their marriages, their jobs, their habits, their hobbies, their friendships, or their internal senses of self. She argues that changes in the last half century have radically altered the roles of today's mothers and fathers, making their mandates at once more complex and far less clear.\nRecruiting from a wide variety of sources-in history, sociology, economics, psychology, philosophy, and anthropology-she dissects both the timeless strains of parenting and the ones that are brand new, and then brings her research to life in the homes of ordinary parents around the country. The result is an unforgettable series of family portraits, starting with parents of young children and progressing to parents of teens. Through lively and accessible storytelling, Senior follows these mothers and fathers as they wrestle with some of parenthood's deepest vexations-and luxuriate in some of its finest rewards.\nMeticulously researched yet imbued with emotional intelligence, All Joy and No Fun makes us reconsider some of our culture's most basic beliefs about parenthood, all while illuminating the profound ways children deepen and add purpose to our lives. By focusing on parenthood, rather than parenting, the book is original and essential reading for mothers and fathers of today-and tomorrow.","torrent":{"xt":"urn:btih:b9ca141ce8355833386be35b140fba21751c8840","amp;dn":"All+Joy+and+No+Fun+-+The+Paradox+of+Modern+Parenthood+-+EPUB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9ca141ce8355833386be35b140fba21751c8840","infoHashBuffer":{"type":"Buffer","data":[185,202,20,28,232,53,88,51,56,107,227,91,20,15,186,33,117,28,136,64]},"announce":[],"urlList":[]}}