{"title":"Good Talk, Dad - Bill Geist and Willie Geist - Audiobook MP3","uid":10706681,"size":163912691,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ba40bd9b7e36701229da68433d01f205f0718cc4&amp;dn=Good+Talk%2C+Dad+-+Bill+Geist+and+Willie+Geist+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1407300802,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nGood Talk, Dad: The Birds and the Bees...and Other Conversations We Forgot to Have\n\nWritten by: Bill Geist, Willie Geist\nNarrated by: Bill Geist, Willie Geist\nLength: 5 hrs and 40 mins\nFormat: Unabridged\nRelease Date:05-20-14\n\nFrom popular TV hosts and best-selling authors Bill and Willie Geist, a hilarious testament to the special nature of father-son relationships.\n\nIn Good Talk, Dad, this talented father-son team shares stories of their funny and heartwarming relationship. Told in a unique back-and-forth banter style, this extended conversation riffs on everything from music and sports to summer camp, driving lessons, and family life. Imagine Big Russ &amp; Me meets Sh*t My Dad Says.\n\nAfter Bill went public with his struggle with Parkinsons disease, the Geists decided to collaborate on this book so their children and grandchildren would have a record of their unique bond. Now that Willie is a father (and Bill a grandfather), Willie has continued Bill's child-rearing traditions in the hopes of carrying on the riotous Geistian parenting legacy. The result is delightfully entertaining, wildly funny, and poignant as well. ","torrent":{"xt":"urn:btih:ba40bd9b7e36701229da68433d01f205f0718cc4","amp;dn":"Good+Talk%2C+Dad+-+Bill+Geist+and+Willie+Geist+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba40bd9b7e36701229da68433d01f205f0718cc4","infoHashBuffer":{"type":"Buffer","data":[186,64,189,155,126,54,112,18,41,218,104,67,61,1,242,5,240,113,140,196]},"announce":[],"urlList":[]}}