{"title":"Doug MacLeod Brand New Eyes(2011) (blues acoustic)(flac)[rogercc","uid":6462414,"size":250044313,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ba9339f847fbddc2ea995133d009c47db9e8143a&amp;dn=Doug+MacLeod+Brand+New+Eyes%282011%29+%28blues+acoustic%29%28flac%29%5Brogercc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"rogercc1","files":14,"time":1307819208,"description":"DOUG MacLEOD BRAND NEW EYES\nReleased: 8 March 2011\nLabel:Fresh\nFormat:Flac\n\n\n\nTrue blues. These two words define in style and commitment the acoustic music composed and played by Doug MacLeod, a singersongwriter in the American tradition.\nMacLeod has been a beacon of unquestionably honest roots-music since the 1970s. Proof enough: 16 albums, a couple of DVDs, and thousands of gigs stateside and overseas. And in December, the announcement by the Blues Foundation of his nomination for the 2011 Blues Music Award as Acoustic Artist of the Year.\nNow, the release of his new album, Brand New Eyes (FR-703) on the new label Fresh! from RR, a division of the 35 year-old multi-Grammy nominated, audiophile label Reference Recordings. With\nliner notes by Downbeat columnist and Grove Press author Frank-John Hadley, Brand New Eyes offers Doug's sincere voice and lyric ease supported by his highly individual guitar stylings.\nOn Brand New Eyes, MacLeod presents 11 original songs. In a genre often reliant on old standards, he is the rare traveling artist who writes and sings original songs that are based on his own life and experiences. He learned from the old masters, lived the music,survived the life and carries forward a valuable tradition. MacLeod is known for his superb songwriting, guitar wizardry, warm soulful vocals, wit and unforgettable live performances. At the heart of this is his knack for storytelling, bringing characters -- from the faceless to the legendary -- to strikingly real life.(from Press Release)\n\nTracklist\n\n1 Brand New Eyes 5:40\n2 Something Dark is Walking 4:28\n3 The Train of Change 5:10 **\n4 Midnight in Memphis 6:00\n5 Zu-Zu Woman 3:35\n6 One Eyed Owl 4:15\n7 Somewhere South of Somewhere 5:35 (instrumental)\n8 I Rolled a Nickel 4:59\n9 The Nature of the Man 4:161\n10 Some Old Blues Song (aka I Can Count on My Blues)* 6:40\n11 Welcome In Your Home 5:10\n\n** Denny Croy, string bass and Dave Kida, drums\n*The original title was Some Old Blues Song, but when Bruce Iglauer\nof Alligator wanted to record it with Son Seals he preferred it to be\ncalled I Can Count On My Blues.","torrent":{"xt":"urn:btih:ba9339f847fbddc2ea995133d009c47db9e8143a","amp;dn":"Doug+MacLeod+Brand+New+Eyes%282011%29+%28blues+acoustic%29%28flac%29%5Brogercc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba9339f847fbddc2ea995133d009c47db9e8143a","infoHashBuffer":{"type":"Buffer","data":[186,147,57,248,71,251,221,194,234,153,81,51,208,9,196,125,185,232,20,58]},"announce":[],"urlList":[]}}