{"title":"Acoustica - Beatcraft v1.02 Build 19 with serial.","uid":4341430,"size":8903018,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:baa708e0a52606c97cd91db2d9c5770bf4c2c490&amp;dn=Acoustica+-+Beatcraft+v1.02+Build+19+with+serial.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"romelanda","files":6,"time":1218624616,"description":"Beatcraft &quot;Make Your OWN Sweet Beat!&quot; \n\nAcoustica Beatcraft is an extremely powerful, easy to use Drum Machine software program for beginners and professionals alike! It&amp;#039;s friendly, streamlined interface makes beat generation fast, while allowing your unlimited creativity to pour through. Beatcraft features an extensive library of top-quality, professional drum sounds, powerful sequencing and loop generation tools, and killer audio effects, all wrapped in a clean and comfortable interface with a 32 bit state-of-the-art sound engine. Leave the dust cover on your drum set - Beatcraft is all you need to capture the power and rhythm of the world&amp;#039;s best drummers. From light jazz beats to crushing hip hop beats, rap beats, heavy metal, 4-on-the-floor, straight ahead rock and roll to time-warping electronica and progressive rock, from dance and R&amp;B to the edge of your imagination, Acoustica Beatcraft does it all!\n\nBeatcraft Features: \nUnlimited drum tracks! \nHundreds of professional-quality drum sounds and patterns built in, including rap, hip hop, rock, dance, jazz and electronica. \nPowerful-yet-easy beat pattern interface! \nEasy drag-and-drop interface for manipulating sounds and patterns! \nAdvanced features including triplets, low-pass and high-pass resonant filters on every step, audio choke, reverse, rate change, and more! \nPowerful pattern sequencer with live looping controls, tempo change flags, and unlimited sequencer tracks! \nUse any WAV, MP3, WMA, or OGG file as a drum sound! \nUnlimited track-level and global effects, including reverb, delay, flanger, distortion, and 3rd party VST and DirectX effects! \nRender patterns, sequences, and loops to WAV, MP3, WMA, and OGG format! \nSee more for yourself! \n&quot;Make Your Own Sweet Beat!&quot; \n\nHomepage - http://www.acoustica.com/\n","torrent":{"xt":"urn:btih:baa708e0a52606c97cd91db2d9c5770bf4c2c490","amp;dn":"Acoustica+-+Beatcraft+v1.02+Build+19+with+serial.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"baa708e0a52606c97cd91db2d9c5770bf4c2c490","infoHashBuffer":{"type":"Buffer","data":[186,167,8,224,165,38,6,201,124,217,29,178,217,197,119,11,244,194,196,144]},"announce":[],"urlList":[]}}