{"title":"The Vampire Diaries - Season 1 (Complete)","uid":8043168,"size":8075089920,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:baa841137f46e5088cca28e0510751238d2d9ee8&amp;dn=The+Vampire+Diaries+-+Season+1+%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":5,"uploader":"libreme","files":22,"time":1358690994,"description":"The series follows the life of Elena Gilbert a 17-year-old girl, who falls deeply in love with a 162-year-old vampire named Stefan Salvatore. Their relationship becomes increasingly complicated as Stefan's vicious, and malevolent older brother Damon Salvatore returns with a plan to wreak havoc on the town and a revenge against his younger brother. Both brothers begin to show affection towards Elena, mainly because of her resemblance to their past love Katherine Pierce. It is revealed that Elena is a descendant of Katherine, who eventually returns with plans against the trio.\n\nThe series is set in the fictional town of Mystic Falls, Virginia, a town charged with supernatural history since its settlement of migrants from New England in the late 17th century. Other story lines revolve around the other inhabitants of the town, most notably Elena's younger brother Jeremy Gilbert, her best friends Bonnie Bennett and Caroline Forbes and their mutual friends Tyler Lockwood and Matt Donovan. The town's politics are orchestrated by descendants of the original founding families, all comprising a &quot;Founders' Council&quot;. Some of the founding families of Mystic Falls include the Salvatores, the Gilberts, the Fells, the Forbes and the Lockwoods. They guard the town mainly from vampires, although there are other supernatural threats such as werewolves, witches, ghosts and hybrids.\n\nThe Vampire Diaries Season 1\n\nThe series focuses on the fictional town of Mystic Falls, Virginia, that is charged with supernatural history. It follows Elena Gilbert as she begins to get over her parents' death and two vampire brothers, Stefan and Damon Salvatore. Kayla Ewell portrayed Vicki Donovan for the first seven episodes until her character was killed off. Matt Davis was later cast as a history teacher in a recurring role to fill the void. He was later upgraded to series regular status. The season concluded on May 13, 2010, comprising 22 episodes.\n\n---------------------------------------------------------\n\nIf you think torrents are too slow in downloading, check www.libretanan.com for direct downloads of these episodes (completely free).\n\nIf direct downloads are slow for you, then use torrent to download these episodes. Direct downloads are only fast when only you or a few clients are downloading. Otherwise, use torrents to download pieces of these files from different seeders/peers.\n---------------------------------------------------------","torrent":{"xt":"urn:btih:baa841137f46e5088cca28e0510751238d2d9ee8","amp;dn":"The+Vampire+Diaries+-+Season+1+%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"baa841137f46e5088cca28e0510751238d2d9ee8","infoHashBuffer":{"type":"Buffer","data":[186,168,65,19,127,70,229,8,140,202,40,224,81,7,81,35,141,45,158,232]},"announce":[],"urlList":[]}}