{"title":"Funeral for a Friend - Discography (2002-2013) [FLAC]","uid":8845277,"size":3500056382,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bb4b9b439ba819075069199ed498ff86ff8e92f2&amp;dn=Funeral+for+a+Friend+-+Discography+%282002-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":5,"uploader":"politux","files":-1,"time":1377363940,"description":"\n  Funeral for a Friend - Discography (2002-2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Post-Hardcore, Screamo, Alternative\n  Source: CD\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  2002 Between Order and Model EP\n  2003 Casually Dressed &amp; Deep in Conversation\n  2003 Four Ways to Scream Your Name EP\n  2003 Seven Ways to Scream Your Name EP\n  2005 Hours\n  2007 Tales Don't Tell Themselves\n  2007 Tales Don't Tell Themselves (Japan)\n  2008 Memory and Humanity\n  2009 Your History is Mine 2002-2009\n  2011 Welcome Home Armageddon\n  2013 Conduit  \n\n  Funeral for a Friend's energized blend of emo, metal, and post-hardcore was created by vocalist Matt Davies, guitarists Kris Roberts and Darran Smith, bassist Gareth Davies, and drummer Randy Richards. The Welsh quintet first appeared in 2002 with a series of EPs and singles, including Between Order and Model, Four Ways to Scream Your Name, and Juneau. Such releases helped land the group on the cover of Kerrang! magazine, a recognition of the band's growing hype that, in turn, earned a record deal with Warner Music. Funeral for a Friend's debut full-length, Casually Dressed &amp; Deep in Conversation, was then issued in October 2003. It was not given a concurrent U.S. release; instead, the seven-track mini-CD Seven Ways to Scream Your Name (collecting non-album tracks from the earlier EPs) appeared domestically via the New Jersey indie label Ferret. Meanwhile, Funeral for a Friend embarked on a series of high-profile touring engagements, including a series of European dates opening for Iron Maiden.\n\n  Touring continued through summer 2004, and the Spilling Blood in 8mm DVD appeared in September with live footage, videos, and a band documentary. Funeral for a Friend returned in June 2005 with Hours, their second full-length; more touring followed, including the band's first stint on the Warped Tour. The guys also picked up that year's Kerrang! award for Best British Band. Back at home by the end of 2005, Matt Davies utilized some downtime from touring to work on material for his first side project, the alt-country-inspired the Secret Show, whose debut album was released in February 2007. Three months later, Funeral for a Friend issued their next album, Tales Don't Tell Themselves, subsequently jumping on the road for headlining dates in the U.K. and U.S. before spending summer on the Warped Tour. Memory and Humanity followed shortly thereafter, arriving during the final quarter of 2008 and featuring the band's familiar mix of emo-influenced songcraft and anthemic rock uplift. A fifth album, the apocalypse-themed Welcome Home Armageddon, arrived in 2011, and was followed later that year by the tie-in EP, See You All in Hell. The following year, longtime drummer Ryan Richards parted ways with the band, citing a desire to focus on his family, and was replaced by Pat Lundy. Whole again, the band released their sixth full-length album, Conduit, in early 2013.","torrent":{"xt":"urn:btih:bb4b9b439ba819075069199ed498ff86ff8e92f2","amp;dn":"Funeral+for+a+Friend+-+Discography+%282002-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb4b9b439ba819075069199ed498ff86ff8e92f2","infoHashBuffer":{"type":"Buffer","data":[187,75,155,67,155,168,25,7,80,105,25,158,212,152,255,134,255,142,146,242]},"announce":[],"urlList":[]}}