{"title":"The Shell Collector by Anthony Doerr","uid":9701361,"size":1187069,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bb7717cd60a2982c8419acfd3e84d247579fc2b4&amp;dn=The+Shell+Collector+by+Anthony+Doerr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"PirateBook","files":2,"time":1394000960,"description":"\nA remarkable collection of stories from a young American writer of huge potential: 'A show-stopping debut, as close to faultless as any writer could wish for' Los Angeles Times 'His fingers dug the shell up, he felt the sleek egg of its body, the toothy gap of its aperture. It was the most elegant thing he'd ever held. &quot;That's a mouse cowry,&quot; the doctor said. \n\n&quot;A lovely find. It has brown spots, and darker stripes at its base, like tiger stripes. You can't see it, can you?&quot; But he could. He'd never seen anything so clearly in his life.' In this assured, exquisite debut, Anthony Doerr takes readers from the African coast to the suburbs of Ohio, from sideshow pageantry to harsh wilderness survival, conjuring nature in both its beautiful abundance and its crushing power. \n\nThe blind hero of the title story spends his days roaming the beaches of Kenya, his fingers ploughing through sandy granules of grace and intrigue, his German shepherd at his side. And then there are whale-watchers and fishermen, hunters and mystics, living lives uncompleted or undone, caught, memorably, as they turn toward the reader. \n\nA natural storyteller, Doerr explores the human dilemma in all its manifestations: longing, grief, indecision, heartbreak and slow, slow recuperation. Shimmering with elegance and invention, The Shell Collector is an enchanting and imaginative book by a young writer just setting off on what will surely be a hugely compelling literary odyssey.\n\nGenre: General Fiction/Classics","torrent":{"xt":"urn:btih:bb7717cd60a2982c8419acfd3e84d247579fc2b4","amp;dn":"The+Shell+Collector+by+Anthony+Doerr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb7717cd60a2982c8419acfd3e84d247579fc2b4","infoHashBuffer":{"type":"Buffer","data":[187,119,23,205,96,162,152,44,132,25,172,253,62,132,210,71,87,159,194,180]},"announce":[],"urlList":[]}}