{"title":"Il Camorrista[DivX - Mp3 Ita -  Sub Eng-Rou][TnTVillage]","uid":4718281,"size":1362607697,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bb8408b2ee7c0894365310587b3e293476a76f4b&amp;dn=Il+Camorrista%5BDivX+-+Mp3+Ita+-++Sub+Eng-Rou%5D%5BTnTVillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Superattila","files":3,"time":1234384745,"description":"Visitate il Miglior Sito di Torrent Italiano\n\n\n      [WWW.TnTVillage.scambioetico.org]\n\n &lt;a href=&quot;\nhttp://www.tntvillage.scambioetico.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tntvillage.scambioetico.org/index.php&lt;/a&gt;\n\n\n\n\nIL CAMORRISTA[DivX - Mp3 Ita -  Sub Eng-Rou][TnTVillage.scambioetico.org]\n\n\nTitolo:  Il Camorrista\n\nNazionalitÃƒÂ : Italia\n\nAnno: 1986\n\nGenere: Drammatico\n\nRegia: Giuseppe Tornatore\n\nSoggeto: Giuseppe Marrazzo\n\nSceneggiatura: Giuseppe Tornatore, Massimo De Rita\n\nFotografia: Blasco Giurato\n\nMontaggio: Mario Morra\n\nScenografia: Osvaldo Desideri\n\nMusiche: Nicola Piovani\n\nCostumi: Luciana Marinucci\n\nProduzione: ReteItalia(Fininvest)\n\nDistribuzione: Titanus\n\nPersonaggi: *Ben Gazzara interpreta Il professore, *Laura Del Sol interpreta Rosaria, *Leo Gullotta interpreta Il commissario Iervolino, *Nicola Di Pinto interpreta Alfredo, *Franco Interlenghi interpreta Don Saverio, *Piero Vida interpreta Mimmo Mesillo, *Biagio Pelligra interpreta Il padre,*Giacomo Piperno interpreta Il questore, *Luciano Bartoli interpreta Ciro Parrella, *Maria Carta interpreta La madre, *Marzio Honorato interpreta Il sindaco Lo Russo, *Lino Troisi interpreta O' Malacarne, *Anita Zagaria interpreta Anna, *Sergio Boccalatte interpreta Gennaro di Domenico, *Marino MasÃƒÂ© interpreta Roberto Sapienza; *Jean Pierre Duriez interpreta Frank Titas.\n\n\n\nRecensione\n\nIl camorrista ÃƒÂ¨ il film d'esordio di Giuseppe Tornatore, del 1986, liberamente tratto dall'omonimo romanzo di Giuseppe Marrazzo. Prodotto da Reteitalia (Fininvest) e Titanus al costo di 4 miliardi di lire (con un'edizione TV di 5 ore che non andÃƒÂ² mai in onda). Ritirato nel 1986 dopo 2 mesi di distribuzione, querelato e messo in onda su Rete 4 nel marzo 1994. Film efferato e violento che non lascia nulla all'immaginazione, con un Ben Gazzara di malefica grandezza, e un Leo Gullotta nella sua prima interpretazione drammatica, Il camorrista ha raggiunto negli anni un'elevata popolaritÃƒÂ . Tuttavia, questa sua popolaritÃƒÂ  molto spesso si coniuga ad un totale fraintendimento del suo messaggio: il film, infatti, ÃƒÂ¨ da una quindicina di anni un cult per molti ragazzi delle zone popolari di Napoli, per i quali il protagonista non ÃƒÂ¨ altro che un mito da imitare. Testimonianza concreta dell'essere diventato un cult ÃƒÂ¨ che, a vent'anni dall'uscita nelle sale, molte bancarelle di DVD pirata partenopee offrono, assieme ai film del momento, come titolo di punta proprio Il Camorrista. Stessa sorte per la colonna sonora di Nicola Piovani, una delle piÃƒÂ¹ scaricate come suonerie per cellulare nella zona di Napoli e remixata per le discoteche con le frasi piÃƒÂ¹ salienti del film da un dj napoletano.Il film tratta, come in un romanzo, dell'ascesa e della caduta del 'Professore di Vesuviano', alias Raffaele Cutolo, noto boss della camorra napoletana, dal primo violento delitto di gioventÃƒÂ¹ alla creazione in carcere della Nuova Camorra Organizzata (nel film &quot;Nuova Camorra Riformata&quot;) arrivando a trattare alla pari con politici, servizi segreti, affaristi americani e terroristi. I riferimenti alla storia politica e criminale a cavallo degli anni '70 e '80 in Campania ci sono tutti; dalle tangenti sugli appalti per la ricostruzione post-terremoto fino al rapimento dell'assessore regionale Ciro Cirillo (nel film ridenominato Mimmo Mesillo) da parte delle Brigate Rosse.\n\n\nTrama\n\nNel carcere di Poggioreale un recluso, il &quot;Professore&quot;, comincia a farsi rispettare, sfidando un boss della camorra piÃƒÂ¹ anziano di lui. Egli costituisce giÃƒÂ  tra le mura del luogo di pena i quadri dell'esercito della futura camorra riformata. Preso ad un certo momento il posto del vecchio boss, che conduce vita comoda in una cella bene attrezzata, il &quot;Professore&quot;, sempre aiutato dall'esterno dalla sorella Rosaria, esecutrice delle sue direttive e tesoriera della potente organizzazione, riesce ad evadere dal manicomio criminale in cui, dopo il processo, gli avvocati della difesa sono riusciti a farlo trasferire come infermo di mente. Per contro la sua mente funziona benissimo: egli riesce a partire per New York, a contattare il vertice di Cosa Nostra ed a farsi riconoscere come il capo indiscusso della nuova camorra. Ormai in Campania il &quot;Professore&quot; ha creato una potente e ramificata organizzazione, della quale - a parte gli innumerevoli delitti e le vittime - moltissimi riescono a beneficiare, ottenendo in cambio protezione, lavoro e denaro. Un commando viene una notte inviato nella villa del nuovo boss dai capi e capetti locali, rimasti ai margini di ogni attivitÃƒÂ  e profitto. Alfredo Canale, un fedelissimo del &quot;Professore&quot;, scopre perÃƒÂ² il piano dei nemici e, per salvare la vita del suo capo, ne svela alla Polizia il nascondiglio. E' la scelta del male minore, ma il &quot;Professore&quot; crede di essere stato tradito dal piÃƒÂ¹ fedele dei suoi e ne ordina l'esecuzione. Intanto a Napoli si scatena la Polizia, a seguito del sequestro di un assessore comunale ad opera delle Brigate Rosse e questo blocca ogni impresa e lucro della camorra. A causa degli aspetti politici del sequestro e dei vari risvolti che ne conseguono, alte personalitÃƒÂ  e gli stessi Servizi segreti verranno a patti con il &quot;Professore&quot; per salvare l'assessore e lasciare, al contempo, all'oscuro notizie e faccende, che ÃƒÂ¨ nell'interesse di gente potente e qualificata non far venire alla luce. Scoppiato un vero scandalo su scala nazionale, il &quot;Professore&quot;, che nel frattempo ha fatto eseguire altri crimini, sarÃƒÂ  trasferito su di un'isola in un carcere di massima sicurezza.\n\n\nTHE PROFESSOR\n\nPlot\n\nIl Camorrista (English: The Professor) is a 1986 Italian drama film directed by Giuseppe Tornatore. It was his film debut, based on a Giuseppe Marrazzo novel. The International version is shorter than the original Italian released. In 1963 Raffaele Cutolo called the Professor kills a man who had harassed her sister Rosaria, and ends up in prison. After 10 years in prison back in Naples prison Poggioreale where together with his friend Alfredo Canale and Pasquale Zara said the animal create the Nuova Camorra riformata. The organization grows up to that in the seventies clashes with the old families of the Camorra, and bursts War of the Camorra that will bleed the entire South Italy in the 1970s and 1980s. In 1980 an earthquake destroys Naples his province Naples and the Campania. With the rain of money for reconstruction, the war continues even more brutal than before. In 1981 the Red Brigades kidnapped the regional Assessor Ciro Messillo, the Christian Democrats for fear that speaking confessing secrets of the party turns to intervene the Professor, who in exchange for full mental illness and freedom accept and pay 3 billion ransom and the assessor is freed, but taken into custody by the secret services and not by the police. The fall of Professor and the disappearance of NCO. Politicians do not respect the agreement and the professor is brought in the high-security prison of Asinara by decree of the Italian president Sandro Pertini. This assists the disintegration of his organization and the repentance of all his trusted men. His sister Rosaria try to bring it back to reality, but to no avail. At the end she kill Ciro a trusted man who had sold to politicians by exploding himself and his car and putting his girlfriend inside a cement pylon.\n\nScheda Tecnica\n\n[ Info sul file ]\n\nNome: Il Camorrista.avi\nData: 11/04/2008 06:09:08\nDimensione: 1,362,422,344 bytes (1299.307 MB)\n\n[ Info generiche ]\n\nDurata: 02:44:13 (9852.96 s)\nTipo di contenitore: AVI OpenDML\nStreams totali: 2\nTipo stream n. 0: video\nTipo stream n. 1: audio\nAudio streams: 1\nJUNK: AVI OpenDML FlasKMPEG plugin release\n\n[ Giudizi sulla qualitÃƒÂ  ]\n\nRisoluzione: MOLTO ALTA (720 x 384)\nLarghezza: multipla di 16 (BENE)\nAltezza: multipla di 16 (BENE)\nQualitÃƒÂ  DRF medio: MEDIA (3.961489)\nQualitÃƒÂ  deviazione standard: BASSA (2.268792)\nMedia pesata dev. std.: BASSA (2.267784)\n\n[ Traccia video ]\n\nFourCC: DIV3/DIV3\nRisoluzione: 720 x 384\nFrame aspect ratio: 15:8 = 1.875 (~1.85:1)\nPixel aspect ratio: 1:1 = 1\nDisplay aspect ratio: 15:8 = 1.875 (~1.85:1)\nFramerate: 25 fps\nFrames totali: 246324\nStream size: 1,118,703,600 bytes\nBitrate: 908.318799 kbps\nQf: 0.131411\nKey frames: 986 (0; 250; 500; 750; 1000; ... 246250)\nNull frames: 0\nMin key int: 250\nMax key int: 250\nKey int medio: 249.821501\nRitardo: 0 ms\n\n[ Traccia audio ]\n\nAudio tag: 0x55 (MP3)\nBitrate: 192 kbps CBR\nCanali: 2\nFrequenza: 48000 Hz\nChunks: 49264\nStream size: 236,466,515 bytes\nRitardo: 0 ms\n\n[ Info sulla codifica MPEG4 ]\n\nPacked bitstream: No\nQPel: No\nGMC: No\nInterlaced: No\nAspect ratio: Square pixels\nQuant type: H.263\nFrames totali: 246324\nDrop/delay frames: 0\nFrames corrotti: 0\n\nI-VOPs: 986 ( 0.400 %)\nP-VOPs: 245338 ( 99.600 %) #########################\nB-VOPs: 0 ( 0.000 %)\nS-VOPs: 0 ( 0.000 %)\nN-VOPs: 0 ( 0.000 %)\n\n[ Analisi DRF ]\n\nDRF medio: 3.961489\nDeviazione standard: 2.268792\nDRF max: 16\n\nDRF9: 8012 ( 3.253 %) #\n\nI-VOPs DRF medio: 4.477687\nI-VOPs deviazione std.: 1.334519\nI-VOPs DRF max: 14\n\nP-VOPs DRF medio: 3.959415\nP-VOPs deviazione std.: 2.271535\nP-VOPs DRF max: 16\n\n\nRapporto generato da AVInaptic (10-04-2007) in data 9 feb 2009, h 21:23:40\n\n\n* La cartella contiene i sottotitoli in Inglese e Rumeno in formato .srt\n\n* The briefcase contains the subtitles in English and Romanian in formed .srt\n\n* Thanks for the translation of the subtitles in English Chirilloff and Kinofil","torrent":{"xt":"urn:btih:bb8408b2ee7c0894365310587b3e293476a76f4b","amp;dn":"Il+Camorrista%5BDivX+-+Mp3+Ita+-++Sub+Eng-Rou%5D%5BTnTVillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb8408b2ee7c0894365310587b3e293476a76f4b","infoHashBuffer":{"type":"Buffer","data":[187,132,8,178,238,124,8,148,54,83,16,88,123,62,41,52,118,167,111,75]},"announce":[],"urlList":[]}}