{"title":"Discovery.Channel.World.War.II.In.HD.Colour.03of13.Britain.At.Ba","uid":6374657,"size":854904832,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bbf3eab664252d2a77680bf6179b18a4961b4aef&amp;dn=Discovery.Channel.World.War.II.In.HD.Colour.03of13.Britain.At.Ba&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"DocFreak08","files":-1,"time":1304812983,"description":"Nugus Martin Productions has accumulated probably the best collection of rare and unseen footage of World War II in the world. By using the very latest colorization techniques it is now possible to show the full story of World War II as it has never been fully seen before. With the very latest satellite delivered terrain mapping and state of the art graphics this story can now be told with the very latest access to information which was not previously available to other older series.\n\nConventional wisdom has recently changed as more and more secrets have been revealed particularly in the last five to ten years as documents, files and photographs have been released. Code breaking revelations, and newly released government papers on both sides of the Atlantic have added a very insightful new dimension to the understanding of this the worlds' greatest ever conflict. Narrated by English actor Robert Powell, WORLD WAR II IN HD COLOUR is a vivid, in-depth experience that provides viewers with new insights and information.\n\nAlso Known As: World War II in Colour and HD\n\nColourisation and Restoration : Westwing Studios Inc.\nExecutive Producer : Matthew Barrett\n\nNugus/Martin Productions (2009)\n\nEpisode 3 : Britain at Bay\nIn June 1940, Britain stood alone against the Nazis. Hitler was convinced that it was only a matter of days before it sued for peace. He had more troops, a better air force and the better weapons. This film shows how close Britain came to defeat, as its exhausted air force struggled to fight all the German Luftwaffe. However, because of critical errors by the Luftwaffe commander Hermann Goering, Britain was able to regroup. Then using its brilliant team of code crackers and specially trained spies, it began the fightback, working alongside the resistance movements in the occupied territories.\n\n\nTechnical Specs\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 2016 kbps\nVideo Resolution: 608x352\nVideo Aspect Ratio: 1.727:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 51:27.720\nNumber Of Parts: 13\nPart Size: 855,058,432 Bytes\nRipped by: DocFreak08","torrent":{"xt":"urn:btih:bbf3eab664252d2a77680bf6179b18a4961b4aef","amp;dn":"Discovery.Channel.World.War.II.In.HD.Colour.03of13.Britain.At.Ba","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbf3eab664252d2a77680bf6179b18a4961b4aef","infoHashBuffer":{"type":"Buffer","data":[187,243,234,182,100,37,45,42,119,104,11,246,23,155,24,164,150,27,74,239]},"announce":[],"urlList":[]}}