{"title":"Mrs. Dalloway by Virginia Woolf (audio book, unabridged)","uid":8252077,"size":447478235,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bc8d6ae74a354cbdf532de18d14c5d32d96cb0bb&amp;dn=Mrs.+Dalloway+by+Virginia+Woolf+%28audio+book%2C+unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"tyl3rdurd3n","files":-1,"time":1363182241,"description":"Heralded as Virginia Woolf's greatest novel, this is a vivid portrait of a single day in a woman's life. When we meet her, Mrs. Clarissa Dalloway is preoccupied with the last-minute details of party preparation while in her mind she is something much more than a perfect society hostess. As she readies her house, she is flooded with remembrances of faraway times. And, met with the realities of the present, Clarissa reexamines the choices that brought her there, hesitantly looking ahead to the unfamiliar work of growing old.\n\n&quot;Mrs. Dalloway was the first novel to split the atom. If the novel before Mrs. Dalloway aspired to immensities of scope and scale, to heroic journeys across vast landscapes, with Mrs. Dalloway Virginia Woolf insisted that it could also locate the enormous within the everyday; that a life of errands and party-giving was every bit as viable a subject as any life lived anywhere; and that should any human act in any novel seem unimportant, it has merely been inadequately observed. The novel as an art form has not been the same since.\n&quot;Mrs. Dalloway also contains some of the most beautiful, complex, incisive and idiosyncratic sentences ever written in English, and that alone would be reason enough to read it. It is one of the most moving, revolutionary artworks of the twentieth century.&quot;\n--Michael Cunningham, author of The Hours\n\n--------------------------------------------------------------------\n\n128 kbps, 44.1 khz, .mp3, stereo.\n","torrent":{"xt":"urn:btih:bc8d6ae74a354cbdf532de18d14c5d32d96cb0bb","amp;dn":"Mrs.+Dalloway+by+Virginia+Woolf+%28audio+book%2C+unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc8d6ae74a354cbdf532de18d14c5d32d96cb0bb","infoHashBuffer":{"type":"Buffer","data":[188,141,106,231,74,53,76,189,245,50,222,24,209,76,93,50,217,108,176,187]},"announce":[],"urlList":[]}}