{"title":"MAJOR LAZER Lazer Strikes Back Vol 1","uid":8178841,"size":49360560,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bcb3926e0e32abe82b58e90d8cf18be6575ec251&amp;dn=MAJOR+LAZER+Lazer+Strikes+Back+Vol+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"rjordan21","files":-1,"time":1361585787,"description":"The upcoming Major Lazer album, FREE THE UNIVERSE, has been been kidnapped by General Rubbish and we all must embark on an epic journey to upset his evil plan so Major Lazer can free the universe as planned with the album.\n\n\nMajor Lazer sends the following message: \n \nOur fans are the most important part of what makes Major Lazer what it is.  It is with that consideration that FREE THE UNIVERSE will not be released this month as previously scheduled.  We never want to disappoint our supporters but circumstances out of our control have made us unable to keep the intended date.  For anyone disappointed, we are truly apologetic and we promise that this hiccup has only made what we have planned for the album stronger.  We tried extremely hard to keep the date but it was ultimately decided that rushing the album would have been unfair to you and everyone who worked so hard on it.  An iTunes exclusive pre-order in the US will launch next Tuesday, 2/26 which will feature an instant grat download of the forthcoming Major Lazer single Watch Out for This (Bumaye).\n \nIn the mean time, please enjoy LAZER STRIKES BACK Vol. 1.   \nWe will be putting out 3 volumes of rare/unreleased music on-line until album release.  Major Lazers FREE THE UNIVERSE WORLD TOUR starts next week.\n \n\nLAZER STRIKES BACK Vol. 1\n1. Major Lazer &amp; Flux Pavilion - Jah No Partial (Jack Beats Remix) \n2. Major Lazer - Get Free feat. Amber of Dirty Projectors (Yellow Claw Get Free Money Remix) \n3. Major Lazer - Original Don feat. The Partysquad (DGRC Remix)\n4. Hot Chip - Look At Where We Are (Major Lazer Extended Remix) \n\n","torrent":{"xt":"urn:btih:bcb3926e0e32abe82b58e90d8cf18be6575ec251","amp;dn":"MAJOR+LAZER+Lazer+Strikes+Back+Vol+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcb3926e0e32abe82b58e90d8cf18be6575ec251","infoHashBuffer":{"type":"Buffer","data":[188,179,146,110,14,50,171,232,43,88,233,13,140,241,139,230,87,94,194,81]},"announce":[],"urlList":[]}}