{"title":"Smugglers V (Latest With 1.4B Patch +  Guild DLC) (GOG)","uid":10628422,"size":90811384,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bccb85b48fe018fd2a4607af8fa5a26cb4830402&amp;dn=Smugglers+V+%28Latest+With+1.4B+Patch+%2B++Guild+DLC%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Sarah116","files":-1,"time":1406273045,"description":"Hey guys, here &quot;Smugglers V&quot; with the &quot;Smugglers Guild&quot; DLC. Hope you guys enjoy and please help seed.\n\n\n---------------\n\n\nSmugglers V (1.4 And 1.4B Patch Notes)\n\n\n- Balance change: You can now trade with pirate hideouts in systems \nowned by another faction with which your faction is at war \n\n- Balance change: Special event skills (like &quot;Security&quot; when your shipÂ´s \ncomputer is infected with a virus) now only require 1 AP to be used. \nThis has a big effect on the combat special events and makes combat in \nthese cases going a lot smoother. \n\n- Bug fixed: The description of the advanced target system has been \ncorrected. \n\n- Bug fixed: Fixes a loop in the planet exploration stories that could \nhappen if you tried to exit the game. \n\n- Bug fixed: Typos \n\n- Bug fixed: The title of a tier in the storyline Smugglers Guild has \nbeen shortened to fit the window title. \n\n- Bug fixed: Under certain circumstances there was an endless loop in \nchapter 4 of the Smugglers Guild story. \n\n- Bug fixed: There was a bug in the Smugglers Guild storyline where \nunder certain circumstances the game crashed trying to create an \nencounter with a Syndicate treasure ship (the Syndicate does not own any). \n\n- Bug fixed: Sometimes it happened that the enemy ship successfully fled \nduring story missions, which resulted in the combat being repeated with \nthe enemy having shields back at full strength. \n\n- Bug fixed: When the enemy used a mine there was a graphical glitch \n(white background) around the mine picture. \n\n\n-----------------------\n\nSmugglers V &quot;Smugglers Guild DLC Info\n\nWhat's cool about it:\n- Dynamic and multiple-pathed background stories\n\n- Includes the story &quot;The Smugglers Guild&quot;\n\n- Includes the story &quot;Thirst For Vengeance&quot;\n\n- Includes the story &quot;SolomonÂ´s Treasure&quot;\n\n\nOverview:\nSmuggler's Guild is a compilation of background stories for Smugglers 5 and is named after the first of the three stories.\n\nThe first story, &quot;The Smuggler's Guild&quot;, starts with the retirement of your trader father through ill health. There's no money in being an honest trader these days. Smuggling contraband is a risky business, but the rewards are great - especially for those lucky or connected enough to join the exclusive Smugglers Guild.\n\nThe second story, &quot;Thirst For Vengeance&quot;, recalls the pirate raiders that killed your parents and kidnapped your sister when you were a child. As a graduate of the space academy with a ship of your own, the time has finally come to seek your revenge.\n\nIn the final story, &quot;SolomonÂ´s Treasure&quot;, your father dedicated his life to finding the hidden treasure of Solomon McTavish, legendary pirate, and died without success. Perhaps you can do better - but you are not the only one seeking this vast fortune.","torrent":{"xt":"urn:btih:bccb85b48fe018fd2a4607af8fa5a26cb4830402","amp;dn":"Smugglers+V+%28Latest+With+1.4B+Patch+%2B++Guild+DLC%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bccb85b48fe018fd2a4607af8fa5a26cb4830402","infoHashBuffer":{"type":"Buffer","data":[188,203,133,180,143,224,24,253,42,70,7,175,143,165,162,108,180,131,4,2]},"announce":[],"urlList":[]}}