{"title":"The Thick Of It - Spinners and Losers.divx","uid":3746083,"size":679293602,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bcf04633e57f5c894cd59e86358dcd2977faf416&amp;dn=The+Thick+Of+It+-+Spinners+and+Losers.divx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"fezzler","files":1,"time":1184790708,"description":"THE THICK OF IT SPECIAL\nPART TWO: SPINNERS AND LOSERS\n\nMalcolm Tucker?s political career hangs in the balance. He has just seventeen hours to spin himself back into power, and it?s going to be the longest night of his life.\n\nAll hell has broken loose at Number 10 as the Prime Minister resigns six months too early. Suddenly everyone needs to be best friends with the Nutter faction - headed up by Chief Nutter Tom - if they want to keep their jobs. Or failing that, find someone stupid enough to stand against him and force a leadership contest.\n\nMalcolm?s psychotic henchman Jamie loathes the Nutters so he?s found himself a stalking-horse in the form of Cliff Lawton, the minister replaced by Hugh Abbot. And Hugh is literally up in the air (on his way back from Australia) so his advisor Glenn is working hard to keep Hugh?s name in the frame with the new regime. But the rest of the team at the Department of Social Affairs and Citizenship is too pre-occupied with other things. Terri is off home for a dental appointment, Robyn is fire-fighting a walkout at the Immigration Sorting Centre (courtesy of Peter Mannion?s team in the Opposition), and Ollie Reeder is being seduced over to the Dark Side - he&amp;#039;s suddenly become big buddies with Ben Swain, the young Nutter hopeful.\n\nBut when Tom?s dark past starts to unravel the Nutter plans almost anyone could make a play for the top job, providing they have a proper media strategy behind them.","torrent":{"xt":"urn:btih:bcf04633e57f5c894cd59e86358dcd2977faf416","amp;dn":"The+Thick+Of+It+-+Spinners+and+Losers.divx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcf04633e57f5c894cd59e86358dcd2977faf416","infoHashBuffer":{"type":"Buffer","data":[188,240,70,51,229,127,92,137,76,213,158,134,53,141,205,41,119,250,244,22]},"announce":[],"urlList":[]}}