{"title":"Reassembly v03.08.2015","uid":12197218,"size":110422704,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bd645cf4f0edf2f11b040cb5f4205820cc0cc971&amp;dn=Reassembly+v03.08.2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"dauphong","files":1,"time":1438769136,"description":"About This Game\nAnd through the Kickstarter gauntlet we have arrived. Yes, we have a procedurally-generated universe to explore. Yes, we have eye-gogglingly gorgeous vector-based gameplay coupled with particle effects so effortlessly effervescent that you won't have time to wonder if &quot;effortlessly effervescent&quot; means anything coherent. And yes, we have noises and musical moods that take a warm soapy sponge to your brain and massage it into cerebral splendor.\n\nBUT YOU DON'T HAVE TIME FOR THAT!!!\n\nYou're too busy crafting the perfect vessel, a spaceship pristine and precise and, perhaps, powerful, agile, and envy-inducing. Your shapes and colors will induce both fear and wonder into the electronic hearts of whatever insectoid, angley, squarish, plantlike race of alien ships that you come across in your digital safari.\n\nAnd then you grow. And it changes everything. Now your left wing must become your right wing in a lopsided arrangement of fancy new weaponry and mega-buffed shields. You recall thinking when you last were destroyed (and you will be destroyed), that you really needed to buff up that armor. Right? Definitely.\n\nAnd then you grow again. And again. And now you're a battleship capable of producing your own fleet, and each member of your fleet can spawn it's own fleet, and you need it. Your enemies are constantly changing shapes, sizes, and intensities as ships created and honed through the experience of a thousand battles find their way from their creator's computer to yours, leaping into your universe with all the mercy in the world of NONE AT ALL.\n\nIt's time to visit the electronic tide pool","torrent":{"xt":"urn:btih:bd645cf4f0edf2f11b040cb5f4205820cc0cc971","amp;dn":"Reassembly+v03.08.2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd645cf4f0edf2f11b040cb5f4205820cc0cc971","infoHashBuffer":{"type":"Buffer","data":[189,100,92,244,240,237,242,241,27,4,12,181,244,32,88,32,204,12,201,113]},"announce":[],"urlList":[]}}