{"title":"Roswell Rudd, Toumani Diabate - MALIcool [FLAC] TQMP","uid":4854432,"size":310390648,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:be36b5a082548e2eeb5c838881f5579f5ba71050&amp;dn=Roswell+Rudd%2C+Toumani+Diabate+-+MALIcool+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"pastafari","files":-1,"time":1240002474,"description":"Roswell Rudd, Toumani Diabate - MALIcool\n2002\n\nBrought to you by TQMP\nThe Quality Music Project\n\nIf you're at all familiar with my reviews on this site, you know that I'm a huge fan of what I call world jazz or jazz beat. This, simply, is the meeting of an authentic jazz orientation with a genuine world music sensibility. Some of the best examples of this kind of music are Vira Loucos by Cyro Baptista, Sanfona by Egberto Gismonti, Beyond the Sky by Yusef Lateef and Adam Rudolf, Nascer by Peter Epstein, Alight by Safa, and Peace Pipe by Ben Allison.\n\nWith Malicool, however, I believe we have something truly new. Whereas on Peace Pipe, the brilliant &quot;downtown world jazz&quot; album by Ben Allison, Malian kora player Momadou Diabate is thrust into a hip Western jazz setting, with generally very satisfactory results, on Malicool free jazz maestro Roswell Rudd does the opposite--he travels to Mali and inserts himself (and his jazz aesthetic) into traditional Malian string music. In his liner notes Rudd observes that he had to radically adjust his trombone playing, from a chromatic concept to the natural octave setting of Malian music, from a drum-oriented understanding to a more naturally flowing percussive direction, but especially from a sound-impact standpoint. The tonal weight of the trombone could have easily overwhelmed the delicate string interaction typical of this music. Thus, he had to totally redesign his approach tonally and spatially. \n\nDoes it work? Magnificently. It strikes me that this is almost some new kind of music--a unique blending of Malian and jazz sensibilities into something greater than the sum of its parts. What we've got here is the timeless, static-like quality of West African music joined to the restless exploratory character of jazz to produce a music that is at once meditative and ecstatic, mournful and joyous, still and dynamic. \n\nThis is perhaps best illustrated by two tunes: &quot;Jackie-ing&quot; and &quot;Ode to Joy,&quot; the first a well-known jazz composition by Thelonius Monk, the second, of course, the famous Beethoven composition. Each sounds totally natural, even familiar, though surely like nothing else one has ever heard before. There's an inherent playfulness to Monk's music which this cross-cultural amalgam perfectly captures, all the while maintaining what can only be described as a completely alien--to jazz, at least--musical aesthetic. &quot;Ode to Joy,&quot; here called &quot;Malijam,&quot; is something else again. Reharmonized, rhythmically deconstructed, it still manages, somehow, to perfectly capture the essence of Beethoven.\n\nHighest praise to Roswell Rudd for even attempting such music. Kudos to all involved for bringing it off so spectacularly.\n-- Jan P. Dennis &quot;Longboard jazzer&quot; (Top 500 amazon reviewer)\n\nTracks\n01- Bamako\n02- Rosmani\n03- Jackie-ing\n04- All Through the Night\n05- Hank\n06- Johanna\n07- For Toumani\n08- MALIcool\n09- Sena et Mariam\n10- Malijam\n\nArtwork, EAC log and CUE sheet included.\n\nFormat: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafari Cubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nProud Member of the Church of the Flying Spaghetti Monster &lt;a href=&quot;\nhttp://venganza.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://venganza.org&lt;/a&gt;\n\nYou too can search for evidence the Flying Spaghetti Monster is the Lord and Master of the Universe  &lt;a href=&quot;\nhttp://setiathome.berkeley.edu&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://setiathome.berkeley.edu&lt;/a&gt;","torrent":{"xt":"urn:btih:be36b5a082548e2eeb5c838881f5579f5ba71050","amp;dn":"Roswell+Rudd%2C+Toumani+Diabate+-+MALIcool+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be36b5a082548e2eeb5c838881f5579f5ba71050","infoHashBuffer":{"type":"Buffer","data":[190,54,181,160,130,84,142,46,235,92,131,136,129,245,87,159,91,167,16,80]},"announce":[],"urlList":[]}}