{"title":"U2 - Live at Red Rocks (Deluxe) [DVD9 ENG] TNT Village","uid":8556517,"size":6705098752,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:be943010b80e43bcfc739f5f5720d17f3f86944d&amp;dn=U2+-+Live+at+Red+Rocks+%28Deluxe%29+%5BDVD9+ENG%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"l.diliberto","files":15,"time":1370739074,"description":"U2 - Live at Red Rocks (Deluxe) [DVD9 ENG] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=327162&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=327162&lt;/a&gt;\n\nU2 Live at Red Rocks: Under a Blood Red Sky (also known simply as U2 Live at Red Rocks or Under a Blood Red Sky) is a concert film by Irish rock band U2. It was recorded on 5 June 1983 at Red Rocks Amphitheatre in Colorado, United States on the group's War Tour. Originally released in 1984 on videocassette, U2 Live at Red Rocks was the band's first video release. It accompanied a 1983 live album entitled Under a Blood Red Sky, on which two tracks from the film appear. The video was directed by Gavin Taylor and produced by Rick Wurpel and Doug Stewart.\n\nThe film was arranged by U2 management to showcase the band's live act and promote them to American audiences. It depicts the band's performance at Red Rocks on a rain-soaked evening. The weather threatened to cancel the concert, but the band had invested in the filming with Island Records and concert promoter Barry Fey and wished to proceed with the gig. The rain and the torch-lit natural beauty of the surroundings combined to dramatise U2's performance. Segments of U2 Live at Red Rocks were shown in regular rotation on MTV, in addition to broadcasts on other television networks.\n\nCritics praised the concert and the video, and it subsequently became a best-seller. The video, along with Under a Blood Red Sky, helped establish U2's reputation as remarkable live performers, and it boosted Red Rocks' stature as a live venue in the US. A remastered edition of U2 Live at Red Rocks was released on DVD in September 2008, featuring previously unreleased tracks. This coincided with a remastered edition of Under a Blood Red Sky. Rolling Stone selected the film's performance of &quot;Sunday Bloody Sunday&quot; as one of the &quot;50 Moments that Changed the History of Rock and Roll&quot;.\n\n.: Cover :.\n\n\n.: Crediti :.\n\nDurata: 1h 21 min\nLingue: Eng\nFormato Video: PAL \n\n.: Screenshot :.\n\n","torrent":{"xt":"urn:btih:be943010b80e43bcfc739f5f5720d17f3f86944d","amp;dn":"U2+-+Live+at+Red+Rocks+%28Deluxe%29+%5BDVD9+ENG%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be943010b80e43bcfc739f5f5720d17f3f86944d","infoHashBuffer":{"type":"Buffer","data":[190,148,48,16,184,14,67,188,252,115,159,95,87,32,209,127,63,134,148,77]},"announce":[],"urlList":[]}}