{"title":"Playing it My Way - Sachin Tendulkar","uid":11432592,"size":3865235,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:becbcdd8d619c700f486b9e565f024d8e95a99c8&amp;dn=Playing+it+My+Way+-+Sachin+Tendulkar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1415733454,"description":"The greatest run-scorer in the history of cricket, Sachin Tendulkar retired in 2013 after an astonishing 24 years at the top. The most celebrated Indian cricketer of all time, he received the Bharat Ratna Award - India's highest civilian honour - on the day of his retirement. Now Sachin Tendulkar tells his own remarkable story - from his first Test cap at the age of 16 to his 100th international century and the emotional final farewell that brought his country to a standstill.\n\nWhen a boisterous Mumbai youngster's excess energies were channelled into cricket, the result was record-breaking schoolboy batting exploits that launched the career of a cricketing phenomenon. Before long Sachin Tendulkar was the cornerstone of India's batting line-up, his every move watched by a cricket-mad nation's devoted followers.\n\nNever has a cricketer been burdened with so many expectations; never has a cricketer performed at such a high level for so long and with such style - scoring more runs and making more centuries than any other player, in both Tests and one-day games. And perhaps only one cricketer could have brought together a shocked nation by defiantly scoring a Test century shortly after terrorist attacks rocked Mumbai.\n\nHis many achievements with India include winning the World Cup and topping the world Test rankings. Yet he has also known his fair share of frustration and failure - from injuries and early World Cup exits to stinging criticism from the press, especially during his unhappy tenure as captain.\n\nDespite his celebrity status, Sachin Tendulkar has always remained a very private man, devoted to his family and his country. Now, for the first time, he provides a fascinating insight into his personal life and gives a frank and revealing account of a sporting life like no other","torrent":{"xt":"urn:btih:becbcdd8d619c700f486b9e565f024d8e95a99c8","amp;dn":"Playing+it+My+Way+-+Sachin+Tendulkar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"becbcdd8d619c700f486b9e565f024d8e95a99c8","infoHashBuffer":{"type":"Buffer","data":[190,203,205,216,214,25,199,0,244,134,185,229,101,240,36,216,233,90,153,200]},"announce":[],"urlList":[]}}