{"title":"C and C Music Factory - The Best Of 2008 [FLAC] Kitlope","uid":6622845,"size":447283562,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bf187d3c8a2b7e38809ee25d2d741fc6d219d10e&amp;dn=C+and+C+Music+Factory+-+The+Best+Of+2008+%5BFLAC%5D+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Kitlope","files":16,"time":1314061402,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Plextor PX-716SA \nOptical Drive Firmware: 1.11 \nCd Software: Exact Audio Copy V1.0 Beta 1 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: BF187D3C8A2B7E38809EE25D2D741FC6D219D10E\nFile Size: 426.56 MB\nYear: 2008\nLabel: Columbia / Legacy\nCatalog #: 88697 35302 2\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nC+C Music Factory is a dance-pop and hip hop group formed in 1989 and broke up 1996 in result of David Cole's death. In 2011, C &amp; C Music Factory has reformed with legendary producer Eric Kupper stepping in to replace Cole. Their first release, &quot;Rain&quot; featuring Scarlett Santana will be released in August of 2011.\n\nC+C Music Factory earned a total of 35 music industry awards worldwide, including five Billboard Awards, five American Music Awards, and two MTV Video Music Awards. After Cole died in January 1995, his production partner ClivillÃƒÂ©s continued to use the C+C name alone.\n\nC+C Music Factory consisted primarily of the two record producers Robert ClivillÃƒÂ©s and David Cole and vocalists who varied by the particular recording project.\n\n\nBefore forming C+C Music Factory Robert ClivillÃƒÂ©s and David Cole were active in 2 Puerto Ricans, a Blackman, and a Dominican and The 28th Street Crew in the late 1980's.[2][3] In 1990 ClivillÃƒÂ©s and Cole released a single, feathering later C+C Music Factory rapper Freedom Williams, called &quot;Get Dumb! (Free Your Body)&quot; as The Crew.[4]\n\nIn 1989 ClivillÃƒÂ©s and Cole hired the artist Zelma Davis (Vocalist), Martha Wash (Vocalist) and Freedom Williams (MC) to all the tracks for Gonna Make You Sweat, the group's first album.[1] In 1990 it peaked at No. 2 on the Billboard 200 album chart, No. 11 on the R&amp;B album chart, and went 5x platinum.\n\nAll four singles from their debut album reached No. 1 on Billboard's Dance/Club Play chart, and all four were also crossover Pop and R&amp;B hits. The first single, &quot;Gonna Make You Sweat&quot;, reached No. 1 on Billboard's Hot 100 and R&amp;B Singles chart (and No. 3 in the UK). The fourth and final single from their debut album, &quot;Just a Touch of Love&quot;, featured in the movie Sister Act. The album contained two more Top 5 singles; &quot;Here We Go (Let's Rock &amp; Roll)&quot; reached No. 3 on Billboard's Hot 100 chart (and No. 20 in the UK), and &quot;Things That Make You Go Hmmm&quot; (inspired by a phrase uttered periodically by late-night talk show host, Arsenio Hall) reached No. 4 (and No. 4 in the UK).\n\nIn 1992, they had another No. 1 Dance/Club play hit with the song &quot;Keep It Comin'&quot; (Dance Till You Can't Dance No More); with emcee Q-Unique and lead and background vocalist Deborah Cooper that was recorded for the soundtrack and opening cheerleading routine from the movie Buffy the Vampire Slayer.\n\nThe duo's second album, Anything Goes! released in 1994, had two less successful singles, &quot;Do You Wanna Get Funky&quot; and &quot;Take a Toke.&quot; Neither reached the Hot 100, but they did achieve high critical acclaim in some circles. The album peaked at No. 106 on the Billboard 200, and No. 39 on the R&amp;B album chart. This album mainly featured on vocals hip-hop outfit Trilogy and the returning Zelma Davis and Martha Wash. Freedom Williams was asked to return but declined this invitation.[5]\n\nDavid Cole died on January 24, 1995.[6]\n\nAn album was released in Europe in late 1995 by Robert ClivillÃƒÂ©s with the name C+C Music Factory,[7] which spawned one more US No. 1 Dance/Club Play hit &quot;I'll Always be Around.&quot; Neither the single nor the album featured former member David Cole. The album was released by MCA in 1995 in Europe, but it was not released in the US. &quot;I'll be Around&quot; was released as a vinyl and CD promo and vinyl and CD single in the USA on MCA Records. This was the final studio album of new material to be released under the C+C Music Factory name. A 1996 promo maxi single &quot;Don't Stop The Remix&quot; was the last single released by the group (only in Japan).\n\n\n\n\nPlaylist: The Very Best Of 2008\n\n\n\nTracks: \n\n\n1\t\tDo You Wanna Get Funky \n2\t\tGonna Make You Sweat (Everybody Dance Now) \n3\t\tA Deeper Love \n4\t\tThings That Make You Go Hmmmm... \n5\t\tRobi-Rob's Boriqua Anthem (Single Version) \n6\t\tHere We Go, Let's Rock &amp; Roll \n7\t\tI Found Love \n8\t\tJust A Touch Of Love (Everyday) \n9\t\tIt's Gonna Be A Lovely Day \n10\t\tA Groove Of Love (What's This Word Called Love?) \n11\t\tKeep It Comin' (Dance Till You Can't Dance No More!) \n12\t\tPride (In The Name Of Love) (The Radio Mix) \n13\t\tYou Take My Breath Away\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:bf187d3c8a2b7e38809ee25d2d741fc6d219d10e","amp;dn":"C+and+C+Music+Factory+-+The+Best+Of+2008+%5BFLAC%5D+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf187d3c8a2b7e38809ee25d2d741fc6d219d10e","infoHashBuffer":{"type":"Buffer","data":[191,24,125,60,138,43,126,56,128,158,226,93,45,116,31,198,210,25,209,14]},"announce":[],"urlList":[]}}