{"title":"Ninja.Gaiden.Dragon.Sword.nds.eur.by.doberman.{}","uid":4659527,"size":134273397,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:bf6fd165b5bc71b08d65e3a6772d09fb1b87f22a&amp;dn=Ninja.Gaiden.Dragon.Sword.nds.eur.by.doberman.%7B%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"rotwailer","files":4,"time":1232327847,"description":"Descripcion:\n\nEl argumento es sencillo: el protagonista, Ryu Hayabusa regresa para rescatar a la joven ninja Momiji, que se entrena en la aldea Hayabusa. TambiÃƒÂ©n iremos descubriendo el poder de la espada encantada que fue capaz de derrotar el DragÃƒÂ³n Oscuro.\n\nDos son los puntos clave en este juego: los grÃƒÂ¡ficos y la jugabilidad. Respecto a ÃƒÂ©sta ÃƒÂºltima, debemos comentar el uso absoluto del lÃƒÂ¡piz.Con la consola colocada a modo de libro (como en Brain Training) tendremos la pantalla de la izquierda con el mapa de nuestro recorrido y a la derecha se desarrollarÃƒÂ¡ toda la acciÃƒÂ³n. Todo el juego se maneja con la stylus, desde los movimientos de personaje por los escenarios como la lucha. Y ÃƒÂ©sta es una de sus maravillas. Nuestro repertorio dependerÃƒÂ¡ de los movimientos que realicemos, moviendo hacia arriba nuestro personaje saltarÃƒÂ¡, si a la vez bajamos rÃƒÂ¡pidamente, caerÃƒÂ¡ con la espada sobre los enemigos. Haremos ataques cortantes si deslizamos la punta del lÃƒÂ¡piz rÃƒÂ¡pidamente sobre un enemigo como si fuÃƒÂ©ramos a cortarlo; ataques con shuriken si tocamos a un enemigo o bloquear las envestidas tan sÃƒÂ³lo con tocar cualquier botÃƒÂ³n de la consola. Movimientos sencillos de aprender y que nos harÃƒÂ¡n disfrutar del juego desde el primer momento, sin complejos tutoriales de manejo al modo de Wii.\n\nEl segundo aspecto que destaca de Ninja Gaiden para DS es el apartado grÃƒÂ¡fico. En pocas ocasiones vemos que se exprimen las posibilidades tÃƒÂ©cnicas de la consola como en este caso. Los fondos de los escenarios son prerrenderizados en 2D con las figuras en 3D, lo cual otorga una sensaciÃƒÂ³n de profundidad muy lograda y sensaciÃƒÂ³n de realismo. A ello le ayudan los efectos sonoros, muy acordes con la acciÃƒÂ³n y muy conseguidos.\n\nRespecto al resto de caracterÃƒÂ­sticas del juego seÃƒÂ±alar que el propÃƒÂ³sito de ser apto para todos pÃƒÂºblicos, hace que en esta versiÃƒÂ³n no nos salpicarÃƒÂ¡ la sangre de nuestros enemigos ni tendremos que limpiar la katana. Las luchas son limpias y nuestros enemigos desaparecerÃƒÂ¡n cuando caigan derrotados a lo largo de los trece niveles totales. \n\nTras un pequeÃƒÂ±o tutorial inicial, la dificultad del juego no es muy elevada aunque va en incremento segÃƒÂºn avanzamos niveles. Ante los enemigos de final de fase deberemos saber quÃƒÂ© estrategia utilizar y con que golpe le podemos hacer daÃƒÂ±o. Un ataque caÃƒÂ³tico nos harÃƒÂ¡ recomenzar de nuevo la partida. Como apoyo durante nuestro rescate, tendremos las esencias, una bola de energÃƒÂ­a que podremos absorber y que, segÃƒÂºn su color, nos otorgarÃƒÂ¡ salud (azul), poder (roja) o permitirÃƒÂ¡ comprar objetos (amarilla).\n\nLa compra de objetos en la tienda de Muramasa es otra de las ayudas mÃƒÂ¡s interesantes. Cuando nuestro nivel de esencia amarilla sea el adecuado, podremos hacernos con la Joya del herrero espiritual (aumenta el nivel de nuestra espada), nuevos ataques o sortilegios para el combate e incluso aumentar la salud mÃƒÂ¡xima de nuestro hÃƒÂ©roe.\n\nEn conjunto, nos encontramos ante uno de los mejores juegos para Nintendo DS. Lleno de acciÃƒÂ³n, con una enorme jugabilidad y aprovechando las posibilidades que da la consola.\n\nLo bueno:\n- La jugabilidad. Desde el primer momento disfrutaremos del juego.\n- Los grÃƒÂ¡ficos: de lo mejor en la consola.\n- Una alternativa al resto del catalogo de Nintendo DS.\n\nLo malo:\n- QuizÃƒÂ¡s algo lineal.\n- La dificultad media.","torrent":{"xt":"urn:btih:bf6fd165b5bc71b08d65e3a6772d09fb1b87f22a","amp;dn":"Ninja.Gaiden.Dragon.Sword.nds.eur.by.doberman.%7B%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf6fd165b5bc71b08d65e3a6772d09fb1b87f22a","infoHashBuffer":{"type":"Buffer","data":[191,111,209,101,181,188,113,176,141,101,227,166,119,45,9,251,27,135,242,42]},"announce":[],"urlList":[]}}