{"title":"Shaw's Textbook of Operative Gynaecology, 7E [PDF] [StormRG]","uid":10259634,"size":67845249,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bfba2fe393b4755e5dc0e3c7e9a4ec13d17d4c9b&amp;dn=Shaw%27s+Textbook+of+Operative+Gynaecology%2C+7E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":-1,"time":1401408859,"description":"Author: John H Shepherd, Marcus E Setchell \nPublisher: Elsevier Health Sciences; 7 edition (2012)\nLanguage: English\nISBN-10: 8131211606\nISBN-13: 978-8131211601\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nChapters that are new or radically changed include the opening chapter on the Health Needs of Women in a Changing Society; Teaching and Learning Surgical Techniques; and chapters on Minimal Access Surgery, which are richly illustrated by remarkable photographic images. Chapters on Pelvic Floor and Cancer Surgery retain well-established operative procedures where relevant, but include accounts of exciting newer techniques, such as robotic surgery. Up to the minute chapters on Radiology, Radiotherapy and Chemotherapy are provided by colleagues from these specialties who now form part of modern multidisciplinary teams.\n\nThe 6th Edition, which appeared in 2001, reflected the growing replacement of conventional abdominal and vaginal surgery with radiological interventions, endoscopic surgery and medical treatments. The last 10 years have seen worldwide acceptance of the benefits of less invasive gynaecological procedures, allowing ever shorter stay in hospital and quicker recovery for the patient, but often with the use of much more expensive and complex technological equipment. At the same time, there has been an increasing trend towards super-specialisation so that in many parts of the world gynaecologists focus on a narrower field of activity. Specialists need to be aware of these developments even though the individual gynaecologist may carry out only a limited range of operations or therapies.\n\nThe structure of the book has been changed radically, separating benign from malignant conditions, congenital from acquired, and with a strong emphasis on patient choice, safety and prevention of complications.","torrent":{"xt":"urn:btih:bfba2fe393b4755e5dc0e3c7e9a4ec13d17d4c9b","amp;dn":"Shaw%27s+Textbook+of+Operative+Gynaecology%2C+7E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfba2fe393b4755e5dc0e3c7e9a4ec13d17d4c9b","infoHashBuffer":{"type":"Buffer","data":[191,186,47,227,147,180,117,94,93,192,227,199,233,164,236,19,209,125,76,155]},"announce":[],"urlList":[]}}