{"title":"Iain M. Banks - [Culture 10] - The Hydrogen Sonata (Sci-Fi)","uid":7697583,"size":1523743,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bffaf9843b86079482965ea439d61d9fd68a2b5d&amp;dn=Iain+M.+Banks+-+%5BCulture+10%5D+-+The+Hydrogen+Sonata+%28Sci-Fi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"micron66","files":-1,"time":1349405886,"description":"Iain M. Banks - [Culture 10] - The Hydrogen Sonata\n\n\nEbook Formats - EPUB and MOBI\n\n\nThe Hydrogen Sonata is a science fiction novel by British author Iain M. Banks, set in his techno-utopian Culture universe. The book was released on 4 October 2012 in the United Kingdom, and will be released on 9 October in the United States.\n\n\n\nPlot summary - \n\n\nA brand new Culture novel from the UK's leading SF writer - always the biggest annual event in British SF.\n\nThe new Culture novel from one of the most exciting science fiction writers of modern times - a tour de force of storytelling, world-building and imagination.\n\nIt is, truly, provably, the End Days for the Gzilt civilization.\n\nAn ancient people, they helped set up the Culture ten thousand years earlier and were very nearly one of its founding societies, deciding not to join only at the last moment. Now they've made the collective decision to follow the well-trodden path of millions of other civilizations; they are going to Sublime, elevating themselves to a new and almost infinitely more rich and complex existence.\n\nAmidst preparations though, the Regimental High Command is destroyed. Lieutenant Commander (reserve) Vyr Cossont appears to have been involved and she is now wanted - dead, not alive.\n\nAided only by an ancient, reconditioned android and a suspicious Culture avatar, Cossont must complete her last mission given to her by the High Command - find the oldest person in the Culture, a man over nine thousand years old, who might have some idea what really happened all that time ago. Cossont must discover the truth before she's exiled from her people and her civilization forever - or just plain killed.\n\n","torrent":{"xt":"urn:btih:bffaf9843b86079482965ea439d61d9fd68a2b5d","amp;dn":"Iain+M.+Banks+-+%5BCulture+10%5D+-+The+Hydrogen+Sonata+%28Sci-Fi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bffaf9843b86079482965ea439d61d9fd68a2b5d","infoHashBuffer":{"type":"Buffer","data":[191,250,249,132,59,134,7,148,130,150,94,164,57,214,29,159,214,138,43,93]},"announce":[],"urlList":[]}}