{"title":"The Chemistry of Food - Jan Velisek","uid":15325420,"size":9654633,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c072d9bcb8b7d7060c122cb557889915e1e16596&amp;dn=The+Chemistry+of+Food+-+Jan+Velisek&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"clouderone","files":1,"time":1468694473,"description":"The Chemistry of Food - Jan Velisek (Wiley-Blackwell, 2014).pdf\r\n\r\nISBN 978-1-118-38384-1\r\n\r\nA core subject in food Science, food chemistry is the study of the chemical composition, processes and interactions of all biological and non-biological components of foods.\r\n\r\nThis book is an English language translation of the author's Czech-language food chemistry textbook.\r\n\r\nThe first half of the book contains an introductory chapter and six chapters dealing with main macro- and micronutrients, and the essential nutritional factors that determine the nutritional and energy value of food raw materials and foods.\r\n\r\nIt includes chapters devoted to amino acids, peptides and proteins, fats and other lipids, carbohydrates, vitamins, mineral substances and water. The second half of the book deals with compounds responsible for odour, taste and colour that determine the sensory quality of food materials and foods. It further includes chapters devoted to antinutritional, toxic and other biologically active substances, food additives and contaminants.\r\n\r\nStudents, teachers and food technologists will find this book an essential reference on detailed information about the changes and reactions that occur during food processing and storage and possibilities how to manage them. Nutritionists and those who are interested in healthy nutrition will find information about nutrients, novel foods, organic foods, nutraceuticals, dietary supplements, antinutritional factors, food additives and contaminants","torrent":{"xt":"urn:btih:c072d9bcb8b7d7060c122cb557889915e1e16596","amp;dn":"The+Chemistry+of+Food+-+Jan+Velisek","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c072d9bcb8b7d7060c122cb557889915e1e16596","infoHashBuffer":{"type":"Buffer","data":[192,114,217,188,184,183,215,6,12,18,44,181,87,136,153,21,225,225,101,150]},"announce":[],"urlList":[]}}