{"title":"Works of Love - Soren Kierkegaard","uid":8973592,"size":17739281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c114ccc0ff1a0b7bc9e85522bce1e1f1fc2ef5c7&amp;dn=Works+of+Love+-+Soren+Kierkegaard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"livhre","files":-1,"time":1380385024,"description":"The various kinds and conditions of love are a common theme for Kierkegaard, beginning with his early Either/Or, through &quot;The Diary of the Seducer&quot; and Judge William's eulogy on married love, to his last work, on the changelessness of God's love. Works of Love, the midpoint in the series, is also the monumental high point, because of its penetrating, illuminating analysis of the forms and sources of love. Love as feeling and mood is distinguished from works of love, love of the lovable from love of the unlovely, preferential love from love as the royal law, love as mutual egotism from triangular love, and erotic love from self-giving love.\n\nThis work is marked by Kierkegaard's Socratic awareness of the reader, both as the center of awakened understanding and as the initiator of action. Written to be read aloud, the book conveys a keenness of thought and an insightful, poetic imagination that make such an attentive approach richly rewarding. Works of Love not only serves as an excellent place to begin exploring the writings of Kierkegaard, but also rewards many rereadings","torrent":{"xt":"urn:btih:c114ccc0ff1a0b7bc9e85522bce1e1f1fc2ef5c7","amp;dn":"Works+of+Love+-+Soren+Kierkegaard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c114ccc0ff1a0b7bc9e85522bce1e1f1fc2ef5c7","infoHashBuffer":{"type":"Buffer","data":[193,20,204,192,255,26,11,123,201,232,85,34,188,225,225,241,252,46,245,199]},"announce":[],"urlList":[]}}