{"title":"Seth MacFarlane - 2014 - Holiday For Swing! FLAC","uid":11240192,"size":255512148,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c21100927ca55ea9c53e263d082da0b61502632b&amp;dn=Seth+MacFarlane+-+2014+-+Holiday+For+Swing%21+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"eika256","files":-1,"time":1413659259,"description":"Seth MacFarlane - 2014 - Holiday For Swing!\n\nOne thing eternal prankster Seth MacFarlane takes seriously is Frank Sinatra. He abandoned yucks in 2011 for a de facto Sinatra tribute called Music Is Better Than Words -- a record that so exactingly replicated the sound and style of Frank's Capitol LPs, it was recorded in the same room in the Capitol Records building that the Chairman of the Board used -- and it was successful enough to open the door for a sequel in 2014. MacFarlane, perhaps wisely, opted to channel his Sinatra obsession into a Christmas record called Holiday for Swing! Once again, he works with Joel McNeely -- the arranger/producer behind Music Is Better Than Words, plus all those animated homages to Wait 'Til Your Father Gets Home that MacFarlane airs on Fox -- with the intent of re-creating the snazzy snap of the holiday albums from Old Blue Eyes. So, Holiday for Swing! is another full-bore Frank tribute and, like its predecessor, it isn't bad. McNeely is a deft arranger steeped in the work of Nelson Riddle and Gordon Jenkins and MacFarlane is an able mimic, mimeographing Frank's cadences while wisely avoiding any attempts to conjure up the master's charm. Apart from the ever so slight notion that he's singing with a wink borrowed from Burl Ives -- a tell that gives away his status as a Gen-Xer weaned on Rankin &amp; Bass holiday productions -- MacFarlane plays it straight, even when he's camping it up with Sara Bareilles on &quot;Baby, It's Cold Outside&quot; (Norah Jones is the other guest, singing on &quot;Little Jack Frost Get Lost&quot;), and this sincerity plays out in his favor. MacFarlane loves Frank too much to mess with his music so he winds up with a retro salute that's thoroughly pleasant. (AllMusic)\n\nTrack list:\n01 - Let It Snow! Let It Snow! Let It Snow!\n02 - Christmas Dreaming\n03 - I'll Be Home For Christmas\n04 - Little Jack Frost Get Lost (Featuring Norah Jones)\n05 - Snow (From White Christmas)\n06 - A Marshmallow World\n07 - What Are You Doing New Year's Eve\n08 - Baby, It's Cold Outside (Featuring Sara Bareilles)\n09 - Mele Kalikimaka\n10 - Warm In December\n11 - Moonlight In Vermont\n12 - (Everybody's Waitin' For) The Man With The Bag\n13 - The Christmas Song\n\nEnjoy and share!","torrent":{"xt":"urn:btih:c21100927ca55ea9c53e263d082da0b61502632b","amp;dn":"Seth+MacFarlane+-+2014+-+Holiday+For+Swing%21+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c21100927ca55ea9c53e263d082da0b61502632b","infoHashBuffer":{"type":"Buffer","data":[194,17,0,146,124,165,94,169,197,62,38,61,8,45,160,182,21,2,99,43]},"announce":[],"urlList":[]}}