{"title":"GlarySoft Glary Utilities PRO v5.0.0.1 + License Key [ATOM]","uid":10148231,"size":13410995,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c2c9a215bd1de05077cc816f2f32ae9a5ae38346&amp;dn=GlarySoft+Glary+Utilities+PRO+v5.0.0.1+%2B+License+Key+%5BATOM%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"AtomTPB","files":6,"time":1400078607,"description":"Description:\nGlary Utilities Pro is a smart and reliable application that offers numerous powerful and easy-to-use system tools and utilities to fix, speed up, maintain and protect your PC. \n\nIt allows you to clean common system junk files, as well as invalid registry entries and Internet traces. You can manage and delete browser add-ons, analyze disk space usage and find duplicate files. \n\nYou can also view and manage installed shell extensions, encrypt your files from unauthorized access and use, split large files into smaller manageable files and then rejoin them.\n\nFurthermore, Glary Utilities Pro includes the options to optimize memory, find, fix, or remove broken Windows shortcuts, manage the programs that start at Windows startup and uninstall software. Other features include secure file deletion, an Empty Folder finder and more. \n\nAll Glary Utilities Pro tools can be accessed through an eye-pleasing and totally simplistic interface.\n\n\nFeatures:\n*Disk Cleaner - Removes junk data from your disks and recovers disk space\n*Registry Cleaner - Scans and cleans up your registry to improve your system's performance.\n*Shortcuts Fixer - Corrects the errors in your startmenu &amp; desktop shortcuts\n*Uninstall Manager - Uninstalls programs completely that you don't need any more\n*Startup Manager - Manages programs which run automatically on startup\n*Memory Optimizer - Monitors and optimizes free memory in the background\n*Context Menu Manager - Manages the context-menu entries for files, folders...\n*Tracks Eraser - Erases all the traces,evidences,cookies,internet history and more\n*File Shredder - Erases files permanently so that no one can recover them\nInternet Explorer Assistant - Manages Internet Explorer Add-ons and restores hijacked settings\n*File Encrypter and Decrypter - Protects your files from unauthorized access and use.\n*Disk Analysis - Shows you the disk space usage of your files and folders\n*Duplicate Files Finder - Searches for space-wasting and error producing duplicate files\n*Empty Folders Finder - Finds and removes empty folders in your windows\n*File Splitter and Joiner - Splits large files into smaller manageable files, and then rejoin them.\n*Process Manager - Monitors programs that run on your PC and stop spyware and Trojans.\n*Windows Standard Tools - Provides direct access to the useful windows default functions.\n\n\nRequirements:\n*Graphics mode 800x600 with 16-bit colors\n*20 MB free hard disk space at least\n*Intel Pentium or AMD K5 processor with 133 MHz\n*32 MB RAM\n\n\nSupported O/S : Windows 8, 7, 2000, XP, Vista. 32/64bit version.\n\n\nWhat's New in Version 5.0.0.1:\n*Improved program launch speed\n*Improved Erase History: Program detection methods\n*Improved compatibility with Memory Optimizer\n*Fixed Performance and stability in Registry Repair\n*Minor GUI improvements\n*Minor bug fixes","torrent":{"xt":"urn:btih:c2c9a215bd1de05077cc816f2f32ae9a5ae38346","amp;dn":"GlarySoft+Glary+Utilities+PRO+v5.0.0.1+%2B+License+Key+%5BATOM%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2c9a215bd1de05077cc816f2f32ae9a5ae38346","infoHashBuffer":{"type":"Buffer","data":[194,201,162,21,189,29,224,80,119,204,129,111,47,50,174,154,90,227,131,70]},"announce":[],"urlList":[]}}