{"title":"Odetta - The Tradition Masters (2002) (2 CDs)","uid":8685052,"size":483691191,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c2eac5cbbaf2d4f4bd951cec8671753b6524c7d0&amp;dn=Odetta+-+The+Tradition+Masters+%282002%29+%282+CDs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":null,"files":48,"time":1373779201,"description":"This is the same torrent that was uploaded to Demonoid in May 2008.\n\n\nOdetta - The Tradition Masters (2002) (2 CDs)\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop. (Includes 8 page booklet.)\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio from All Music:\n\nOdetta was born on New Year's Eve 1930 in Birmingham, AL. By the time she was six years old, she'd moved with her younger sister and mother to Los Angeles. She showed a keen interest in music from the time she was a child, and when she was about ten years old, somewhere between church and school, her singing voice was discovered. Odetta's mother began saving money to pay for voice lessons for her, but was advised to wait until her daughter was 13 years old and well into puberty.\n\nThanks to her mother, Odetta did begin voice lessons when she was 13. She received a classical training, which was interrupted when her mother could no longer afford to pay for the lessons. The puppeteer Harry Burnette interceded and paid for Odetta to continue her voice training.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:gifixq95ld0e~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:gifixq95ld0e~T1&lt;/a&gt;\n\nAlbum Review:\n\nWhile Odetta is usually lumped in with other revival artists, she actually began performing in the late '40s and had recorded her first album by 1956, a couple of years before the folk boom started. Her stripped-down style and powerful vocals also differed markedly from many revival practitioners, reminding one more of Leadbelly than Joan Baez. This connection is strengthened by the inclusion of pieces like &quot;Midnight Special&quot; and &quot;Take This Hammer&quot; in her repertoire. The Tradition Masters reissues Sings Ballads and Blues (1956) and At the Gate of Horn (1957) in a two-disc set, providing an excellent overview of Odetta's early work. Both sets are fairly straightforward, with her vocals supported by her persistent guitar strum on Sings Ballads and Blues and the addition of Bill Lee's bass on At the Gate of Horn. The most important element, though, is always Odetta's resonant vocals. Whether singing blues, spirituals, or straight folk, she delivers the lyrics with religious fever, as though she inhabited the words. Her approach also invigorates familiar fare like &quot;Greensleeves&quot; and &quot;He's Got the Whole World in His Hands,&quot; reminding the listener how good these songs are. It's also illustrative to compare her deep-interpretive approach to a lullaby like &quot;Pretty Horses&quot; with later, &quot;sweetened&quot; versions of the song by groups like Peter, Paul &amp; Mary. The Tradition Masters is a good place to immerse oneself in Odetta's authoritative versions of classic folk material. Old fans, unfamiliar with her early music, will likewise want to pick up a copy.\n\nTrack List:\n\nDisc 1:\n\n01. Santy Anno\n02. If I Had A Ribbon Bow\n03. Muleskinner Blues\n04. Another Man Done Gone\n05. Shame And Scandal\n06. 'Buked And Scorned\n07. Jack O' Diamonds\n08. Easy Rider\n09. Joshua\n10. Hound Dog\n11. Glory, Glory\n12. Alabama Bound\n13. Been In The Pen\n14. Deep Blue Sea\n15. God's Gonna Cut You Down\n16. Spiritual Trilogy\n\nDisc 2:\n\n01. Gallows Tree (Gallows Pole)\n02. Lowlands\n03. The Fox\n04. Maybe She Go\n05. Midnight Special\n06. Deep River\n07. Chilly Winds\n08. Greensleeves\n09. Devilish Mary\n10. Take This Hammer\n11. He's Got The Whole World In His Hands\n12. Sail Away Ladies\n13. Lass Of The Low Country\n14. Timber\n15. Pretty Horses\n\nMore album detail at: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:kiftxqwaldse&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:kiftxqwaldse&lt;/a&gt;\n","torrent":{"xt":"urn:btih:c2eac5cbbaf2d4f4bd951cec8671753b6524c7d0","amp;dn":"Odetta+-+The+Tradition+Masters+%282002%29+%282+CDs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2eac5cbbaf2d4f4bd951cec8671753b6524c7d0","infoHashBuffer":{"type":"Buffer","data":[194,234,197,203,186,242,212,244,189,149,28,236,134,113,117,59,101,36,199,208]},"announce":[],"urlList":[]}}