{"title":"Warships of the Anglo-Dutch Wars 1652-74","uid":11833474,"size":3721044,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c363f31bfc3af598b9e87a30d087a2b114a6f8ed&amp;dn=Warships+of+the+Anglo-Dutch+Wars+1652-74&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429666152,"description":"During the 17th century England and Holland found themselves at war three times, in a clash for economic and naval supremacy, fought out in the cold waters of the North Sea and the English Channel. The First Anglo-Dutch War (1652-54) pitted the Dutch against Oliver Cromwell's Commonwealth Navy, which proved as successful at sea as his New Model Army had been on land. Following the Restoration of 1660 the two maritime powers clashed again, and in the Second Dutch War (1665-67) it was the Dutch who had the upper hand. They humiliated the English by burning their fleet in the Medway (1667), forcing Charles II to sue for peace. This peace proved temporary, and the Third Dutch War (1672-74) proved a well-balanced and bitterly-fought naval contest. The Royal Navy eventually emerged triumphant, establishing a tradition of naval dominance that would last for two centuries.\n\nThis was a revolutionary era in several key areas - warship design, armament and in naval tactics. In effect the ships and fleets that began the conflict in 1652 were by-products of an earlier age - warships designed to fight chivalrous duels with their enemy counterparts. By the close of the Third Dutch War these warships had evolved into fully-fledged ships-of-the-line - the warships that would dominate the age of fighting sail until the advent of steam. This book traces the development of these warships during this critical evolutionary period in naval history, and shows that while both sides evolved their own doctrines of warship design and armament, it was the English notion who created a battle-winning navy of sailing ships-of-war","torrent":{"xt":"urn:btih:c363f31bfc3af598b9e87a30d087a2b114a6f8ed","amp;dn":"Warships+of+the+Anglo-Dutch+Wars+1652-74","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c363f31bfc3af598b9e87a30d087a2b114a6f8ed","infoHashBuffer":{"type":"Buffer","data":[195,99,243,27,252,58,245,152,185,232,122,48,208,135,162,177,20,166,248,237]},"announce":[],"urlList":[]}}