{"title":"Skyrim Mod: Falskaar","uid":8748529,"size":677524163,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c37724ef2bc6ab93516b189437363871677af2ea&amp;dn=Skyrim+Mod%3A+Falskaar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Baha_Z","files":2,"time":1374983155,"description":"I don't take credit, it's not my work. Just trying to share it as nexusmods is slow as hell.\n\nSource: http://skyrim.nexusmods.com/mods/37994/?\n\nFalskaar is a new lands mod that adds a new world (In a seperate worldspace) to the game. It was designed in a similiar manner as Skyrim, so all varieties of characters and level are welcome. The world scales in a similiar manner to Skyrim. Beyond that, Falskaar is simply designed to add a new land, much like a DLC. The land is an open world that may be freely explored. It has dungeons, quests, towns, people, and all sorts of content to keep you busy.\n\nNexus page: http://skyrim.nexusmods.com/mods/37994/?\n\n--------Features--------\n\n- An entirely new land independant of Tamriel, roughly the size of 2-3 Skyrim holds.\n\n- 20-30+ hours of gameplay.\n\n- 26 quests, including a 9 quest long main story, and 17 side quests! (Along with some unmarked content)\n\n- New items including new books, recipes, weapons and armor sets. (A mix of brand new, and retextured)\n\n- Two new spells and a new shout.\n\n- A bard with several unique new songs.\n\n- A soundtrack containing 14 brand new tracks composed by Adamm Khuevrr just for Falskaar, adding more than 40 minutes of new music!\n\n- A fully voiced experience, featuring almost 30 semi-professional and professional voice actors and actresses.\n\n--------Requirements--------\n\n- Skyrim patched to the latest version. (As of July 12th, 1.9.32.0.8 or greater)\n\n- Falskaar does NOT require SKSE or any DLC.\n\n--------Installation--------\n\n- Extract the archives contents into &quot;Skyrim/Data&quot; and activate Falskaar.esm.\n\n- Place above all .ESP files, and below any official plugins. (Update.esm &amp; DLC)\n\n- Other than that, load order shouldn't matter. Follow other mod's rules when placing it exactly.\n\n--------How to Start/What Level Should You Be--------\n\n- To start the mod, speak with Jalamar in Riften (In the market, or the Bee and Barb), or explore Echo Deep Mine, just NE of Riften.\n\n- There is no level requirement for this mod. It's designed to scale like Skyrim, so you can dive in right out of Helgen, or play at a higher level. Both should be fine.\n\nIMPORTANT: Do NOT use the console during this to set stages, open doors or disabled objects! Falskaar has been rigorously tested and nothing should be broken, so by doing this you void any guarantee for support, and will most likely break stuff.\n\n--------Compatibility--------\n\n- Falskaar was designed to edit as few vanilla assets and places as possible. However, still, two small areas pose risk:\n\n1) The area just outside of Riften along the path to the NE where the entrance to Echo Deep Mine is added.\n\n2) The portion of Dawnstar Bay that Wulf's ship now occupies.\n\n- Mods that conflict with these areas may cause you problems. Otherwise there are no major compatability concerns.\n\n- Falskaar was designed with compatability in mind, so many mods will work automatically, like wildlife replaces, etc.\n\n--------Uninstallation--------\n\n- The uninstallation of Falskaar is NOT supported. It's simply too big.\n\n- Treat Falskaar like a DLC, and do NOT remove it during a playthrough. Only remove if you are starting a new game.\n\n- To remove (Only for new game) simply delete &quot;Video/Falskaar_Intro.bik&quot;, &quot;Video/Falskaar_Outro.bik&quot;, &quot;Falskaar.bsa&quot;, and &quot;Falskaar.esm&quot;.\n\n- Failure to follow the above conditions will likely result is serious, irreversable damage to your save and is not recommended or supported.\n\n--------Permissions--------\n\nFalskaar may NOT be translated into another language without my permission.\n\nFalskaar may NOT under any circumstances be hosted or uploaded by anyone but me, anywhere ever.\n\nFalskaar may be modded in a similar manner to Skyrim under the following conditions:\n\n- No files that are packaged as part of Falskaar may be redistributed in any way shape or form. This includes the ESM, Bink video files, and any files contained within the BSA. The one and only exception to this are the Script and source (PSC and PEX) files. These may be altered and redistributed freely.\n\n- Your mod must require Falskaar as a master. You are not allowed to repackage Falskaar.esm. Just like with Skyrim, direct people to this page to download Falskaar, then they may download your child-mod separately.\n\n- You must make it abundantly clear that I am the author of Falskaar and preside over it's files.\n\n- You must make it clear that your mod is not supported by me in any way shape or form, and is an independent mod with it's own responsibilities and faults.\n\n--------Credits--------\n\nFor list of credits see Nexus page, or Youtube video:\n\n--------Patch Notes--------\n\nV 1.0.0 - Initial Release","torrent":{"xt":"urn:btih:c37724ef2bc6ab93516b189437363871677af2ea","amp;dn":"Skyrim+Mod%3A+Falskaar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c37724ef2bc6ab93516b189437363871677af2ea","infoHashBuffer":{"type":"Buffer","data":[195,119,36,239,43,198,171,147,81,107,24,148,55,54,56,113,103,122,242,234]},"announce":[],"urlList":[]}}