{"title":"Anacondas: The Hunt for the Blood Orchid (DVD, 2004)","uid":4325372,"size":825491131,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c37c8b89a24f89876a05771a5a9f2cf6e58aa75e&amp;dn=Anacondas%3A+The+Hunt+for+the+Blood+Orchid+%28DVD%2C+2004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"jazz3","files":2,"time":1217726856,"description":"Movie Description\nSome greedy scientists discover the &quot;blood orchid&quot; holds the secret to immortality, blooms once every seven years, and only grows deep in the jungles of giant python-infested Borneo. Quickly, an expedition is formed but it&amp;#039;s the rainy season and the only boat they can charter is a leaky barge belonging to unshaven Captain Johnson (Johnny Mesner). The cute blonde in the expedition (KaDee Strickland) digs Johnson&amp;#039;s stoic demeanor, while her scientist boss (Matthew Marsden) tries to win her through promises of untold riches once they find that orchid. Some of the other potential items on the snakes&amp;#039; menu: Johnson&amp;#039;s burly co-pilot (Karl Yune), a handsome ship&amp;#039;s doctor (Nicholas Gonzalez), a shrieking techie nerd (Cole Burris), Johnson&amp;#039;s pet monkey, and two corporate money-grabbers (Morris Chestnut and Salli Richardson). Of course the only ones who are going to be doing any real grabbing here are the gigantic anacondas, who recognize a boat full of lunch when they see one. They attack from nowhere and are big and fast. As if they weren&amp;#039;t enough trouble, there are also poison spiders, a giant crocodile, dangerous waterfalls, explosions, treachery, headhunters, and slimy leeches. Fans of the original may miss Jon Voight, but pretty much everything else--a great mixture of fun, suspense, and both intentional and unintentional laughs--is here, including the healthy tweaking of racial and sexual horror-film stereotypes. Monster movie connoisseurs will find this a meal they can swallow whole and digest for days.\n\nCredits \nCast: Johnny Messner, Matthew Marsden \nDirector: Dwight H. Little \nProducer: Susan Ruskin, Verna Harrah \n\n","torrent":{"xt":"urn:btih:c37c8b89a24f89876a05771a5a9f2cf6e58aa75e","amp;dn":"Anacondas%3A+The+Hunt+for+the+Blood+Orchid+%28DVD%2C+2004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c37c8b89a24f89876a05771a5a9f2cf6e58aa75e","infoHashBuffer":{"type":"Buffer","data":[195,124,139,137,162,79,137,135,106,5,119,26,90,159,44,246,229,138,167,94]},"announce":[],"urlList":[]}}