{"title":"Eddie Kendricks - Motown Solo Albums Vol 1 &amp; 2","uid":9459092,"size":909432125,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c380ccd12f9b1cba3e152979935d613558e3362b&amp;dn=Eddie+Kendricks+-+Motown+Solo+Albums+Vol+1+%26amp%3B+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"chmeee_sk_cdn","files":-1,"time":1389319567,"description":"mp3 320\n &lt;a href=&quot;\nhttp://www.allmusic.com/album/keep-on-truckin-the-motown-solo-albums-vol-1-mw0000551183&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/keep-on-truckin-the-motown-solo-albums-vol-1-mw0000551183&lt;/a&gt;\n\nThis double-CD set is the first of two anthologies to gather the solo work of Temptations co-founder Eddie Kendricks. Included are his early-'70s long-players All by Myself, People...Hold On, Eddie Kendricks, and For You. Although he had gained considerable distinction as a key component in the Temptations during the 1960s, by decade's end the group was being torn apart by substance abuse and egos. David Ruffin's departure was followed by Kendricks -- who had actually already begun to record All by Myself prior to officially leaving the Temps. His debut project was sensitively produced by Motown stalwart Frank Wilson, who showcases Kendricks at his best and most diverse. The material ranges from the funky &quot;Let's Go Back to Day One&quot; through to the Philly soul score that weaves beneath the remake of Jimmy Webb's &quot;Didn't We.&quot; People...Hold On takes Kendricks down a path of introspective, socially conscious themes -- much like labelmate Marvin Gaye had done with his landmark What's Going On in 1971. Among the standouts are the optimistic &quot;Someday We'll Have a Better World&quot; and the passionate &quot;My People...Hold On.&quot; Much more personal are the inspired &quot;Day by Day&quot; and the driving groove that propels &quot;Let Me Run into Your Lonely Heart&quot; -- all reconfirming Kendricks' stature as a substantial singer. Although there were several singles from All by Myself and People...Hold On that performed admirably on the R&amp;B surveys, the majority didn't create a stir on the pop charts. All that changed, however, with Eddie Kendricks -- which entered the Top 20 R&amp;B and pop LP countdowns. Much of the attention was due to the chart-topping &quot;Keep on Truckin',&quot; which is here in the unedited seven-plus-minute album version. On the other side of the stylistic spectrum are &quot;Each Day I Cry a Little,&quot; replete with spoken intro, and the not-to-be-missed remake of &quot;Any Day Now&quot; -- the Burt Bacharach-penned song that Chuck Jackson spun into gold some years earlier. The success of &quot;Keep on Truckin'&quot; spilled over to For You, with Kendricks garnering a pair of Top Ten tunes with &quot;One Tear&quot; and his second number one, the refined &quot;Shoeshine Boy.&quot; He also covers light rock hits with &quot;If&quot; by Bread and an outstanding interpretation of &quot;Time in a Bottle&quot; that may best Jim Croce's original. Keep on Truckin': The Motown Solo Albums, Vol. 1 is limited to an edition of 5,000 and comes with a full-color glossy 28-page booklet with photos, reproductions of the LP artwork, full credits, and discographical details. \n &lt;a href=&quot;\nhttp://www.allmusic.com/album/the-thin-man-the-motown-solo-albums-vol-2-mw0000778756&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/the-thin-man-the-motown-solo-albums-vol-2-mw0000778756&lt;/a&gt;\n\nThis triple-disc anthology complements Keep on Truckin': The Motown Solo Albums, Vol. 1. Included are Eddie Kendricks' mid- to late-'70s long-players Boogie Down!, The Hit Man, He's a Friend, Goin' Up in Smoke, and Slick, as well as seven previously unavailable sides excavated from the Motown vaults. Kendricks' post-&quot;Keep on Truckin'&quot; successes continued on Boogie Down!, topping the R&amp;B LP chart and making a sizable impact on pop audiences thanks to the tracks &quot;Boogie Down,&quot; &quot;Tell Her Love Has Felt the Need,&quot; and the slinky funk-a-thon &quot;Son of Sagittarius.&quot; Kendricks' arguably less polished The Hit Man chalked up two additional Top Ten R&amp;B hits with &quot;Get the Cream Off the Top&quot; and &quot;Happy.&quot; The latter is not the Rolling Stones tune, but does feature Kendricks' outstanding falsetto. Meanwhile, the Barrett Strong composition &quot;Fortune Teller&quot; is also distinguished for its stinging groove and solid backbeat. By the time of the generally uneven He's a Friend in 1976, the intensity and passion seem to be replaced by slick rhythms and equally superficial arrangements. There are a few excellent cuts, most notably the bedroom ballad &quot;A Part of Me&quot; and the hot-steppin' &quot;It's Not What You Got,&quot; which made it into the Top Ten disco/dance survey. Similarly, the follow-up, Goin' Up in Smoke, would manage to yield the hit single &quot;Goin' Up in Smoke.&quot; That said, the majority of the platter is essentially disco dreck, and one wonders whether titles such as &quot;Thanks for the Memories&quot; (no, not that one) and &quot;Skeleton in Your Closet&quot; were correlated to Kendricks' state of mind. Slick -- the artist's Motown swan song -- is a return to the more soulful sound that had informed much of his earlier solo work. The haunting refrain on &quot;I Want to Live (My Life with You),&quot; the warm and inviting &quot;Intimate Friends,&quot; and the slightly funky interpretation of Seals &amp; Crofts' &quot;Diamond Girl&quot; give it a definite edge over its predecessor. Most of the bonus selections are gleaned from the era surrounding 1972's People...Hold On. Compilers saved the best of the &quot;lost and found&quot; material for last with the outstanding &quot;I'll Be Your Servant.&quot; Somehow the song initially slipped through the cracks, but luckily it has been resuscitated for listeners on this limited-edition set.\n","torrent":{"xt":"urn:btih:c380ccd12f9b1cba3e152979935d613558e3362b","amp;dn":"Eddie+Kendricks+-+Motown+Solo+Albums+Vol+1+%26amp%3B+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c380ccd12f9b1cba3e152979935d613558e3362b","infoHashBuffer":{"type":"Buffer","data":[195,128,204,209,47,155,28,186,62,21,41,121,147,93,97,53,88,227,54,43]},"announce":[],"urlList":[]}}