{"title":"The Last Leviathan v0.1.1","uid":15129833,"size":112505478,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c39a82286540f046ed03cc1fe4e131af27ea5bf1&amp;dn=The+Last+Leviathan+v0.1.1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"dauphong","files":1,"time":1467144533,"description":"About This Game\r\nThe Last Leviathan is a physics-based, ship building and destruction adventure. You construct battle ships to crush your adversaries and massacre the monsters you encounter around the ancient seas of Middenhir.\r\n\r\nOn your voyage to uncover where The Last Leviathan lies you will discover a world full of rival ships, mythical monsters, wrecked flotsam, physics-puzzles and hidden treasures.\r\n\r\n\r\n\r\nBuild Ships\r\n\r\nWith blocks bought, found or plundered, you’ll craft boats capable of conquering pirates, out manoeuvring racing ships, disintegrating towers high on the coastal hills and solving mysteries.\r\n\r\nNaval Encounters\r\n\r\nAcross the busy seas of Middenhir you’ll encounter many ships from clans far and wide. Some will be friendly and want to trade, others are looking for blood and booty - Yours!\r\n\r\nBattling Monsters\r\n\r\nSome say these behemoths are the descendants of The Last Leviathan, others just refuse to accept that they exist. Once you’ve seen one on the horizon you’ll wonder how you ever thought of anything else.\r\n\r\nMonster battles will be the pinnacle of your experience in The Last Leviathan. You’ll need to analyse the monster’s weaknesses, craft bigger weapons, build a specialised ship and then unleash the dogs of war with true, commanding skill.\r\n\r\n\r\n\r\nVoyage: Build, sail, navigate and fight across the seas, unveiling the secrets of Middenhir in a voyage of survival and discovery.\r\n\r\nCreative: Completely open sandbox for you to be inventive or just enjoy the sights and relax in.\r\n\r\nBattle Seas: An ocean of fights and challenges including: survival, last man standing, racing, waves, and many more that we (and you) haven't thought of yet!\r\n\r\n\r\n\r\nFull Steam Workshop integration allowing your ship designs to be shared and battled with or against. Leaderboards will track your uploaded ship’s performance in battle against members of the community.\r\n\r\nYou'll be able to Mod in many ways from Ship-AI, Cannon-AI, ship block creation and potentially even Battle Seas events.\r\n\r\n\r\n\r\nOur current version is a limited set of polished features for both Battle Seas and Creative modes. Voyage mode &amp; Real-time multiplayer will be developed during Early Access.\r\n\r\nWe’ll be releasing on PC initially, then Mac and Linux versions during Early Access.\r\n\r\n\r\n\r\nWe’re Super Punk Games, a small indie developer based in Nottingham, England.\r\n\r\nTo get in touch about the game, you can find us hanging out in the Steam Community HUB or on our subreddit,&amp; twitter. Use the link above to our website to find out more!\r\n\r\nThank you for reading to the end, you are clearly a Super Punk!","torrent":{"xt":"urn:btih:c39a82286540f046ed03cc1fe4e131af27ea5bf1","amp;dn":"The+Last+Leviathan+v0.1.1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c39a82286540f046ed03cc1fe4e131af27ea5bf1","infoHashBuffer":{"type":"Buffer","data":[195,154,130,40,101,64,240,70,237,3,204,31,228,225,49,175,39,234,91,241]},"announce":[],"urlList":[]}}