{"title":"Neal Asher -  The Voyage of the Sable Keech (Spatterjay #2)","uid":11570776,"size":724511918,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c3af833f2be299b42ec450653c4d6475da68f09f&amp;dn=Neal+Asher+-++The+Voyage+of+the+Sable+Keech+%28Spatterjay+%232%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Cybotage","files":17,"time":1417019332,"description":"Neal Asher -  The Voyage of the Sable Keech (Spatterjay #2)\n\nWritten by Neal Asher\nFormat: MP3\nUnabridged\n\nSable Keech is a walking dead man, and the only one to have been resurrected by nanochanger. Did he succeed because he was infected by the Spatterjay virus, or because he came late to resurrection in a tank of seawater? Tracing the man's last-known seaborne journey, Taylor Bloc wants to know the truth. He also wants so much else - adulation, power, control - and will go to any lengths to achieve them. An ancient hive mind, almost incomprehensible to the human race, has sent an agent to this uncertain world. Does it simply want to obtain the poison 'sprine' that is crucial to immortality - and, if so, maybe Janer must find it and stop it. Meanwhile, still faced with the ennui of immortality, Erlin has her solitude rudely interrupted by a very angry whelkus titanicus, and begins the strangest of journeys. Deep in the ocean the Spatterjay virus has wrought a terrible change that will affect them all. Something dormant for ten years is breaking free, and once again the aftershocks of an ancient war will focus on this watery world. And Sniper, for ten years the Warden of Spatterjay, finally takes delivery of his new drone shell. It's much better than his old one: powerful engines, more lethal weapons, thicker armour. He's going to need them","torrent":{"xt":"urn:btih:c3af833f2be299b42ec450653c4d6475da68f09f","amp;dn":"Neal+Asher+-++The+Voyage+of+the+Sable+Keech+%28Spatterjay+%232%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3af833f2be299b42ec450653c4d6475da68f09f","infoHashBuffer":{"type":"Buffer","data":[195,175,131,63,43,226,153,180,46,196,80,101,60,77,100,117,218,104,240,159]},"announce":[],"urlList":[]}}