{"title":"Meyler's Side Effects of Herbal Medicines {BBS}","uid":7517548,"size":3878529,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3e3f3a3880f028f75f5d70ef490568034edbe94&amp;dn=Meyler%27s+Side+Effects+of+Herbal+Medicines+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1344521286,"description":"Elsevier now offers a series of derivative works based on the acclaimed Meylers Side Effect of Drugs, 15th Edition. These individual volumes are grouped by specialty to benefit the practicing physician or health care clinician.\n\nHerbal Medicines are popular with consumers and patients who often assume that they are natural and therefore safe. However, herbal medicines undoubtedly have adverse effects and patients often do not discuss their use of herbal medicines with their doctors, and the risks are not always addresses.\n\nThis book summarizes the adverse effects of a large range of herbal medicines and the active ingredients that they contain. It includes extensive lists of the families of plants that are used as herbal medicines, including the Latin names of genera and species as well as the common names of individual plants. It features not only herbal medicines but information on important compounds such as tropane alkaloids, cardiac glycosides, nicotine, and pyrolizidine alkaloids.\n\nThe material is drawn from the 15th edition of the internationally renowned encyclopedia, Meyler's Side Effects of Drugs, and the latest volumes in the companion series, Side Effects of Drugs Annuals.\n\nThis volume is critical for any health professional or homeopathic practitioner with an interest in herbal medicines.\n\n    * Surpasses the Physician's Desk Reference Â© by including clinical case studies and independent expert analysis\n\n    * Complete index of drug names\n\n    * Most complete cross referencing of drug-drug interactions available\n\nThe book is divided into three separate sections:\n\n    * Family - Each monograph is organized under a family of plants. For example Liliaceae.\n\n    * Genera - The various genera that are included under the family name are tabulated. For example the family Liliaceae contains 94 genera.\n\n    * Species - In each monograph, some species are dealt with separately. For example, in Liliaceae, four species are included under their Latin names and major common names\n\nEach monograph includes the following information in varying amounts:\n\n    * Alternative common names\n\n    * Active ingredients\n\n    * Uses - both traditional and modern\n\n    * Adverse effects\n\n    * Referencese\n\nDrug names have usually been designated by their recommended or proposed International Non-proprietary Names (rINN or pINN); when those are not available, clinical names have been used. In some cases, brand names have been used.\n\n\n\n# Hardcover: 320 pages\n# Publisher: Elsevier Science; 1 edition (October 7, 2008)\n# Language: English\n# ISBN-10: 0444532692\n# ISBN-13: 978-0444532695","torrent":{"xt":"urn:btih:c3e3f3a3880f028f75f5d70ef490568034edbe94","amp;dn":"Meyler%27s+Side+Effects+of+Herbal+Medicines+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3e3f3a3880f028f75f5d70ef490568034edbe94","infoHashBuffer":{"type":"Buffer","data":[195,227,243,163,136,15,2,143,117,245,215,14,244,144,86,128,52,237,190,148]},"announce":[],"urlList":[]}}