{"title":"Need for Speed Porsche Unleashed","uid":6811309,"size":727447263,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c473344db546bd9479d86685e3bb57897d4fa12d&amp;dn=Need+for+Speed+Porsche+Unleashed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"NFS4EV3R","files":-1,"time":1321044828,"description":"Need for Speed Porsche Unleashed (2000)\n\n\nDrive over 80 different Porsches, from the first 356 Ferdinand to the 2000 911 Turbo over multiple tracks. Some tracks have alternate paths. Others are rally tracks where you go from one end of the track to the other instead of doing circuit racing. The graphics have been enhanced and the physics model changed to reflect a true 4-point system, and you can feel the difference between the different vehicles.\n\nTwo completely different single-player modes available. First, there's factory driver, which have you join Porsche as a test driver. As you complete different challenges, which can vary from doing specific manoeuvres in pre-alloted time to racing fellow drivers, you will make your way up to Ace Test Driver. Second, there's Evolution, which is the &quot;career mode&quot;, you start with enough money to buy one 356, and start racing. As you win races, time will pass, new cars will become available, or you can peruse the used car market. Buy/repair/sell cars, win races, buy enhancement parts for your car, and make your way to the end of the modern era...\n\n\nFeatures:\n- Over 80 models from 50 amazing years\n- 9 European open road courses &amp; 5 closed tracks\n- 4-point physiks model captures the unique feel of each car\n- 3D cockpits - Advanced in-car view simulates head movement\n- Mission-based challengesreward you for exceeding the limits\n- High-Speed thrills with traffic, police and spectacular crashes  \n- Work with over 700 parts of the official Porsche catalog  \n- Buy and sell, upgrade, repair, and mantain your cars\n\nOS: Windows 2K/XP/Vista/7\n\n","torrent":{"xt":"urn:btih:c473344db546bd9479d86685e3bb57897d4fa12d","amp;dn":"Need+for+Speed+Porsche+Unleashed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c473344db546bd9479d86685e3bb57897d4fa12d","infoHashBuffer":{"type":"Buffer","data":[196,115,52,77,181,70,189,148,121,216,102,133,227,187,87,137,125,79,161,45]},"announce":[],"urlList":[]}}