{"title":"Eliane Elias-Bossa Nova Stories-2009-jazz","uid":4665718,"size":85418910,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c51b9ffebd1577931a779225641bcd5e64493cb3&amp;dn=Eliane+Elias-Bossa+Nova+Stories-2009-jazz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1232558844,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nEliane Elias (eh-lee-AH-neh eh-LEE-ahs) (born March 19, 1960 in SÃƒÂ£o Paulo, Brazil) is a consummate Brazilian jazz pianist, arranger, vocalist and songwriter. Elias lives and works in New York City where she settled in 1981. Her music is readily recognizable by her use of jazz harmonies, her rich blending of rhythmic styles, and, occasionally, her voice.\nElias started with the piano at age six. Her mother was a classical pianist who often played jazz records in the family home. Eliane studied at the Free Center of Music Apprenticeship in SÃƒÂ£o Paulo. She started composing and, more notably, performing her own jazz pieces at seventeen. She became known to the Brazilian public when she joined Brazilian singer/guitarist/songwriter Toquinho and poet/entertainer Vinicius de Moraes, with whom she made concert tours, mainly through South America.\nOn a tour in Europe in 1981, she met jazz bassist Eddie Gomez and was encouraged to travel to New York. After moving there, she was invited to join Steps Ahead, and recorded one album with the group in 1983. After leaving Steps Ahead, she worked with trumpet player Randy Brecker, whom she subsequently married. They recorded an album named after their daughter, &quot;Amanda&quot;. Starting in 1986, Elias became a successful band leader. In 1988 she was elected as &quot;Best New Talent&quot; by the JAZZIZ magazine poll of jazz critics.\nShe has recorded several notable albums, including one featuring duets with Herbie Hancock. Their 1995 disc &quot;Solos and Duets&quot; was nominated for a Grammy[1] in the &quot;Jazz instrumental video&quot; category. In 1997, American musician Bob Brookmeyer dedicated a full album to his arrangements of Eliane's compositions, backed by the Danish Jazz Orchestra and published under the name of &quot;Impulsive!&quot; [2], which received another Grammy nomination as &quot;Best Large Jazz Ensemble Album&quot; in 2001.\nStarting with the 1990 album &quot;Eliane Elias Plays Jobim&quot;, from time to time she has added her own vocals to her recordings. She was one of the featured artists in the Latin jazz documentary, Calle 54, released in 2000. Elias' 2006 album &quot;Around the City&quot; included no less than Vicente Amigo and Oscar Castro-Neves in the guitar roles. Her most recent release, &quot;Something For You&quot; (2007) is dedicated to the music of her much-admired Bill Evans, whose works she played and also transcribed when still a child, and whom she regards as a considerable and highly valuable influence on her musical upbringing.\nElias is currently married to bassist Marc Johnson (a close friend of Bill Evans, and part of his trio in his last years), with whom she has produced several albums. They regularly perform together in concert tours, both in the U.S. and abroad.\n\n","torrent":{"xt":"urn:btih:c51b9ffebd1577931a779225641bcd5e64493cb3","amp;dn":"Eliane+Elias-Bossa+Nova+Stories-2009-jazz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c51b9ffebd1577931a779225641bcd5e64493cb3","infoHashBuffer":{"type":"Buffer","data":[197,27,159,254,189,21,119,147,26,119,146,37,100,27,205,94,100,73,60,179]},"announce":[],"urlList":[]}}