{"title":"The Four Loves - C.S. Lewis","uid":4291170,"size":11447872,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5890234c4f1c590f53aea4c02ccaf35e685f52e&amp;dn=The+Four+Loves+-+C.S.+Lewis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"CuriousGeorge","files":1,"time":1215902369,"description":"The Four Loves is a book by C. S. Lewis which explores the nature of love from a Christian perspective through thought-experiments and examples from literature. The content of the examination is prefaced by Lewis' admission that he initially mistook St. John's words &quot;God is Love&quot; for a simple inroads to his topic. By distinguishing need-love (such as the love of a child for its mother) from gift-love (epitomized by God's love for humanity), Lewis happens upon the contemplative that the natures of even these basic categorizations of love are more complicated than they, at first, seem. As a result, he formulates the foundation of his topic (&quot;the highest does not stand without the lowest&quot;) by exploring the nature of pleasure, and then divides love into four categories, based in part on the four Greek words for love: affection, friendship, eros, and charity. It must be noted, states Lewis, that just as Lucifer?a former cherub?perverted himself by pride and fell into depravity, so too can love?commonly held to be the arch-emotion?become corrupt by presuming itself to be what it is not (&quot;love begins to be a demon the moment he begins to be a god&quot;).\n\nAffection\n\nAffection (storge, ??????) is fondness through familiarity, especially between family members or people who have otherwise found themselves together by chance. It is described as the most natural, emotive, and widely diffused of loves: natural in that it is present without coercion; emotive because it is the result of fondness due to familiarity; and most widely diffused because it pays the least attention to those characteristics deemed &quot;valuable&quot; or worthy of love and, as a result, is able to transcend most discriminating factors. Ironically, its strength, however, is what makes it vulnerable. Affection has the appearance of being &quot;built-in&quot; or &quot;ready made&quot;, says Lewis, and as a result people come to expect, even to demand, its presence--irrespective of their behavior and its natural consequences.\n\nFriendship\n\nFriendship (philia, ?????) is a strong bond existing between people who share a common interest or activity. Lewis explicitly says that his definition of friendship is narrower than mere companionship: friendship in his sense only exists if there is something for the friendship to be &quot;about&quot;. It is the least natural of loves, states Lewis; i.e., it is not biologically necessary to progeny like either affection (e.g., rearing a child), eros (e.g., creating a child), or charity (e.g., providing for a child). It has the least association with impulse or emotion. In spite of these characteristics, it was the belief of the ancients (Lewis himself, too) that it was the most admirable of loves because it looked not at the beloved (like eros), but it looked towards that &quot;about&quot;--that thing because of which the relationship was formed. This freed the participants in this friendship from self-consciousness. Because the more they were looking towards something beyond or above themselves, the more those who were looking towards that thing with them were welcomed with the same sincerity, which freed the relationship from jealousy. And although the love may not be biologically necessary, it has, argued Lewis, civilization value. The thing beyond or above themselves may be of monumental importance to society. But without the benefit of friendship to blunt the loneliness of &quot;being the only person who sees this&quot;, or the idea that two heads are better than one, many advances in society may never have been embarked upon. The relationship is by its nature selective, and therefore, exclusive. This characteristic is not detrimental per se, but the idea or goal towards which friends strive need not be altruistic. The innocuous ideas may simply be the cause of pseudo-aristocracies that ignore the legitimate cries of those outside their group; the malefic ones may be quite worse.\n\nEros\n\nEros (????) is love in the sense of 'being in love'. This is distinct from sexuality, which Lewis calls Venus, although he does spend time discussing sexual activity and its spiritual significance in both a pagan and a Christian sense. He identifies eros as indifferent. This is good because it promotes appreciation of the beloved regardless of any pleasure that can be obtained from them. It can be bad, however, because this blind devotion has been at the root of many of history's most abominable tragedies. In keeping with his warning that &quot;love begins to be a demon the moment [it] begins to be a god&quot;, he warns against the danger of elevating eros to the status of a god.\n\nCaritas\n\nCaritas (agap?, ?????) is an unconditional love directed towards one's neighbor which is not dependent on any lovable qualities that the object of love possesses. Agape is the love that brings forth caring regardless of circumstance. Lewis recognizes this as the greatest of loves, and sees it as a specifically Christian virtue. The chapter on the subject focuses on the need of subordinating the natural loves to the love of God, who is full of charitable love. Lewis states that &quot;He is so full, in fact, that it overflows, and He can't help but love us.&quot; Lewis metaphorically compares love with a garden, charity with the gardening utensils, the lover as the gardener, and God as the elements of nature. God's love and guidance act on our natural love (that cannot remain what it is by itself) as the sun and rain act on a garden: without either, the object (metaphorically the garden; realistically love itself) would cease to be beautiful or worthy. Lewis warns that those who exhibit charity must constantly check themselves that they do not flaunt--and thereby warp--this love (&quot;But when you give to someone, don't tell your left hand what your right hand is doing.&quot;--Matthew 6:3), which is its potential threat.","torrent":{"xt":"urn:btih:c5890234c4f1c590f53aea4c02ccaf35e685f52e","amp;dn":"The+Four+Loves+-+C.S.+Lewis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5890234c4f1c590f53aea4c02ccaf35e685f52e","infoHashBuffer":{"type":"Buffer","data":[197,137,2,52,196,241,197,144,245,58,234,76,2,204,175,53,230,133,245,46]},"announce":[],"urlList":[]}}