{"title":"Nefes Vatan Sagolsun 2009 DVDRip","uid":5265665,"size":724143617,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c5e4659493805bd6c5b06f1d9ea364081b20fa99&amp;dn=Nefes+Vatan+Sagolsun+2009+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"lucabra44","files":1,"time":1262878558,"description":"Not a camrip. It has good quality DVDRip\n\nNefes: Vatan sagolsun (Turkish for 'Breath: Long live the Homeland') is about a small group of Turkish soldiers in a remote patrol station in eastern Turkey facing their near-certain death during a time the conflict between Turkish Army and separatist militant organization PKK reached its peak point.\n\n\n-------a bit spoiler--------\nA major who had just lost two people in his command in a combat with PKK militants arrives at the station and takes charge. He finds it very difficult to step out of the state of depression due to his recent loss and so intimidates his soldiers into bettering themselves to ensure that such a tragedy never happens again. During his stay there, he came across a PKK militant called the 'Doctor' who intervenes in his phone calls with his wife through radio frequencies. This becomes almost habitual with frequent exchange of hostile words. ' Why do you live like pigs instead of being a doctor in your village and serving your people' the Major asks and 'I would rather live in my mountains as a freeman than being a doctor from your universities' the Doctor replies. In parallel to that, we observe daily routines of Turkish soldiers and their sincere phone calls with their loved ones as we approach to the inevitable end. \n-------a bit spoiler--------\n\nSuperb news\nFor the English, French and German Sub:","torrent":{"xt":"urn:btih:c5e4659493805bd6c5b06f1d9ea364081b20fa99","amp;dn":"Nefes+Vatan+Sagolsun+2009+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5e4659493805bd6c5b06f1d9ea364081b20fa99","infoHashBuffer":{"type":"Buffer","data":[197,228,101,148,147,128,91,214,197,176,111,29,158,163,100,8,27,32,250,153]},"announce":[],"urlList":[]}}