{"title":"Steve Reich - 1989 - Different Trains - Electric Counterpoint [K","uid":5118766,"size":60292962,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c606aa997668df5bc3028135b57a6c68bb77e2f7&amp;dn=Steve+Reich+-+1989+-+Different+Trains+-+Electric+Counterpoint+%5BK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"muzik62","files":-1,"time":1255202082,"description":"Steve Reich - Different (Trains Kronos Quartet) Electric Counterpoint (Pat Metheny) (1989)\n\nmp3 192 kbits\n\n--------------------- Tracks ------------------\n1. Different Trains (America- Before the War) - The Kronos Quartet\n2. Different Trains (Europe- During the War) - The Kronos Quartet\n3. Different Trains (After the War) - The Kronos Quartet\n4. Electric Counterpoint (Fast) - Pat Metheny\n5. Electric Counterpoint (Slow) - Pat Metheny\n6. Electric Counterpoint (Fast) - Pat Metheny\n\n&quot;Different Train is one of Steve Reich's most talked-about pieces. It was inspired by his personal memories of his experience as a child riding trains a lot all over the United States to visit each of his divorced parents, &amp; also interviews he did with holocaust survivors about their experiences aboard European trains in WWII. The string quartet's job is mostly to match speech melody, &amp; there are other trainy sounds mixed in, too. The music is very muscular, very compelling.\nElectric Counterpoint is some of Reich's most beautiful music if you ask me. Each note is absolutely clear; the music changes gradually in increments with great awareness of keeping the listener never bored but always interested. The guitar virtuosity of Pat Metheny does a lot for the piece, too. For one thing, Reich finished his drafts of the music with Metheny telling him where the notes could go given the physical shape of guitars. For me, Electric Counterpoint is probably much more enjoyable to listen to than Different Trains. Wonderful music.\nDifferent Trains is an important Reich piece to be familiar, but I'd even highly recommend this cd just for Electric Counterpoint. This cd is very high on the list of Steve Reich cd's to get.&quot;\nBy burninfield\n\nmuzik62","torrent":{"xt":"urn:btih:c606aa997668df5bc3028135b57a6c68bb77e2f7","amp;dn":"Steve+Reich+-+1989+-+Different+Trains+-+Electric+Counterpoint+%5BK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c606aa997668df5bc3028135b57a6c68bb77e2f7","infoHashBuffer":{"type":"Buffer","data":[198,6,170,153,118,104,223,91,195,2,129,53,181,122,108,104,187,119,226,247]},"announce":[],"urlList":[]}}