{"title":"Blue.Bloods.S05E14.720p.HDTV.X264-DIMENSION","uid":11685607,"size":854489032,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:c6698e27f1666c173a73e869bea10aa89b7b2ccc&amp;dn=Blue.Bloods.S05E14.720p.HDTV.X264-DIMENSION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Thhaque","files":1,"time":1423305867,"description":"[b]Blue Bloods\n\n[IMG]http://i.imgur.com/HALceWx.jpg[/IMG]\n\nGenre: Crime, Drama, Family\nYear: 2014\nCountry: USA\nRuntime: 42 min\nDirector: Robin Green \nCasts: Jennifer Butler, Len Cariou, Bridget Moynahan, Tom Selleck, Donnie Wahlberg and more.\n\n.: Plot :.\nBLUE BLOODS is a drama about a multi-generational family of cops dedicated to New York City law enforcement. Frank Reagan (Tom Selleck) is the New York Chief of Police and patriarch of the Reagan brood, which he heads as diplomatically as he does the force, even when dealing with the politics that plagued his unapologetically bold father, Henry (Len Cariou), during his stint as Chief. A source of pride and concern for Frank is his eldest son Danny (Donnie Wahlberg), a seasoned detective, family man and Iraqi War vet who on occasion uses dubious tactics to solve cases. The sole Reagan woman in the family, Erin (Bridget Moynahan), is a N.Y. Assistant D.A. and newly single parent, who also serves as the legal compass for her siblings and father. Jamie (Will Estes) is the youngest Reagan, fresh out of Harvard Law and the family's &quot;golden boy.&quot; However, unable to deny the family tradition, Jamie decided to give up a lucrative future in law and is now a newly minted cop, a career change seemingly supported by his beautiful girlfriend, Sydney Davenport (Dylan Moore), a first year lawyer. Jamie's life takes an abrupt turn, however, when he's asked to become part of a clandestine police investigation even his father knows nothing about, and one that could impact the family's legacy. Emmy Award winners Mitchell Burgess, Robin Green and Leonard Goldberg are executive producers for CBS Television Studios.[/b]","torrent":{"xt":"urn:btih:c6698e27f1666c173a73e869bea10aa89b7b2ccc","amp;dn":"Blue.Bloods.S05E14.720p.HDTV.X264-DIMENSION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6698e27f1666c173a73e869bea10aa89b7b2ccc","infoHashBuffer":{"type":"Buffer","data":[198,105,142,39,241,102,108,23,58,115,232,105,190,161,10,168,155,123,44,204]},"announce":[],"urlList":[]}}