{"title":"Grateful Dead - Live/Dead (1969) [Rock Pop][mp3 320][schon55]","uid":5143734,"size":195369118,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c6c9a3288bc68b21f4acf61c40e120c84901bd85&amp;dn=Grateful+Dead+-+Live%2FDead+%281969%29+%5BRock+Pop%5D%5Bmp3+320%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"schon55","files":22,"time":1257099809,"description":"Grateful Dead - Live/Dead \nYear: 1969 (Warner)\nLabel: Rhino (Remastered, HDCD, 2003)\nTotal time: 73:04\nQuality: 320 kbps\n\nThe Grateful Dead's fourth title was likewise their first extended concert recording.   Spread over two LPs, Live/Dead (1969) finally was able to relay the intrinsic sonic magnificence of a Dead show in real time.   Additionally, it unleashed several key entries into their repertoire, including the sidelong epic and Deadhead anthem&quot;Dark Star&quot; as well as wailing and otherwise electrified acidic covers of the Rev.   Gary Davis blues standard &quot;Death Don't Have No Mercy&quot; and the R&amp;B rave-up &quot;(Turn on Your) Lovelight.  &quot; Finally, the conundrum of how to bring a lengthy performance experience to the listener has been solved.   The album's four sides provided the palette from which to replicate the natural ebb and flow of a typical Dead set circa early 1969.   Tomes have been written about the profound impact of &quot;Dark Star&quot; on the Dead and their audience.   It also became a cultural touchstone signifying that rock music was becoming increasingly experimental by casting aside the once-accepted demands of the short, self-contained pop song.   This version was recorded on February 27, 1969, at the Fillmore West and is presented pretty much the way it went down at the show.   The same is true of the seven remaining titles on Live/Dead.   The rousing rendition of &quot;St.   Stephen&quot; reinvents the Aoxomoxoa (1968) prototype with rip-roaring thunder and an extended ending which slams into an instrumental rhythmic excursion titled &quot;The Eleven&quot; after the jam's tricky time signature.   The second LP began with a marathon cover of &quot;(Turn on Your) Lovelight,&quot; which had significant success for both Bobby &quot;Blue&quot; Bland and Gene Chandler earlier in the decade.   With Ron &quot;Pigpen&quot; McKernan at the throttle, the Dead barrel their way through the work, reproportioning and appointing it with fiery solos from Garcia and lead vocal raps courtesy of McKernan.   &quot;Death Don't Have No Mercy&quot; is a languid noir interpretation of Rev.   Gary Davis' distinct Piedmont blues.   Garcia's fretwork smolders as his solos sear through the melody.   Likewise notable is the criminally underrated keyboard work of Tom Constanten, whose airy counterpoint rises like a departing spirit from within the soul of the song.   The final pairing of &quot;Feedback&quot; -- which is what is sounds like it might be -- with the &quot;lowering down&quot; funeral dirge &quot;And We Bid You Goodnight&quot; is true to the way that the band concluded a majority of their performances circa 1968-1969.   They all join in on an a cappella derivative of Joseph Spence and the Pinder Family's traditional Bahamian distillation.   Few recordings have ever represented the essence of an artist in performance as faithfully as Live/Dead.   It has become an aural snapshot of this zenith in the Grateful Dead's 30-year evolution and as such is highly recommended for all manner of enthusiasts.   - by Lindsay Planer, AMG\n\nPersonnel:\nJerry Garcia (Guitar and Vocals) \nPhil Lesh (Bass Guitar and Vocals) \nBob Weir (Guitar and Vocals) \nMickey Hart (Percussion) \nTom Constanten (Keyboards) \nPigpen (Vocals, Congas and Organ) - 5 \n\nGrateful Dead - Live/Dead Tracks:\n01  Dark Star (Jerry Garcia/Mickey Hart/Bill Kreutzmann/Phil Lesh) 23:08 \n02  St .  Stephen (Jerry Garcia/Phil Lesh/Robert Hunter) 6:32 \n03  The Eleven (Phil Lesh/Robert Hunter) 9:22 \n04  Turn On Your Love Light (Joseph Scott/Deadric Malone) 15:08 \n05  Death Don't Have No Mercy (Gary Davis) 10:29 \n06  Feedback (Tom Constanten/Mickey Hart/Bill Kreutzmann/Phil Lesh) 7:50 \n07  And We Bid You Goodnight (Traditional) 0:35","torrent":{"xt":"urn:btih:c6c9a3288bc68b21f4acf61c40e120c84901bd85","amp;dn":"Grateful+Dead+-+Live%2FDead+%281969%29+%5BRock+Pop%5D%5Bmp3+320%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6c9a3288bc68b21f4acf61c40e120c84901bd85","infoHashBuffer":{"type":"Buffer","data":[198,201,163,40,139,198,139,33,244,172,246,28,64,225,32,200,73,1,189,133]},"announce":[],"urlList":[]}}