{"title":"Isaac Asimov's Science Fiction Magazine collection","uid":10402876,"size":24218626178,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c789253c0fede2e20a6919f912789f0fb5905b3c&amp;dn=Isaac+Asimov%27s+Science+Fiction+Magazine+collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":8,"uploader":"GugaLanik","files":-1,"time":1403392685,"description":"Asimov's Science Fiction is an American science fiction magazine which publishes science fiction and fantasy and perpetuates the name of author and biochemist Isaac Asimov. It is currently published by Penny Publications 10 times a year, with double issues in April/May and October/November.\n\nAsimov's Science Fiction began life as the digest-sized Isaac Asimov's Science Fiction Magazine (or IASFM for short) in 1977. Joel Davis of Davis Publications approached Asimov to lend his name to a new science fiction magazine, after the fashion of Ellery Queen's Mystery Magazine or Alfred Hitchcock's Mystery Magazine. Asimov refused to act as editor, but served instead as editorial director, writing editorials and replying to reader mail until his death in 1992. At Asimov's request Lt. Col. George Scithers (AUS Ret.), the first editor, negotiated an acquisitions contract with the Science Fiction Writers of America providing considerable better terms for writers than had been the periodical standard up to that time.\n\nInitially a quarterly, its first issue was dated Spring 1977. It changed to a bimonthly in 1978 and began publishing monthly in 1979. In the mid-1980s it was published once every four weeks, with an extra &quot;mid-December&quot; issue. Double issues were added in the early 1990s before the schedule was scaled back to the present 10 issues per year.\n\nThe magazine was sold to Bantam Doubleday Dell in January 1992, a few months before Asimov's death, and the title changed to Asimov's Science Fiction. In 1998, the magazine's size changed; it is now taller and slightly wider than the standard digest format (matching other magazines published by its newest corporate parent).\n\nMartin Gardner wrote a regular column of &quot;puzzle tales&quot; for the magazine from 1977 to 1986. He produced 111 columns in all, many later published in book form.\n\nScithers was an editor whose taste in science fiction was similar to Asimov's, favoring traditional stories with a strong hero in a future setting. His successors made the magazine more &quot;literary&quot;, until under Dozois it became the most influential magazine in the field since H. L. Gold's Galaxy Science Fiction. Many of the stories he published were set on Earth in the present day or near future, with ordinary people as protagonists.\n\nScithers left the magazine after five years, winning two Hugo awards as best editor, and was succeeded by Shawna McCarthy. McCarthy held the position for three years, winning one Hugo award. Gardner Dozois edited the magazine from 1985 to 2004, winning 15 Hugo awards, before stepping down and becoming its contributing editor. Sheila Williams is the current editor and won the Hugo Awards for Best Short Form Editor in 2011.\n\n\n\nAnd here's another collection for your enjoyment. More than 300 issues of this amazing, astounding, astonishing, startling, wonderful magazine. These stories are pure sense of wonder.\n\nI'm sure there are enough material here to spend the rest of our lives reading. Nevertheless, several issues are missing. If you got any of the missing issues and can scan them, please contact me at the email address inside the torrent. It would be much appreciated.\n\nSome of the writers presented here, in no particular order:\n\n- Isaac Asimov \n\n- Arthur C. Clarke\n\n- Carl Sagan\n\n- Larry Niven\n\n- George R. R. Martin\n\n- Orson Scott Card\n\n- Mike Resnick\n\n- Harlan Ellison\n\n- Connie Willis\n\n- Ursula K. Le Guin\n\n- Poul Anderson\n\n- Frederik Pohl\n\n- Barry B. Longyear (including his novella &quot;Enemy Mine&quot; which was later adapted into an awesome film)\n\n- Gene Wolfe\n\n- Gregory Benford\n\n- David Brin\n\n- Robert Silverberg\n\n- Charles Sheffield\n\n- Greg Bear\n\n- Norman Spinrad\n\n- Pat Cadigan\n\n- Tanith Lee\n\n- James Patrick Kelly\n\n- Octavia E. Butler\n\n- George Alec Effinger\n\n- Lucius Shepard\n\n- Ben Bova\n\n- Karen Joy Fowler\n\n- Alexander Jablokov\n\n- Bruce Sterling\n\n- Damon Knight\n\n- Roger Zelazny\n\n- Kim Stanley Robinson\n\n- Judith Moffett\n\n- Geoffrey A. Landis\n\n- Harry Harrison\n\n- Megan Lindholm\n\n- Lawrence Watt-Evans\n\n- Allen M. Steele\n\n- Terry Bisson\n\n- Brian W. Aldiss\n\n- R. Garcia y Robertson\n\nand many others.\n\n\nBonus:\n\n- Asimov's SF Adventure Magazine (Complete)\n\n- I. Asimov: A Memoir\n\n- Asimov's Guide to the Bible (PDF &amp; AudioBook)\n\n- Isaac Asimov Presents: The Best Science Fiction of the 19th Century\n\n- Foundation's Friends (Stories in Honor of Isaac Asimov)\n\n\nA big THANK YOU for all the people who scanned these gems. \n\nPlease keep sharing it for as long as you can. \n\nLeave a comment if you liked this torrent. \n\nDon't forget to visit asimovs dot com to get a subscription, if you enjoyed the magazine.\t\n\n","torrent":{"xt":"urn:btih:c789253c0fede2e20a6919f912789f0fb5905b3c","amp;dn":"Isaac+Asimov%27s+Science+Fiction+Magazine+collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c789253c0fede2e20a6919f912789f0fb5905b3c","infoHashBuffer":{"type":"Buffer","data":[199,137,37,60,15,237,226,226,10,105,25,249,18,120,159,15,181,144,91,60]},"announce":[],"urlList":[]}}