{"title":"The The - Infected 1986 Hardcore &amp; Punk New Wave","uid":9410304,"size":83604439,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c7dc8f9f30f9c9722ea49fae2d6e867677d8bb34&amp;dn=The+The+-+Infected+1986+Hardcore+%26amp%3B+Punk+New+Wave&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1388271200,"description":"Source: 1986 CD\n\nHighly sought after CD for collectors so if you find one in shrink wrap do not open it!\n\nReview by Angry Mofo:\n\nThis one-man band is sadly underrated and virtually unknown, possibly because Matt Johnson is too literate for the layman to stomach, or possibly just because he tends to take 5-year-long vacations once in a while. No matter. Infected was his first platinum disc, and rightly so. It's a commentary on the state of the world today - mainly Britain, since he lived there, but really it could apply to any &quot;civilized&quot; modern country. Not every song is explicitly about politics, but every one has the same mood and theme - that things have reached the point where they can't go on the same way any longer and something must be done. Every song burns with desperation as Johnson tries to find a way out but can't.\nOne thing I like about Johnson is that he's almost never arty - you know how a lot of the time bands are so self-conscious that they basically beat you over the head and scream &quot;We're arty!&quot; at you? Well, he never does that, but he still always remains very poetic. Even from the song titles you can see this - &quot;Slow Train to Dawn&quot;, for instance. Johnson pegs the problems of the world so accurately it makes me wish I had thought of it, and sometimes even predicts further developments - &quot;Sweet Bird of Truth&quot;, a song about a soldier on a doomed flight to fight in Africa, features the line &quot;Am I to cry like a baby/Die like a man/When all the planet's little wars start joinin' hands?&quot; Guess what events happened just a bit down the road in the Middle East?\n\nWhen he's not singing about politics, he's singing about man's quest to find himself.\nThe very dark, despairing lyrics are masked by airy (and really catchy) dance-pop, which may be seen as a drawback by some, but for others may serve to make the songs all the more memorable. If you liked Infected, I recommend Mind Bomb, The The's next album - if you liked that, I definitely recommend Infected. They're completely different works but at the same time they're remarkably similar, and many songs in Mind Bomb are almost sequels to songs from Infected (if you want to see how the relationship in &quot;Slow Train to Dawn&quot; ended, just listen to &quot;Kingdom of Rain&quot;, another duet with another pop singer).","torrent":{"xt":"urn:btih:c7dc8f9f30f9c9722ea49fae2d6e867677d8bb34","amp;dn":"The+The+-+Infected+1986+Hardcore+%26amp%3B+Punk+New+Wave","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7dc8f9f30f9c9722ea49fae2d6e867677d8bb34","infoHashBuffer":{"type":"Buffer","data":[199,220,143,159,48,249,201,114,46,164,159,174,45,110,134,118,119,216,187,52]},"announce":[],"urlList":[]}}