{"title":"The Executive Guide to Healthcare Kaizen- Graban [PDF] [StormRG]","uid":11511800,"size":18192676,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c833ba60e59d33da141ef2c28c1e3651d6cea03f&amp;dn=The+Executive+Guide+to+Healthcare+Kaizen-+Graban+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":2,"time":1416408206,"description":"TITLE/EDITION The Executive Guide to Healthcare Kaizen: Leadership for a Continuously Learning and Improving Organization\nAuthor: Mark Graban (Author), Joseph E. Swartz (Author)\nPaperback: 200 pages\nPublisher: Productivity Press; 1 edition (August 21, 2013)\nLanguage: English\nISBN-10: 1466586419\nISBN-13: 978-1466586413\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nHospitals and health systems are facing many challenges, including shrinking reimbursements and the need to improve patient safety and quality. A growing number of healthcare organizations are turning to the Lean management system as an alternative to traditional cost cutting and layoffs. &quot;Kaizen,&quot; which is translated from Japanese as &quot;good change&quot; or &quot;change for the better,&quot; is a core pillar of the Lean strategy for today's best healthcare organizations.\n\nKaizen is a powerful approach for creating a continuously learning and continuously improving organizations. A Kaizen culture leads to everyday actions that improve patient care and create better workplaces, while improving the organization's long-term bottom line. The Executive Guide to Healthcare Kaizen is the perfect introduction to executives and leaders who want to create and support this culture of continuous improvement.\n\nThe Executive Guide to Healthcare Kaizen is an introduction to kaizen principles and an overview of the leadership behaviors and mindsets required to create a kaizen culture or a culture of continuous improvement. The book is specifically written for busy C-level executives, vice presidents, directors, and managers who need to understand the power of this methodology. \n\nThe Executive Guide to Healthcare Kaizen shares real and practical examples and stories from leading healthcare organizations, including Franciscan St. Francis Health System, located in Indiana. Franciscan St. Francis' employees and physicians have implemented and documented 4,000 Kaizen improvements each of the last three years, resulting in millions of dollars in hard savings and softer benefits for patients and staff. \n\nChapters cover topics such as the need for Kaizen, different types of Kaizen (including Rapid Improvement Events and daily Kaizen), creating a Kaizen culture, practical methods for facilitating Kaizen improvements, the role of senior leaders and other leaders in Kaizen, and creating an organization-wide Kaizen program.\n\nThe book contains a new introduction by Gary Kaplan, MD, CEO of Virginia Mason Medical Center in Seattle, Washington, which was named &quot;Hospital of the Decade&quot; in 2012.\n\nThe Executive Guide to Healthcare Kaizen is a companion book to the larger book Healthcare Kaizen: Engaging Front-Line Staff in Sustainable Continuous Improvements (published in 2012). Healthcare Kaizen is a longer, more complete &quot;how to&quot; guide that includes over 200 full color images, including over 100 real kaizen examples from various health systems around the world. Healthcare Kaizen was named a recipient of the prestigious Shingo Professional Publication and Research Award","torrent":{"xt":"urn:btih:c833ba60e59d33da141ef2c28c1e3651d6cea03f","amp;dn":"The+Executive+Guide+to+Healthcare+Kaizen-+Graban+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c833ba60e59d33da141ef2c28c1e3651d6cea03f","infoHashBuffer":{"type":"Buffer","data":[200,51,186,96,229,157,51,218,20,30,242,194,140,30,54,81,214,206,160,63]},"announce":[],"urlList":[]}}