{"title":"Woodwork: A Step-by-Step Photographic Guide {BBS}","uid":7645362,"size":75440846,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8c597af8d9c4b92060bf46902598fbd118cd603&amp;dn=Woodwork%3A+A+Step-by-Step+Photographic+Guide+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1347892627,"description":"In the machine age there is a particular pleasure in working with wood, which Woodwork celebrates, both in the easy-to-follow instructions for mastering the core skills and in the projects at the end of the book that demonstrate them.\n\n\nThe first chapter details the properties of the most commonly used hardwood and softwood lumber, so that woodworkers can make an informed decision about matching the qualities of a wood to its intended purpose. This is then followed by a chapter on all the important tools a woodworker is likely to need both hand and machine and on how to look after them to ensure the longest and most efficient working life. The third chapter discusses the optimum layout for a workshop so that key considerations of accessibility and safety are taken into account.\n\n\nThe next four chapters demonstrate, with detailed step-by-step instructions, the essential woodworking skills, from working by hand to using power tools and fixed machinery, as well as further skills that will be useful to the more ambitious woodworker, such as veneering, carving, and woodturning.\n\n\nThese techniques are then put straight into practice in the final chapter, which contains 30 attractive projects ranging from a simple footstool to a complex desk. These are cross-referenced to the technical skills in the practical section, and include detailed plans and cutting lists so that the projects are easy to follow.\n\n\n# Hardcover: 400 pages\n# Publisher: DK Publishing (April 19, 2010)\n# Language: English\n# ISBN-10: 0756643066\n# ISBN-13: 978-0756643065","torrent":{"xt":"urn:btih:c8c597af8d9c4b92060bf46902598fbd118cd603","amp;dn":"Woodwork%3A+A+Step-by-Step+Photographic+Guide+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8c597af8d9c4b92060bf46902598fbd118cd603","infoHashBuffer":{"type":"Buffer","data":[200,197,151,175,141,156,75,146,6,11,244,105,2,89,143,189,17,140,214,3]},"announce":[],"urlList":[]}}