{"title":"The Forever War 1-3 (1988-1991) (Complete) [Dark Horse] (Yaz-CCA","uid":8693643,"size":39700570,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c8d61b35c710943d545f6480c3412fe31d4c8bbb&amp;dn=The+Forever+War+1-3+%281988-1991%29+%28Complete%29+%5BDark+Horse%5D+%28Yaz-CCA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"blackcanary","files":-1,"time":1373924348,"description":"English | CBZ and CBR | 3 Issues\n\nThe Forever War: Book 1-3\nPublisher:  Dark Horse Comics\nPublication Date:  1988 - October 1991\n\nStory:\tJoe Haldeman\nArtwork:  Marvano\nLetterer:  L. Lois Buhalis\n\nThe Forever War is a 1988 Belgian science fiction graphic novel trilogy drawn by Marvano and closely based on the 1974 award-winning The Forever War novel by American author Joe Haldeman, who has noted that he &quot;supplied all of the dialogue and scripted [the comic] like a movie&quot;.  The novel won the Nebula Award in 1975, the Hugo Award in 1976, and the Locus Award in 1976.\n\nDrawn in the ligne claire style and originally published in Dutch as De Eeuwige Oorlog, it tells the story of William Mandella, an elite soldier fighting for Earth in a centuries-long interstellar war against the 'Taurans'. The series focuses mainly on the dehumanising effects of war and its attendant bureaucracy.\n\nStaying very faithful to the novel in describing the life of the soldiers and their involvement in various military actions, the graphic novel touches upon themes such as the inhumanity of war (both during combat and in the administration of it) and the change of a society faced with centuries of war footing against an almost totally unseen enemy. Most importantly, it portrays personal experiences of a soldier who, due to pure luck and the Einsteinian time dilation of interstellar travel, fights in and survives the whole length of the war, to end up in a world he does not recognize anymore.\n\nLike the novel, the series is based heavily on Haldeman's experiences in, and thoughts about, the Vietnam War, which are mirrored in the conduct of the military actions and propaganda operations of Earth's military government, especially in its treatment of enemies and the casualties/veterans on its own side. Like its protagonists, the series shows more resignation than outright cynicism at what are depicted as very human failings unchanged throughout history. Haldemann has noted that Marvano managed to include much more of the novel's &quot;first-person ruminations&quot; by Mandella in the graphic novel than the author had originally thought practical.\n\nThe three volumes of the series span the whole of almost one millennium of war between humanity and the Taurans, an extraterrestrial species that stays enigmatic throughout the series. Due to time dilation, the two main characters experience the whole of the war, biologically appearing to be in their early thirties at the end of the hostilities.\n\nThe English version of The Forever War: Books 1-3 were originally published in Dark Horse's Cheval Noir #8-11 (June - September 1990), #14-18 (January - May 1991), and #19-23 (June - October 1991).  NBM also published Books 1-3 in English from 1990 - 1994.\n\nThanks goes to Yaz for this release.\n\nDon't know how to view this comic book?  Use CDisplayEx or another comic book reader application. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8689374&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8689374&lt;/a&gt;","torrent":{"xt":"urn:btih:c8d61b35c710943d545f6480c3412fe31d4c8bbb","amp;dn":"The+Forever+War+1-3+%281988-1991%29+%28Complete%29+%5BDark+Horse%5D+%28Yaz-CCA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8d61b35c710943d545f6480c3412fe31d4c8bbb","infoHashBuffer":{"type":"Buffer","data":[200,214,27,53,199,16,148,61,84,95,100,128,195,65,47,227,29,76,139,187]},"announce":[],"urlList":[]}}