{"title":"THE SILENCE OF THE LAMBS - Thomas Harris Frank Muller {FerraBit}","uid":4726100,"size":290714804,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c90ae6174e4ea7e0b4e33b532214910afe8c72fd&amp;dn=THE+SILENCE+OF+THE+LAMBS+-+Thomas+Harris+Frank+Muller+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"FerraBit","files":-1,"time":1234762562,"description":"THE SILENCE OF THE LAMBS by Thomas Harris (1988)\n\nRead by .. : Frank Muller\nPublisher. : Recorded Books (1993)\nISBN . .. .: ISBN-10: 1402534965\nFormat .  .: MP3. 171 tracks, 275 MB\nBitrate .  : ~64kbps (iTunes 8, VBR, mono, 24 kHz)\nSource . . : 9 CDs.\nUnabridged : Unabridged \n\n\nAwesome book. Incredible reading. Epic.\n\nOriginal CD-file format kept - tracks ~3 minutes.\n\nFile note: Disc 8_Track 9 was skipped/not included - it was a blank track on the CD, 4 seconds long, apparently a production error (the only one I've seen from Recorded Books).  No narration missed.\n\nCheers, FerraBit\nFenruary 2009\n\nLinks: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Silence_of_the_Lambs_(novel)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Silence_of_the_Lambs_(novel)&lt;/a&gt; &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Frank_Muller&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Frank_Muller&lt;/a&gt; \n\nOriginally posted: TPB, Demonoid, Mininova (Please do not repost)\nPlease present your library card, and comment me some loving.\n____________________\n\n   The Silence of the Lambs, by Thomas Harris, is even better than the successful movie. Like his earlier Red Dragon, the book takes us inside the world of professional criminal investigation. All the elements of a well-executed thriller are working here--driving suspense, compelling characters, inside information, publicity-hungry bureaucrats thwarting the search, and the clock ticking relentlessly down toward the death of another young woman. What enriches this well-told tale is the opportunity to live inside the minds of both the crime fighters and the criminals as each struggles in a prison of pain and seeks, sometimes violently, relief.\n\n  Clarice Starling, a precociously self-disciplined FBI trainee, is dispatched by her boss, Section Chief Jack Crawford, the FBI's most successful tracker of serial killers, to see whether she can learn anything useful from Dr. Hannibal Lecter. Lecter's a gifted psychopath whose nickname is &quot;The Cannibal&quot; because he likes to eat parts of his victims. Isolated by his crimes from all physical contact with the human race, he plays an enigmatic game of &quot;Clue&quot; with Starling, providing her with snippets of data that, if she is smart enough, will lead her to the criminal. Undaunted, she goes where the data takes her. As the tension mounts and the bureaucracy thwarts Starling at every turn, Crawford tells her, &quot;Keep the information and freeze the feelings.&quot; Insulted, betrayed, and humiliated, Starling struggles to focus. If she can understand Lecter's final, ambiguous scrawl, she can find the killer. But can she figure it out in time?\n","torrent":{"xt":"urn:btih:c90ae6174e4ea7e0b4e33b532214910afe8c72fd","amp;dn":"THE+SILENCE+OF+THE+LAMBS+-+Thomas+Harris+Frank+Muller+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c90ae6174e4ea7e0b4e33b532214910afe8c72fd","infoHashBuffer":{"type":"Buffer","data":[201,10,230,23,78,78,167,224,180,227,59,83,34,20,145,10,254,140,114,253]},"announce":[],"urlList":[]}}