{"title":"AGI - Long Range Shooting Techniques","uid":4827456,"size":720990193,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c9280a96d5a2cf976a0e387dafe5bfbf8c22cf71&amp;dn=AGI+-+Long+Range+Shooting+Techniques&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"aikijohn","files":-1,"time":1239004535,"description":"Long range shooting expert Darrell Holland takes you through a course of instruction guaranteed to improve your long range shooting skills. The initial discussion focuses on the rifle, ballistics, cartridges, and bullets. Judging range and equipment calibration are covered, along with a selection of optics and range finders. Shooting techniques are covered from the point of both a hunter and a tactical shooter. Darrell shows tips for bench and field shooting positions, and demonstrates them along with expedient methods and accessories for optimum accuracy. You'll see some incredible shooting at ranges out to 600 yards and learn how to make those shots. On a rainy day recently, I used the methods taught by Darrell in this course to score head shots three for three at 360 yards and three for three body shots on metal silhouettes at 600 yards. All in light rain with changing wind conditions. Exclusively for AGI customers we have developed and are including a set of invaluable tables for calculating your long-range shots. ","torrent":{"xt":"urn:btih:c9280a96d5a2cf976a0e387dafe5bfbf8c22cf71","amp;dn":"AGI+-+Long+Range+Shooting+Techniques","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9280a96d5a2cf976a0e387dafe5bfbf8c22cf71","infoHashBuffer":{"type":"Buffer","data":[201,40,10,150,213,162,207,151,106,14,56,125,175,229,191,191,140,34,207,113]},"announce":[],"urlList":[]}}