{"title":"Screenwriting for Dummies, 2nd Edition (7Summits)","uid":5529719,"size":3257906,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c98923468101b3337c45e9bc3c001e93f6d39dbf&amp;dn=Screenwriting+for+Dummies%2C+2nd+Edition+%287Summits%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"7_summits","files":-1,"time":1272894100,"description":"For Dummies, 2008 | ISBN: 978-0-470-34540-5 | 364pages | PDF | 3.1MB\n\n\nWrite a great script and get it into the hands of the Hollywood players!\n\nSo you want to be a screenwriter? Whether you want to write a feature film or a TV script or adapt your favorite book, this friendly guide gives you expert advice in everything from creating your story and developing memorable characters to formatting your script and selling it to the studios. You get savvy industry tips and strategies for getting your screenplay noticed!\n\n   * The screenwriting process from A to Z -- from developing a concept and thinking visually to plotline, conflicts, pacing, and the conclusion\n   * Craft living, breathing characters -- from creating the backstory to letting your characters speak to balancing dialogue with action\n   * Turn your story into a script -- from developing an outline and getting over writer's block to formatting your screenplay and handling rewrites\n   * Prepare for Hollywood -- from understanding the players and setting your expectations to polishing your copy and protecting your work\n   * Sell your script to the industry -- from preparing your pitch and finding an agent to meeting with executives and making a deal\n\nOpen the book and find:\n\n   * The latest on the biz, from entertainment blogs to top agents to box office jargon\n   * New story examples from recently released films\n   * Tips on character development, a story's time clock, dramatic structure, and dialogue\n   * New details on developing the nontraditional screenplay -- from musicals to animation to high dramatic style\n   * Expanded information on adaptation and collaboration, with examples from successful screenwriting duos","torrent":{"xt":"urn:btih:c98923468101b3337c45e9bc3c001e93f6d39dbf","amp;dn":"Screenwriting+for+Dummies%2C+2nd+Edition+%287Summits%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c98923468101b3337c45e9bc3c001e93f6d39dbf","infoHashBuffer":{"type":"Buffer","data":[201,137,35,70,129,1,179,51,124,69,233,188,60,0,30,147,246,211,157,191]},"announce":[],"urlList":[]}}