{"title":"Joan Osborne - Studio Discography 1995 - 2008 (320kbps)","uid":6843719,"size":868165532,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c9d37c75e1ad5426f61d1f9f5526d64c1eab3537&amp;dn=Joan+Osborne+-+Studio+Discography+1995+-+2008+%28320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"piratetorrent1989","files":85,"time":1322287489,"description":"Joan Elizabeth Osborne (born July 8, 1962) is an American singer-songwriter. She is best known for her song &quot;One of Us&quot;. She has toured with Motown sidemen the Funk Brothers and was featured in the documentary film about them, Standing in the Shadows of Motown.\n\nOriginally from Anchorage, Kentucky, a suburb of Louisville, Osborne moved to New York City in the late 1980s, where she formed her own record label, Womanly Hips, to release a few independent recordings. She signed with Mercury Records, and released her first full length album, Soul Show: Live at Delta 88, in 1991. Her second (and first major label) album was Relish (1995), which became a hit on the strength of the single &quot;One of Us&quot;. Apart from this song, the rest of the album was steeped in country, blues and folk music. &quot;Right Hand Man&quot; and &quot;St. Teresa&quot; became minor hits following the success of &quot;One of Us&quot;.\nIn 2001, Osborne appeared on Austin City Limits, singing material mainly from Righteous Love. In a brief interview segment at the end of the episode, Osborne reflects on her gladness to have gotten out of the limelight of her mid-90's stardom.\nShe was featured in the 2002 documentary film, Standing in the Shadows of Motown, and toured with Motown sidemen the Funk Brothers. She and her band accompanied the Dixie Chicks for a national tour in the summer of 2003, during which time she also joined veteran San Francisco jam-rockers The Dead as a vocalist, and released her fourth album, titled How Sweet It Is, a collection of classic rock and soul covers.\nDuring 2005 and 2006, Osborne performed on numerous occasions with Phil Lesh and Friends. In February 2007, she appeared on the Grand Ole Opry.\nIn May 2007, she issued Breakfast in Bed, a return to the soul music that she had covered on How Sweet It Is. Breakfast in Bed also featured the two songs (&quot;Heatwave&quot; and &quot;What Becomes of the Brokenhearted&quot;) that she had covered for the film Standing in the Shadows of Motown.\nShe sang lead vocals on the cover of &quot;Spoonful&quot; on Vivian Campbell's solo album Two Sides Of If. She also provided some vocals for &quot;Wayfaring Stranger&quot; on Spearhead's 1997 album Chocolate Supa Highway. She covered Dolly Parton's &quot;Do I Ever Cross Your Mind&quot; on the 2003 tribute album Just Because I'm a Woman: Songs of Dolly Parton. She is featured on the Holmes Brothers 2007 collection State of Grace performing &quot;Those Memories of You&quot;, an old Allan O'Bryant and Bill Monroe bluegrass tune.\nOsborne's latest album, Little Wild One, was released in September 2008. Osborne performs as a guest vocalist on Sgt. Pepper Live, the 2009 album and DVD by Cheap Trick.\nRecently her song &quot;One of Us&quot; was performed by the cast of Glee in the episode &quot;Grilled Cheesus&quot;.\nShe performed with The Waybacks at Merlefest, 2011, during the Hillside Album hour, featuring The Allman Brothers' Eat a Peach.\nOsborne is currently a member of Trigger Hippy, along with Steve Gorman, Audley Freed, Jackie Greene, and Nick Govrik.\n\nAlbums:\n\nRelish\nRighteous Love\nHow Sweet It Is\nChristmas Means Love\nPretty Little Stranger\nBreakfast In Bed\nLittle Wild One","torrent":{"xt":"urn:btih:c9d37c75e1ad5426f61d1f9f5526d64c1eab3537","amp;dn":"Joan+Osborne+-+Studio+Discography+1995+-+2008+%28320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9d37c75e1ad5426f61d1f9f5526d64c1eab3537","infoHashBuffer":{"type":"Buffer","data":[201,211,124,117,225,173,84,38,246,29,31,159,85,38,214,76,30,171,53,55]},"announce":[],"urlList":[]}}