{"title":"Principles of Digital Image Processing: Fundamental Techniques","uid":6532160,"size":4840104,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca13e3ae49bca77c4dc83dfd0646a9ed6b25e1a4&amp;dn=Principles+of+Digital+Image+Processing%3A+Fundamental+Techniques&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"_F1_","files":-1,"time":1310385443,"description":"Wilhelm Burger, Mark James Burge, &quot;Principles of Digital Image Processing: Fundamental Techniques&quot; \n Sp,..er | 2009 | ISBN: 1848001908 | 259 pages | PDF | 4.62 MB \n\n This easy-to-follow textbook provides a modern, algorithmic introduction to digital image processing\n , designed to be used both by learners desiring a firm foundation on which to build, and practitioners in search of critical analysis and modern implementations of the most important techniques.\n\n It compiles the key elements of digital image processing, starting from the basic concepts and elementary properties of digital images through simple statistics and point operations, fundamental filtering techniques, localization of edges and contours, and basic operations on color images. This reader-friendly text concentrates on practical applications\n and working implementations, and presents the important formal details and mathematics necessary for a deeper understanding of the algorithms. Implementations are all based on Java and ImageJ.\n\n This concise yet comprehensive, reader-friendly text is ideal for undergraduates studying foundation courses as well as ideal for self-study.","torrent":{"xt":"urn:btih:ca13e3ae49bca77c4dc83dfd0646a9ed6b25e1a4","amp;dn":"Principles+of+Digital+Image+Processing%3A+Fundamental+Techniques","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca13e3ae49bca77c4dc83dfd0646a9ed6b25e1a4","infoHashBuffer":{"type":"Buffer","data":[202,19,227,174,73,188,167,124,77,200,61,253,6,70,169,237,107,37,225,164]},"announce":[],"urlList":[]}}