{"title":"Beginning Java 8 APIs, Extensions and Libraries - 2014","uid":11277702,"size":9656609,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca92d3d68e87f657c2436b5d5c2cae22f5ec9447&amp;dn=Beginning+Java+8+APIs%2C+Extensions+and+Libraries+-+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"diypromo","files":-1,"time":1414174032,"description":"Beginning Java 8 APIs, Extensions and Libraries\n==================================================\n\nYear: 2014\nAuthor: Kishori Sharan\nSeries: The Expert's Voice in Java\nPublisher: Apress\nISBN: 978-1-4302-6662-4\n\nDescription\n============\n\tBeginning Java 8 APIs, Extensions and Libraries completes the Apress learning Java journey and is a comprehensive approach to learning the Java programming language extensions and available APIs and libraries, including the new JavaFX APIs.\n\tThis book covers the key extensions of the Java programming language such as Swing, JavaFX, network programming, and JDBC. Each topic starts with a discussion of the topic's background. A step-by-step process, with small snippets of Java code, provides easy-to-follow instructions. At the end of a topic, a complete and ready-to-run Java program is provided. This book contains over 130 images and diagrams to help you visualize and better understand the topics. More than 130 complete programs allow you to practice and quickly learn the topics.\n\tThe Swing chapters discuss various aspects of working with a GUI, from the very basic concepts of developing a Swing application, to the most advanced topics, such as decorating a Swing component with a JLayer, drag-and-drop features, Synth Skinnable L&amp;F, etc.\n\tThe chapter on network programming covers the basics of network technologies first, and then, the advanced topics of network programming, using a Java class library. It covers IPv4 and IPv6, addressing schemes, subnetting, supernetting, multicasting, TCP/IP sockets, UPD sockets, asynchronous socket I/O, etc.\n\tThe chapter on JDBC provides the details of connecting and working with databases such as Oracle, SQL Server, MySQL, DB2, Java DB (Apache Derby), Sybase, Adaptive Server Anywhere, etc. It contains a complete discussion on processing a ResultSet and a RowSet. It discusses how to use the RowSetFactory, to obtain a RowSet object of a specific type. Working with Large Objects (LOBs), such as Blob, Clob, and NClob, is covered in detail with Java code examples and database scripts","torrent":{"xt":"urn:btih:ca92d3d68e87f657c2436b5d5c2cae22f5ec9447","amp;dn":"Beginning+Java+8+APIs%2C+Extensions+and+Libraries+-+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca92d3d68e87f657c2436b5d5c2cae22f5ec9447","infoHashBuffer":{"type":"Buffer","data":[202,146,211,214,142,135,246,87,194,67,107,93,92,44,174,34,245,236,148,71]},"announce":[],"urlList":[]}}