{"title":"Doctor Who - Season 08 - (1970) - 25 Episodes","uid":9082916,"size":2097668427,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cac04705cdb8b285420c7d9159b55bef95361c74&amp;dn=Doctor+Who+-+Season+08+-+%281970%29+-+25+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bnaron","files":25,"time":1382410632,"description":"The eighth season of British science fiction television series Doctor Who began on 2 January 1971 with Terror of the Autons and ended with The Daemons featuring Jon Pertwee as the Third Doctor. Roger Delgado makes his first appearance as The Master in Terror of the Autons and continues to make appearances in each of the five serials. Nicholas Courtney and John Levene continue their roles of Brigadier Lethbridge-Stewart and Sergeant Benton, while Richard Franklin makes his first appearance as Captain Mike Yates.\n\nThe season marks the first appearance of the Master who goes on to make further appearances through the season in every serial as the main antagonist who is finally captured at the end of the season. Colony in Space was the first serial set away from Earth since The War Games at the end of Season 6, and came about as a result of producer Barry Letts' feeling that the Earthbound stories of the Doctor's exile were too limiting in terms of potential plotting.\n\n1.  Terror of the Autons - Four Episodes\n\n    Synopsis: The Master arrives on Earth and makes an alliance with\n    the Autons to conquer the planet.\n\n2.  The Mind of Evil - Six Episodes\n\n    Synopsis: The Master creates the Keller Machine, a device that\n    appears to rehabilitate prisoners, but instead kills them.\n\n3.  The Claws of Axos - Four Episodes\n\n    Synopsis: The Axons land on Earth supposedly peacefully, even\n    offering a new energy source. However, that is not their real\n    purpose. \n\n4.  Colony in Space - Six Episodes\n\n    Synopsis: On his first trip to another planet since his\n    regeneration, the Doctor and Jo travel to Uxaerius, where they\n    find that its colonists are struggling to survive.\n\n5.  The Daemons - Five Episodes\n\n    Synopsis: The Master summons Azal to assist him in an incident\n    that happened at an archaeological dig at Devil's End.\n\n","torrent":{"xt":"urn:btih:cac04705cdb8b285420c7d9159b55bef95361c74","amp;dn":"Doctor+Who+-+Season+08+-+%281970%29+-+25+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cac04705cdb8b285420c7d9159b55bef95361c74","infoHashBuffer":{"type":"Buffer","data":[202,192,71,5,205,184,178,133,66,12,125,145,89,181,91,239,149,54,28,116]},"announce":[],"urlList":[]}}