{"title":"Thug: The True Story of India's Murderous Cult - Mike Dash","uid":11021458,"size":3077323,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb1de53f77bbc9e5771529f9789a9f3064d56c9f&amp;dn=Thug%3A+The+True+Story+of+India%27s+Murderous+Cult+-+Mike+Dash&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1410587092,"description":"Never in recorded history has there been a group of murderers as deadly as the Thugs. For nearly two centuries, groups of these lethal criminals haunted the roads of India, slaughtering travellers whom they met along the way with such efficiency that over the years tens of thousands of men, women and children simply vanished without trace. Mike Dash, one of our best popular historians, has devoted years to combing archives in both India and Britain to discover how the Thugs lived and worked. Painstakingly researched and grippingly written. Thug tells, for the first time the full story of the Thugs' rise and fall from its beginnings in the late seventeenth century to its eventual demise at the hands of British officer William Sleeman, in 1840.\n\nReview\n&quot;* 'Dash brings a confident organisation to his material, a rapid grasp of both personality and circumstance, and a bold eye for significant detail' The Telegraph * 'Fascinating and immensely readable' TLS * 'The thrillerish pace is kept up throughout, the storming narrative grounded in historical and political detail... a gripping read' Geographical magazine * 'Excellently written and well researched book...Thug is an invaluable guide' The Times * 'Dash picks his way through this tale with a steady and determined manner...Thug is a reliable and meticulous piece of work' Guardian * 'The book is a mix of many genres: social history, detective novel, crime thriller, political narrative...an entertaining read' Indian Express&quot; \n\nAbout the Author\nMike Dash is a Cambridge educated historian. He has worked as a magazine publisher, and is the author of four previous books including the bestsellers Tulipomania and Batavia's Graveyard. He lives in London.","torrent":{"xt":"urn:btih:cb1de53f77bbc9e5771529f9789a9f3064d56c9f","amp;dn":"Thug%3A+The+True+Story+of+India%27s+Murderous+Cult+-+Mike+Dash","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb1de53f77bbc9e5771529f9789a9f3064d56c9f","infoHashBuffer":{"type":"Buffer","data":[203,29,229,63,119,187,201,229,119,21,41,249,120,154,159,48,100,213,108,159]},"announce":[],"urlList":[]}}