{"title":"JSA v1 (001 - 087) (1999 - 2006) (Novus(Digital) + DCP(Scans))","uid":10614567,"size":3060405148,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:cb66d00a45e8a67be1e248de63ad36796c2789ea&amp;dn=JSA+v1+%28001+-+087%29+%281999+-+2006%29+%28Novus%28Digital%29+%2B+DCP%28Scans%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"nemesis43","files":88,"time":1406084493,"description":"JSA v1 (001 - 087) (1999 - 2006) (Novus + DCP)\n\n\nWriters James Robinson and David Goyer, along with penciller Stephen Sadowski, gave readers an update on the founding fathers of the super-team with this JSA series - the first to feature a roster hailing from various generations. Besides founding Golden Age heroes Green Lantern (Alan Scott), Wildcat (Ted Grant), and the Flash (Jay Garrick), the team also featured a host of newcomers and second generation heroes. Black Canary (Dinah Lance) joined the group, straight from the silver age, as did the grown up Golden Age hero Sand, and former Infinity Inc. member Atom Smasher (formerly Nuklon). Starman joined the fledgling team as well, along with other newcomers Hourman (from the pages of JLA), Hawkgirl, and teh new Star-Spangled Kid. It was an impressive line up that would shift and change over the course of the title's successful 87 issue run, as members of the team passed the torch to other new members. Perhaps more importantly, the title's original writers would also pass the torch to a new writer.\n\nAfter an initial arc that involved a battle against a younger version of the Legion of Super Heroes villain Mordru, and a stand alone Sand story, James Robinson left the title in the capable hands of Goyer's new writing partner, Geoff Johns. Soon to be a DC phenomenon, Johns' knowledge of super hero continuity and characterization propelled the comic for nearly the rest of its tenure and later guided the super hero team into a successful relaunch. Over the course of the title's run, the JSA battled many villains, including the likes of the Ultra-Humanite, Eclipso, Extant and the Gentleman Ghost. The series saw new members Hawkman, Captain Marvel, Jakeem Thunder, the second Mister Terrific and Hourman, a new Doctor Fate, and even the supposedly reformed villain Black Adam. THe title debuted a new and deadly Crimson Avenger and delved into the nine lives of team member Wildcat.","torrent":{"xt":"urn:btih:cb66d00a45e8a67be1e248de63ad36796c2789ea","amp;dn":"JSA+v1+%28001+-+087%29+%281999+-+2006%29+%28Novus%28Digital%29+%2B+DCP%28Scans%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb66d00a45e8a67be1e248de63ad36796c2789ea","infoHashBuffer":{"type":"Buffer","data":[203,102,208,10,69,232,166,123,225,226,72,222,99,173,54,121,108,39,137,234]},"announce":[],"urlList":[]}}