{"title":"The Kick-Ass Writer by Chuck Wendig","uid":9621861,"size":900874,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc162d2728436c55b6ff9df89920b40441255a50&amp;dn=The+Kick-Ass+Writer+by+Chuck+Wendig&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"PirateBook","files":3,"time":1392511524,"description":"\nThe journey to become a successful writer is long, fraught with peril, and filled with difficult questions: How do I write dialogue? How do I build suspense? What should I know about query letters? How do I start?\n\nThe best way to answer these questions is to ditch your uncertainty and transform yourself into a KICK-ASS writer. This new book from award-winning author Chuck Wendig combines the best of his eye-opening writing instruction previously available in e-book form only with all-new insights into writing and publishing. It's an explosive broadside of gritty advice that will destroy your fears, clear the path, and help you find your voice, your story, and your audience.\n\nYou'll explore the fundamentals of writing, learn how to obtain publication, and master the skills you need to build an army of dedicated fans. No task is too large or small for the kick-ass writer. With his trademark acerbic wit and gut-punch humor, Wendig will explain:\n\nHow to build suspense, craft characters, and defeat writer's block.\nHow to write a scene, an ending even a sentence.\nBlogging techniques, social media skills, and crowdfunding.\nHow to write a query letter, talk to agents, and deal with failure and success!\nWhether you're just starting out or you need one more push to get you over the top, two things are for certain a kick-ass writer never quits, and chuck Wendig won't let you down in this high-octane guide to becoming the writer you were born to be.\n\nGenre: Non Fiction | Educational | Self Help","torrent":{"xt":"urn:btih:cc162d2728436c55b6ff9df89920b40441255a50","amp;dn":"The+Kick-Ass+Writer+by+Chuck+Wendig","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc162d2728436c55b6ff9df89920b40441255a50","infoHashBuffer":{"type":"Buffer","data":[204,22,45,39,40,67,108,85,182,255,157,248,153,32,180,4,65,37,90,80]},"announce":[],"urlList":[]}}