{"title":"4x4.Evolution.2-FRACTO","uid":4362536,"size":362092427,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cc53db9e38436f8ac175afb0c73cc95cc3336775&amp;dn=4x4.Evolution.2-FRACTO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"FRACTO","files":-1,"time":1219736307,"description":"4x4 Evo2 -FRACTO\n\n*********************************************************************\nRELEASE INFO\n\nDeveloper:    Terminal Reality\nRetail Date:  September 21, 2001\nGenre:        Racing\n\nThe game is fully patched and I bundled the editor as well (4x4Editor.exe)\nMultiplayer works too, of course.\n\n*********************************************************************\nGENERAL GAME DESCRIPTION\n\n4x4 Evo2 is an off-road racing game. 4x4 Evo2 allows you to take your favorite SUV or truck and race it in realistic looking off-road locations. To accurately capture the feel of off-road racing we designed the game so that there are no artificial walls to keep you on the track. In 4x4 Evo2 the tracks are completely open and you can drive anywhere that your truck will take you. There are no walls to confine you, so this is a race from checkpoint to checkpoint. If you can find a better route than the racetrack itself - take it. In order to find out where the next checkpoint is follow the green arrow at the top of your screen (F key by default toggles it on and off). If the arrow is green you are headed in the right direction. If the arrow is red you are heading in the wrong direction. The upper left hand of the screen shows important information such as what position you are in, your time compared to the last lap, and what lap you are on. The map on the upper right hand side of the screen gives you a general idea of the course and where the other trucks are. Watch the map carefully as your competitors do not always drive on the track. If you see a competitor taking a short cut, you might want to try follow (it may be a faster path). The lower portion of the screen shows you your tachometer, speedometer, and gear position.\n\n*********************************************************************\nINSTALLATION\n\n1. Run 4x4evo2.exe\n2. Select the path where you want it to install the game\n3. Click install\n4. Run the game from the newly created icon on your desktop\n5. Enjoy and SEED!\n\n*********************************************************************\nSYSTEM REQUIREMENTS\n\nMinimum System Requirements\n---------------------------------------\nWin98/ME/2000\nPentium III, IV, or Athlon at 450 MHz or better\n128MB of RAM\n100% DirectX 8 or OpenGL Compatible 3D Accelerator with 32MB of RAM \nSound Card\n1.2 GB free uncompressed hard disk space\n\nRecommended System Requirements\n---------------------------------------\nPentium III, IV, or Athlon at 700 MHz or better\n256MB of RAM\nNVidia GeForce2 or Geforce3, Matrox G400, or ATI Radeon video card\nSoundblaser Live Sound Card\n1.5 GB free uncompressed hard disk space\n\n\nOperating System\n-----------------------------\n4x4 Evo2 supports Windows 98, Windows ME, Windows 2000 as long as DirectX 8 or higher is installed and the minimum system requirements are met.\n\nWindows NT 4.0 will be limited to OpenGL.\n\n*********************************************************************\nTIPS\n\nIf you ever get lost or stuck in a place you cannot get out of (like a deep ravine) use the reset position key (H by default) to reset your position to the last checkpoint that you drove through.\n\nIf you change the weather setting to rain, it would be wise to change your tires to a deep cut. \n\nIf you are racing in the snow, you won't be very successful unless you switch to studded tires.\n\nDifferent tire treads work better on different tracks. Experiment to see what combination will give you the best time.\n\nJust like in real life, when your tires are off the ground you loose speed. You should always try your best to keep your tires on the ground (not jump) even if this means slowing down a bit. It is sometimes faster to slow down at a hill so that you may accelerate down the other side, than to hit the hill at full speed and jump down the other side (loosing speed the entire time).\n\nQuick Race allows you to try every track, and practice getting good times. Use this as a tool to prepare you for Career Mode.\n\nUse your Career Mode money wisely. Upgrading the appearance of your truck is fun, but it doesn't make it any faster.\n\nEach race in a series increases in difficulty. To keep competitive, if you have won money in the prior race, you may want to upgrade your truck before attempting the next race.\n\nIt never hurts to explore the track for faster routes to checkpoints - you also may find a surprise or two.\n\nIf you do not seem to be accelerating properly, ease up on the gas a bit. As you upgrade your vehicle the power of your vehicle significantly increases. If you just mash on the gas, it is likely that you will not go very fast because your tires are spinning in place.\n\nIt is always best, when racing off road, to have a 4WD vehicle. If you feel like you aren't getting the proper traction, make sure that your vehicle is in 4WD (the 4 key by default cycles you through between 4WD High, 4WD Low, and 2WD).  If you have a 2WD vehicle, you can't shift into 4WD (in case you were wondering...)\n\nRunning into objects or other vehicles can slow you down significantly. Avoid running into objects whenever possible.\n\nExperiment with your vehicle settings. You might find that your personal driving style benefits from oversteering or understeering.\n\n*********************************************************************\nCONTROLS\n\nBefore trying to use a controller in 4x4 Evo2, make sure that you have properly installed it and calibrated it in Windows before launching 4x4 Evo2.\n\nDefault Keys:\n-----------------\nAccelerate = up arrow, forward on joystick, or gas pedal on shared axis driving wheel/paddles\nBrake = down arrow, back on joystick, or gas pedal on shared axis driving wheel/paddles\nSteer right = right arrow, or right on joystick\nSteer left = left arrow, or left on joystick\nH = reset position if lost or stuck\n4 = Toggle Four wheel drive mode between 2WD, 4WD-HI, and 4WD-LO\nL = toggle headlights\nA = upshift (manual trans)\nZ = downshift (manual trans)\nF = toggle finder\nD = toggle speedometer\nO = toggle timing overlay\ntab = toggle map\nV = toggle view","torrent":{"xt":"urn:btih:cc53db9e38436f8ac175afb0c73cc95cc3336775","amp;dn":"4x4.Evolution.2-FRACTO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc53db9e38436f8ac175afb0c73cc95cc3336775","infoHashBuffer":{"type":"Buffer","data":[204,83,219,158,56,67,111,138,193,117,175,176,199,60,201,92,195,51,103,117]},"announce":[],"urlList":[]}}