{"title":"M. R. James-A Warning to the Curious &amp; Casting the Runes","uid":15756334,"size":50044167,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cc723455c0f55462555e4e0f4c60246fad9d2f88&amp;dn=M.+R.+James-A+Warning+to+the+Curious+%26amp%3B+Casting+the+Runes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"twocows","files":6,"time":1473058362,"description":"A Warning to the Curious &amp; Casting the Runes\r\nby M. R. James\r\n\r\n   Fantasy\r\nMONTAGUE RHODES JAMES, the greatest English writer of ghost stories, was born in 1862 at Goodnestone Parsonage in Kent, where his father was Curate, and spent most of his boyhood at Livermere, near Bury St Edmunds in East Anglia, where his father had become Rector. From childhood he was passionately interested in mediaeval books and antiques. At the age of six, attending his first children's party, he burst into tears, but was soon comforted by being taken into the library of the house and left there alone. He won a scholarship to Eton and took a double first at Cambridge, becoming a distinguished linguist and mediaevalist. In the years up to 1914 he enjoyed spending his vacations cycling round Europe, the first of his many visits being made with a friend sharing a double tricycle. In 1913 he became Vice-Chancellor of the University, and in 1918 he became Provost of Eton. A man of formidable learning and enormous quickness of mind, he translated the Apocryphal Books of the New Testament into English, having them published in 1924, and was said to time his breakfast egg by the time it took him to complete the Times crossword. Many of his elegant and terrifying tales were suggested to him by scenes he had visited in Europe or England. Seaburgh, for instance, in 'A Warning to the Curious', is Aldeburgh in Suffolk. Story-telling was a hobby, and his great reputation is based on only thirty or so stories, written over about the same number of years, from 1894 to 1927. His first collection, 'Ghost Stories of an Antiquary', was published in 1904. He died in 1936. This volume contains A Warning To The Curious and Casting The Runes. Geoff McGivern has been heard in many BBC Radio programmes, including Mid-Week, Week Ending and the role of Ford Prefect in the original radio and cassette version of The Hitch Hiker's Guide to The Galaxy. He has appeared extensively on stage including the West End run of The Dresser. On television he has appeared in Mr Pye, Blackadder III and Chelmsford 123","torrent":{"xt":"urn:btih:cc723455c0f55462555e4e0f4c60246fad9d2f88","amp;dn":"M.+R.+James-A+Warning+to+the+Curious+%26amp%3B+Casting+the+Runes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc723455c0f55462555e4e0f4c60246fad9d2f88","infoHashBuffer":{"type":"Buffer","data":[204,114,52,85,192,245,84,98,85,94,78,15,76,96,36,111,173,157,47,136]},"announce":[],"urlList":[]}}