{"title":"In Search of Vikings (gnv64)","uid":11708981,"size":43870508,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ccb79082c94528b2461fa77fdf5cff9f60f432d1&amp;dn=In+Search+of+Vikings+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"gnv65","files":4,"time":1424249754,"description":"In Search of Vikings - Interdisciplinary Approaches to the Scandinavian Heritage of North-West England\nby Stephen E. Harding and David Griffiths\nCRC Press | December 2014 | ISBN-10: 1482207575 | True PDF | 204 pages | 40.8 mb\n\nThe Viking Age lasted a little over three centuries, but has left a lasting legacy across Europe. These dynamic warrior-traders from Scandinavia, who fought and interacted with peoples as far apart as North America, Russia, and Central Asia, are some of the most recognizable historical figures in the western world. In the modern imagination they represent ruthlessness, heroism, adventurousness, and a unique prestige embellished by the wondrous tales and poetry of the sagas. Yet the sum of evidence for the Viking presence is far less clear than their reputation implies.\n\nIn Search of Vikings presents a collection of papers from experts in a broad range of disciplines, including history, archaeology, genetics, and linguistics, to provide a detailed understanding of the Vikings in peace and in war. This book focuses on one particularly exciting area of the Viking world, namely the north-west region of England, where they are known to have settled in large numbers. North-west England was the crossroads between Ireland, Scotland, Wales, the Isle of Man, and the Anglo-Saxon kingdoms. It was a battleground for distant powers and dynasties, and its Irish Sea coastline created opportunities for trading and settlement. Silver hoards, burials, and Old Norse place-names attest to the Viking presence, and Scandinavian DNA is detectable amongst the modern population. The 12 integrated studies in this book are designed to reinvigorate the search for Vikings in this crucial region and to provide must-reading for anyone interested in Viking history.\n\nAbout the Author\nSteve Harding DSc Oxford (b. Wirral, 1955) is an expert on Macromolecules (proteins, carbohydrate polymers and DNA) and the methodologies used to see how they behave in solution. Trained by the man who discovered hydrogen bonds in DNA (JM Creeth), he instigated the DNA survey of NW England looking for Viking ancestry in the old population, working with colleagues at Leicester University and engaging heavily with the public &amp; heritage organisations. He is a member of the &quot;Saving Oseberg&quot; Reference Group, contributing his expertise in complex carbohydrate characterisation in helping save one of Norway's national treasures. He was recently honoured by King Harald V.\n\nCONTENTS\nForeword.......................vii\nPreface..........................ix\nContributors...........................xi\n1. Interdisciplinary Approaches to the Scandinavian Heritage of North-West England..............1\n2. A Brief History and Archaeology of Viking Activity in North-West England..........................33\n3. Speaking Like a Viking: Language and Cultural Interaction in the Irish Sea Region............51\n4. Viking Age Women........................61\n5. Taking Sides: North-West England Vikings at the Battle of Tettenhall, AD 910.....................71\n6. The Battle of Brunanburh in 937: Battlefield Despatches.................................95\n7. Viking Age Rural Settlement in Lowland North-West England: Identifying the Invisible?....109\n8. A Viking-Age Site at Workington, Cumbria: Interim Statement............................127\n9. Were There Vikings in Carlisle?..........................137\n10. Viking-Age Silver in North-West England: Hoards and Single Finds......................................149\n11. What Can Genetics Tell Us about the Vikings in the Wirral and West Lancashire?.............165\n12. Figuring It Out: Further Work on the Neston Cross Fragments, Cheshire............................179\n &lt;a href=&quot;\nhttp://s28.postimg.org/b1ijlrxa5/In_Search_of_Vikings.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s28.postimg.org/b1ijlrxa5/In_Search_of_Vikings.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ccb79082c94528b2461fa77fdf5cff9f60f432d1","amp;dn":"In+Search+of+Vikings+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccb79082c94528b2461fa77fdf5cff9f60f432d1","infoHashBuffer":{"type":"Buffer","data":[204,183,144,130,201,69,40,178,70,31,167,127,223,92,255,159,96,244,50,209]},"announce":[],"urlList":[]}}