{"title":"Nancy Drew And The Haunted Carousel","uid":3384940,"size":412661390,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cd4f31d21f8b79fe092f9cdd12ba1830a9984df5&amp;dn=Nancy+Drew+And+The+Haunted+Carousel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Grim2004","files":1,"time":1127074946,"description":"Nancy Drew and the Haunted Carousel (c) Her Interactive\n\nThe merry-go-round at Captain?s Cove seems to have a mind of its own. Late at night, when the park is deserted, it takes off on a bizarre riderless journey. Will you be able to unravel the mysterious happenings surrounding this beautiful antique carousel?\n  \nRide the carousel: fun or fact finding? Learn about antique carousel horses. \n\n\nYou, as Nancy Drew, are invited to the Jersey shore to investigate a series of micarps at the Captain?s Cove Amusement Park. First, the lead horse was stolen from the carousel. Then the roller coaster suddenly lost power, resulting in a serious accident. Now the merry-go-round is mysteriously starting up in the middle of the night. \n\n  \nSearch the Captain's Coves\namusement park. Take a break from your case\nand play some games! \n\nThe amusement park is closed while the insurance company looks into the roller coaster accident. Nancy begins her own investigation by interviewing park employees, including office manager Joy Trent; chief engineer Ingrid Corey; security officer Harlan Bishop, and Elliot Chen, the park?s art director. \n\n  \nAn amusement park is a big place \ninside and out -- investigate everything... Can you monitor the park as closely as all this surveillance equipment? \n\nAs her search unfolds, Nancy learns about the lonely craftsman who carved the carousel horses, and about the sad history of the park?s former owner, Daryl Trent. Before he died he hid puzzles and riddles throughout the park to reunite his daughter Joy with her past.\n\nInstall and Enjoy!:)\n","torrent":{"xt":"urn:btih:cd4f31d21f8b79fe092f9cdd12ba1830a9984df5","amp;dn":"Nancy+Drew+And+The+Haunted+Carousel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd4f31d21f8b79fe092f9cdd12ba1830a9984df5","infoHashBuffer":{"type":"Buffer","data":[205,79,49,210,31,139,121,254,9,47,156,221,18,186,24,48,169,152,77,245]},"announce":[],"urlList":[]}}