{"title":"La sombra del poder HDRip][spanish]","uid":6758788,"size":2626791424,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ce38f3bbeb020270e53cf12e738551e02936af0d&amp;dn=La+sombra+del+poder+HDRip%5D%5Bspanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Black1000","files":-1,"time":1319129307,"description":"La sombra del poder.HDrip\n\nAÃƒÂ±o: 2009\n\nDuracion: 127 min.\n\nReparto: Russell Crowe, Ben Affleck, Rachel McAdams, Robin Wright Penn, Jason Bateman, Helen Mirren, Jeff Daniels, Michael Berresse, Harry Lennix, Josh Mostel, Michael Weston, Barry Shabaka Henley, Viola Davis, Maria Thayer, Wendy Makkena\n\nGenero: Thriller. Intriga.\n\nSinopsis\n\nAdaptaciÃƒÂ³n de la exitosa miniserie de TV britÃƒÂ¡nica de la BBC del mismo nombre, que narra cÃƒÂ³mo un congresista y un reportero se ven envueltos en un caso de dos asesinatos que, aparentemente, no tienen relaciÃƒÂ³n entre sÃƒÂ­. Cal McCaffrey (Russell Crowe) es un periodista de Washington DC cuyo olfato le lleva a desenmaraÃƒÂ±ar los misteriosos asesinatos de algunas de las figuras mÃƒÂ¡s prometedoras de la polÃƒÂ­tica y la gran empresa. El apuesto e imperturbable congresista Stephen Collins (Ben Affleck) representa el futuro de su partido: debido a su honradez, ha sido elegido presidente del comitÃƒÂ© que supervisa los gastos de Defensa. Todos esperan que esta estrella en auge represente a su partido en la prÃƒÂ³xima carrera hacia la presidencia. Hasta que alguien asesina brutalmente a su ayudante/amante, y los secretos se escapan de su escondite. McCaffrey tiene la dudosa fortuna de ser un viejo amigo de Collins, y de que su jefa (Helen Mirren) sea totalmente despiadada y le mande a investigar el caso. Mientras sigue la pista del asesino con la ayuda de su compaÃƒÂ±era Della (Rachel McAdams), descubre una tapadera que amenaza con hacer temblar las estructuras del poder de la naciÃƒÂ³n. En una ciudad de relaciones pÃƒÂºblicas, asesores y ricos polÃƒÂ­ticos, aprenderÃƒÂ¡ una verdad innegable: cuando miles de millones estÃƒÂ¡n en juego, la integridad, el amor y la vida de cualquiera estÃƒÂ¡n en peligro.\n","torrent":{"xt":"urn:btih:ce38f3bbeb020270e53cf12e738551e02936af0d","amp;dn":"La+sombra+del+poder+HDRip%5D%5Bspanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce38f3bbeb020270e53cf12e738551e02936af0d","infoHashBuffer":{"type":"Buffer","data":[206,56,243,187,235,2,2,112,229,60,241,46,115,133,81,224,41,54,175,13]},"announce":[],"urlList":[]}}