{"title":"NATO's Secret Armies: Operation GLADIO and Terrorism in Western","uid":6322504,"size":3019053,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf04535035f01be5fa30d047746764bcfca42598&amp;dn=NATO%5C%27s+Secret+Armies%3A+Operation+GLADIO+and+Terrorism+in+Western&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Djofullinn","files":1,"time":1302983178,"description":"Review\n'Much of this is appearing in English for the first time and it would be hard to overstate its importance.' - Lobster\nProduct Description\n\nThis fascinating new study shows how the CIA and the British secret service, in collaboration with the military alliance NATO and European military secret services, set up a network of clandestine anti-communist armies in Western Europe after World War II.\n\nThese secret soldiers were trained on remote islands in the Mediterranean and in unorthodox warfare centres in England and in the United States by the Green Berets and SAS Special Forces. The network was armed with explosives, machine guns and high-tech communication equipment hidden in underground bunkers and secret arms caches in forests and mountain meadows. In some countries the secret army linked up with right-wing terrorist who in a secret war engaged in political manipulation, harrassement of left wing parties, massacres, coup d'ÃƒÂ©tats and torture.\n\nCodenamed 'Gladio' ('the sword'), the Italian secret army was exposed in 1990 by Italian Prime Minister Giulio Andreotti to the Italian Senate, whereupon the press spoke of &quot;The best kept, and most damaging, political-military secret since World War II&quot; (Observer, 18. November 1990) and observed that &quot;The story seems straight from the pages of a political thriller.&quot; (The Times, November 19, 1990). Ever since, so-called 'stay-behind' armies of NATO have also been discovered in France, Spain, Portugal, Germany, Belgium, the Netherlands, Luxemburg, Denmark, Norway, Sweden, Finland, Switzerland, Austria, Greece and Turkey. They were internationally coordinated by the Pentagon and NATO and had their last known meeting in the NATO-linked Allied Clandestine Committee (ACC) in Brussels in October 1990.\n &lt;a href=&quot;\nhttp://www.amazon.com/NATOs-Secret-Armies-Operation-Contemporary/dp/0714656070/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1302973524&amp;sr=1-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/NATOs-Secret-Armies-Operation-Contemporary/dp/0714656070/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1302973524&amp;sr=1-1&lt;/a&gt;","torrent":{"xt":"urn:btih:cf04535035f01be5fa30d047746764bcfca42598","amp;dn":"NATO%5C%27s+Secret+Armies%3A+Operation+GLADIO+and+Terrorism+in+Western","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf04535035f01be5fa30d047746764bcfca42598","infoHashBuffer":{"type":"Buffer","data":[207,4,83,80,53,240,27,229,250,48,208,71,116,103,100,188,252,164,37,152]},"announce":[],"urlList":[]}}