{"title":"The Heiress (1949)","uid":9875911,"size":1775256195,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cf1c511baa6acef919af48543aa04450af05fbe0&amp;dn=The+Heiress+%281949%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"mfccorrea","files":1,"time":1396480004,"description":" Olivia DeHavilland won an Academy Award (her second) for her portrayal of Catherine Sloper, the plain-Jane daughter of wealthy widower Dr. Austin Sloper (Ralph Richardson). Catherine is not only unattractive, but lacks most of the social graces, thanks in great part to the domineering attitudes of her father. When Catherine falls in love with handsome young Morris Townsend (Montgomery Clift), she is convinced that her love is reciprocated, else why would Morris be so affectionate towards her? Dr. Sloper sees things differently, correctly perceiving that Morris is a callow fortune hunter. Standing up to her father for the first time in her life, Catherine insists that she will elope with Morris; but when Dr. Sloper threatens to cut off her dowry, Morris disappears. Still, Catherine threatens to run off with the next young man who pays any attention to her; Sloper, belatedly realizing how much he has hurt his only child, arranges to leave her his entire fortune. Years pass: Morris returns, insisting that he'd only left because he didn't want to cause Catherine the &quot;grief&quot; of being disinherited. Seemingly touched by Morris' &quot;sincerity&quot;, Catherine agrees to elope with him immediately. But when Morris arrives at the appointed hour, he finds the door locked and bolted. Asked how she can treat Morris so cruelly, Catherine replies coldly &quot;Yes, I can be very cruel. I have been taught by masters.&quot; Though The Heiress ends on a downbeat note, the audience is gratified to know that Catherine Sloper has matured from ugly-duckling loser to a tower of strength who will never allow herself to be manipulated by anyone ever again.\n\nRip Specs: (DVD Rip)\n\nGeneral           : The Heiress.mkv\nFormat            : Matroska at 2 050 Kbps\nLength            : 1.65 GiB for 1h 55mn 28s 128ms\n\nVideo #0          : AVC at 1 850 Kbps\nAspect            : 720 x 540 (1.333) at 23.976 fps\n\nAudio #0          : AC-3 at 192 Kbps\nInfos             : 2 channels, 48.0 KHz\nLanguage          : en\n\nText #0           : VobSub\nLanguage          : en\n\nText #1           : VobSub\nLanguage          : fr\n\nText #2           : VobSub\nLanguage          : pt\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0041452/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0041452/&lt;/a&gt;\n\nLanguage: English\nSubtitles: English, French, Portuguese\n\n","torrent":{"xt":"urn:btih:cf1c511baa6acef919af48543aa04450af05fbe0","amp;dn":"The+Heiress+%281949%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf1c511baa6acef919af48543aa04450af05fbe0","infoHashBuffer":{"type":"Buffer","data":[207,28,81,27,170,106,206,249,25,175,72,84,58,160,68,80,175,5,251,224]},"announce":[],"urlList":[]}}