{"title":"Dracopedia- The Bestiary [PDF]","uid":9445826,"size":26993534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cfc133a16b332fbb0f3aa373c0da0269ffc1e3e7&amp;dn=Dracopedia-+The+Bestiary+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"F1restorm","files":-1,"time":1389093358,"description":"Dracopedia- The Bestiary : An Artists Guide to Creating Mythical Creatures \nAuthor: William O'Connor\nPublished: 2013\nPublisher: Impact\nISBN: 9781440325243\nFormat: Retail PDF\nReader Required: Adobe Reader, Adobe Digital Editions\n\nTested on the above readers with no problems on laptop and Android tablet. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n_____________________________________________________________________________________\n\n\nUnleash the Beasts!\nFor millennia historians, artists and scientists have chronicled their ideas and discoveries of mythological and magical monsters in encyclopedias known as bestiaries. From Asia to America, Japan to the jungles of South Africa, the vast menagerie of exotic and legendary creatures has populated the imaginations of all cultures for centuries.\n\nBeautifully illustrated and fantastically detailed, Dracopedia: The Bestiary is a modern, but no less unsettling reimagining of the ancient version. It is an A-to-Z artist's guide to animals of the legendary world. Some, like the griffin and yeti, may be familiar to you. Others--like the enigmatic questing beast and ferocious manticore--may seem new and strange. Some may even haunt your dreams. Inside the bestiary, you will find:\n\nSecrets of each animal's evolution--origins, habitat, anatomy, diet and more.\nFantastic illustrations created using pencil sketches and digital coloring.\nFour-stage demonstrations taking you from concept and design to under-painting and finishing details.\n\n\nBy drawing on the forms and features of more pedestrian animals, you'll learn how to give shape to the bizarre creatures that roam the depths of your imagination, adding to the bestiary of the ages.\n","torrent":{"xt":"urn:btih:cfc133a16b332fbb0f3aa373c0da0269ffc1e3e7","amp;dn":"Dracopedia-+The+Bestiary+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfc133a16b332fbb0f3aa373c0da0269ffc1e3e7","infoHashBuffer":{"type":"Buffer","data":[207,193,51,161,107,51,47,187,15,58,163,115,192,218,2,105,255,193,227,231]},"announce":[],"urlList":[]}}