{"title":"music for programming 1-27","uid":10638666,"size":3020895109,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cfc871459886468bee5b21ea355e151ec7d53b4f&amp;dn=music+for+programming+1-27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"L29Ah","files":28,"time":1406425254,"description":"It is a dump of musicforprogramming.net project.\n\nA series of mixes intended for listening\nwhile programming to aid concentration\nand increase productivity (also compatible\nwith other activities).\n\n\nManifesto\n\nWarning: Pretentiousness.\n\nWhile concentrating on complex tasks or creative work, we often feed ourselves streams of musical information in an attempt to occupy the parts of our minds that would otherwise be left relatively idle. Without this, over prolonged periods of concentration, those underactive brain centers create a sense of imbalance. Whether this imbalance is real or merely perceived, it can often create distracting interjections from powerfully oblique thoughts about food, memories, desires, and emotions.\n\nUsing music in this way is nothing new, but with the wrong choices, we can often find ourselves fighting against thematic intent to such a degree as to almost denigrate the music itself. We train ourselves to 'tune out' and demote what we've chosen to mere background noise.\n\nThe goal of this series is to provide listening experiences that can be fully appreciated for their artistic intent despite sometimes having only partial attention paid to them. That is to not to say that the music is not worthy of exclusive attention, but that it contains themes or textures of a certain type that the problem-solving brain centers won't have trouble processing, and fully appreciating, while attempting to code, write, or draw.\n\nIn other words, the music itself should not task the listener with too much 'problem solving' of its own. The musical ideas develop and cover large thematic and emotional distances, but rarely in such a short space of time as to sound dramatic.\n\nThe back-and-forth motion between contemplation on the next stage of your work, and the subsequent actions to realise it will necessarily create peaks and troughs of brain activity. This series attempts to provide a soundtrack that can be fully appreciated over that entire gamut.\n\nMore importantly, the episodes have been lovingly crafted by people who've invested huge chunks of their lives finding all this beautiful stuff. For you.\n","torrent":{"xt":"urn:btih:cfc871459886468bee5b21ea355e151ec7d53b4f","amp;dn":"music+for+programming+1-27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfc871459886468bee5b21ea355e151ec7d53b4f","infoHashBuffer":{"type":"Buffer","data":[207,200,113,69,152,134,70,139,238,91,33,234,53,94,21,30,199,213,59,79]},"announce":[],"urlList":[]}}