{"title":"Stuffocation: How We've Had Enough Stuff (2014) epub","uid":11775619,"size":378188,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d030c74a04b5da43726713b778a9dd09fca5ebe7&amp;dn=Stuffocation%3A+How+We%27ve+Had+Enough+Stuff+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bookzilla","files":1,"time":1427280594,"description":"We have more stuff than we could ever need - clothes we don't wear, kit we don't use, and toys we don't play with.\n\n But having everything wethought we wanted isn'tmaking us happier. It's badfor the planet. It's clutteringup our homes. It's makingus feel 'stuffocated' andstressed - and it might evenbe killing us.\n\n In this groundbreaking book, trend forecaster James Wallman finds that a rising number of people are turning their backs on all-you-can-get consumption, from the telecoms exec who's sold almost everything he owns, to the well-off family who have moved into a remote mountain cabin.\n\n Wallman's solution to our clutter crisis is less extreme, but equally fundamental. We have to transform what we value. We have to focus less on possessions and more on experiences. Rather than a new watch or another pair of shoes, we should invest in shared experiences like holidays and time with friends.\n\n With intriguing insights on psychology, economics and culture, Stuffocation is a vital manifesto for change. It has inspired those who have read it to be happier and healthier, and to live more, with less","torrent":{"xt":"urn:btih:d030c74a04b5da43726713b778a9dd09fca5ebe7","amp;dn":"Stuffocation%3A+How+We%27ve+Had+Enough+Stuff+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d030c74a04b5da43726713b778a9dd09fca5ebe7","infoHashBuffer":{"type":"Buffer","data":[208,48,199,74,4,181,218,67,114,103,19,183,120,169,221,9,252,165,235,231]},"announce":[],"urlList":[]}}