{"title":"Miracles and Mysteries in Judeo-Christianity","uid":5110467,"size":188257682,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d07a9ca24b1febe7745b1209dd4c57f678cb32c6&amp;dn=Miracles+and+Mysteries+in+Judeo-Christianity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"moman73","files":15,"time":1254697951,"description":"Miracles and Mysteries in Judeo-Christianity:\n\nMiracles are necessary acts to prove the prophethood of the prophets. Thus when Moses parted the sea or when Jesus cured the sick and raised the dead; these miraculous acts were signs to people to the authenticity of the person performing these acts.\n\nIn Christianity, however, it heavily relied on miracles and supernaturalism to settle even the dogmatic differences. Here is a bizarre story quoted by the Theosophists that  shows how a miracle decided which Gospels are to be accepted as authentic and included in the Canon of the Bible (the upload includes the reference to this story): \n\n&quot;By the fourth century it became necessary for the Church to decide which of the many Gospels then in circulation were to be accepted as authentic. The question came up in the Council of Nicea. Fortunately the testimonies of two eye-witnesses have been preserved, so there can be little doubt as to the method used in the selection of the Gospels. There were 318 Bishops present in this Council, and one of the two eyewitnesses, Sabinus, Bishop of Heraclea, left a description of their mental capacities.\n\n&quot;With the exception of the Emperor (Constantine)&quot; he said, &quot;and Eusebius Pamphilus, these Bishops were a set of illiterate, simple creatures who understood nothing.&quot; About forty Gospels were submitted to these Bishops. As they differed widely in their contents, the decision was difficult. At last it was determined to resort to &quot;miraculous intervention.&quot; The method used was known as the Sortes Sanctorum, or &quot;the holy casting of lots for purposes of divination.&quot; \n\nIts use in the Council of Nicea was described by another eye-witness, Pappus, in his Synodicon to that Council. He says: Having promiscuously put all the books referred to the Council for determination under a communion table in a church, they (the Bishops) besought the Lord that the inspired writings might get upon the table, while the spurious ones remained underneath. And it happened accordingly. \n\nWhen the Bishops returned to the Council room on the following morning, the four Gospels of Matthew, Mark, Luke and John were resting on the communion table. Their presence in the New Testament is due to the art of divination, for practicing which the Church subsequently condemned men and women as sorcerers, enchanters and witches, and burned them by the thousands.&quot;\n\nThe above story causes a lot of embarrassment to the Christians; many of them discredit it as unauthentic and dismiss the source as an obscure writer with no credibility. But, even if this story was not authentic, few doubt that miracles and mysteries are major source (or explanation) to many of the Christian beliefs. \n\nThis upload includes 15 titles. Some of these titles are apologetics in nature.\n\n1- Great Theosohpists - Hypatia, The last of the Neoplatonists. This is one of the references that quoted the story about how a miracle settled which Gospels to be included in the Canon of the Bible.\n\n2- 100 Most Strangest Mysteries; by Matt Lamy, 2004. It includes a section on Marvels and Miracles that report many of them related to Christianity.\n\n3- Gospel Mysteries. \n\n4- The Mysteries: Pagan and Christian; by S. Cheetham, 1897.\n\n5- Some Modern Difficulties on Mysteries and Incarnation; by: S. Baring-Gould, 1875. \n\n6- Letters to Eugenia, on the Absurd, Contradictory and Demoralizing Dogmas and Mysteries of the Christian Religion; by: Baron Holback, 1819.\n\n7- The Origins of the Christian Mystical Tradition; by: Andrew Louth, 2nd Ed. 2007.\n\n8- Esoteric Christianity or the Lesser Mysteries; by: Annie Besant, Third Impression Reprinted 1914.\n\n9- Christianity not Mysterious; by: John Toland, 1696. This classic is written by John Toland (1670-1722); one of the earliest freethinkers in the West. He wrote over a hundred books in various domains but mostly dedicated to criticizing ecclesiastical institutions. In this book he argued that the divine revelation of the Bible contains no true mysteries; rather, all the dogmas of the faith can be understood and demonstrated by properly trained reason from natural principles. For this argument he was prosecuted by a grand jury in London, and the book was also burnt by the public hangman in Dublin, because it was contrary to the core doctrine of faith.\n\n10- May - The Miracles and Myths of the New Testament; by: Joseph May, 1908. \n\n11- Counterfeit Miracles; by: Benjamin Warfield, 1918.\n\n12- Supernatural Religion or An Inquiry into the Reality of Divine Revelation; by: Walter Richard Cassels, popular edition,1902. \n\n13- The Pro and Con of Supernatural Religion; by: E. E. Guild, 1876.\n\n14- The Place of Miracle in Religion; by: A. T. Lyttelton, 1899.\n\n15- Christianity as Mystical Fact; by: Rudolf Steiner, 1997.\n\n","torrent":{"xt":"urn:btih:d07a9ca24b1febe7745b1209dd4c57f678cb32c6","amp;dn":"Miracles+and+Mysteries+in+Judeo-Christianity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d07a9ca24b1febe7745b1209dd4c57f678cb32c6","infoHashBuffer":{"type":"Buffer","data":[208,122,156,162,75,31,235,231,116,91,18,9,221,76,87,246,120,203,50,198]},"announce":[],"urlList":[]}}