{"title":"Disney's Hannah Montana 2 - Meet Miley Cyrus ","uid":11781045,"size":165451495,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d0a94b34f1ad88d71a79b96975d2001045423b15&amp;dn=Disney%27s+Hannah+Montana+2+-+Meet+Miley+Cyrus+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"Big-Papi","files":29,"time":1427573581,"description":"Source: 2007 CD\n \n \n \n \nBy Marc Cabir Davis\n \n[quote]If you're an adult music listener reading this review, heres the deal. You could do much worse than this. Yes, this is music sung by a 14 year old girl who is obviously being marketed toward the tween audience, but its not very different from Ashley Tisdale or even Avril Lavigne.\n\nFor those of you who don't know what the big deal is about, Miley Cyrus sounds like a younger Avril Lavinge, but with more varied musical tastes. Much of her music is straight-forward pop-rock (evoking some of the new Kelly Clarkson), and some of it is decidedly experimental (Latin &amp; Reggae tunes on a couple of tracks). Its evident they wanted to make a record that everybody would love, and yes, I can guarantee that much of this is juvenile and really quite repugnant.\n\nHowever, if theres one thing that stands out - it's the voice. Miley Cyrus has a raspy, throaty voice that is really unlike most pop-queens. Listening to her voice makes you realize just how thin and boring Lindsay Lohan sounds on record. I think Cyrus has a musical future in front of her - I would just like her to record an album of jazz standards, and it would actually work. Yes, shes that good, but the music isn't exactly groundbreaking.\n\nListen, theres a market for this. But I must say that for all the hype, Cyrus DOES have something. If you look beyond the insanely pink jackets she wears and the hair extensions that change every day, she has a really unique voice, and you might want to get this just to check that out.\n\nIf its any help, this is definitely better than both of Lindsay Lohan's albums.[/quote]","torrent":{"xt":"urn:btih:d0a94b34f1ad88d71a79b96975d2001045423b15","amp;dn":"Disney%27s+Hannah+Montana+2+-+Meet+Miley+Cyrus+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0a94b34f1ad88d71a79b96975d2001045423b15","infoHashBuffer":{"type":"Buffer","data":[208,169,75,52,241,173,136,215,26,121,185,105,117,210,0,16,69,66,59,21]},"announce":[],"urlList":[]}}