{"title":"Married.With.Children.Season.1(UKB-RG-BINGOWINGZ)","uid":6362205,"size":3184350920,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d12d69bd7eb6920d917a84db6e220ec5a0f9fa03&amp;dn=Married.With.Children.Season.1%28UKB-RG-BINGOWINGZ%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":6,"uploader":".BONE.","files":17,"time":1304372111,"description":"Release Title: Married.With.Children.Season.1(UKB-RG-BINGOWINGZ)\nTV Air Date: 1987\nGenre: Comedy\nRunTime: 24 Minutes x13\nNumber Of Episodes: 13\n8PatD.png\nThe Bundys are a stereotypical &quot;white trash&quot; American family.\nAl is a shoe salesman who is fond of frequently reliving his\ndoubtful 15 seconds of fame on the football field.\nAl is terrified of the all-to-frequent amorous advances his\nditsy wife Peggy, a woman who must spend most of Al's wages\nat the salon and the mall. They have two children: Kelly,\nthe stunning but superficial party animal, and Bud, who is\ntoo wrapped up in himself to realize his goal of &quot;scoring&quot;\nwith a girl.\nEpisodes:\n\nEpisode 1: Pilot\nOriginal Air Date 5 April 1987\n\nIn the very first episode of this widely successful, ribald sitcom,\nAl Bundy has a chance of getting front row seats to the basketball\ngame, but Peggy makes him stay home and meet their new yuppie\nneighbors, Marcy and Steve Rhodes.\n\nEpisode 2: Thinnergy\nOriginal Air Date 12 April 1987\n\nMarcy introduces Peg to a new energetic diet to improve her marriage.\nAl, meanwhile, wants to part of it but learns if he tries the diet,\nhe can persuade Peg to quit. He must then swallow his pride and admit\nto Peggy he loves her no matter what.\n\nEpisode 3: But I Didn't Shoot the Deputy\nOriginal Air Date 19 April 1987\n\nThere has been a rash of burglaries in the area, and the Rhodes'\nhouse is robbed and Al's car stereo is ripped off, both families\nseek alternatives: Steve and Marcy buy a guard dog that won't stop\nbarking, and Al purchases a fire arm. One fateful night, the two\nmethods of home defense butt heads, and it's not a pretty picture.\n\nEpisode 4: Whose Room Is It Anyway?\nOriginal Air Date 26 April 1987\n\nSteve and Marcy plan to add a new room onto their house using their\ntax refund money. Al convinces Steve to make it into a billiards\nroom while Peggy convinces Marcy to make it into an exercise room,\nwhich leads to an all-out battle of the sexes to see who will win.\n\nEpisode 5: Have You Driven a Ford Lately\nOriginal Air Date 3 May 1987\n\nAl and Steve buy a beat up Ford Mustang off of one of Kelly's\nboyfriends. Soon they form a tight friendship while fixing it\nup like new. The only problem is they are neglecting their\nwives now that they spend every free minute with the car.\nMarcy gets to experience something in the backseat of the\nMustang that she has always wanted to do and when Al finds\nout about it, he won't let her forget it.\n\nEpisode 6: Sixteen Years and What Do You Get\nOriginal Air Date 10 May 1987\n\nIt's the Bundys' 16th wedding anniversary. Al plans to buy Peggy\na very fancy watch, but unfortunately, his credit card gets declined.\nDare he show up at the party without a present?\n\nEpisode 7: Married... Without Children\nOriginal Air Date 17 May 1987\n\nSteve and Marcy decide that once is enough after they volunteer to\nwatch Kelly, Bud, and the family dog Buck, after Al and Peggy go\naway for the weekend to a seedy motel in Wisconsin where Al wants\nto watch a boxing match on the cable TV system.\n\nEpisode 8: The Poker Game\nOriginal Air Date 24 May 1987\n\nAl takes Steve one evening to watch a poker game with his poker\nplaying friends. Steve gets the feel of the game and sits in for\none of the men, but he ends up losing his paycheck to Al.\nFrom then on, Steve tries to avoid Marcy to avoid telling her the\ntruth about losing their mortgage payment money while Al plans\nto use his $300 winnings to buy a new fishing rod.\n\nEpisode 9: Peggy Sue Got Work\nOriginal Air Date 31 May 1987\n\nTo get the money to purchase a new VCR that Al won't buy her,\nPeggy takes a job in a department store of selling clocks, which\ntakes the &quot;fun&quot; out of the Bundy marriage as a result of her\nabsence, and Kelly and Bud getting stuck with Al for the evenings.\n\nEpisode 10: Al Loses His Cherry\nOriginal Air Date 7 June 1987\n\nAl gets a first-hand look at Luke's swinging bachelor life when\nhe takes refuge at Luke's apartment after work rather than return\nhome to finish an argument with Peggy over visiting her relatives\nfor the weekend. Luke invites two women over at his place where\none of them, an attractive but dim-witted airplane stewardess,\ntempts Al.\n\nEpisode 11: Nightmare on Al's Street\nOriginal Air Date 14 June 1987\n\nWhile Steve is out of town for the week on business, Marcy starts\nhaving dreams involving a romance-minded Al which turns her dreams\ninto nightmares, and turns off her sexual urges, prompting her to\nlook into the source of her nightmares, while a clueless Steve asks\nAl for advice on Marcy's sudden lack of sexual needs.\n\nEpisode 12: Where's the Boss?\nOriginal Air Date 21 June 1987\n\nThe near death of the playboy owner of Al's shoe store starts\nAl wondering why he's never visited the store.\nFeeling unappreciated Al decides to take drastic action.\n\nEpisode 13: Johnny Be Gone\nOriginal Air Date 28 June 1987\n\nPersonal problems and crises delay Al and Peggy's departure to the\ngoing out of business party of their favorite hamburger joint,\n&quot;Johnny Be Goods,&quot; which range from Kelly being stood up from going\nto a party, Bud wanting to finish a remote-controlled car for a model\ncar festival, to Marcy stranded at the Bundys wearing only a towel\nafter staining her dress.\nPSMdK.png\n7JHYZ.jpg\nF8i95.png\nEd O'Neill ... Al Bundy (261 episodes, 1987-1997)\nDavid Faustino ... Bud Bundy (260 episodes, 1987-1997)\nChristina Applegate ... Kelly Bundy (259 episodes, 1987-1997)\nKatey Sagal ... Peggy Bundy (254 episodes, 1987-1997)\nAmanda Bearse ... Marcy D'Arcy (248 episodes, 1987-1997)\nBuck Buck ... Buck the Dog (178 episodes, 1987-1995)\nTed McGinley ... Jefferson D'Arcy (168 episodes, 1989-1997)\n8qSNk.png\nORIGINAL Source: Mazza/RS","torrent":{"xt":"urn:btih:d12d69bd7eb6920d917a84db6e220ec5a0f9fa03","amp;dn":"Married.With.Children.Season.1%28UKB-RG-BINGOWINGZ%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d12d69bd7eb6920d917a84db6e220ec5a0f9fa03","infoHashBuffer":{"type":"Buffer","data":[209,45,105,189,126,182,146,13,145,122,132,219,110,34,14,197,160,249,250,3]},"announce":[],"urlList":[]}}