{"title":"Urban and Contemporary Worship 2 Piano Lesson","uid":8543069,"size":1023889091,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d1734342dd8a7b93833829b786b4a34e2ee6816a&amp;dn=Urban+and+Contemporary+Worship+2+Piano+Lesson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"BlackPope","files":-1,"time":1370449159,"description":"Now it's time for you to learn the fundamentals of making your playing sound more full, phat, and flavorful. In Urban and Contemporary Worship Play by Ear Volume 2 you will learn the secrets behind alternate voicings, substitutions, advanced progressions, grace notes and most importantly, a ton of passing tones. All of these tools and concepts are the hidden secret tricks that differentiates one musician from another. You ever see a musician seem to play the same chords you play, but for some reason his playing sounds more full? Or have you ever heard a musician back up a singer and he was able to play all kinds of embellishments and chord changes that sound really phat? Well, that is because that musician built a vocabulary of chords in which to pull from. Your problem is not that you cannot play, it's that you need more chords in your vocabulary. That's what Volume 2 is all about! This DVD will build your vocabulary of phat chords, progressions, and passing tones in order to help you sound more professional and more phat. As a special treat, we will begin to introduce you to the tritone as well. Once you have the vocabulary, you will be able to pull from a plethora of nice chord changes and special nuances that will change the way you play instantly. ","torrent":{"xt":"urn:btih:d1734342dd8a7b93833829b786b4a34e2ee6816a","amp;dn":"Urban+and+Contemporary+Worship+2+Piano+Lesson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1734342dd8a7b93833829b786b4a34e2ee6816a","infoHashBuffer":{"type":"Buffer","data":[209,115,67,66,221,138,123,147,131,56,41,183,134,180,163,78,46,230,129,106]},"announce":[],"urlList":[]}}