{"title":"The Complete Sinestro Corps War + Ex (2007|Dgtl+S|TLK+JK-E, MM+)","uid":9527469,"size":701861682,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d1bc8cef000c899cb2c0473e3229caab9beaf0a9&amp;dn=The+Complete+Sinestro+Corps+War+%2B+Ex+%282007%7CDgtl%2BS%7CTLK%2BJK-E%2C+MM%2B%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1390775286,"description":"For more information on this major DC event, please check out the wiki entry here: \n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Sinestro_Corps_War&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Sinestro_Corps_War&lt;/a&gt;\n\nThe Sinestro Corps War was a 2007 crossover between Green Lantern v2 and Green Lantern v4, as well as involving the DC Universe at large. It was a huge critical and financial success, and with good reason - this was a story years in the making and Geoff Johns laid the groundwork early in 2005 with the Rebirth miniseries and the defeat and exile of Sinestro. Elements of the war's consequences were prophesied in the story &quot;Tygers&quot; by Alan Moore - included in this torrent - upon which Johns and others drew their inspiration. The possibility of different colored Lantern Corps represented different parts of the visible spectrum (and emotional wavelengths) was a brilliant idea that subsequently led to entirely new take on the Lantern mythos and moved it far forward in future stories such as Blackest Night (2009) and War of the Green Lanterns (2011) - and it is critical component of the modern Lantern-verse as well. \n\nThis torrent contains all 12 parts of the story + 4 Tales of the Sinestro Corps specials in the reading order that DC considers canon. I have also added two bookends - the first, part 00, is the 3 Green Lantern tales by the legendary Alan Moore, including the famous &quot;Mogo Doesn't Socialize&quot; where we are first introduced to that character, and more relevantly the &quot;Tygers&quot; short story in which Abin Sur - Hal Jordan's predecessor as Earth's Lantern - meets an alien who foretells not only of Sur's own death but also the destruction of the entire Lantern Corps. The bookend comic is Sinestro Corps War - Secret Files and Origins, which is a database of many Lanterns and their histories. It helps to keep things straight for the uninitiated and acts as a guide. All parts of the torrent are in numerical order and if you just want the core story, the extras and &quot;Tales&quot; off-shoots can be easily skipped. The Green Lantern digital copies are by JK-Empire, the Green Lantern Corps are digital via TLK-Empire, the Sinestro Corps Special is a DCP-HD edit and the rest are various Minutemen scanners. Thanks to all for their rips, they are excellent as always! Please seed and enjoy.\n\n","torrent":{"xt":"urn:btih:d1bc8cef000c899cb2c0473e3229caab9beaf0a9","amp;dn":"The+Complete+Sinestro+Corps+War+%2B+Ex+%282007%7CDgtl%2BS%7CTLK%2BJK-E%2C+MM%2B%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1bc8cef000c899cb2c0473e3229caab9beaf0a9","infoHashBuffer":{"type":"Buffer","data":[209,188,140,239,0,12,137,156,178,192,71,62,50,41,202,171,155,234,240,169]},"announce":[],"urlList":[]}}