{"title":"The Jim Henson Hour (1989) - Complete Series - Muppets Dog City","uid":10697636,"size":7320772841,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d215e9c01eaad11c8905e9272d615107dee85b15&amp;dn=The+Jim+Henson+Hour+%281989%29+-+Complete+Series+-+Muppets+Dog+City&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":4,"uploader":"creepyspookyicky","files":-1,"time":1407191299,"description":"Here are all 12 episodes of The Jim Henson Hour, including all the originally unaired ones, in the best quality available to me. The series was never completely released on DVD. This collection of the complete series would not have been possible without the hard work of Garrett Gilchrist, who restored most of these from VHS and LaserDisc. Look for his DVD-Rs, if you want some of them in better quality.\nI recreated episode 11 &amp; 12 from different sources to provide the best quality for each segment of the show, since the original VHS sources are quite poor in quality. Episode 5 is in two parts, because the videos have different frame rates, due to Miss Piggy's Hollywood being from a portuguese DVD. Episode 11 also has hardcoded dutsh subtitles for the most part, again as it was the best video source available. I also included some extras like the test pilot and the pitch reel for the show.\n\n\nFrom the Muppet Wiki:\n\nThe Jim Henson Hour was an hour-long prime-time anthology series produced by Jim Henson as a showcase for a variety of Jim Henson Productions' television work. The short-lived series aired over the course of four months in 1989. During this time, a total of nine episodes (out of twelve produced in total) aired on NBC, before the low-rated series was cancelled. Two later aired on Nickelodeon in 1992 and 1993, and the final episode never aired in the US, but it did air in the UK in 1990.\n\nThe Jim Henson Hour was modeled after the old Walt Disney Presents specials, in which every week Walt Disney would show off the latest innovations and creations of his production company. At the beginning of each episode, Jim Henson would enter a computer-generated set (alongside the Thought Lion from The Storyteller) and introduce the evening's show.\n\nOrdinarily, the hour was divided into two parts. The first half hour would feature a modernized variation of The Muppet Show, titled MuppeTelevision. Hosted by a mix of old and new Muppet characters, the shows featured celebrity guests, musical numbers and comedy sketches.\n\nThe second half-hour featured more serious and sometimes darker content, such as installments of The Storyteller and Lighthouse Island. Occasionally, a light-hearted story or more Muppet antics (such as Miss Piggy's Hollywood) would close out the hour.\n\nSeveral episodes featured extended full-episode mini-movies: such as the comedic film noir &quot;Dog City&quot;; the more dramatic &quot;Monster Maker&quot; and &quot;Living with Dinosaurs&quot;; and a behind the scenes special, entitled &quot;Secrets of the Muppets&quot;. ","torrent":{"xt":"urn:btih:d215e9c01eaad11c8905e9272d615107dee85b15","amp;dn":"The+Jim+Henson+Hour+%281989%29+-+Complete+Series+-+Muppets+Dog+City","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d215e9c01eaad11c8905e9272d615107dee85b15","infoHashBuffer":{"type":"Buffer","data":[210,21,233,192,30,170,209,28,137,5,233,39,45,97,81,7,222,232,91,21]},"announce":[],"urlList":[]}}