{"title":"The Ruby programming Language 2008","uid":5615070,"size":28736139,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d2463a08b19602f5b9f854fce4f9d7e00ecbd25d&amp;dn=The+Ruby+programming+Language+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"rubyloader","files":-1,"time":1276032880,"description":"Title\n    The Ruby Programming Language\nBy\n    David Flanagan, Yukihiro Matsumoto\nPublisher:\n    O'Reilly Media\nReleased:\n    January 2008 \nPages:\n    448 \n\nBestselling author David Flanagan teams up with Ruby creator Yukihiro &quot;Matz&quot; Matsumoto and writer/cartoonist/programmer why the lucky stiff to bring you the authoritative guide to Ruby. Covering versions 1.9 and 1.8, this book helps you learn Ruby's lexical structure, primary expressions, conditionals, syntax, classes, the data it manipulates, and more. For experienced programmers who want to look at this language in depth, this guide is invaluable.\nFull Description\n\nThe Ruby Programming Language is the authoritative guide to Ruby and provides comprehensive coverage of versions 1.8 and 1.9 of the language. It was written (and illustrated!) by an all-star team:\n\n    * David Flanagan, bestselling author of programming language &quot;bibles&quot; (including JavaScript: The Definitive Guide and Java in a Nutshell) and committer to the Ruby Subversion repository.\n\n\n    * Yukihiro &quot;Matz&quot; Matsumoto, creator, designer and lead developer of Ruby and author of Ruby in a Nutshell, which has been expanded and revised to become this book.\n\n\n    * why the lucky stiff, artist and Ruby programmer extraordinaire.\n\nThis book begins with a quick-start tutorial to the language, and then explains the language in detail from the bottom up: from lexical and syntactic structure to datatypes to expressions and statements and on through methods, blocks, lambdas, closures, classes and modules.\n\nThe book also includes a long and thorough introduction to the rich API of the Ruby platform, demonstrating -- with heavily-commented example code -- Ruby's facilities for text processing, numeric manipulation, collections, input/output, networking, and concurrency. An entire chapter is devoted to Ruby's metaprogramming capabilities.\n\nThe Ruby Programming Language documents the Ruby language definitively but without the formality of a language specification. It is written for experienced programmers who are new to Ruby, and for current Ruby programmers who want to challenge their understanding and increase their mastery of the language.","torrent":{"xt":"urn:btih:d2463a08b19602f5b9f854fce4f9d7e00ecbd25d","amp;dn":"The+Ruby+programming+Language+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2463a08b19602f5b9f854fce4f9d7e00ecbd25d","infoHashBuffer":{"type":"Buffer","data":[210,70,58,8,177,150,2,245,185,248,84,252,228,249,215,224,14,203,210,93]},"announce":[],"urlList":[]}}