{"title":"EXPLOITED COLLEGE GIRLS - Bella - 19 Years Old Amateur 720p","uid":11726370,"size":1935819978,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d256526a24f5836ded26157c355c95ad8f90a90c&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Bella+-+19+Years+Old+Amateur+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"beta2008x","files":1,"time":1425078692,"description":" &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=qbv86_llb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=qbv86_llb.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=reu9o_ecg_15_02_26_bella_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=reu9o_ecg_15_02_26_bella_s.jpg&lt;/a&gt;\n\nMeet Bella, a petite, 19 year old with wild hair and a wilder streak and, lucky for you, the only thing this tanned little beauty likes more than getting pierced is getting fucked. As soon as she opens her mouth you can tell she's a California girl and as soon as gets naked you'll see why we wish they all could be California girls: she's got an incredible body.\nAs Jay gets to know a little more about the dynamo that is Bella, she's pounding down the last of a king sized energy drink which begs the question, does this little firecracker really need MORE energy? Stay tuned and you'll see why Bella needs to stay hydrated: she uses a LOT of spit for various things in today's update. Before that, however, Jay has her strip to show off her tight, tanned little bod and fantastic, curvy little ass. When asked, she explains that her tits are 34 C's but we're pretty sure this is just because she forgot where C lands in the alphabet. The letter she was looking for is clearly B, but as long as she goes the extra mile to get an A in today's sex ed class we're not going to flunk her.\nDespite losing her vibrator in a divorce, Bella remembers how to use one. Between the pocket rocket and Jay's fingers, Bella gets wet and squirmy in no time and if there are two qualities we like to see in Ex Co Gi girls, they're wet and squirmy. When Jay commands her to get to her knees for this week's blowjob we're suddenly completely on board with this whole energy drink addiction. She attacks his cock with her hands and plenty of spit like giving head is the newest extreme sport and Jay actually has to pull her off it before she sucks him dry.\nDry is one thing Bella never lets herself get, though. Jay gets her to the bed to fuck and the entire time she's licking and spitting on her fingers and rubbing her clit and pussy with them. From doggy to cowgirl to reverse cowgirl her hands never stop finding their way to her pussy. Although, and here's a pervy thought for you: it could be the other way around. Maybe Bella just loves the taste of her own pussy. We leave that to viewers to decide.\nAfter watching Bella's tight little ass bounce on his cock, Jay can't hold out any longer and has Bella get to the floor for a taste of his very own high protein energy drink. Now &quot;Jay Juice&quot; won't give you wings or make you into a monster, but we hear it's good for the skin and after dumping a 12 ounce serving of it on a pretty face like Bella's Jay always seems to be in a good mood","torrent":{"xt":"urn:btih:d256526a24f5836ded26157c355c95ad8f90a90c","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Bella+-+19+Years+Old+Amateur+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d256526a24f5836ded26157c355c95ad8f90a90c","infoHashBuffer":{"type":"Buffer","data":[210,86,82,106,36,245,131,109,237,38,21,124,53,92,149,173,143,144,169,12]},"announce":[],"urlList":[]}}