{"title":"Dexter's Final Cut (Audiobook) By Jeff Lindsay","uid":9682399,"size":207555843,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d27799f3df173489f75f8a5691e076a6bf8b5e2c&amp;dn=Dexter%27s+Final+Cut+%28Audiobook%29+By+Jeff+Lindsay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"sidmal","files":-1,"time":1393686199,"description":"\n\nDexter's Final Cut (Audiobook) By Jeff Lindsay, read by the author\n Unabridged edition 2013 | 14 hours and 28 mins | ISBN: 0449013553 | MP3 32 kbps | 208 MB\n\n\n\n\n With 1.7 million copies of the Dexter novels sold, and ever-increasing critical acclaim, Jeff Lindsay returns to his groundbreaking and beloved character with his most entertaining book yet. Get ready for a grisly send-up of Hollywood, and a full dose of dark Dexter wit.\n\n Lights. Camera. Mayhem. You won't find this story on television.\n\n Hollywood gets more than it bargained for when television's hottest star arrives at the Miami Police Department and develops an intense, professional interest in a camera-shy blood spatter analyst named Dexter Morgan.\n\n Mega-star Robert Chase is famous for losing himself in his characters. When he and a group of actors descend on the Miami Police Department for &quot;research,&quot; Chase becomes fixated on Dexter Morgan, the blood spatter analyst with a sweet tooth for doughnuts and a seemingly average life. To perfect his role, Chase is obsessed with shadowing Dexter's every move and learning what really makes him tick. There is just one tiny problem . . . Dexter's favorite hobby involves hunting down the worst killers to escape legal justice, and introducing them to his special brand of playtime. It's a secret best kept out of the spotlight and away from the prying eyes of bloated Hollywood egos if Dexter wants to stay out of the electric chair. The last thing he needs is bright lights and the paparazzi. . . but even Dexter isn't immune to the call of fame.\n\n Jeff Lindsay's razor sharp, devilish wit, and immaculate pacing prove that he is in a class of his own, and this new novel is his most masterful creation yet.\n\n\n","torrent":{"xt":"urn:btih:d27799f3df173489f75f8a5691e076a6bf8b5e2c","amp;dn":"Dexter%27s+Final+Cut+%28Audiobook%29+By+Jeff+Lindsay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d27799f3df173489f75f8a5691e076a6bf8b5e2c","infoHashBuffer":{"type":"Buffer","data":[210,119,153,243,223,23,52,137,247,95,138,86,145,224,118,166,191,139,94,44]},"announce":[],"urlList":[]}}