{"title":"My First Interracial (2014) - Anal Interracial Porn XXX","uid":10856425,"size":3285779655,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d28f40914edf8bb3b7389fb1c4af158109a64a03&amp;dn=My+First+Interracial+%282014%29+-+Anal+Interracial+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"KidAtomic","files":-1,"time":1408843121,"description":"My First Interracial (2014)\n\nKeisha Grey - 1st Interracial!\n\nBLACKED.COM proudly presents the new series &quot;My First Interracial&quot; filmed and directed by award winning director Greg Lansky. For the very first time and exclusively for this film these four beautiful and pure looking models are seen having intense interracial sex. Shot with high-end production values at luxurious locations and with true cinematic HD. Starring Lacey Johnson, Farrah Flower, Kelly Diamond (in a very rare anal scene) and new starlet Keisha Grey.\n\nCOVERS AND SCREENS FOUND HERE:        &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=7&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=7&lt;/a&gt;\n\nSHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!!\n\n    Scene 1. Kelly Diamond, Prince Yahshua\n    Scene 2. Keisha Grey, Jason Brown\n    Scene 3. Lacey Johnson, Flash Brown\n    Scene 4. Farrah Flower, Flash Brown\n\nLength 2 hrs. 37 mins.\n\nActresses:\n    Farrah Flower [Facial Bald IR]\n    Keisha Grey [Facial IR]\n    Kelly Diamond [Anal Facial Bald IR]\n    Lacey Johnson [Facial Bald IR]\n\nActors:\n    Flash Brown\n    Jason Brown\n    Prince Yahshua\n\nReviewed by bono-ONE  on  8/21/2014\nGreetings porn fans. I have a release from Blacked.com here to check out and I believe it's the first title but I could be wrong. This show concerns itself with interracial action and the four girls appearing will all be making the IR debuts here. A real nice cover shot featuring Keisha Grey makes this an appealing title to slip into the player. Now let's find out how the action is. A flip over to the back cover gives you some good information such as the girls name and the guy she will be working with- a nice tough not enough studios do this these days.\n\nKelly Diamond with Prince Yahshua:\n\nKelly leads off and we find her sitting in a chair that is elevated off the ground, hanging from the ceiling. She then makes her way upstairs and we get to check her out wearing nothing but panties and a white shirt that's opened. They keep moving Kelly around next to the bedroom where she poses on a white bed-- everything white here! A short interview then follows while we get to check Kelly out lying on her side with a hint of the panties showing. Turning over more she opens up the short revealing her perky titties. Moving on we get Kelly opening her legs and the panties are gone too so the masturbation looks very good here. Prince joins in and takes over fingering duties and he moves down to taste her as well spreading her legs open as wide as he can. Sweet!! A doggie pose next with Prince digging his tongue deep into her ass hole, that's awesome and you get a close shot of this. Kelly gets her shot soon enough and from a side angle we watch as she strokes and sucks as much of Prince's cock as she can. Pulling back you see Kelly lying flat on her stomach which causes her butt to slightly arch up and I dig this shot when it's presented. I also enjoyed that she didn't try and get super aggressive here and titled way more towards making love to his cock with her mouth rather than trying to torpedo fuck it through her throat. The sex begins in mish and after a short time they make the move down to Prince analizing her!! Kelly uses a purple Hitachi up top to keep her pussy happy and we are told this is a rare anal scene for her too. Going over to doggie she offers up that ass just a little bit longer before asking Prince to go back into her pussy. After a strong pounding here Prince drops his load onto her waiting tongue. A very good start here.\n\nKeisha Grey with Jason Brown:\n\nNext up is the busty beauty Keisha Grey who we find in a seated position to start this one. Keisha is rocking a blue jean jacket and a red dress under that hugs her body beautifully. Keisha stands allowing us the full frontal view and yes there was some fine cleavage showing here too. Keisha also has a short chat with our shooter and nicely she starts to lose clothes as we go along. The tits are pulled out and her panties are removed as she sits back, opens up and begins playing with herself. I sense a pattern here and a good one where the girl pleasures herself until the guy shows up. Indeed Keisha is still playing with her pussy when Jason comes walking in and over to Keisha lying on the couch. As Prince did before Jason takes over the fingering duties while they begin kissing up top. Jason then makes the short trip down to eat her pussy and he spends some quality time here tasting her kittie and a flip over to the doggie position finds Jason tasting her ass also-- I really liked this and hope it continues in the last two scenes. We watch next as Keisha works that big dick out and she comments as much before making the move down to take Jason in. The side view is used very well here and like the first scene Keisha doesn't try to do to much here and gives a solid accounting of herself. The sex opens with missionary and Keisha is totally nude now so the boobs look impressive here moving every so slightly as Jason fucks her. Oh yeah! I think you'll enjoy the view when they work in the cowgirl shot and she grinds a little bit as well. This scene ends with a facial for Keisha who did very good for her first IR scene.\n\nLacey Johnson with Flash Brown:\n\nThis next scene offers up a classic IR scenario where you have a cute blonde taking on a big black cock. Lacey opens the scene wearing a blue dress that is quickly taken off and we check out her body. Then the go back to her clothed so she can be interviewed, lol. Don't get the girl naked only to put her back in clothes moments later, lol. Lacey gets naked again but not removing the dress fully as she did at the start. The tits are pulled out and she relaxes back into the couch and pulls her blue thong aside to masturbate. Flash joins her on the couch and like his fellow dudes before gets to take over using his fingers on Lacey's pussy while they kiss. Flash then moves down to bury his face in that cookie while Lacey symbolically places her hand on top of his head to keep him in place-- I don't think he was going anywhere! No ass licking in this scene but we do move on to Lacey sitting up and taking in Flash's cock. The side view was once again used well to present the blow job. Watching Lacey stroke the cock slowly while taking in that monster then going back to taking him in was a great shot and she offered up some hot eye contact also. Sex wise you have a short mish and they tried to do reverse but it didn't quite work so they went on to an open shot for doggiestyle with a hint of that teasing ass hole right there to see. Miss Johnson finishes the ride in cowgirl leading up to her pop shot which finds a home on her face and tongue.\n\nFarrah Flower with Flash:\n\nTime to close this IR show and this scene begins with Farrah flowering the plants and taking a drink of water. This cute red head is then fully nude all of a sudden!! Walking back outside we get some awesome shots of her standing then back inside she's got glasses on and a book in her hand. The quick hitting images were nice but they should have lasted longer because those last couple really showed how sexy Farrah looked and it was to bad they cut away so soon. Miss Flower also undergoes a short interview and during this she starts to show off that body again for us. Pink panties and no bra so those modest sized tits are pulled out over the top of her dress. Farrah then begins to tease us again playing with her pussy while the shot goes floor level, right where you'd want to be no doubt to face dive into her pussy! Farrah is also rocking sneakers here as you see them planted on the couch, I liked that. Flash is back for a second scene and the two kiss briefly before he takes the short trip down to eat her pussy. I do wish they would have taken the panties off though, just don't care a lot for the pull aside shot. Farrah then sits up to begin her oral on Flash's dick and I liked how his dick was nearly as big as her head, lol. Ok a slight exaggeration but you get the idea. It's so big-- gee we haven't heard that before, haha! Farrah strokes him and then eases that dick in while gazing up to Flash with that I'm taking all of you look in her eyes. As for the sex you see Farrah tested in mish and doggie along with a ride in reverse with a wide open shot that shows her off beautifully. A bit more in mish before Flash launches his load to Farrah's face and mouth, some of the cum dripping off her chin as she offers clean up too.\n\nExtras &amp; Final Thoughts:\n\nWell for a first time title this begins in very promising fashion and I hope to see more just like this coming soon from this studio. The first two scenes were slightly better I think as they also included the guys licking the girls ass along with some fine pussy eating. The girls in all four scenes offered up some super hot head before taking dick in their pussies. Kelly in that first scene also gives up her ass in a couple shots to Prince. Not a whole lot in the extras but you did get those short interviews with the girls so that is some of what you'd normally get in a BTS anyway. The action is quite good if you are looking for strong sex scenes that don't try and push the girls to hard. Just solid fucking with some attractive young girls, I can dig that. Stay tuned and hope this studio releases more titles like this, it's well worth checking out.\n\n\nCOVERS AND SCREENS FOUND HERE:        &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=7&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=7&lt;/a&gt;\n\nSHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!!","torrent":{"xt":"urn:btih:d28f40914edf8bb3b7389fb1c4af158109a64a03","amp;dn":"My+First+Interracial+%282014%29+-+Anal+Interracial+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d28f40914edf8bb3b7389fb1c4af158109a64a03","infoHashBuffer":{"type":"Buffer","data":[210,143,64,145,78,223,139,179,183,56,159,177,196,175,21,129,9,166,74,3]},"announce":[],"urlList":[]}}