{"title":"Mass Effect 2 *NEW* DLC Authorization Patch","uid":5489061,"size":567594,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d2d565779ea3e451ded5ef5a7c37498f6ed2ecb3&amp;dn=Mass+Effect+2+%2ANEW%2A+DLC+Authorization+Patch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"illiria","files":-1,"time":1270891768,"description":"This is my patch, it is based on Loghain's (if I'm not mistaken) original patcher, only mine ties itself to a game executable and silently patches the game before it starts. Which means that:\n\n1) You never have to re-patch the game;\n2) You never have to disconnect the internet;\n3) You will never need to install or run patch again. Install once, and it will work on all the future DLCs, forever (or till BioWare changes authorization system).\n\nAfter yopu have installed the patch, simply run the game from your typical Mass Effect 2 Desktop or Start Menu shortcut. Or, alternatively, using &quot;RunMassEffect2.exe&quot; file in game's &quot;Binaries&quot; folder. \n\nAnd no, you will not notice any difference in game launch time or anything at all, for that matter.\n\n***NOTE*** that original patcher requires Microsoft .NET Framework 3.5 to be installed on your system, otherwise the patcher will crash (stop responding).\n\nWork on different game RIPs is, of course, not guaranteed. Patch needs to read the game path from registry. If it was cut out of some RIP, my patch (and official patch, and DLCs) won't work.\n\nAlso ***THIS IS MY FIRST TORRENT***, so if it doesn't download, sorry, this is my first attempt. I've never created torrents before.\nIf it won't work, I'll try to get it up and running in a bit.\n\nOh, and &quot;Illiria&quot; account isn't what I typically use, so my future uploads (and I make many great patches, repacks, etc.) will likely be under a different account. Reference will be made.","torrent":{"xt":"urn:btih:d2d565779ea3e451ded5ef5a7c37498f6ed2ecb3","amp;dn":"Mass+Effect+2+%2ANEW%2A+DLC+Authorization+Patch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2d565779ea3e451ded5ef5a7c37498f6ed2ecb3","infoHashBuffer":{"type":"Buffer","data":[210,213,101,119,158,163,228,81,222,213,239,90,124,55,73,143,110,210,236,179]},"announce":[],"urlList":[]}}