{"title":"Kenny Garrett, John Scofield, Michael Brecker, David Friesen - O","uid":5666373,"size":303105269,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d30a6817c0ca593e980e59348a55941eac854bfc&amp;dn=Kenny+Garrett%2C+John+Scofield%2C+Michael+Brecker%2C+David+Friesen+-+O&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"mariorg","files":-1,"time":1278158309,"description":"This West Wind album, recorded at various studio sites in Seattle, WA, Portland, OR, Berkeley, CA, and New York City between 1987 and 1994, has Kenny Garrett as the leader, but a closer reveal might more accurately hand that title to David Friesen. The bassist is on five of the nine tracks, in duet performances with John Scofield, Michael Brecker, or Denny Zeitlin, while Garrett does lead the other four selections in larger ensemble contexts. Extraordinary musicianship is present throughout, making for an interesting musical experience, and with great appeal for fans who enjoy any of these talented musicians.\n\nLongtime friends Scofield and Friesen reunite for a somber take of &quot;Old Folks&quot; and a brighter &quot;True Blue,&quot; Brecker's tenor sax joins the bassist for a great, spirited version of the Sonny Rollins classic &quot;Airegin&quot; and the heavy duty, hip neo-bop original &quot;Signs &amp; Wonders,&quot; with the two occasionally merging in tandem phrases. A final track for bass and piano with the brilliant Zeitlin allows them to interpret the great Wayne Shorter composition &quot;Speak No Evil&quot; over nine minutes with a symmetry and balance unparalleled in most duet recordings, especially over long lengths of time via the wonderfully inventive acoustic keyboardist. Garrett leads a sextet with less dominant trombonist Julian Priester, a pronounced Bill Frisell and sublimated Robben Ford on electric guitars. They do the sly Duke Ellington evergreen &quot;Wanderlust&quot; proud under a deep bassline by Anthony Cox, while the outstanding track of the album &quot;The Oyster Dance&quot; slips from 7/8 time to fractured beats at will in a funky yet scattered method quite reminiscent of Thelonious Monk. Another quintet with Steve Nelson and Mulgrew Miller offers up a different sonic challenge, as they do pianist Miller's &quot;Wingspan&quot; in hard bop fashion with Garrett's alto alongside Nelson's vibraphone in fully charged bright moments, while &quot;Sonhos Do Brasil&quot; offers a contrasting, sleek, and softer bossa nova style, with percussionist Rudy Bird as special guest. The listening skills of the larger ensembles is quite evident, while Garrett -- at this time a 27-year-old phenom -- is still learning his craft but growing very quickly in the company of these well-chosen super-pro partners. Drummers Jerry Granelli and Tony Reedus are especially notable for rhythmically moving things along quite nicely for Garrett and friends. This material deserves high marks simply for the great musicians participating, and though uneven, retains full intrigue in one-of-a-kind session status, any of which could have been full-blown concepts -- one of which (sigh) might have been a Garrett-Brecker project that is not here.\n\n~ Michael G. Nastos, All Music Guide\nhttp://www.answers.com/topic/old-folks-2001-album-by-kenny-garrett-1","torrent":{"xt":"urn:btih:d30a6817c0ca593e980e59348a55941eac854bfc","amp;dn":"Kenny+Garrett%2C+John+Scofield%2C+Michael+Brecker%2C+David+Friesen+-+O","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d30a6817c0ca593e980e59348a55941eac854bfc","infoHashBuffer":{"type":"Buffer","data":[211,10,104,23,192,202,89,62,152,14,89,52,138,85,148,30,172,133,75,252]},"announce":[],"urlList":[]}}