{"title":"Neutrinopower and the Existance of Scalar Waves (Konstantin Meyl","uid":4333825,"size":659528664,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d3c76a0ff0badfaaa483fc0ae51df92e97d4e490&amp;dn=Neutrinopower+and+the+Existance+of+Scalar+Waves+%28Konstantin+Meyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"red_gonzo","files":1,"time":1218153697,"description":"This is Prof. Dr.-Ing. Konstantin Meyl&amp;#039;s mindblowing video lecture Neutrinopower and the Existance of Scalar Waves (2004) which discusses  the subject of scalar waves, neutrinos and how they can be used in various applications. Meyl describes how field vortices form scalar waves and how electromagnetic waves (transverse waves) and scalar waves (longitudinal waves) both should be represented in wave equations. For comparison, transverse EM waves are best used for broadcast transmissions like television, while longitudinal scalar waves are better for one-to-one communication systems like cell phones. Today cell phones use the wrong transverse broadcast which creates lots of completely unnecessary electromagnetic smog. He also presents the theory that neutrinos are scalar waves moving faster than the speed of light. When moving at the speed of light they are photons but when a neutrino is slowed to below the speed of light it simply becomes an electron. Neutrinos can oscillate between e- and e+. Fusion involves e-, and a lightning flash involves e+. Energy in a vortex acts as a frequency converter. The measurable mixture of frequencies is called noise. Meyl also mentions that the earth is expanding at a measured rate of 10 cm a year, therefore slowing the earth&amp;#039;s rotation. He also noted that the earth is now expanding at a quicker rate than it was 2,300 years ago and effects the length of our year. Meyl talked about Tesla&amp;#039;s scalar wave transmitter in Colorado Springs as he transmitted energy 26 miles at velocities greater than light. Tesla measured the resonance of the Earth at 12 Hz, the Schumann resonance of the Earth is 7.8 Hz. Meyl shows how one can calculate the scalar wave of the Earth to be 1.54 times the speed of light and presents a model that ties the expansion of the earth to be the result of the earth`s absorption of neutrino energy. The ramifications of this model are that neutrino energy can be tapped. He took this the next step and postulated that Zero Point Energy is neutrino power - energy from the field; available at anytime, and everywhere present. To show the place of neutrinos in conventional science, Meyl noted that the 2002 Nobel Physics prize was in regards to work on neutrinos. He also quoted a 1898 New York Times statement by Tesla that establishes Tesla, the &quot;father of free energy&quot; as also the discoverer of the neutrino. Professor Konstantin Meyl has written numerous books and given lectures at universities in Germany. Presented at ExtraOrdinary Technology Conference 2004 at Salt Lake City in USA before astonished audience who were amazed at what they were seeing. 65 min. long. A must see for everyone.\n\nVideo specs:\nVideo codec: divx, 720x480, 1200 bps\nAudio codec: mp3, 44kHz, Stereo\n","torrent":{"xt":"urn:btih:d3c76a0ff0badfaaa483fc0ae51df92e97d4e490","amp;dn":"Neutrinopower+and+the+Existance+of+Scalar+Waves+%28Konstantin+Meyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3c76a0ff0badfaaa483fc0ae51df92e97d4e490","infoHashBuffer":{"type":"Buffer","data":[211,199,106,15,240,186,223,170,164,131,252,10,229,29,249,46,151,212,228,144]},"announce":[],"urlList":[]}}