{"title":"Le Mystere des Voix Bulgares, vol. 1-4","uid":3832091,"size":272599756,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d3d3205a9293e402c188a93084a3577e866e4408&amp;dn=Le+Mystere+des+Voix+Bulgares%2C+vol.+1-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"trialanderror","files":-1,"time":1191694921,"description":"Le MystÃƒÆ’Ã‚Â¨re des Voix Bulgares \n(The Mystery of the Bulgarian Voices)\n\nEnchanting Ethno Music, hard to describe.  Listeners' responses instead:\n\nPurity\nA Rare Gem\nEerie Beauty\nAmazing Voices\nOutstanding Quality\nEthereal And Soulful\nEngaging And Meditative\nEnchanting And Culturally Rich\nOne Of The Most Engaging Piece Of Music\nThe Only Mystery Is Why More Have Not Heard These Voices\nLovely Dissonance And, In Spite Of Its Modernism, A Bearer Of Endangered Heritage\n\n\nThe ensemble:\n\nThe Bulgarian State Television Female Vocal Choir is an internationally renowned World Music ensemble that blends traditional six-part a capella repertoire with modern arrangements. It is most recognized under the recording name &quot;Le MystÃƒÆ’Ã‚Â¨re des Voix Bulgares.&quot; First created as the &quot;Bulgarian State Radio and Television Female Vocal Choir&quot; in Bulgaria in 1952 by Philip Koutev, &quot;the father of Bulgarian concert folk music&quot;, the choir is now under the direction of Dora Hristova.\n\nSingers are chosen from country villages for the beauty and openness of their voices, and they undergo extensive training in the unique centuries old singing style. Influenced by Bulgaria's Thracian, Byzantine and Ottoman history, their music is striking in its use of diaphonic singing and distinctive timbre, as well as its modal scales and dissonant harmonies (abundant second, seventh, and ninth intervals).\n\nThough the choir became widely known when the trend-setting English alternative record label 4AD released a pair of anthology albums in 1986 and 1988 with the now famous title Le MystÃƒÆ’Ã‚Â¨re des Voix Bulgares, their recordings date as far back as 1957. The first pressing of the Voix Bulgares album was the result of fifteen years of work by Swiss ethnomusicologist and producer Marcel Cellier and was originally released in 1975 on his small Discs Cellier label. Ivo Watts-Russell (founder of 4AD) was introduced to the choir from a third or fourth generation audio cassette lent to him by Peter Murphy, singer from the band Bauhaus. He became thoroughly entranced by the music, and tracked down and licensed the recordings from Cellier. The group has since performed extensively around the world to wide acclaim and were honored with a Grammy Award in 1989 for their second album.","torrent":{"xt":"urn:btih:d3d3205a9293e402c188a93084a3577e866e4408","amp;dn":"Le+Mystere+des+Voix+Bulgares%2C+vol.+1-4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3d3205a9293e402c188a93084a3577e866e4408","infoHashBuffer":{"type":"Buffer","data":[211,211,32,90,146,147,228,2,193,136,169,48,132,163,87,126,134,110,68,8]},"announce":[],"urlList":[]}}