{"title":"Gilisoft File Lock Pro v10.6.0","uid":15362757,"size":6640100,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d3f46eb6002199ba298214fb174f97dc6b339fa1&amp;dn=Gilisoft+File+Lock+Pro+v10.6.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ZarkBit","files":1,"time":1469046473,"description":"Gilisoft File Lock Pro v10.6.0\r\n\r\nExclusive Features of File Lock Pro\r\n\r\n\r\nHiding Files/Folders/Drives\r\nHide your private files/folders from local disk or external (USB) disk, completely invisible to anyone or any programs even under Windows Safe Mode. Make your private data unsearchable. All hidden files are never shown in search results.\r\n\r\nLocking Files/Folders/Drives\r\nPassword protect any type files/folders on local disk or external (USB) disk, password protect a folder so all new files added become password protected also.\r\n\r\nProtecting Files/Folders/Drives\r\nAfter protect the files/folders on local disk, people can read the write-protected files, but nobody can modify, delete (even shift delete), or rename it without password.\r\n\r\nFolder/Disk Monitoring\r\nMonitor a disk or a folder and its sub-folders when changing and writing or any operations or changes make by a user.\r\n\r\nLocking LAN Shared Folder\r\nWindows doesn't have a built in feature which allows you to lock access to a folder via a password. With GiliSoft File Lock Pro, you set passwords for your folder shared on network that limit access to them.\r\n\r\nFile Encryption/Portable Encryption\r\nEncrypt files and folders into GFL format or EXE format file with AES encryption algorithm. You can open EXE encrypted files or folders on other computer.\r\n\r\nFile Shredder/Disk Wiper\r\nFile Shredder has been developed as fast, safe and reliable tool to shred your company files. It also has integrated Disk Wiper which uses shredding algorithm to wipe unused disk space.\r\n\r\nAdvanced Settings\r\nExclude List - There are system files or program you can not lock, you can use this exclude list to filter out them. You can use Program Log to view all history of operations.\r\n\r\nSelf-protection Mode\r\nNobody can uninstall this software without password and you can hide this program in Invisible Mode. When someone enters wrong password more than 5 times, it will send alarm notifications to your pre-defined e-mail and the unknown login will be temporarily banned.\r\n\r\nEasy to Use\r\nWith it you can use one password to Protect File Folder &amp; Drive. You can lock a file or folder with windows explorer context menu or simply dragging and dropping it into the program’s main window. When forget password, you can find lost password with your pre-defined e-mail.\r\n \nhttp://gilisoft.com/product-file-lock-pro.htm","torrent":{"xt":"urn:btih:d3f46eb6002199ba298214fb174f97dc6b339fa1","amp;dn":"Gilisoft+File+Lock+Pro+v10.6.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3f46eb6002199ba298214fb174f97dc6b339fa1","infoHashBuffer":{"type":"Buffer","data":[211,244,110,182,0,33,153,186,41,130,20,251,23,79,151,220,107,51,159,161]},"announce":[],"urlList":[]}}