{"title":"Richard Phillips - A Captain's Duty- Somali Pirates, Navy SEALs,","uid":9011754,"size":483145,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d463541d02105174e2d2c67f526c58fc72cc835c&amp;dn=Richard+Phillips+-+A+Captain%27s+Duty-+Somali+Pirates%2C+Navy+SEALs%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"420weedman","files":1,"time":1381116498,"description":"It was just another day on the job for fifty-three-year-old Richard Phillips, captain of the Maersk Alabama, the United States-flagged cargo ship which was carrying, among other things, food and agricultural materials for the World Food Program. That all changed when armed Somali pirates boarded the ship. The pirates didn't expect the crew to fight back, nor did they expect Captain Phillips to offer himself as hostage in exchange for the safety of his crew. Thus began the tense five-day stand-off, which ended in a daring high-seas rescue when U.S. Navy SEALs opened fire and picked off three of the captors.\n\n&quot;It never ends like this,&quot; Captain Phillips said.\n\nAnd he's right.\n\nA Captain's Duty tells the life-and-death drama of the Vermont native who was held captive on a tiny lifeboat off Somalia's anarchic, gun-plagued shores. A story of adventure and courage, it provides the intimate details of this high-seas hostage-taking--the unbearable heat, the death threats, the mock executions, and the escape attempt. When the pirates boarded his ship, Captain Phillips put his experience into action, doing everything he could to safeguard his crew. And when he was held captive by the pirates, he marshaled all his resources to ensure his own survival, withstanding intense physical hardship and an escalating battle of wills with the pirates. This was it: the moment where training meets instinct and where character is everything. Richard Phillips was ready.\n\n&quot;I share the country's admiration for the bravery of Captain Phillips and his selfless concern for his crew. His courage is a model for all Americans.&quot;\n-President Barack Obama\n\nAdapted by Billy Ray into the movie Captain Phillips starring Tom Hanks and directed by Academy Award nominee Paul Greengrass (United 93, The Bourne Supremacy, The Bourne Ultimatum)\nGenre: Biographies/Memoirs","torrent":{"xt":"urn:btih:d463541d02105174e2d2c67f526c58fc72cc835c","amp;dn":"Richard+Phillips+-+A+Captain%27s+Duty-+Somali+Pirates%2C+Navy+SEALs%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d463541d02105174e2d2c67f526c58fc72cc835c","infoHashBuffer":{"type":"Buffer","data":[212,99,84,29,2,16,81,116,226,210,198,127,82,108,88,252,114,204,131,92]},"announce":[],"urlList":[]}}