{"title":"Stiff: The Curious Lives of Human Cadavers","uid":4978712,"size":913145,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5216b6f7ce7552e7b19eaa7c165d816544ba687&amp;dn=Stiff%3A+The+Curious+Lives+of+Human+Cadavers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":-1,"time":1246147221,"description":"&quot;An oddly compelling, often hilarious exploration of the strange lives of our bodies postmortem.\n\nFor two thousand years, cadavers -- some willingly, some unwittingly -- have been involved in science's boldest strides and weirdest undertakings. They've tested France's first guillotines, ridden the NASA Space Shuttle, been crucified in a Parisian laboratory to test the authenticity of the Shroud of Turin, and helped solve the mystery of TWA Flight 800. For every new surgical procedure, from heart transplants to gender reassignment surgery, cadavers have been there alongside surgeons, making history in their quiet way.\n\nIn this fascinating, ennobling account, Mary Roach visits the good deeds of cadavers over the centuries-from the anatomy labs and human-sourced pharmacies of medieval and nineteenth-century Europe to a human decay research facility in Tennessee, to a plastic surgery practice lab, to a Scandinavian funeral directors' conference on human composting. In her droll, inimitable voice, Roach tells the engrossing story of our bodies when we are no longer with them.&quot;\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:d5216b6f7ce7552e7b19eaa7c165d816544ba687","amp;dn":"Stiff%3A+The+Curious+Lives+of+Human+Cadavers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5216b6f7ce7552e7b19eaa7c165d816544ba687","infoHashBuffer":{"type":"Buffer","data":[213,33,107,111,124,231,85,46,123,25,234,167,193,101,216,22,84,75,166,135]},"announce":[],"urlList":[]}}