{"title":"World Psychedelic Classics from West Africa [FLAC] TQMP","uid":6571342,"size":410992410,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d5982112164ace0d48e1d3f9c1587f50715b46dd&amp;dn=World+Psychedelic+Classics+from+West+Africa+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"pastafari","files":-1,"time":1311984319,"description":"World Psychedelic Classics 3: Love's a Real Thing - The Funky Fuzzy Sounds Of West Africa\n2004\n\nThis is a mind-blowing collection of West African tracks that will kick you out of your chair ;) Among the irresistible Super Eagles, you'll find familiar names like Orchestre Poly-Rythmo de Cotonou and Manu Dibango. As it usually happens when dealing with poorly documented music, Lusafrica attributes a misspelled track 6 to No. 1 de No. 1, but there's was no such a band. That's actually an album title by a band named Orchestre Number One de Dakar, also seen as Starband Number One de Dakar in Sterns catalogue and LPs issued during that period. Among the great bands from Mali, there's Orchestre Regional de Kayes featured here. And If you haven't heard Sorry Bamba here's your chance for an introduction. He led the famous Orchestre Kanaga de Mopti. Previously his music was very hard to find but now Thrill Jockey and Kindred Spirits have reissued some of his works. I've listened to Vol. 1 1970-79 and it's a total knockout.\n\nI've scanned the booklet so you can check out all the related info provided there. Enjoy!\n\n* * * * * * * * * * * * * * * * * * *\n\nThese twelve astonishing tracks are drawn from a broad spectrum of early 70s West African psychedelic classics. Yet the fact that they scarcely registered on the Richter scale of contemporary underground music must surely be one of the greatest ironies of modern popular music, given that western counterculture drew so heavily on the musical, aesthetic and visual traditions of Africa.\n\nMusically, the transatlantic links are strong and obvious; from the urban black American soul and funk of James Brown, through the West Coast sounds of Hendrix, to the deeper grooves of Cuban rumba and Latin percussion. During these years a nod in the direction of Detroit, Los Angeles or Havana was still more important than learning the latest lines from Lagos, Kinshasa or Accra.\n \nBut by the early 70s the transition from the direct imitation of western pop was well underway, and if the period of 'authenticite' had not yet arrived, there was certainly sufficient experimentation by a younger generation of musicians, producers and studio engineers to mark out this era as something special. This compilation represents a unique period of musical cross-fertilization as the influence of the Bearles and Elvis steadily gave way to that of Franco and Fela.\n \nYet, in purely musical terms, it was not a simple, oneÃ‚Â­dimensional, transition from foreign to local styles. For while the same external forces were influential across the region, they interacted with an enormous variety of indigenous traditions. In this respect, the connections remain more in the ear of the listener than in the minds of the musicians and producers, and marked a far less sudden rupture with the past than in the West.\n\nBy the late 60s the earlier synthesis of western popular music and African idioms, purveyed by such luminaries as E.T. Mensah, Bobby Benson, the Star Band and Alfa Jazz was wearing thin. A younger generation of musicians, more confident and self-assured in its African roots, with plenty to react against, was establishing itself as the authentic voice of African rebellion and black power.\n\nAnglophone West Africa, historically more open 10 American influences, Geraldo Pino's Heartbeats led the way, followed by Gambia's Super Eagles, Ghana's Psychedelic Aliens, Fela's Koola Lobitos and Segun Buckner's Soul Assembly.\n \nMeanwhile, in the French speaking countries, innovators like Orchestre Poly-Ritmo from Benin, Manu Dibango from Cameroon and a dutch of state-sponsored bands from Guinea seemed to jump a generation by moving straight from boleros, cha chas and foxtrots to the heavily Latin influenced sounds of the Sahel. By the end of the decade the 'black-roots modernisers' were on the move across the Region.\n\nBoth aesthetically and visually, the sensitivities of the new generation of western hippies and soul brothers reflected a variety of non-western influences. These, in turn, resonated throughout West Africa as flared trousers, headÃ‚Â­bands, necklaces, beads, day-glo colours, afro hairstyles, platform shoes and dashikis filtered through the coastal metropolitan capitals to the remotest inland villages.\n\nAcross the region, young people now felt comfortably hip in their traditional dress. 'London' suits, never much of a style to aspire to, went by the board as the 'afro-boys' and 'Santana-men' seized centre stage, disparaging older more conservative styles and music as 'colo' and 'kyenkyernna'\n \nAs in the West, the late 1960s was a period of tumultuous political and generational change in West Africa. In addition to the global issues of Vietnam, South Africa and third world revolution, young West Africans now began to call attention to more local concerns as the early optimism of the nationalist struggle gave way to military government, corruption and dashed hopes. For the first time in modern history, as new ideas bounced around the world at an unprecedented speed, a generation gap appeared in Africa.\n \nStudents, now enrolling in ever-larger numbers in the new high schools and universities of West Africa, perhaps unsurprisingly, led thjs new musical protest movement. \nHalls of residence in Legon and Kumasi, Ife and Ibadan, Fourah Bay and Yaounde provided the catalyst for musical experimentation, while the rapidly expanding urban centres provided ever larger and more sophisticated audiences.\n \nBy the late 1 960s, the West African club scene, typified by such legendary venues as Weekend in Havana and the Tiptoe in Accra, the African Club in Lagos and the Rose Pavilion in Dakar presented a truly urban, good-time weekend dance scene. The music was electric, amplified and unambiguously youthful, bringing, in time, a touch of modernity to even the most remote villages. This was new music for a new generation.\n \nThe technology of making music similarly leapt forward in this period of rapid social, and economic change. New studios sprang up in the coastal capitals as producers and entrepreneurs such as Faisel Helwani, Dick Essiebons, King Bruce and even Ginger Baker embraced the aspirations of the new generation and smoothed their way by supporting new crossover and fusion experiments, including the introduction of keyboards and effects to modern African music.\n\nCheap record players and imported vinyl also started to penetrate the more conservative rural hinterland, allowing teenagers to compete with middle class, middle-aged, farmers in setting the tone and direction of West African musical consumerism.\n \nImported psychedelic music also provided new insights into how the rest of the world was thinking, inspiring a wave of creative, cheap and cheerful' cover designs and providing an opportunity for younger graphic artists, such as Lemi Ghariokwu, (the designer of the Fela Kuti covers), to display their talents. \n\nThis new generation of West Africans took to psychedelia like ducks to water. All the essential ingredients existed in abundance in the burgeoning metropolitan capitals of West Africa: centuries of psychotropic experience, the strongest source music on the planet, decades of adapting western pop to local tastes and an affinity with anti-imperialist ideology. Add to this heady brew a cultural philosophy which actively promoted music, a relaxed attitude to sex and the day-glo visual imagery of daily life, almost guaranteed that West Africans would embrace funk, soul and acid rock as something familiar if not entirely home-grown.\n\nThirty years on we can only speculate what impact the atmospheric and mesmeric rhythms of the Sahel, allied with the funkier sounds of the coastal capitals, would have had on a western generation being weaned on mind altering substances and a new appreciation of non-mainstream music. These dozen tracks are representative of the African beats missing from Monterey and which Woodstock lacked at a time when a global perspective was becoming more important than ever in the heart of corporate America.\n-- CD booklet notes\n\n* * * * * * * * * * * * * * * * * * *\n\nTrack List\n\n01 - Orchestre Poly-Rythmo de Cotonou Dahomey - Minsato Le, Mi Deyihome\n02 - Super Eagles - Love's a Real Thing\n03 - Moussa Doumbia - Keleya\n04 - Manu Dibango - Ceddo End Title\n05 - Sorry Bamba - Porry\n06 - Orchestre Number One de Dakar - Guajira Ven\n07 - William Onyeabor - Better Change Your Mind\n08 - Ofo &amp; The Black Company - Allah Wakbarr\n09 - Gasper Lawal - Awon-Ojise-Oluwa\n10 - Bunzu Sounds - Zinabu\n11 - Tunji Oyelana and the Benders - Ifa\n12 - Orchestre Regional de Kayes - Sanjina\n\n* * * * * * * * * * * * * * * * * * *\n\nArtwork, EAC log and CUE sheet included.\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt;\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;","torrent":{"xt":"urn:btih:d5982112164ace0d48e1d3f9c1587f50715b46dd","amp;dn":"World+Psychedelic+Classics+from+West+Africa+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5982112164ace0d48e1d3f9c1587f50715b46dd","infoHashBuffer":{"type":"Buffer","data":[213,152,33,18,22,74,206,13,72,225,211,249,193,88,127,80,113,91,70,221]},"announce":[],"urlList":[]}}