{"title":"Infernal Restraints--MILF Tears  Simone Sonay  Matt Williams MP","uid":10162571,"size":990556201,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d59a4478e2f710f08e86e9dee2528ee860a42e2a&amp;dn=Infernal+Restraints%5C--MILF+Tears++Simone+Sonay++Matt+Williams+MP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"merzedes","files":-1,"time":1400319862,"description":"MILF Tears | Simone Sonay | Matt Williams\n\n \n\nMay 16, 2014\n\n\n \n\nMP4 only.\n\n \n\nSimone Sonay is a busty, fit and toned MILF that loves the the dick. She craves it. Too bad for her today is not about the dick. Today is about putting this cougar through the Infernalrestraints experience. It isn't going to be easy for her, Simone is going to earn her orgasms the hard way. Just how bad does she want it?\n\n \n\nBound on a wooden bondage device that keeps her legs spread wide, we cut off her panties to see what we are working with. Simone gets pogoed and vibrated just enough to give her an edge. She will need all she can get for what we are about to put her through. Shifting her into stocks, Simone is completely immobilized. Her hands are stuck in our custom made metal hand cans, her legs are bound by metal pipes. We add a stocking hood and a extra large ring gag. Simone is finally starting to grasp what true bondage is. Nipple clamps and a nose hook reinforce her total helplessness. This swinger is reduced to a play toy for our desires.\n\n \n\nMoving our shaken MILF onto a metal frame, we lash her down with leather belts to properly display that body. A big black ballgag is wedged deep inside that huge mouth of hers. After a through coating of baby oil her body is gleaming. Someone this lush must be taken down a peg or two and we introduce her to electricity. Simone is terrified and rightly so. Her fear makes her give up sweet sweet MILF tears. This is much harder then just lying back and getting fucked, which is our slutty cougar's stock in trade. She has suffered so sweetly we must reward her a little and we bring in the vibrator for a few well deserved orgasms. Simone is blasted out of her mind, dazed and confused, unable to even recall her own name. We haul this throughly wrecked MILF up on her wire frame, leaving her hanging from the rafters. She sways gently, totally destroyed. We might be back to play with her again later if we feel so inclined... \n\n \n\nScreens\n &lt;a href=&quot;\nhttp://infernalrestraints.com/device/bondage/2014/05_16ssonay/InfernalRestraints-Simone-Sonay-Matt-Williams-MILF-Tears.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://infernalrestraints.com/device/bondage/2014/05_16ssonay/InfernalRestraints-Simone-Sonay-Matt-Williams-MILF-Tears.php&lt;/a&gt;\n\n \n\n14 000 down, but how much more to come ?? You decide ;) \n\n \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\n \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n \n\nAny Questions ?? Read our FAQ!!\n\n \n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\n \n\nCheers  :-)  \n","torrent":{"xt":"urn:btih:d59a4478e2f710f08e86e9dee2528ee860a42e2a","amp;dn":"Infernal+Restraints%5C--MILF+Tears++Simone+Sonay++Matt+Williams+MP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d59a4478e2f710f08e86e9dee2528ee860a42e2a","infoHashBuffer":{"type":"Buffer","data":[213,154,68,120,226,247,16,240,142,134,233,222,226,82,142,232,96,164,46,42]},"announce":[],"urlList":[]}}