{"title":"Stardock Decor8 v 1.0 Repack by PainteR","uid":8023279,"size":35097922,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d65bad2377cdce67d79e486f79c654edbeed598b&amp;dn=Stardock+Decor8+v+1.0+Repack+by+PainteR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Purplebeanz","files":-1,"time":1358255818,"description":"******** Stardock Decor8 v 1.0 RePack by PainteR ********\n\n \n\nIn Windows 8, Microsoft has provided a rather broad possibilities for personalization of the new interface: You can select one from their color schemes, as well as select one of the preset watermarks home screen. But to many, and this was not enough - set your own background image and create your own color scheme, you can run Decor8 from Stardock.\n\nStardock company has many years experience in software for Windows, especially for Green space design and interface of the operating system, and therefore its products are a cut above the usual tools of independent developers.\n\nDecor8 can replace the background image on one of the available complete proposed program developers, as well as user-selected. Moreover image can be automatically replaced by the desired amount of time, you can adjust the scrolling background regarding tiles screen (parallax effect), as well as the transparency of the image relative to the main interface colors.\n\nColor scheme can be selected from those that do exist by default, create your own, or automatically generate primary color background image. In addition, the color scheme can be applied to the side of the new interface. As an added bonus proposed reduction is the number of lines in which the tiles are the home screen (you can not increase their number, it is strictly defined by the system).\n\nWindows 8 limits your start screen customization options to only a few provided background images and a few pre-defined color schemes. Decor8 removes these limitations and provides the freedom to personalize your start screen with your own images and colors.\n\nBackground Images\n- Choose from more background images to personalize your start screen.\n- Add your own photos and images\n- Select multiple images to create a custom slideshow\n- Randomize background images in timed intervals for a fresh look\n- Apply effects to scroll, fade, blur, recolor and add contrast to your background images\n- Choose your own image for your lock screen background\n\nColor Schemes\nDecor8 will automatically create a color scheme to match each of your background images. Or you can customize the color scheme, it's up to you. Custom color schemes can also be applied to your charms bar.\n\nCustomization\nControl how many rows of tiles are available on your start screen.\n\nKey features:\n- Contains the English version and localized Russian.\n- Fully automatic  deleting  activation.\n\nInformation about the program :\nName:  Stardock Decor8\nVersion:  1.0\nYear:  2012\nPlatform:  Windows 8\nLanguage:  English and Russian\nCrack :  Integrated\n\n","torrent":{"xt":"urn:btih:d65bad2377cdce67d79e486f79c654edbeed598b","amp;dn":"Stardock+Decor8+v+1.0+Repack+by+PainteR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d65bad2377cdce67d79e486f79c654edbeed598b","infoHashBuffer":{"type":"Buffer","data":[214,91,173,35,119,205,206,103,215,158,72,111,121,198,84,237,190,237,89,139]},"announce":[],"urlList":[]}}