{"title":"Diane Arbus","uid":5718060,"size":36254491,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d69df9b4e75a9761283a074cf2bbff11e047ff9d&amp;dn=Diane+Arbus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"acorn2oaks","files":1,"time":1280184016,"description":"Muscle men, midgets, socialites, circus performers and asylum inmates: in the 1950s and '60s, photographer Diane Arbus (1923-1971) cast her strong eye on them all, capturing them as no one else could. Her documentary-style photos of society's margin-walkers were objective and reverential, while she often portrayed so-called normal people looking far more freakish than the freaks. Her powerful work was well-received in its day. Arbus received Guggenheim Fellowships in 1963 and 1966 and was included in a major show at MOMA in 1967. But her work entered the realm of near-myth after her 1971 suicide. \n\nPosthumously cast as everything from patron saint of the underdog to a crass exploiter of the mentally challenged, Arbus has curiously never had a large retrospective until the show Revelations was organized by Arbus' family and SF MOMA. The accompanying catalogue is an oversized, sumptuous, beautifully printed tome. It includes all of the artist's iconic photographs as well as many that have never been publicly exhibited, including many pages of contact sheets, journal entries, and family snapshots. This work is so strong, it's mind-blowing. The giant in his apartment with his parents looks absolutely regal, his parents sad and confused. Are those crazy people always so happy? And what to make of this moment of extreme tenderness between a dominatrix and her client? This is a book worth hours of your time.","torrent":{"xt":"urn:btih:d69df9b4e75a9761283a074cf2bbff11e047ff9d","amp;dn":"Diane+Arbus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d69df9b4e75a9761283a074cf2bbff11e047ff9d","infoHashBuffer":{"type":"Buffer","data":[214,157,249,180,231,90,151,97,40,58,7,76,242,187,255,17,224,71,255,157]},"announce":[],"urlList":[]}}