{"title":"JP Software Take Command v20.00.18","uid":15811248,"size":35639547,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d72d1f790a078c49f6f24e620979a4d474cf279e&amp;dn=JP+Software+Take+Command+v20.00.18&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"LxByte","files":1,"time":1473636865,"description":"JP Software Take Command v20.00.18\r\n\r\n\r\nTake Command is a comprehensive interactive GUI and command line environment that makes using the Windows command prompt and creating batch files easy, fasterm and far more powerful. Take Command displays your command line applications in tabbed windows, with optional File Explorer-style integration for a visual look at your directories. Take Command includes hundreds of major enhancements to CMD commands such as COPY, DEL, DIR, and MOVE, and adds 170+ new commands, 640+ internal variables and functions, a batch file IDE / debugger, advanced command line editing and programmable tab completion, and thousands of other features.\r\n\r\nIn addition, Take Command is a powerful batch file programming tool, including an integrated IDE with a sophisticated editor and batch debugger. Take Command offers extensions such as DO loops, SWITCH statements, error and exception handling, system monitoring, third-party plugins, and more than 640 built-in variables and functions.\r\n\r\n\r\nBenefits\r\n\r\nTake Command combines the power of the command line with the ease of use of Explorer. You can manipulate files in the tabbed command prompt windows and graphically see the results.\r\nTake Command is compatible with your existing Windows command prompt commands and CMD batch files, while adding thousands of new features. (And Take Command runs your CMD batch files faster than CMD!)\r\nThe integrated and familiar environment means you are immediately more productive with your interactive command prompt and batch file programming tasks.\r\nThe consistent command prompt commands syntax reduces your learning and development time.\r\nThe comprehensive help (including context-sensitive popup help for command line commands syntax), speeds your development time and reduces syntax errors.\r\nCreate and debug your batch scripts in a fraction of the time with the integrated editor and batch file debugger.\r\nIt's fast - 20-200% faster at displaying output than the standard CMD command prompt.\r\nTake Command is fully customizable, including multiple themes, colors, menus, toolbars, and windows.\r\nYou can redefine your commands through aliasing, create new commands and functions for your regular tasks, and assign frequently used commands to a single keystroke.\r\nThe user interface is available in English, French, German, Italian, Russian, and Spanish. (Online help is currently in English only.)\r\n\r\nOfficial Website: https://jpsoft.com/take-command-windows-scripting.html","torrent":{"xt":"urn:btih:d72d1f790a078c49f6f24e620979a4d474cf279e","amp;dn":"JP+Software+Take+Command+v20.00.18","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d72d1f790a078c49f6f24e620979a4d474cf279e","infoHashBuffer":{"type":"Buffer","data":[215,45,31,121,10,7,140,73,246,242,78,98,9,121,164,212,116,207,39,158]},"announce":[],"urlList":[]}}