{"title":"Black Panther v4 01-41 + Ex (2005-2008|Digital|AnPymGold-Empire)","uid":10000378,"size":1099981959,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d7ef855f3b4002dd2e2a6431f59ad7837e995893&amp;dn=Black+Panther+v4+01-41+%2B+Ex+%282005-2008%7CDigital%7CAnPymGold-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"VikTSlick","files":-1,"time":1397975889,"description":"Reginald Hudlin pens this excellent modern take on the Black Panther, T'Challa, and a variety of artists including John Romita Jr. join him throughout the volume. This set of tales firmly re-characterizes T'Challa for the modern age, shows his relationship with Storm, his roles as King and a member of the Avengers, his defense of Wakanda as it is beset by attacks from many angles and takes us through the Civil War and into Secret Invasion among crossover events. Promotional info for the first collected edition - &quot;Deep in the heart of Africa is Wakanda, a technologically advanced civilization of great power and mystery. It's warrior-king is T'Challa, the latest in a famed family line, and the great hero known worldwide as the Black Panther. Despite the futile defeats of the past, outsiders are once more assembling to invade Wakanda and plunder its riches. Leading this brutal assault is Klaw, a deadly assassin with the blood of T'Challa's murdered father on his hands. Klaw brings with him a powerful army of super-powered mercenaries, all hell-bent on raining death and destruction on this pristine land. Even with Wakanda's might and his own superhuman skills, can the Black Panther prevail against such a massive invading force?&quot;\n\nThese are the new digital rips for all 41 issues of the series run, by AnPymGold-Empire. Also included are the 2008 Annual by FB-DCP and the special Saga digital-exclusive recap of the Black Panther's history, by PeteThePIPster. Thanks to all the scanners for their hard work, please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:d7ef855f3b4002dd2e2a6431f59ad7837e995893","amp;dn":"Black+Panther+v4+01-41+%2B+Ex+%282005-2008%7CDigital%7CAnPymGold-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7ef855f3b4002dd2e2a6431f59ad7837e995893","infoHashBuffer":{"type":"Buffer","data":[215,239,133,95,59,64,2,221,46,42,100,49,245,154,215,131,126,153,88,147]},"announce":[],"urlList":[]}}