{"title":"Supernanny Season 2","uid":4711586,"size":6122696704,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d8cd8a5f65aaa4ab98db5333661f2003f2615b9b&amp;dn=Supernanny+Season+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"umunda","files":17,"time":1234043723,"description":" &lt;a href=&quot;http://www.supernanny.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.supernanny.com/&lt;/a&gt;\n\nHailed by the New York Times as &quot;fascinating&quot; and &quot;required viewing,&quot; praised by Oprah Winfrey, David Letterman and Kelly Ripa, acclaimed by such publications as Newsweek, Hollywood Reporter and The New Yorker, and lauded by parents and nannies across America, &quot;Supernanny&quot; is a hit. Jo Frost, as Supernanny, can tame the wildest toddler, soothe the savage six-year-old and get the most difficult child to overcome problems with behavior, sleep, mealtime, potty training and other challenges that have vexed parents around the world for centuries. After just three episodes of the show aired in the U.K. in summer 2004, Jo Frost became Britain's hottest new TV star and a godsend to desperate parents who were dazzled by her amazing results with unruly children. She debuted in America in early 2005 and captivated Americans as well with her practical, no-nonsense style, honed over 20 years of nannying. &quot;Supernanny&quot; is now an international phenomenon; it airs in 172 territories, almost all of them with Frost as Supernanny. The series was nominated for a People's Choice Award, and fans have embraced her three books, propelling them to the bestseller lists: Supernanny: How to Get the Best from Your Children; Ask Supernanny and Jo Frost's Confident Baby Care: What You Need to Know for the First Year from America's Most Trusted Nanny.\n\nIn each episode of the television series, this modern-day Mary Poppins observes how the parents handle their day-to-day obstacles with their children. Once she's assessed the pitfalls, she works with the parents, instilling her tried-and-true methods for transforming unwanted behavior. Then, after demonstrating just how well the new style will work and getting unbelievable results from the children, the parents must fly solo with the Supernanny techniques. For several days they try to implement Jo's suggestions, and she revisits them at the end of the program to help keep them on track for the future.\n\nHer simple methods stress consistency, communication and reasonable consequences for poor behavior, all delivered with loving firmness. She emphasizes the importance of spelling out the new rules of the household to children in advance, as well as explaining the consequences for infractions. She also candidly points out to parents where they need to be more decisive, more flexible or even how they may need to adjust their expectations of a child's readiness for certain behaviors. For example, graduating a child to a seat at the dinner table instead of a high chair may be long overdue and provide an easy fix to mealtime misbehavior. When parents witness Jo's results and -- even better -- achieve them on their own, they're true believers in the Supernanny way. Best of all, children and adults can enjoy lasting benefits of a more harmonious family life.","torrent":{"xt":"urn:btih:d8cd8a5f65aaa4ab98db5333661f2003f2615b9b","amp;dn":"Supernanny+Season+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8cd8a5f65aaa4ab98db5333661f2003f2615b9b","infoHashBuffer":{"type":"Buffer","data":[216,205,138,95,101,170,164,171,152,219,83,51,102,31,32,3,242,97,91,155]},"announce":[],"urlList":[]}}