{"title":"Notre Musique (Our Music) - Jean Luc Godard (2004)","uid":3413624,"size":733219063,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d8cf05135fcb0442ad0ef510054a4cb8ce251c51&amp;dn=Notre+Musique+%28Our+Music%29+-+Jean+Luc+Godard+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"alunte","files":3,"time":1132880383,"description":"DVDRIP - AVI 700mb\nSubtitles - English; Portuguese-BR\n\nThe movie is divided into three kingdoms: 1 - Enfer, 2 - Purgatoire and 3 - Paradis. The first part of the movie consists in a collage of various war images and situations accompanied by a wonderful music. Some very clever sentences are said off screen, too. &quot;Death can be seen in two different ways: as the possible of the impossible or as the impossible of the possible&quot;. The second part shows us the crossed stories of some peoples meeting in Sarajevo for the Book Weeks: J. L. Godard himself, a young Israeli Journalist, a Palestinian and a Spanish poets, A young Hebrew girl with Russian origins, a Hebrew translator with Egyptian origins, some American natives, some natives of Sarajevo and other people speak about their experiences, they wishes, war, peace, poetry, history, life, death, cinema, reconciliation. J.L. Godard gives a lecture to some cinema students and shows them photographs. The third part takes place in paradise and shows us a girl who has been killed in a cinema by Israeli snipers who suspected her of being a terrorist ready to kill herself. She had a red bag with her and people thought it contained a bomb. In fact there were just books in it. The girl wanders near a river and encounters an American marine. Some boys are playing and reading books. Paradise is fenced and guarded by U.S. military forces.\n\nThis movie is truly amazing. In fact it is not just a film, it is poetry. In moments like these when cinema industry is dominated by fast, brainless, action-packed movies, it is a real pleasure and mind-freeing experience to see something that beautiful and poetic. This was presented this year in Cannes and didn't get much attention if I remember right. A journalist of &quot;Le Nouvel Observateur&quot; who usually gives very good advices, this time got it wrong saying that &quot;Notre Musique&quot; is a senile work. Not at all. It's the work of a director who has only improved with years and who has reached total serenity and great wisdom. This film does not give you ready-made, simple answers to common questions, it gives you some points which are incredibly interesting to develop and think about. Sarajevo is the ideal place where peoples, histories and cultures mix and sometimes sadly clash. When the young girl is asked &quot;Why Sarajevo?&quot; the touching answer she gives is &quot;Because Palestine. I come from Tel Aviv and wanted to see a place where people can get along in harmony&quot;. There's so much to think about this movie. And everything is filmed so well, so limpidly, with such a mastery, you can't stop staring at the screen. &quot;Godard is the only film director in the world&quot;","torrent":{"xt":"urn:btih:d8cf05135fcb0442ad0ef510054a4cb8ce251c51","amp;dn":"Notre+Musique+%28Our+Music%29+-+Jean+Luc+Godard+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8cf05135fcb0442ad0ef510054a4cb8ce251c51","infoHashBuffer":{"type":"Buffer","data":[216,207,5,19,95,203,4,66,173,14,245,16,5,74,76,184,206,37,28,81]},"announce":[],"urlList":[]}}