{"title":"New Musik - From A to B (Straight Lines) 1980","uid":4154931,"size":128544395,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d8d33614b61414336db5d5ee0bdc249869096668&amp;dn=New+Musik+-+From+A+to+B+%28Straight+Lines%29+1980&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"80zforever","files":-1,"time":1209108032,"description":"New Musik's debut album, From A to B, is one of the best and most influential electronic LPs of the 80s. Its keyboards may sound dated, but there's a freshness to these charming, unpretentious songs that hasn't been spoiled by technological advances in computerized instrumentation. Many new wave revivalists have attempted to capture the nerdy vocals and quirky synthesized bleeps of From A to B and failed. This record is a product of its time, recorded when keyboards were viewed as eventually replacing guitar and bass as rock &amp; roll tools. While many synth pop groups became mired in existential woe to show that they had emotions underneath the layers of Casio hiccups, New Musik is having a blast on From A to B. &quot;With robot precision/We're gonna be doin' just fine,&quot; sings Tony Mansfield (guitars, keyboards, vocals) with geek sincerity on the exhilarating &quot;Straight Lines.&quot; Like Kraftwerk, New Musik uses keyboards to create moods and not just to make feet move. However, From A to B is more accessible than any Kraftwerk album. The tracks on the LP are structured like traditional pop songs with choruses catchy enough for the Beatles, a band whom New Musik would cover later on 1982's Warp. There are no love ditties, but tracks like the soaring &quot;On Islands&quot; generate warmth and the group often utilizes acoustic strumming to prevent everything from seeming too mechanical. &quot;Science&quot; is nerdy sci-fi dance music years before Thomas Dolby. The CD reissue adds three bonus tracks &quot;Missing Persons,&quot; &quot;She's a Magazine,&quot; and Sad Films&quot; that make the album even more appealing. Somehow, the archaic synthesizers aren't embarrassing; instead, the years have preserved their coolness. \n\n\nTracks\n \n01\tStraight Lines\n02\tSanctuary\n03\tA Map Of You\n04\tScience\n05\tOn Islands\n06\tThis World Of Water\n07\tLiving By Numbers\n08\tDead Fish (Don't Swim Home)\n09\tAdventures\n10\tThe Safe Side\n11       Missing Ppersons\n12       SheÃ‚Â´s A Magazine\n13       Sad Films\n \n \n\n\t \n\t \n\n\t \n\t \n\n\t \n\t \n\n\t\n","torrent":{"xt":"urn:btih:d8d33614b61414336db5d5ee0bdc249869096668","amp;dn":"New+Musik+-+From+A+to+B+%28Straight+Lines%29+1980","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8d33614b61414336db5d5ee0bdc249869096668","infoHashBuffer":{"type":"Buffer","data":[216,211,54,20,182,20,20,51,109,181,213,238,11,220,36,152,105,9,102,104]},"announce":[],"urlList":[]}}