{"title":"Elliott Kay - Poor Man's Fight [1-2]","uid":13522176,"size":428489610,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d8dc988c693139a441dfda2837582d3e78d29252&amp;dn=Elliott+Kay+-+Poor+Man%27s+Fight+%5B1-2%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Cybotage","files":2,"time":1455372247,"description":"Poor Man's Fight (Poor Man's Fight #1)\r\n\r\nHigh school senior Tanner Malone has bombed the Test, a high-stakes exam that establishes how much he owes for his corporate-funded education. Burdened by a crushing debt that rules out college, Tanner enlists in the navy of Archangel, a star system with four terraformed worlds. But he hasn't factored in the space pirates.\r\n\r\nJust as Tanner begins basic training, the government ramps up its forces to confront a band of rowdy raiders who are wreaking havoc in the void. Led by complex and charismatic Captain Casey, the outlaws love a little murder and mayhem, but they are also democratic, egalitarian, and devoted to freeing each new recruit from debt and corporate oppression.\r\n\r\nAssigned to the front lines, Tanner soon finds himself caught in the crossfire between ruthless foes, cruel comrades, and unforgiving space. Can he do his duty when good and evil look so much alike? \r\n\r\n---\r\n\r\nRich Man's War (Poor Man's Fight #2) \r\n\r\nTanner Malone is starting to enjoy his navy post in the honor guard. After surviving violent conflicts with space pirates in the void, he hopes to stay out of the stars for a while. But when the government of Archangel, a prosperous Union state including four terraformed worlds, makes a dangerous decision to defy the Big Three's corporate dominance, war threatens the galaxy.\r\n\r\nThe interstellar fighting escalates, and duty calls a reluctant Tanner to the front lines, where it becomes more and more difficult to tell the difference between politician, pirate, and protector. When secret intel reveals a vast network of bloody covert operations, along with a rigged economic system that enslaves its members, Tanner finds himself at the perilous intersection between the government, the Big Three, and pirates who will stop at nothing to remain free. \r\n\r\n\r\n\r\nRead by Timothy Andrés Pabon\r\nFormat: M4A\r\nBitrate: 32 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:d8dc988c693139a441dfda2837582d3e78d29252","amp;dn":"Elliott+Kay+-+Poor+Man%27s+Fight+%5B1-2%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8dc988c693139a441dfda2837582d3e78d29252","infoHashBuffer":{"type":"Buffer","data":[216,220,152,140,105,49,57,164,65,223,218,40,55,88,45,62,120,210,146,82]},"announce":[],"urlList":[]}}