{"title":"The Autobiography of Martin Luther King, Jr (retail) epub - Abee","uid":8757376,"size":4473220,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9011bba1eb1eeef85ad7df1f34ce26b2972fd41&amp;dn=The+Autobiography+of+Martin+Luther+King%2C+Jr+%28retail%29+epub+-+Abee&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"The_Abee","files":2,"time":1375174997,"description":"The Autobiography of Martin Luther King, Jr (retail) epub - Abee\n____\n &lt;a href=&quot;\nhttp://davidswanson.files.wordpress.com/2010/01/autobiography-of-martin-luther-king-jr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://davidswanson.files.wordpress.com/2010/01/autobiography-of-martin-luther-king-jr.jpg&lt;/a&gt;\n\nPublication Date: January 1, 2001\n\nClayborne Carson has created a book that remarkably approximates a self-portrait of Martin Luther King Jr. Delving into all aspects of this mans life, the work covers his boyhood, his education, and his emergence as a leader. From his relationships with his wife and children, to his dealings with the important political figures of the era, this book defines the history of a genuine hero.\n\nCelebrated Stanford University historian Clayborne Carson is the director and editor of the Martin Luther King Papers Project; with thousands of King's essays, notes, letters, speeches, and sermons at his disposal, Carson has organized King's writings into a posthumous autobiography. In an early student essay, King prophetically penned: &quot;We cannot have an enlightened democracy with one great group living in ignorance.... We cannot have a nation orderly and sound with one group so ground down and thwarted that it is almost forced into unsocial attitudes and crime.&quot; Such statements, made throughout King's career, are skillfully woven together into a coherent narrative of the quest for social justice. The autobiography delves, for example, into the philosophical training King received at Morehouse College, Crozer Theological Seminary, and Boston University, where he consolidated the teachings of Afro-American theologian Benjamin Mays with the philosophies of Locke, Rousseau, Gandhi, and Thoreau. Through King's voice, the reader intimately shares in his trials and triumphs, including the Montgomery Boycott, the 1963 &quot;I Have a Dream Speech,&quot; the Selma March, and the 1964 Nobel Peace Prize. In one of his last speeches, King reminded his audience that &quot;in the final analysis, God does not judge us by the separate incidents or the separate mistakes that we make, but by the total bent of our lives.&quot; Carson's skillful editing has created an original argument in King's favor that draws directly from the source, illuminating the circumstances of King's life without deifying his person. --Eugene Holley Jr. --This text refers to an out of print or unavailable edition of this title.\nCarson, director of the Martin Luther King Jr. Papers Project and author of A Knock at Midnight: Inspiration from the Great Sermons of Reverend Martin Luther King, Jr., has pieced together an incomplete study of King's life by supplementing his extant autobiographies (e.g., Stride Toward Freedom and Where Do We Go from Here) with previously unpublished and published writings, interviews and speeches. If King's rhetorical flourishes and use of the word &quot;negro&quot; sometimes seem outdated, the compilation still offers a concise first-person account of his life from his birth in Atlanta in 1929 to his awakening social consciousness and discovery of the teachings of Mahatma Gandhi. History propelled King to center stage in the struggle for black liberation. When Rosa Parks refused to surrender her bus seat in 1955, the &quot;once dormant and quiescent Negro community was now fully awake&quot; and King, along with many others in Montgomery's black community, organized the bus boycott that would launch King into his leadership role in the civil rights movement. The book offers glimpses of King's family life as well a view of famous Americans such as Stokely Carmichael, Malcolm X and JFK. (In 1960, King did not feel &quot;there was much difference between Kennedy and Nixon.&quot; He writes, &quot;I felt at points that he was so concerned about being President of the United States that he would compromise basic principles.&quot;) But what is most evident throughout Carson's study is the moral courage that sustained King and allowed him to inspire a largely peaceful mass movement against segregation in the face of bloody reprisals. (Dec.) FYI: In November, Carol Publishing will release Seventh Child: A Family Memoir of Malcolm X, by his nephew Rodnell P. Collins. ($21.95 230p ISBN 1-55972-491-9)\nCopyright 1998 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.\nSee all Editorial Reviews\n\nPaperback: 416 pages\nPublisher: Grand Central Publishing (January 1, 2001)\nISBN-10: 0446676500\nASIN: B0029LHX26\n\n\nSee a tiny collection of my torrents. ;)\n_______________________________\n       &lt;a href=&quot;\nhttp://thepiratebay.se/user/The_Abee/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/The_Abee/&lt;/a&gt;\n_______________________________\t\t\n\t\t\n\n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n \n\n\n                                                      (:__Abee \t\n","torrent":{"xt":"urn:btih:d9011bba1eb1eeef85ad7df1f34ce26b2972fd41","amp;dn":"The+Autobiography+of+Martin+Luther+King%2C+Jr+%28retail%29+epub+-+Abee","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9011bba1eb1eeef85ad7df1f34ce26b2972fd41","infoHashBuffer":{"type":"Buffer","data":[217,1,27,186,30,177,238,239,133,173,125,241,243,76,226,107,41,114,253,65]},"announce":[],"urlList":[]}}