{"title":"Dig! The Brian Jonestown Massacrs &amp; Dandy Worhols","uid":3497003,"size":705423407,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d907010692721507c33b756abfd005d0fca16e0a&amp;dn=Dig%21+The+Brian+Jonestown+Massacrs+%26+Dandy+Worhols&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"joeconor","files":3,"time":1150882273,"description":"DIG! is the feature-length documentary shot over seven years about musicians Anton Newcombe, leader of the Brian Jonestown Massacre, and Courtney Taylor, head of the Dandy Warhols, star crossed friends and bitter rivals. From the moment they met, The Dandy Warhols and the Brian Jonestown Massacre quickly bonded over a desire to not conform to the tastes of the recording industry. Yet, the bands? choices over how to express their creativity and originality in a profit-driven industry eventually put them at irreconcilable odds.\n        Culled from 1500 hours of footage and narrated by Courtney Taylor, DIG! follows the underground giant Anton Newcombe, unearthing him to be an important yet largely unnoticed artist of our time. \n          In 1996 Anton Newcombe and his band the Brian Jonestown Massacre - who in a decade independently released 11 albums, 3 recorded in one year ? are hell-bent on staging a revolution in the music industry.  They are convinced their friends, the Dandy Warhols, will join them to create a united front.  But Anton?s creative psychosis takes him to the most remote areas of the human mind to find his original art, and as a result, he destroys every opportunity for financial success.\n     While tracking the destructive path of the Brian Jonestown Massacre, DIG! also accompanies the more ?well-adjusted? Warhols through their leader Courtney Taylor, as they navigate the corporate sea, trying to maintain their creative edge while starring in mega-budget music videos and entertaining crowds in the tens of thousands.\n          DIG! is about both musicians? love and obsession, gigs and recordings, arrests and death threats, uppers and downers - their choices between art and industry, which unfold with the passage of time.","torrent":{"xt":"urn:btih:d907010692721507c33b756abfd005d0fca16e0a","amp;dn":"Dig%21+The+Brian+Jonestown+Massacrs+%26+Dandy+Worhols","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d907010692721507c33b756abfd005d0fca16e0a","infoHashBuffer":{"type":"Buffer","data":[217,7,1,6,146,114,21,7,195,59,117,106,191,208,5,208,252,161,110,10]},"announce":[],"urlList":[]}}