{"title":"Monopoly City","uid":6441243,"size":54106401,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d98732dbfd655d0eb70cfb20efbf6410ec1d229b&amp;dn=Monopoly+City&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":".BONE.","files":2,"time":1306988431,"description":"Monopoly City adds new twists to the classic board game. This board game will teach your kids about what it takes to be the best property developer and the work that goes into building their dream city. With the goal of owning the prestigious Monopoly tower, your kids will be learning important lessons about money while wheeling and dealing their way to the top.\n\nBuild on every Go and watch your city fortune grow. In this metropolitan edition of Monopoly, be the top property developer and watch your dream city rise before your eyes. What will you build-- houses or industrial complexes, schools, skyscrapers or stadiums? The choice is yours. But watch out a rival developer could build a sewage plant right next to your prize property and make its value plummet. So build wisely and rake in the rent... and the prestigious Monopolytower could be yours. Includes deal making button.\n\nMonopoly City is exactly like classic Monopoly in lay out, rules, and gameplay-roll the dice, move your character around the board, and try not to spend too much time in jail or go bankrupt. However Monopoly City has also made several neat changes, with newly named properties, new monetary values, futuristic buildings, and new playing cards.\n\nInstead of property deeds, you acquire permits for the zones you'd like to build in, and this latest version also includes an electronic trading unit, making it possible to hold &quot;public&quot; or &quot;private&quot; auctions for your properties and districts. \n\n","torrent":{"xt":"urn:btih:d98732dbfd655d0eb70cfb20efbf6410ec1d229b","amp;dn":"Monopoly+City","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d98732dbfd655d0eb70cfb20efbf6410ec1d229b","infoHashBuffer":{"type":"Buffer","data":[217,135,50,219,253,101,93,14,183,12,251,32,239,191,100,16,236,29,34,155]},"announce":[],"urlList":[]}}