{"title":"Los Redonditos De Ricota - La Mosca Y La Sopa (1991) WMA320","uid":6103176,"size":95717001,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:da0d7ce20b4882c7b692836797d23847ea75a651&amp;dn=Los+Redonditos+De+Ricota+-+La+Mosca+Y+La+Sopa+%281991%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1295054645,"description":"La mosca y la sopa es el quinto ÃƒÂ¡lbum de la banda Patricio Rey y sus Redonditos de Ricota, fue grabado entre mayo y julio de 1991 en el estudio del cielito. Siendo este uno de los ÃƒÂ¡lbumes emblema de la banda junto a Oktubre, con ÃƒÂ©xitos como Un poco de amor francÃƒÂ©s, Mi perro dinamita y El pibe de los astilleros. El tema Blues de la artillerÃƒÂ­a estÃƒÂ¡ dedicado a Enrique Syms, periodista amigo de la banda, con el cual se enemistaron luego de un comentario hecho por ÃƒÂ©l acerca de que se estaban volviendo comerciales.\n\nEl ÃƒÂ©xito acumulado con el lanzamiento de cada disco le permitiÃƒÂ³ a la banda presentarse en Obras gran cantidad de veces desde el final de 1989 hasta el show en el que se ocasionÃƒÂ³ el conflicto de Walter Bulacio, despuÃƒÂ©s de este hecho, la banda decidiÃƒÂ³ que tenÃƒÂ­a que dejar de tocar por unos meses y se enfocÃƒÂ³ en lanzar en CD el material nuevo que la banda estaba tocando, por lo que la banda se instalo en Del Cielito y en muy poco tiempo lanzÃƒÂ³ este nuevo disco y sus dos sucesores.El disco consiguiÃƒÂ³ que la banda llegara a su nivel de ÃƒÂ©xito mÃƒÂ¡s alto gracias a la alta rotaciÃƒÂ³n radial que recibieron los hits Mi perro dinamita y Un poco de amor francÃƒÂ©s.\n\nEl prÃƒÂ³logo de este CD tiene una gran similitud con los textos que Solari publicaba como columnista en la revista de su amigo Enrique Symns,Cerdos y Peces (los cuales se aprecian en el arte del disco):\n\nTratando de lucirse, un chancho puede comer jamÃƒÂ³n (siempre revelamos a lo que estamos sometidos). \nLa mosca esta en la sopa. AceptÃƒÂ©moslo. Sentados a la mesa servidas estÃƒÂ¡n nuestros hÃƒÂ©roes. Esos tres bombones que creen que arman un gran cacao. Esos que han ganado reputaciÃƒÂ³n gracias a los papeles duros y son muÃƒÂ±ecos vudÃƒÂº de ÃƒÂ©sta sociedad-espectÃƒÂ¡culo. El primero de los comensales rechaza de pleno el plato. El segundo quita la mosca del plato y toma la sopa. El tercero exprime la mosca dentro del plato hasta la ultima gotita y luego come con fruiciÃƒÂ³n. Mientras tanto, lenta, muy lentamente, se les mete la muerte por donde los monos se meten la manzana.\n\nQueridos amigos, la franela no es como la gamuza. Puede que alguna de ÃƒÂ©stas noches no nos encontremos aquÃƒÂ­ ya. Puede ser cualquiera de nosotros el que se va al pasado. AllÃƒÂ­, un chimpancÃƒÂ© viejito atiza el fogÃƒÂ³n, se llama AdÃƒÂ¡n y es tu gran papito. Ese mono que rÃƒÂ­e, despacito, en la oscuridad. AllÃƒÂ­, y para siempre, aprendimos que ciertos fuegos no se encienden frotando dos palitos.\n\nPATRICIO REY\n\nVoz: Indio Solari\nGuitarras: Skay Beilinson\nSaxofÃƒÂ³n: Sergio Dawi\nBaterÃƒÂ­a: Walter Sidotti\nBajo: Semilla Bucciarelli\nArtistas Invitados: \nLuis Mississipi Robinson con la armÃƒÂ³nica en Tarea fina.\nLito Vitale en teclados en el Blues de la artillerÃƒÂ­a.\n\npor WIKIPEDIA\n\nTRACKLIST:\n\n01 - Toxi - Taxi.wma                                        \n02 - Fusilados Por La Cruz Roja.wma                         \n03 - Un Poco De Amor Frances.wma                            \n04 - Mi Perro Dinamita.wma                                  \n05 - Blues De La Artilleria.wma                             \n06 - Tarea Fina.wma                                         \n07 - El Pibe De Los Astilleros.wma                          \n08 - Nueva Roma.wma                                         \n09 - Salando Las Heridas.wma                                \n10 - Queso Ruso.wma\n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:da0d7ce20b4882c7b692836797d23847ea75a651","amp;dn":"Los+Redonditos+De+Ricota+-+La+Mosca+Y+La+Sopa+%281991%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da0d7ce20b4882c7b692836797d23847ea75a651","infoHashBuffer":{"type":"Buffer","data":[218,13,124,226,11,72,130,199,182,146,131,103,151,210,56,71,234,117,166,81]},"announce":[],"urlList":[]}}