{"title":"Seven Wonders of Engineering - Ron Miller","uid":11676728,"size":17307890,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:da534d7fb07e9a770940f4c2684070dd18e250fe&amp;dn=Seven+Wonders+of+Engineering+-+Ron+Miller&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1422902677,"description":"In every age, science and technology have played an important role in advancing human civilization. From architecture to engineering, communication to transportation, humans have invented and developed extraordinary wonders. Engineers take the discoveries of scientists and mathematicians to make practical things, from roads and bridges to weapons and vehicles. Electronic engineers design and build everything from television sets to computers. Chemical engineers research new uses for plastics and other materials. Other engineers design new energy sources and nonpolluting factories. In this book, we'll explore seven wonders of modern engineering that allow people to travel beneath the ocean, bring power to entire cities, and land on the moon. We'll also see engineering wonders that cut though a continent and design engines too small to see. Along the way, we'll see advancements in materials, technology, and construction techniques, and we'll learn the stories of how and why these engineering feats became important to the world","torrent":{"xt":"urn:btih:da534d7fb07e9a770940f4c2684070dd18e250fe","amp;dn":"Seven+Wonders+of+Engineering+-+Ron+Miller","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da534d7fb07e9a770940f4c2684070dd18e250fe","infoHashBuffer":{"type":"Buffer","data":[218,83,77,127,176,126,154,119,9,64,244,194,104,64,112,221,24,226,80,254]},"announce":[],"urlList":[]}}