{"title":"ACDSee v15.0 build 169 with Key [iahq76]","uid":7683187,"size":85857122,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:da635fa9c9a9a7138753ce1ea475694e182a3dae&amp;dn=ACDSee+v15.0+build+169+with+Key+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"TorDigger","files":3,"time":1348875127,"description":"ACDSee 15\n \nWhat's New in ACDSee 15\n \nKeep track of your ever-growing collection. Polish up even the messiest of photos. Add something magical to an already great shot that's sure to impress. You can do it all, faster and easier than ever before, in ACDSee 15.\n \nHierarchical keywords\n \nOrganize your collection with hierarchical keywords that help you sort your photos better than ever before. For instance, let's say you create a keyword tree that looks like this: Events | Local | Birthdays. You can then assign a photo from last week's birthday celebration to the Birthdays keyword with the check of a box, and it implicitly gets added to the higher level keywords too. You can create as many levels as you want, and display all of the photos you've tagged with that keyword in one click. It's sorting, supersized!\n \nEasily brush on edits\n \nWant to soften only a face and not the entire photo? The Edit Brush makes it super easy and fast to apply any editing effect to a specific part of your photo. Choose your brush size and the amount of feathering to help you achieve exactly the look you want.\n \nBlur smartly\n \nUse the Smart Blur filter to blur areas of little or no detail while still maintaining the sharpness and important details of your photo. Try it as a creative effect or to reduce the noise in your photo for a smoother, less grainy look\n \nImproved noise reduction\n \nDon't delete those grainy, high ISO photos. Rescue them with ACDSee's improved noise reduction controls for smoother and more natural results, while saving as much edge detail as possible.\n \n\nHomepage: http://www.acdsee.com/\n \nInstallation Instructions:\n \n1. Install Program.\n2. Run application, Block program internet access thru firewall.\n3. Use given key to register application. Do not register online or create online account. click register later on first screen. \n4. Done, Enjoy.\n ","torrent":{"xt":"urn:btih:da635fa9c9a9a7138753ce1ea475694e182a3dae","amp;dn":"ACDSee+v15.0+build+169+with+Key+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da635fa9c9a9a7138753ce1ea475694e182a3dae","infoHashBuffer":{"type":"Buffer","data":[218,99,95,169,201,169,167,19,135,83,206,30,164,117,105,78,24,42,61,174]},"announce":[],"urlList":[]}}