{"title":"CorelDRAW Graphics Suite X6 16.4.0.1280 SP4 (64 bit) [ChingLiu]","uid":8833011,"size":912675542,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dbaf2965b7dc27b6f8c0c546f3a6f98006f95d01&amp;dn=CorelDRAW+Graphics+Suite+X6+16.4.0.1280+SP4+%2864+bit%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Ching_Liu","files":-1,"time":1377038105,"description":"Performance and stability\nThe following areas feature performance and stability improvements (formerly released as service packs).\n\nBitmaps\n-Transparency merge modes are correctly retained in objects that are converted to bitmaps. \n-The Vignette bitmap effect works as expected on transparent bitmaps in CorelDRAW. \n\nColor and color styles\n-Color harmonies can be edited by using harmony rules and adding spot colors. \n-CorelDRAW no longer stops responding when color styles from two documents are merged or after other operations related to color styles. \n-Color styles can be converted to spot colors, preserving the original tint. \n-When color styles are converted to grayscale and then to spot colors, the final results are no longer white spot colors. \n-Unrecognized spot colors no longer cause slow performance. \n\nImporting and exporting files\n-Merge modes in fills and transparencies are reproduced correctly in documents that are saved as bitmaps. \n-Adobe Illustrator (AI) files that contain mesh fills with merge modes applied are now imported properly. \n-Dimension lines in imported Micrografx Designer 9 files are displayed correctly. \n-Exporting only selected objects to an Encapsulated PostScript (EPS) file no longer results in a multipage file. \n-Filenames (titles) are preserved in exported PDF files. \n-CorelDRAW no longer stops responding when exporting a document that contains perspective lenses to a PDF file. \n-Bullets that use the font CommonBullets are preserved in exported PDF files. \n-When exporting to a PLT/HPGL file, the last used pen library remains selected on the Pen page of the HPGL export dialog box for future export operations. \n\nEffects\n-Adjustment effects such as Brightness/Contrast/Intensity, Gamma, Color Balance, work as expected when applied to vector objects. \n\nText\n-Updating text in certain files from older versions no longer changes the text font attributes. \n-The Fit Text to Path feature works as expected. If a text string is longer than the path, the characters no longer fall off the path. \n-CorelDRAW no longer stops responding when trying to bring up the Edit Text dialog box for text frames that contain empty lines or when opening files that contain cloned text. \n\nOpening and saving files\n-Arrowheads in CorelDRAW (CDR) files saved to version 12 are preserved. \n-CorelDRAW no longer stops responding when opening certain files from older versions. \n-Hyperlinks are preserved in saved files. \n\nPrinting\n-CorelDRAW no longer stops responding when printing files that contain imported EPS files. \n-Disabled colors do not appear in the final output when you print color separations. \n\nTools\n-CorelDRAW no longer stops responding when double clicking a control arm of a pattern fill with the Interactive Fill tool. \n-When working with a custom workspace, you can use the Alt key with the Polyline tool to draw circular arcs. \n-Selecting and deleting nodes with the Shape tool in certain files no longer causes the application to stop responding. \n\nCorel PHOTO-PAINT\n-Mask feathering works as expected. \n-You can choose different anti-aliasing settings for text from the property bar. \n\nCorel Connect\n-Undocking the Connect docker no longer results in duplicated tray content. \n\nSystem Requirements\n-MicrosoftÂ® WindowsÂ® 8 (32-bit or 64-bit Editions), MicrosoftÂ® WindowsÂ® 7 (32-bit or 64-bit Editions), Windows VistaÂ® (32-bit or 64-bit Editions), or WindowsÂ® XP (32-bit), all with latest service packs installed \n-IntelÂ® PentiumÂ® 4, AMD Athlonâ„¢ 64 or AMD Opteronâ„¢ \n-1GB RAM \n-1.5GB hard disk space (for typical installation without content - additional disk space is required during installation) \n-Mouse or tablet \n-1024 x 768 screen resolution \n-DVD drive \n-MicrosoftÂ® Internet ExplorerÂ® 7 or higher\n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://www.corel.com/corel/product/index.jsp?pid=prod4260069&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.corel.com/corel/product/index.jsp?pid=prod4260069&lt;/a&gt;","torrent":{"xt":"urn:btih:dbaf2965b7dc27b6f8c0c546f3a6f98006f95d01","amp;dn":"CorelDRAW+Graphics+Suite+X6+16.4.0.1280+SP4+%2864+bit%29+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbaf2965b7dc27b6f8c0c546f3a6f98006f95d01","infoHashBuffer":{"type":"Buffer","data":[219,175,41,101,183,220,39,182,248,192,197,70,243,166,249,128,6,249,93,1]},"announce":[],"urlList":[]}}