{"title":"Perfectly Legal (2002) Indigo - Lauren Hays, Beverly Lynne.avi","uid":8654077,"size":964002124,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:dc2179f78c6444f74a1b9060ce3354489968822f&amp;dn=Perfectly+Legal+%282002%29+Indigo+-+Lauren+Hays%2C+Beverly+Lynne.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Arnyxx","files":-1,"time":1373173759,"description":"########\nNote to skulls: if you think this isn't porn, then move it. I don't like putting it here.\n########\n\n919 MiB\nXvid 640x480  23.976 fps\nAC3 256 kbps\n100 min.\n\n=============================\nIMDb:\n\n3 out of 3 people found the following review useful:\n&quot;Good, but not perfect.&quot;\n8/10 stars\nAuthor: David Brown from USA\n23 April 2004\n\n*** This review contains spoilers ***\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLauren Hays plays a hot divorce attorney who seems to do her job well, but is pretty bad at managing the financial stuff. But she's hot. She represents a woman whose ex-husband has gotten famous selling &quot;better sex&quot; books and videos. But the woman claims he stole the ideas from her. It's your standard courtroom drama stuff, but with a huge dash of stupidity. The &quot;brilliant&quot; way that Lauren eventually wins the case would've been lame even in a Scooby Doo cartoon.\n\nThe story is plenty sufficient to justify eight sex scenes. Seven are boy/girl and one is girl solo (Lauren). Lauren is also in two of the other scenes. Her scenes are the best, but the other five are good as well. All are full sex scenes that get taken to completion. The actors and actresses are always audible without the music covering everything up. The women have some great orgasms in this one.\n\nIn addition to Lauren, there are five other women: Beverly Lynne, Alison Miller, Stephanie Swift, Andrea St. James, and Kylie Wyote (get it, &quot;Kylie Wyote&quot;, &quot;Wile E. Coyote&quot;). All are attractive and give good performances. Monique Parent makes a couple of cameo appearances but doesn't participate in any sex scenes.\n\nBut it could have been better. This video makes the same mistake that's too common in softcore. It gets off to a great start, then loses its momentum. The first six sex scenes all occur during the first hour of the video, one every ten minutes. But in the remaining forty minutes, there are only two more scenes. There's also no lesbian scene. \n","torrent":{"xt":"urn:btih:dc2179f78c6444f74a1b9060ce3354489968822f","amp;dn":"Perfectly+Legal+%282002%29+Indigo+-+Lauren+Hays%2C+Beverly+Lynne.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc2179f78c6444f74a1b9060ce3354489968822f","infoHashBuffer":{"type":"Buffer","data":[220,33,121,247,140,100,68,247,74,27,144,96,206,51,84,72,153,104,130,47]},"announce":[],"urlList":[]}}