{"title":"Food: A Dictionary of Literal and Nonliteral Terms","uid":10828317,"size":2724474,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc31e61691cb2ee55f54890c976749744c968f63&amp;dn=Food%3A+A+Dictionary+of+Literal+and+Nonliteral+Terms&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1408594871,"description":"Food: A Dictionary of Literal and Nonliteral Terms by Robert Palmatier\n\nEnglish | 2000 | ISBN: 0313314365 | 488 pages | PDF | 2,6 MB\n\nEach of the more than seven hundred entries in the dictionary contains a description of the historical background of each of the two types of language, literal and nonliteral, and provides an explanation for the relationship between them.\n\nWherever possible, dates of &quot;first record&quot; in English are provided, along with the bibliographical sources of these dates; and all of the works that record those terms and expressions are given in coded form as listed in the Key to Works Cited. A Guide to Reading the Entries illustrates the typical form of an entry by analyzing an example from the dictionary that introduces five nonliteral expressions, cites thirteen bibliographical sources, and refers the reader to three other relevant entries by means of cross-references. Following the dictionary proper is a Classification of Terms According to Source, in which nearly three hundred nonliteral terms and expressions are listed under the more than four hundred literal categories from which they derive.","torrent":{"xt":"urn:btih:dc31e61691cb2ee55f54890c976749744c968f63","amp;dn":"Food%3A+A+Dictionary+of+Literal+and+Nonliteral+Terms","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc31e61691cb2ee55f54890c976749744c968f63","infoHashBuffer":{"type":"Buffer","data":[220,49,230,22,145,203,46,229,95,84,137,12,151,103,73,116,76,150,143,99]},"announce":[],"urlList":[]}}