{"title":"The Trashmen 4CD 1964-67 Surf Rock (Surfin' Bird)","uid":4746981,"size":238387762,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dc38f23d7b9c118b3cdc1a77fe776f491f3905cd&amp;dn=The+Trashmen+4CD+1964-67+Surf+Rock+%28Surfin%5C%27+Bird%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":4,"uploader":"Iron_Horse","files":78,"time":1235933079,"description":"The Trashmen 4CD 1964-67 Surf Rock (Surfin' Bird)\n\n&quot;The Trashmen&quot;\nThe Trashmen were a rock and roll band formed in Minneapolis, Minnesota, in 1962. The group's lineup was Tony Andreason on lead guitar and vocals, Dal Winslow on guitar and vocals, Steve Wahrer on drums and vocals, and Bob Reed on bass guitar. The group played surf rock which included many elements from garage rock. The Trashmen went on to have other hit singles on the charts. In 1964, &quot;Bird Dance Beat&quot; hit #30 on the Billboard in the United States, as well as becoming a top 10 hit in Canada, and a mega hit in Brazil. Five other Trashmen singles charted, and overall they released 14 albums. They were prolific enough for a four CD box set of their work to be released later. The group disbanded in 1967 but reunited in the 1980s, they played together until the death of Steve Wahrer, who died of cancer in 1989. Tony's brother, Mark Andreason filled Steve's shoes as drummer. In 1999, The Trashmen played in Las Vegas, Nevada at The Las Vegas Grind to a full house. Since then, they have reunited to play select gigs including Chicago (July 2007), Spain (September 2007), Chicago (November 2007), Wisconsin, and Cleveland (March 2008). The Trashmen played for the first time in over a decade in their homestate of Minnesota, when they played the birthday bash for KOZY (AM) Radio at the Reif Center in Grand Rapids, Minnesota. The Trashmen returned to Grand Rapids, where they played in 1964. They have since been touring Europe and the US with successful 2009 gigs in Germany, The Netherlands, France, Spain, Belgium, Italy, and Austria, with many more playdates on the calendar. &lt;a href=&quot; http://en.wikipedia.org/wiki/The_Trashmen&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/The_Trashmen&lt;/a&gt;\n\nLine up:\nTony Andreason - lead guitar and vocals\nDal Winslow - guitar and vocals\nBob Reed - bass guitar\nSteve Wahrer - drums and vocals\n--------------------------------------------------------------------------------------------------------------------------------------------------------------\nThe Trashmen - Surfin' Bird (1964)\nCD to Mp3 224 mbit/s\nIncluded: CD front cover\n\n&quot;Surfin' Bird&quot;\nThe Trashmen's major notable hit was 1963's &quot;Surfin' Bird&quot;, which reached #4 on the Billboard Hot 100 in the later part of that year. The song was a combination of two R&amp;B hits by The Rivingtons, &quot;The Bird's the Word&quot; and &quot;Papa-Oom-Mow-Mow&quot;. The earliest pressings of the single credit the Trashmen as composers, but following a threat from their legal counsel The Rivingtons were subsequently credited as composers. It was later recorded by many artists, including The Ramones, The Cramps, The Beach Boys, Pee-Wee Herman, Equipe 84, and even the thrash band Sodom. It has been used in several movies and television shows (such as well-known scenes in Stanley Kubrick's Full Metal Jacket and John Waters' Pink Flamingos). It is featured in the soundtrack in the video game Battlefield Vietnam. More recently it has been the subject of an episode of the animated series Family Guy, launching the song to #8 on the iTunes Top 10 Rock songs chart.\n\nTracklist:\n(LP Tracks)\n01. Surfin' Bird\n02. King of the Surf\n03. Henrietta\n04. Misirlou\n05. MalagueÃƒÂ±a\n06. It's So Easy\n07. Tube City\n08. My Woodie\n09. Bird Bath\n10. Kuk\n11. Money (That's What I Want)\n12. Sleeper\n(CD Bonus Tracks)\n13. Surfin' Bird (Demo Version)\n14. Bird Dance Beat (Demo Version)\n15. Walkin' My Baby)\n16. Dancin' With Santa\n--------------------------------------------------------------------------------------------------------------------------------------------------------------\nThe Trashmen - The Great Lost Trashmen Album (1964-66)\nCD [1994] to Mp3 128 mbit/s\nIncluded: CD Covers\n\n&quot;The Great Lost Trashmen Album&quot;\nRecorded in March 1964 and January/July 1966, The Great Lost Trashmen Album! was the supposed second release from those Minneapolis hodads who gave the world &quot;Surfin' Bird.&quot; The material finds the Trashmen heading toward Beatles territory on the 1966 sessions, especially on &quot;Talk About Love&quot; (featuring Farfisa organ) and Buddy Holly's tune &quot;Heartbeat.&quot; There's also plenty of amazing surf instrumentals and vocal tracks comparable to &quot;Kuk,&quot; with cool gremmie/hot-dogging/kowabunga lyrics. &quot;Think It Over&quot; would have made an excellent inclusion in one of those AIP beach party movies of the early '60s. Needless to say, if you have any interest in surf music beyond the Beach Boys, buy this Sundazed disc immediately! \n\nTracklist:\n01. Ghost Riders in the Sky\n02. Keep a Knockin'\n03. Think It Over\n04. Greensleeves\n05. True True Lovin'\n06. Stick Shift\n07. Hava Nagila\n08. Be True to Your School\n09. Bad News\n10. Wild Cat Loose in Town\n11. Lucille\n12. Green Onions\n13. Mind Your Own Business\n14. Bird Diddley Beat\n15. Talk About Love\n16. Heartbeat\n--------------------------------------------------------------------------------------------------------------------------------------------------------------\nThe Trashmen - Live Bird '65-'67\nCD [1990] to Mp3 160 mbit/s\nIncluded: CD Covers\n\n&quot;Live Bird '65-'67&quot;\nAlthough marketed as a surf band, Minnesota's Trashmen were decidedly landlocked by geography, but not by spirit. The group's odd mix of surf, R&amp;B, sneering garage pop, and psychotic instrumentals made them one of the most eccentric and interesting of the groups that sprang up around the surf craze of the early '60s. This delightful collection of rare live tracks shows the kind of offhand, humorous dementia that they channeled into their shows, climaxing in a near six-minute version of their wacky masterpiece, the manic &quot;Surfin' Bird.&quot; But this was a surprisingly versatile and nimble band, and their versions here of Booker T. &amp; the MG's' &quot;Green Onions&quot; and James Brown's &quot;Mashed Potatoes&quot; spotlight a funky little R&amp;B groove, while &quot;Same Lines&quot; sneers along with the best of 1960s garage punk, and &quot;Keep Your Hands off My Baby&quot; is skillfully executed faux doo wop. Two of the songs here (&quot;Bird Dance Beat,&quot; &quot;King of the Surf&quot;) were recorded at the Home School for Girls at the Saux Centre in Minnesota in 1966, and the mere thought of young, impressionable girls listening to this band of goofy maniacs is a sobering one.\n\nTracklist:\n01. Let's Go Trippin' \n02. Baja\n03. Lovin' Up a Storm \n04. MalagueÃƒÂ±a\n05. Green Onions\n06. Surfin' Bird\n07. Henrietta\n08. Rumble\n09. Bird Dance Beat\n10. King of the Surf\n11. The Trashmen Report\n12. Mashed Potatoes\n13. The Trashmen Report\n14. Ubangi Stomp\n15. Dal Winslow Interview\n16. Same Lines\n17. Keep Your Hands off My Baby\n--------------------------------------------------------------------------------------------------------------------------------------------------------------\nThe Trashmen - Tube City!: The Best of the Trashmen (1964-67)\nCD [1992] to Mp3 VBR 125-144 mbit/s\nIncluded: CD Covers\n\n&quot;Tube City!: The Best of The Trashmen&quot;\nTube City!: The Best of The Trashmen adds their Garrett singles to their lone 1964 album Surfin' Bird. That classic single is here in all of its raw, unfettered glory, and while it does tend to overshadow the rest of the Trashmen's output, the collection shows that their other work was also strong. Their covers of &quot;Miserlou,&quot; &quot;It's So Easy,&quot; and &quot;Money (That's What I Want)&quot; reflect the band's roots, and aren't overly respectful of the original versions, while &quot;My Woodie&quot; and &quot;Kuk&quot; are respectable surf-pop songs. The Trashmen's instrumentals also fare well, particularly &quot;Tube City&quot; itself , the flamenco-surf of &quot;Malaguena,&quot; and &quot;Bird Dance,&quot; a silly, tiki-bird infested bid to follow up the success of &quot;Surfin' Bird.&quot; &quot;Bird Dance Beat&quot; follows suit, but songs like &quot;Bad News,&quot; &quot;Whoa! Dad,&quot; and &quot;Real Live Doll&quot; have as much energy, but a little more originality. \n\nTracklist:\n01. Tube City\n02. My Woodie\n03. Surfin' Bird\n04. Misirlou\n05. Money\n06. Kuk\n07. King Of The Surf\n08. Bird Bath\n09. It's So Easy\n10. Henrietta\n11. Malaguena\n12. Sleeper\n13. Bird Dance Beat\n14. A-Bone\n15. Bad News\n16. On The Move\n17. Peppermint Man\n18. New Generation\n19. Whoa Dad!","torrent":{"xt":"urn:btih:dc38f23d7b9c118b3cdc1a77fe776f491f3905cd","amp;dn":"The+Trashmen+4CD+1964-67+Surf+Rock+%28Surfin%5C%27+Bird%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc38f23d7b9c118b3cdc1a77fe776f491f3905cd","infoHashBuffer":{"type":"Buffer","data":[220,56,242,61,123,156,17,139,60,220,26,119,254,119,111,73,31,57,5,205]},"announce":[],"urlList":[]}}