{"title":"Robyn Adams - Diplomacy and Early Modern Culture [2011][A]","uid":10455088,"size":1956281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc8f986656a73ac1a2baaff406ec3860fad09237&amp;dn=Robyn+Adams+-+Diplomacy+and+Early+Modern+Culture+%5B2011%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Anette14","files":-1,"time":1404067600,"description":"Description\nProduct Details\nBook Title: Diplomacy and Early Modern Culture (Early Modern Literature in History)\t\nBook Author: Robyn Adams (Editor), Rosanna Cox (Editor)\nSeries: Early Modern Literature in History\nHardcover: 208 pages\nPublisher: Palgrave Macmillan; 1 edition (January 18, 2011)\nLanguage: English\nISBN-10: 0230239765\nISBN-13: 978-0230239760\n\n===================================================================================\nBook Description\nPublication Date: January 18, 2011\nThis volume offers a fresh approach to the study of diplomacy and related activity in the early modern period. It seeks to widen the conventional entry point into the study of the figures associated with continental and global diplomatic exchange, which has traditionally been the province of political and military history. The interdisciplinary theme of the collection is reflected in its generous and fertile scope of intellectual enquiry, texts, objects and methodology. The essays mark a growing interest in the area with contributions from social, religious, literary and intellectual historians, as well as scholars interested in gender and material culture. Moving away from the study of the lone diplomat or agent about his official business, this collection explores the in?between people and places along the journey of the legate, his belongings, household and his or her correspondence. Examining these spaces and activities brings a richer and more textured view of the role of the ambassador abroad, alerting the modern reader to the meaningful texts and contexts surrounding the official or ceremonial mission.\n\n===================================================================================\nReview\n&quot;These subjects are impressively diverse...It is exciting that the history of diplomacy is being revisited in such new and inventive ways.&quot; - Renaissance Quarterly\n\n===================================================================================\nAbout the Authors\nROBYN ADAMS Senior Research Officer at the Centre for Editing Lives and Letters at Queen Mary, University of London, UK. She has published articles which focus on intelligencers in the sixteenth century in Historical Research and Huntington Library Quarterly. She is also the editor of two online letter editions, The Letters of William Herle and The Diplomatic Letters of Thomas Bodley, and associate editor of Letters of a Stuart Princess: the Complete Correspondence of Elizabeth, Queen of Bohemia, vol. II(forthcoming).\nROSANNA COX Lecturer in Early Modern Literature at University of Kent, UK. She works mainly on the politics, literature and thought of the civil war, commonwealth and restoration periods, and is particularly interested in the works of John Milton. She has published chapters and articles on Milton's politics, and on Paradise Lost and Samson Agonistes, and is currently working on her monograph on Milton and citizenship, 1643-1660.\n===================================================================================","torrent":{"xt":"urn:btih:dc8f986656a73ac1a2baaff406ec3860fad09237","amp;dn":"Robyn+Adams+-+Diplomacy+and+Early+Modern+Culture+%5B2011%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc8f986656a73ac1a2baaff406ec3860fad09237","infoHashBuffer":{"type":"Buffer","data":[220,143,152,102,86,167,58,193,162,186,175,244,6,236,56,96,250,208,146,55]},"announce":[],"urlList":[]}}