{"title":"The Train (1964) XviD DVDrip Burt Lancaster, John Frankenheimer","uid":3810669,"size":1465530170,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dd4083e0bc61356d403257b7f23a53831b0d73bd&amp;dn=The+Train+%281964%29+XviD+DVDrip+Burt+Lancaster%2C+John+Frankenheimer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"mike18xx","files":6,"time":1190074298,"description":"The Train (1964) XviD 640x384 DVDrip Burt Lancaster, John Frankenheimer\n\n(IMDB review:) A standout WWII drama, loosely based on a true story. In 1944, as the Allies spread across France from the Normandy landings, the Nazis looted Paris art museums and loaded the works onto a train, with the intention of carrying them back to the Fatherland and selling or bartering them for scarce war materials. A fairly hare-brained scheme, to be sure, and in reality the train never made it further than a siding just east of the city, but that shouldn&amp;#039;t hinder one&amp;#039;s enjoyment of what turns out to be a classic action film.\n\nThe centerpiece of the movie is a clash of wills between Von Waldheim, a cultured but iron-backed Nazi colonel (well-played by Paul Scofield) charged with getting the stolen artworks to Germany, and a taciturn railway troubleshooter named Labiche (Burt Lancaster). Von Waldheim first enlists Labiche as &amp;#039;insurance&amp;#039; against any monkey business during the train&amp;#039;s journey. Labiche, though, happens to have Resistance connections and, with serious reservations, is drawn into a desperate, improvised plot to stop the train, preferably without damaging the precious artifacts inside.\n\nAlthough easily enjoyed as a straight action flick, what gives the film weight is the supporting story, in which Labiche at first argues against wasting precious lives on a few crates of paintings he&amp;#039;s never seen, then gradually comes round as he begins to understand that the Nazis are effectively carrying off a large piece of the heart of France. Beautiful deep-focus black and white photography, and solid supporting performances by a mostly French cast (of which Jeanne Moreau may be the best-known), convincingly evoke the bleak misery of the Occupation. John Frankenheimer&amp;#039;s economical direction manages to present highly-charged action scenes without glossing over the human cost, as Von Waldheim exacts savage reprisals against escalating efforts to hinder the train&amp;#039;s passage.\n\nLancaster, who performed his own stunts, is excellent, furiously athletic as he slides down ladders, leaps onto moving locomotives, and charges over ridges and fields in pursuit of the train. At the same time, he manages to effectively bring a subtle authenticity to his portrayal of the weary, fatalistic railwayman.\n\nFinally, the action set-pieces are nothing short of stunning, and include the train&amp;#039;s mad dash through an Allied carpet-bombing attack, a strafing raid on a speeding locomotive, and several wrecks and derailments, all staged full-scale with period equipment donated by the French national railway. Well worth obtaining on DVD, the film may be hard to find on broadcast television these days.","torrent":{"xt":"urn:btih:dd4083e0bc61356d403257b7f23a53831b0d73bd","amp;dn":"The+Train+%281964%29+XviD+DVDrip+Burt+Lancaster%2C+John+Frankenheimer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd4083e0bc61356d403257b7f23a53831b0d73bd","infoHashBuffer":{"type":"Buffer","data":[221,64,131,224,188,97,53,109,64,50,87,183,242,58,83,131,27,13,115,189]},"announce":[],"urlList":[]}}