{"title":"Oxford Textbook of Correctional Psychiatry [PDF][StormRG]","uid":11746675,"size":5086377,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd9db30862d9335041df7d9daa35a55ef06381e8&amp;dn=Oxford+Textbook+of+Correctional+Psychiatry+%5BPDF%5D%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"0xmovva","files":2,"time":1426060081,"description":"TITLE/EDITION Oxford Textbook of Correctional Psychiatry (Oxford Textbooks in Psychiatry)\nBy: Robert Trestman (Editor), Kenneth Appelbaum (Editor), Jeffrey Metzner (Editor)\nSeries: Oxford Textbooks in Psychiatry\nHardcover: 468 pages\nPublisher: Oxford University Press; 1 edition (June 1, 2015)\nLanguage: English\nISBN-10: 019936057X\nISBN-13: 978-0199360574\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nCorrectional psychiatry has received increasing recognition as an area of practice with unique skills and knowledge. The Oxford Textbook of Correctional Psychiatry brings together American and international experts to provide a comprehensive overview of the field. Students and psychiatric residents will find basic information that prepares them for clinical rotations, and psychiatrists working in jails and prisons will find a detailed review of the complex issues that arise in these settings.\n\nThe Oxford Textbook of Correctional Psychiatry contains 71 chapters divided into 14 sections. The first three sections address history, structure, and processes including chapters on case law, human rights, ethics, organization and funding of systems, and stages of patient management that cover initial assessments through re-entry. The next three sections review in turn a broad array of management issues, emergencies, and psychopharmacology topics. Among other topics, these sections include chapters on sleep, detoxification, reassessment of community diagnoses and treatments, diversion programs, levels of care, malingering, substance use within facilities, and formulary management. Section seven has chapters on common psychiatric disorders, relevant medical disorders, and pain management. Sections eight through ten focus on psychotherapeutic options, suicide risk management, and addictions treatment. Chapters on aggression, self-injury, and other behavioral challenges appear in Section eleven. Section twelve reviews unique assessment and treatment needs of many distinct population groups. Special topics such as forensics, psychological testing, sexual assaults, quality improvement, training, and research, appear in Section thirteen, followed by a section devoted to current resources in correctional healthcare.\n\nThe range of topics covered and the number of prominent contributors set this book apart from other available resources. Readers at all stages of their careers will gain the depth of understanding and practical information they need to approach all of the common clinical, organizational, and ethical challenges they face","torrent":{"xt":"urn:btih:dd9db30862d9335041df7d9daa35a55ef06381e8","amp;dn":"Oxford+Textbook+of+Correctional+Psychiatry+%5BPDF%5D%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd9db30862d9335041df7d9daa35a55ef06381e8","infoHashBuffer":{"type":"Buffer","data":[221,157,179,8,98,217,51,80,65,223,125,157,170,53,165,94,240,99,129,232]},"announce":[],"urlList":[]}}