{"title":"African Pearls - Mali 70, Electric Mali [FLAC] TQMP","uid":6962817,"size":627718241,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ddc29258c1dca19fcfea559d1f63d255712afb30&amp;dn=African+Pearls+-+Mali+70%2C+Electric+Mali+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"pastafari","files":-1,"time":1326820877,"description":"Various Artists - African Pearls: Mali 70, Electric Mali\n2008\n\n* * * * * * * * * * * * * * * * * *\n\nThis is my favourite African Pearls compilation along with Guinee, The Discotheque Years. Here's a chance to listen to the great bands of Mali from that glorious period before synthesisers and programming ruined everything. Super Rail Band, National Badema, Super Biton, Mopti, Super Djata, Les Ambassadeurs and with them Salif Keita, Kante Manfila, Kasse Mady Diabate, Djelimady Tounkara, Zani Diabate, Sorry Bamba... you name it - la crema de la crema, as we say in Spanish. Enjoy!\n\n* * * * * * * * * * * * * * * * * *\n\nReview -\n\nWhile Stern's marches forward with its stellar series of classic Congolese, Guinean and Malian music from the golden era (much of which we have not heard before), Sylla seems to reissue his back catalogue and throw in a few tracks from other labels to sweeten the pot. But the newest take on Mali in the ongoing African Pearls series is more than a repackaging job. I examined the playlist before laying down mega moolah on it, and I was surprised to find I only have a third of the tracks. But I was suspicious because Sylla has a history of mislabelling tracks, and at $30, including tax, it's a big investment in 2 rather dubious pieces of plastic. Remember when CDs first appeared in 1983? The marketers said they were going to be cheaper than LPs but they were immediately more expensive. They don't last as long and no one ever properly addressed the reduced scale of the package to make the information accessible. Perhaps the era of the CD is already over, to be replaced by virtual music. In future, no two records will be the same. From this set, I would have preferred to download the tracks I wanted and burn a disc to avoid the overlap with other CDs in my Mali shelf.\n\nThe first track &quot;Duga&quot; by Orchestre Regional de Kayes is grandiose and declamatory: the singer is almost admonishing you, over a restrained riff, until the electric guitar comes sliding in from the thinnest of thin blue pre-dusk twilight heavens, plaintively ordering the drums. Then the singer commands the sax to appear, very magisterially. This selection comes from a Barenreiter release (as does &quot;Boro&quot; by Orchestre Regional de Mopti, which is B4 here), and reminds me again how I wish someone would do a CD box set of those 15 Barenreiter albums that tell the story of the origin of these youth bands. I have a handful of them on vinyl, but I am missing some (I am sure Barenreiter has outtakes and other goodies, if their vaults are at all organized), and as a compulsive collector and completist I want it all. Malian music (like that of its neighbour GuinÃƒÂ©e, so well documented by Graeme Counsel on the Stern's AuthenticitÃƒÂ© series) was reborn at Independence in 1968 with the griots going electric and the new black president organizing a biennial battle of the bands to bring the great talents out of the bush. Orchestre Regional de SÃƒÂ©gou won the first biennial, in July 1970, and after guitarist Mama Sissoko defected from Regional de Kayes to join them, they went on to win three more times, changing their name to Super Biton de SÃƒÂ©gou. One of the rarities is the 1973 Panorama du Mali LP, which featured two songs by Orch. Regional de Sikasso, &quot;Labanka&quot; &amp; &quot;Tiebaou,&quot; both collected here. &quot;Badialame,&quot; by the Rail Band, is from the same source. Rail Band fans will be glad to hear two obscure 45s by them from 1973, &quot;Tamadiara&quot; and &quot;Nanthan.&quot; &quot;Janfa&quot; by Orchestre National A previously came out on Stern's Legendary Bands of Mali, another essential compilation. The two Orchestre Regional de SÃƒÂ©gou tracks &quot;Saajuru&quot; &amp; &quot;Sisine,&quot; and two National Badema songs were on Syllart's Mali Stars and were also in his Belle Epoque CD series. Among new bands, there is Bida de la Capitale (I don't think it was fronted by Zim Bida, but who knows?) with an organ-driven instrumental groover and percussion that sounds like a steam press. The sax is a bit warbly, due to the poor recording. But the compensations include a smoking Ambassadeurs single from 1976: &quot;M'bouram-mousso.&quot; And to think this was a B side! As the fractured-english liner notes explain: &quot;The Ambassadeurs was founded in 1969 under the aegis of police officer Tiekoro Bagayogo who wanted his share of nightlife excitation.&quot; Disc one ends with total strangers Le MystÃƒÂ¨re Jazz de Tombouctou, an earnest and credible entry; but they deliver a blindingly great number on disc two, &quot;Leli,&quot; guaranteeing some of that nightlife excitation. The big names, Badema, Sikasso, SÃƒÂ©gou, dominate this compilation, which ranks high among classic African reissues. \n-- muzikifan.com\n\n* * * * * * * * * * * * * * * * * *\n\nTrack List\n\nDisc 1\n01 - Orchestre Regional de Kayes - Duga\n02 - Orchestre Regional de Sikasso - Labankan\n03 - Rail Band - Badialame\n04 - Bida de la Capitale - Kenuna\n05 - Super Djata Band - Sosso\n06 - Kanaga de Mopti - N'do n'do\n07 - Sid de Kayes - Moyola\n08 - Rail Band - Tamadiara\n09 - Le Super Biton National de Segou - Saajuru\n10 - Les Ambassadeurs du Motel de Bamako - Mbouran Mousso\n11 - Rail Band - Nanthan\n12 - Le Mystere Jazz de Tombouctou - Wale Tarekk Apolo\n\nDisc 2\n01 - Idrissa Soumaoro - Djama\n02 - Le Kene Star de Sikasso - Hodi Hu Yenyan\n03 - Ciwara Band - Noumou Lakouloumba\n04 - Orchestre Regional de Mopti - Boro\n05 - Le Mystere Jazz de Tombouctou - Leli\n06 - National Badema - Ciro\n07 - Le Super Biton de Segou - Siseni\n08 - Super Djata Band - Tiefaly\n09 - L'Orchestre National 'A' du Mali - Janfa\n10 - Orchestre Regional de Sikasso - Tiebaou\n11 - National Badema - Guede\n12 - Kanaga de Mopti - Kulukutu\n\n* * * * * * * * * * * * * * * * * * *\n\nEAC log and CUE sheet included.\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt;\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nTQMP. The Quality Music Project.","torrent":{"xt":"urn:btih:ddc29258c1dca19fcfea559d1f63d255712afb30","amp;dn":"African+Pearls+-+Mali+70%2C+Electric+Mali+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddc29258c1dca19fcfea559d1f63d255712afb30","infoHashBuffer":{"type":"Buffer","data":[221,194,146,88,193,220,161,159,207,234,85,157,31,99,210,85,113,42,251,48]},"announce":[],"urlList":[]}}