{"title":"America's Next Top Model Cycle 21 Episode 4 S21E04 (The Guy Who","uid":11015151,"size":380585680,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:ddd1b64489b40a872a5dc83205b9e28f81545bc4&amp;dn=America%27s+Next+Top+Model+Cycle+21+Episode+4+S21E04+%28The+Guy+Who+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"magisterjieko","files":1,"time":1410460093,"description":"The Guy Who Gets a Beard Weave\nOriginal Airdate: September 8, 2014\n\nThe remaining thirteen models arrive back home from elimination, and find Keith's photo displayed on the television. Mirjana quickly moves on from Matthew, and begins fooling around with Denzel instead, even though she has a boyfriend back at home. Meanwhile, Romeo insists on being a try hard Wiccan poseur.\n\nThe following day, the contestants are taken to Pershing Square, where they meet Yu Tsai and photographer An Le. The concept of the photo shoot is to create photographs depicting a twofold optical illusion by laying flat on the ground. Keith, Lenox, Ben, Raelia, Shei and Will do well during their session. Adam and Kari struggle to impress. Chantelle is called out on her over confidence, which is verging on arrogance. Most of the models struggle to hold their weight to create a pose, most notably Romeo and Denzel, who winds up cursing and storming off set after he is yelled at by Yu Tsai for being unable to hold up a bicycle.\n\nBack at the house the models find a box containing instructions for a scavenger hunt to find boxes each containing a specific make over. One of the boxes also includes a pair of 'magic shears'. The contestant who finds the shears is allowed to know exactly what their make over will be. Denzel ultimately finds the shears, and is told that he will be getting a lace front beard weave. Chantelle becomes agitated when she realizes that one of the boxes contains instructions for shaved hair, believing that that will be her make over.\n\nMake overs are administered at the Cristophe salon the next morning. Tyra brings Cory to the salon to encourage the models to accept whatever 'Ty-over' they are given. In preparation for a later photo shoot the models must also undergo DNA testing to determine their ancestry. Most people are satisfied with their new look, save Kari, who feels that her new hair makes her look like an alien.\n\nThe night before panel, Matthew and Will kiss. Mirjana, Denzel, and Keith begin to prod Matthew about why he kissed Will, insisting that he is gay.\n\nAt judging, Tyra reminds the models that since there is no challenge score for the week, their fan vote will be the only determining factor as to who gets eliminated once it's added to the judges scores. Lenox, Will, and Raelia and are given good reviews for their photographs. Ben receives the best feedback, and consequently earns best photo. Adam, Shei, Kari and Chantelle receive the heaviest criticism. Chantelle and Kari find themselves in the bottom two.\n\nChantelle is critiqued on not putting her beauty to good use in photographs, while Kari is reprimanded for her lack of neck in photos, and her inability to embrace her make over. The final scores are revealed, and a shocked Chantelle is eliminated from the competition just 0.1 of a point behind Kari, who is given a second chance.","torrent":{"xt":"urn:btih:ddd1b64489b40a872a5dc83205b9e28f81545bc4","amp;dn":"America%27s+Next+Top+Model+Cycle+21+Episode+4+S21E04+%28The+Guy+Who+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddd1b64489b40a872a5dc83205b9e28f81545bc4","infoHashBuffer":{"type":"Buffer","data":[221,209,182,68,137,180,10,135,42,93,200,50,5,185,226,143,129,84,91,196]},"announce":[],"urlList":[]}}