{"title":"Air Bud Movies Pack","uid":5662385,"size":3678388224,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:de11fae3e3dba32a3773936e2808a03deb317028&amp;dn=Air+Bud+Movies+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"Bigfoot420","files":5,"time":1278017629,"description":"Air Bud [1997]\n\nA young boy and a talented stray dog with an amazing basketball playing ability become instant friends. Rebounding from his father's accidental death, 12-year-old Josh Framm moves with his family to the small town of Fernfield, Washington. The new kid in town, Josh has no friends and is too shy to try out for the school basketball team. Instead he prefers to practice alone on an abandoned court, he befriends a runaway golden retriever named Buddy. Josh is amazed when he realizes that Buddy loves basketball...that is playing basketball...and he is GOOD! Josh eventually makes the school team and Buddy is named the Team Mascot. Josh and Buddy become the stars of halftime. Buddy's half-time talent draws media attention. Unfortunately, when Buddy's mean former owner, Norm Snively, comes along with a scheme to cash in on the pup's celebrity, it looks like they are going to be separated.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0118570/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0118570/&lt;/a&gt;\n\n\nAir Bud 2 - Golden Receiver [1998]\n\nThe Golden Reciever picks up where Air Bud left off. Josh, now legal owner of Buddy, now plays football with Buddy instead of Basketball!!! The movie takes place in the same town of Ferfield, Washington. Now in the 8th Grade, Josh discovers he has a great throwing arm and tries out for his school football team. It is then soon discovered that his dog, Buddy, can also make impossible catches, and the two become an unstoppable force. However, an evil duo of Russian circus-managers attempt to kidnap Buddy and use him as their main attraction, while the Timberwolves make it to the championship. Can Josh save Buddy before the big game?\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0140796/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0140796/&lt;/a&gt;\n\n\nAir Bud 3 - World Pup [2000]\n\nNot simply content with his basketball prowess, the hoop-shooting pooch sets his sights on soccer in this third installment. Soon enough, he's howling along with the U.S. Women's Soccer Team, playing with such notables as Brandi Chastain, Brianna Scurri, and Trisha Venturini. And this time out, Buddy also finds love, fathering a littler of lovable pups. And as if he didn't have enough to worry about with the championship game, he's got to save his little one from a gang of nefarious pup-nappers.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0161220/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0161220/&lt;/a&gt;\n\n\nAir Bud - Seventh Inning Fetch [2001]\n\nJosh is off to his first year of college and Buddy has stayed behind with Josh's little sister, Andrea and the rest of the family. Andrea, attempting to fit in with her Jr. High classmates, decides to join the baseball team and along the way discovers that Buddy is a talented baseball player. Just as the season is settling in, a terrible discovery is made - Buddy's puppies, have mysteriously started disappearing with the help of kidnappers' little helper, Rocky Raccoon. Air Bud must find her puppies and make it to the major leagues as he goes to bat for the Anaheim Angels!\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0288415/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0288415/&lt;/a&gt;\n\n\nAir Bud - Spikes Back [2002]\n\nBud is the bestest pal of Noah Framm (Jake D. Smith), a young lad who's trained his four-legged friend to dart through an obstacle course for a competition at the county fair. Bud's inevitable victory doesn't do much to lift the spirits of Noah's older sister Andrea , who's crushed that her best friend is moving away to California. Andrea wants to spend what's left of her summer in San Diego, hoping to earn enough money dogsitting to catch a plane due west. A destructive mishap empties her jar o' cash, but Andrea learns from her new neighbor Connor (Tyler Boissonnault) that the grand prize for a victory in a local volleyball championship is a trip to California. The only problem -- Andrea doesn't know how to play! After a couple of shaky games and a team member that's forced to bow out, it dawns upon Andrea that she has the perfect replacement waiting at home... \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0337812/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0337812/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:de11fae3e3dba32a3773936e2808a03deb317028","amp;dn":"Air+Bud+Movies+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de11fae3e3dba32a3773936e2808a03deb317028","infoHashBuffer":{"type":"Buffer","data":[222,17,250,227,227,219,163,42,55,115,147,110,40,8,160,61,235,49,112,40]},"announce":[],"urlList":[]}}