{"title":"The.Evil.Dead.1981.1080p.BluRay.x264.AC3-SARTRE","uid":15302937,"size":3743817835,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:de23b530da4eebcac356268773e1e11b0f36e145&amp;dn=The.Evil.Dead.1981.1080p.BluRay.x264.AC3-SARTRE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"sartre7","files":8,"time":1468504471,"description":"This auspicious feature debut from Sam Raimi -- shot on 16mm in the woods of Tennesse for around $350,000 -- secured the young director's cult status as a creative force to be reckoned with. The nominal plot involves five vacationing college kids -- Ash (Bruce Campbell), his girlfriend Linda (Betsy Baker), and their classmates Cheryl (Ellen Sandweiss), Scott (Hal Delrich) and Shelly (Sarah York) -- making an unplanned stopover in an abandoned mountain cabin surrounded by impenetrable woods. Before settling in for the night, they come across an ancient-looking occult tome filled with dense hieroglyphics and macabre illustrations, a dagger fashioned from human bones, and a reel-to-reel tape recorder. The taped message, dictated by a professor of archaeology, describes the contents of the Sumerian &quot;Book of the Dead,&quot; filled with incantations used to bring otherworldly demons to life, giving them license to possess the living. The message goes on to explain that those possessed by these demons can only be stopped by total bodily dismemberment. \r\n\r\nWhen played among the group later that evening, the professor's recorded translations of the ritual chants traumatize the strangely prescient Shelly ... and simultaneously release an ominous presence from the depths of the forest. The evil spirits take to their dirty work with gusto, first assuming control of Shelly and transforming her into a cackling, murderous hag with superhuman strength; the others imprison her in the fruit cellar and chain the trapdoor shut. The spirits then begin to possess the other women, including Linda -- who immediately turns on Ash with a barrage of punches and sadistic taunts. Unable to bring himself to chop up his lover's corpse, Ash gives her a more customary burial in the woods -- which proves to be a big mistake. As the others succumb to demonic influence, Ash's horrific predicament becomes increasingly grim until, when all hope seems lost, he stumbles upon a final, desperate solution to the ghoulish onslaught ... well, maybe not. \r\n\r\nDespite the shoestring production values, Raimi has fashioned a tight, lightning-paced fever dream of a movie, filled with operatic overacting and outrageously gory effects that give the project a comic-book feel. Based on an earlier 8mm short titled Within the Woods, this feature version was fraught with distribution difficulties before finding its first audience overseas. After considerable word of mouth (and a glowing endorsement from horror author Stephen King), the film became a hit on home video, where it achieved further notoriety thanks to its highly-publicized banning in Britain amid the notorious &quot;Video Nasties&quot; censorship campaign. Raimi, along with producer Robert Tapert, writer Scott Spiegel and much of the same crew, cranked up the story's comic aspects several dozen notches for the rollicking semi-remake, Evil Dead 2: Dead by Dawn.\r\n\r\n\r\n\r\n\r\n\r\nSTARS.........: Bruce Campbell, Ellen Sandweiss, Richard DeManincor\r\nDIRECTOR......: Sam Raimi\r\nWRITERS.......: Sam Raimi\r\nGENRE.........: Fantasy | Horror\r\nRATING........: 7.6/10  140,117 votes\r\nMETASCORE.....: 70\r\nIMDB link.....: http://www.imdb.com/title/tt0083907\r\nRUNTIME.......: 1h 25mn\r\nSIZE..........: 3.47GB\r\nVIDEO CODEC...: x264 (  )\r\nRESOLUTION....: 1920x1040\r\nASPECT RATIO..: 1.85:1\r\nBITRATE.......: 5000 Kbps (3-pass)\r\nFRAMERATE.....: 23.976 fps\r\nAUDIO1........: English AC3+ 5.1 512kbps\r\nAUDIO2........: Commentary with director Sam Raimi, actor Bruce Campbell and SPFX creator Robert Tappert\r\nAUDIO3........: Commentary with director Sam Raimi and SPFX creator Robert Tappert \r\nAUDIO4........: Commentary with Bruce Campbell\r\nSUBTITLES.....: ENG, GER, SPA\r\nCHAPTERS......: Yes\r\nSOURCE........: lhd-tanz.der.teu81.1080p.rmx\r\nENCODED BY....: Sartre\r\nENCODE DATE...: 2016-07-13","torrent":{"xt":"urn:btih:de23b530da4eebcac356268773e1e11b0f36e145","amp;dn":"The.Evil.Dead.1981.1080p.BluRay.x264.AC3-SARTRE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de23b530da4eebcac356268773e1e11b0f36e145","infoHashBuffer":{"type":"Buffer","data":[222,35,181,48,218,78,235,202,195,86,38,135,115,225,225,27,15,54,225,69]},"announce":[],"urlList":[]}}