{"title":"Aleister Crowley: Magick, Rock and Roll, and the Wickedest Man i","uid":11158910,"size":570505,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df63f5ae55a7a294f9e257a18dcc5b8db671ec35&amp;dn=Aleister+Crowley%3A+Magick%2C+Rock+and+Roll%2C+and+the+Wickedest+Man+i&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"thc-1138","files":1,"time":1412483711,"description":"Aleister Crowley: Magick, Rock and Roll, and the Wickedest Man in the World by Gary Lachman\n\n\n When the mystic, occult magician, poet, and founder of the religious philosophy of Thelema, Aleister Crowley died in an obscure boarding house in Hastings, England, on December 5 1947, at the age of 72, few knew he was to become one of the most enduring pop culture figures of the next hundred years.\n\n In this definitive work Gary Lachman traces both the arc of the occultist's strange and controversial life, and his influence on rock-and-roll giants from the Rolling Stones and Led Zeppelin, to Black Sabbath and Blondie, of which Lachman was a founding member.\n\n Twenty years after his death, in the middle of the Swinging Sixties, Crowley was more popular than he ever was in his lifetime. In 1967, the Beatles put him on the cover of Sgt. Pepper's Lonely Hearts Club Band. The Rolling Stones became, for a time, serious devotees, their music and image being groomed by one of Crowley's most influential disciples, the avant-garde filmmaker Kenneth Anger. His libertarian philosophies informed generations of notable heavy metal groups like Led Zeppelin, Black Sabbath, Metallica, and others, while these same beliefs form the subject of scholarly theses. His image hangs in goth rock bars, occult temples, and college dorm rooms alike, and he's turned up as a character in pop cultural environments from Batman comic books to Playstation video games.\n\n But ALEISTER CROWLEY is more than just a biography of this continually compelling and divisive figure it's also a portrait of his influence on modern pop culture and rock music. Lachman paints the first truly thorough portrait of one of the most famous occult figures of all time. ALEISTER CROWLEY show readers not only who The Great Beast was and where he came from, but also why he's still on our minds nearly one hundred years later. \n","torrent":{"xt":"urn:btih:df63f5ae55a7a294f9e257a18dcc5b8db671ec35","amp;dn":"Aleister+Crowley%3A+Magick%2C+Rock+and+Roll%2C+and+the+Wickedest+Man+i","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df63f5ae55a7a294f9e257a18dcc5b8db671ec35","infoHashBuffer":{"type":"Buffer","data":[223,99,245,174,85,167,162,148,249,226,87,161,141,204,91,141,182,113,236,53]},"announce":[],"urlList":[]}}