{"title":"The Lucy Show","uid":10519968,"size":36914239098,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dfa37490ed2ff8a8e7f32ae920a24d03bfffe5e5&amp;dn=The+Lucy+Show&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":13,"uploader":"Psychodad149","files":299,"time":1404962893,"description":"The Lucy Show\n\nSummary\n\n&quot;The Lucy Show&quot; was produced by Desilu and aired on CBS from 1962 to 1968. It was based on the humorous novel &quot;Life Without George&quot; by Irene Kampen. Desi Arnaz bought the entire rights to the novel in order to go ahead with &quot;The Lucy Show.&quot; However, the show gradually diverged significantly from the book. Originally starring Lucille Ball and Vivian Vance as single mothers sharing a house in Danfield, NY,  (Lucy Carmichael was a widow, but Vivian Bagley was divorced), with Lucy living frugally on her late husband's trust fund, and three children between them, Gale Gordon joined the show as Mr. Mooney in the second season and eventually Lucy became his secretary at the bank in which he was a manager. As the third season progressed, Viv and the children fell out of focus, and the Lucy/Mr. Mooney relationship began to prevail. Season 4 saw the most dramatic shift, as Lucy moves to California (of course Mr. Mooney follows!). It is explained that Viv stays behind in Danfield, while Chris, Lucy's daughter, has gone to college (one of the reasons Lucy has moved). while her son Jerry is sent to a military academy. Neither Viv nor children appear regularly after this, although Viv visits twice for full-episode appearances, while only Jerry makes even a cameo appearance after. \n\nThis is almost two entirely different shows, but both are just classic, brilliant Lucy! My personal opinion is that at their best, they are better than &quot;I Love Lucy.&quot; And only a few are less than best. I am terrifically impressed by Lucy's physical acting. She walks on stilts, swings on ropes, plays a stuntman . . . the list goes on and on.\n\nAnd Gale Gordon as Mr. Mooney! I think he is somewhat underappreciated these days. Also a brilliant comedian in his own right, the slow-burning straight man to Lucy's punch lines, yet instantly obsequious to clients, potential clients, or anyone he thinks has some money. In some ways, he foreshadows the now-better-known Basil Fawlty, although without Basil's streak of sheer insanity.\n\nAll in all, this IS &quot;must see TV&quot;, some of the best entertainment which ever went out over the airwaves, brilliant, classic, Americana.\n\n====\n\nComments and Episode Listing\n\nThis list of episodes, episode titles, and air dates reflects official release information provided by CBS.\n\nIn addition, I've included credits to guest stars who are not specifically named in the show title. These are usually those actors and actresses credited as guest stars, but sometimes note the appearance of someone else meriting mention, such as Lucie Arnaz, Lucy's own daughter, of course. Guest stars were very frequent in the later seasons, when Lucy is living in LA.\n\nThere were any number of semi-regulars in addition to the regular cast. Dick Martin, later famous for &quot;Rowan &amp; Martin's Laugh-In&quot;, makes regular appearances as Lucy &amp; Viv's neighbor in the 1st Season (Dan Rowan appears in a later episode.) Mary Jane Croft, who had appeared in &quot;I Love Lucy&quot; as Betty Ramsay, is a regular in the later seasons.  Noted character actors Ray Kellogg, Sid Gould, and Herb Vigran also appear with some frequency.\n\nAnd of course: &quot;Co-starring Gale Gordon.&quot; Gordon had a particular claim of distinction, as being the only actor to have appeared with Lucy in all her different series. He co-starred with Lucy in her first hit show, &quot;My Favorite Husband,&quot; the radio show which was the forerunner of &quot;I Love Lucy.&quot; He was paired with another legend, Bea Benadaret, and the two played Rudolph and Iris Atterbury, the sensible neighbors to George and Liz Cugat (later, Cooper.)\n \nGordon appeared twice on &quot;I Love Lucy,&quot; as the owner of the Tropicana nightclub where Ricky Ricardo performed. It is true, not just an &quot;urban legend,&quot; that Gordon and Benadaret were first asked to play the Mertzes, but they each had conflicting contractual obligations which prevented them.  \n\nAlong with his run on &quot;The Lucy Show,&quot; he went on to star with her again in &quot;Here's Lucy,&quot; and came out of retirement to appear with her in the ill-fated &quot;Life With Lucy.&quot; \n\nA purely incidental note: Gordon and Benadaret co-starred in a limited-run radio show (six episodes) called &quot;Granby's Green Acres,&quot; which was, obviously, the forerunner to TV's later &quot;Green Acres.&quot; This, and the entire extant collection of &quot;My Favorite Husband&quot; are included in this collection.\n\n","torrent":{"xt":"urn:btih:dfa37490ed2ff8a8e7f32ae920a24d03bfffe5e5","amp;dn":"The+Lucy+Show","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfa37490ed2ff8a8e7f32ae920a24d03bfffe5e5","infoHashBuffer":{"type":"Buffer","data":[223,163,116,144,237,47,248,168,231,243,42,233,32,162,77,3,191,255,229,229]},"announce":[],"urlList":[]}}