{"title":"SOA Governance {BBS}","uid":6768243,"size":22436420,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfe8aa12f0c4bb7ad08c657a33d115065b78978d&amp;dn=SOA+Governance+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1319476291,"description":"The Definitive Guide to Governing Shared Services and SOA Projects\n\n \n\nSOA Governance: Governing Shared Services On-Premise and in the Cloud is the result of a multi-year project to collect proven industry practices for establishing IT governance controls specific to the adoption of SOA and service-orientation. Authored by world-renowned experts in the fields of SOA, IT governance, and cloud computing, this comprehensive book provides clear direction as to what does and does not constitute SOA governance and then steps the reader through the most important industry governance practices, as they pertain to individual SOA project lifecycle stages.\n\n \n\nWith a consistent, vendor-neutral focus, and with the help of case study examples, the authors demonstrate how to define and position precepts, organizational roles, processes, standards, and metrics. Readers benefit from thorough and visually depicted cross-references and mapping between roles, processes, precepts, and project stages, enabling them to fully explore dynamics and dependencies and thereby learn how to use these governance controls to create their own custom SOA governance systems.\n\n \n\nThis important title will be valuable to every practitioner concerned with making SOA work, including senior IT managers, project managers, architects, analysts, developers, administrators, QA professionals, security specialists, and cloud computing professionals.\n\n \n\nTopic Areas\n\n    *\n      Defining SOA governance\n    *\n      Establishing an SOA governance office and program\n    *\n      Working with proven SOA governance precepts and processes\n    *\n      Identifying organizational roles and relating them to SOA governance\n    *\n      Associating design-time and runtime SOA project stages with SOA governance controls\n    *\n      Governance considerations specific to shared services\n    *\n      Roles, precepts, and factors specific to cloud-based services\n    *\n      Understanding and categorizing SOA governance products and technologies\n    *\n      Applying governance controls as early as the planning stages and measuring their success in subsequent stages\n    *\n      Using vitality triggers to govern shared services on an on-going basis\n    *\n      SOA governance controls that pertain to business information documents and policies\n\n\n\n# Hardcover: 704 pages\n# Publisher: Prentice Hall; 1 edition (April 24, 2011)\n# Language: English\n# ISBN-10: 0138156751\n# ISBN-13: 978-0138156756","torrent":{"xt":"urn:btih:dfe8aa12f0c4bb7ad08c657a33d115065b78978d","amp;dn":"SOA+Governance+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfe8aa12f0c4bb7ad08c657a33d115065b78978d","infoHashBuffer":{"type":"Buffer","data":[223,232,170,18,240,196,187,122,208,140,101,122,51,209,21,6,91,120,151,141]},"announce":[],"urlList":[]}}