{"title":"Samantha Fox - Greatest Hits (1992) [CD Rip] 320 vtwin88cube","uid":6232905,"size":181224227,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dff2276598214eb7b2c8f4d0afcabb680f979e85&amp;dn=Samantha+Fox+-+Greatest+Hits+%281992%29+%5BCD+Rip%5D+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1299769416,"description":"Samantha Fox\nGreatest Hits (1992)\n\n\nWhen she was 16 years old, Samantha Fox rose to stardom in Britain as a topless model in the Daily Sun newspaper. Fox's popularity as a model soon led to a record contract. She released her first single, &quot;Touch Me (I Want Your Body),&quot; in 1986. &quot;Touch Me&quot; set the pattern for her career -- frothy, sexually suggestive dance-pop with good beats and sketchy melodies. Throughout her career, Fox always accentuated her sex appeal, making it take priority over her music. Nevertheless, she had a fairly long string of hits, beginning with the U.K. number three single &quot;Touch Me.&quot; &quot;Do Ya, Do Ya (Wanna Please Me)&quot; followed her debut single into the British Top Ten. \n\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nGrabber:\t\tdBpoweramp Release 14\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tPop/Rock\t\t\nSource:\t\t\tRetail CD\t\nLabel:\t\t\tJive\n\nBritish pinup turned pop star Samantha Fox collected a healthy number of dance-pop hits in the late 1980s and early 1990s, and they are all collected on her 1992 Greatest Hits set. Her early hits, including the steamy Top Ten &quot;Touch Me (I Want Your Body),&quot; which kick-started her career, and its follow-up, the almost-rocker &quot;Do Ya Do Ya (Wanna Please Me),&quot; are prime examples of classic 1980s pop, with just a hint of hair-band rock (especially evident on &quot;Spirit of America&quot;). From there the album moves into the straight pop of &quot;Nothing's Gonna Stop Me Now,&quot; which was produced by hit-making machine Stock, Aiken and Waterman, as was her bubblegum (but highly satisfying) version of Dusty Springfield's &quot;I Only Wanna Be With You.&quot; Her other big U.S. Top Five hit, &quot;Naughty Girls (Need Love Too),&quot; is also present, but in a terribly edited version. In the early 1990s, Fox's music took a more straight-forward house/dance turn, evident on great singles like the Top Ten &quot;I Wanna Have Some Fun&quot; and the steamy, red-hot &quot;Love House.&quot; Other highlights include the catchy dance track &quot;I Promise You,&quot; the terrific single &quot;Another Woman (Too Many People)&quot; (arguably one of the album's best songs), and the bonus, non-listed &quot;U.K. Megamix.&quot; Also included are several rarities, including &quot;Hot Lovin',&quot; the guitar-heavy &quot;Giving Me a Hard Time,&quot; and &quot;Even in the Darkest Hours.&quot; A surprisingly diverse collection from a singer many regarded as little more than a commercial gimmick. \n\n\nTrack List:\n\n01.Touch Me (I Want Your Body)\n02.Do Ya Do Ya (Wanna Please Me)\n03.Nothing's Gonna Stop Me Now\n04.I Only Want To Be With You\n05.I Surrender (To The Spirit Of The Night)\n06.I Wanna Have Some Fun\n07.Hold On Tight\n08.Just One Night\n09.Naughty Girls (Need Love Too)\n10.I Promise You (Get Ready)\n11.(I Can't Get No) Satisfaction\n12.Love House\n13.Another Woman (Too Many People)\n14.Spirit Of America\n15.Hot Lovin'\n16.Giving Me A Hard Time\n17.Even In The Darkest Hours\n18.UK Megamix\n\n\n\nCheers!","torrent":{"xt":"urn:btih:dff2276598214eb7b2c8f4d0afcabb680f979e85","amp;dn":"Samantha+Fox+-+Greatest+Hits+%281992%29+%5BCD+Rip%5D+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dff2276598214eb7b2c8f4d0afcabb680f979e85","infoHashBuffer":{"type":"Buffer","data":[223,242,39,101,152,33,78,183,178,200,244,208,175,202,187,104,15,151,158,133]},"announce":[],"urlList":[]}}