{"title":"Titanic Adventure Out of Time","uid":4402709,"size":1308223488,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e064ff5673d98ea550d5434c9232c6fc8e31fdb3&amp;dn=Titanic+Adventure+Out+of+Time&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"yomislih","files":2,"time":1221781358,"description":"A British secret agent is sent on board the HMS Titanic on her maiden voyage in 1912 for a top secret mission. He is to receive his instructions from a contact on board the ship and has been ordered not to leave his cabin until then. Finally, on the evening of 14th April, 4 days after leaving Southampton, British agent Penny Pringle, his contact, arrives and orders him to watch a shady German diplomat. While there, he meets up with an old friend, Lady Georgia Lambeth, and helps her get away from her drunken, bankrupt husband Lord Charles Lambeth, uncovers a scandalous secret about one of the ships financers, and discovers that the steel used to construct the ship is not as safe as everyone thought. Then, the Titanic collides with an iceberg and starts to sink rapidly. Will you survive? Will you complete your mission? If you do, you could prevent Hitlers rise to power, World War I, even the Bolshevik Revolution.\n\n\nTwo ISO Files.  Burn them or mount them and you&amp;#039;re set.\n\n\nAnother hard to find torrent.  This is one of my favorite games of all time.  I hope you enjoy.  Also check out Dust: A Tale of the Wired West.\n\n","torrent":{"xt":"urn:btih:e064ff5673d98ea550d5434c9232c6fc8e31fdb3","amp;dn":"Titanic+Adventure+Out+of+Time","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e064ff5673d98ea550d5434c9232c6fc8e31fdb3","infoHashBuffer":{"type":"Buffer","data":[224,100,255,86,115,217,142,165,80,213,67,76,146,50,198,252,142,49,253,179]},"announce":[],"urlList":[]}}