{"title":"El.Cid.1961.1080p.BluRay.x264.DTS-SARTRE","uid":14337431,"size":6341942294,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:e0d06cfd101eb8e70037cd3b258b913db8a16693&amp;dn=El.Cid.1961.1080p.BluRay.x264.DTS-SARTRE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"sartre7","files":18,"time":1460727378,"description":"Charlton Heston's knack for wearing the mantle of larger-than-life characters serves him well in this 1961 Anthony Mann film of a noble Spanish warrior's campaign to unite his divided country against the threat of a Moorish invasion. Amid the pageantry of 11th century feudal Spain, Heston portrays the legendary Rodrigo Díaz de Vivar, known to history as El Cid Campeador, &quot;the Lord Champion.&quot; Based on accounts of the Cid in El Cantar de Mio Cid circa 1200, the motion picture idealizes Rodrigo as a selfless knight committed to his cause even when his own wife, his king, and his people scorn him. Heston plays his role to the hilt, literally, as he wields sword, lance, and dagger against his enemies. Among the highlights of the film are a spectacular joust to the death over a disputed city and a seaside battle with flying arrows, shining scimitars, charging cavalry, and beating drums.\r\n\r\nWhen French playwright Pierre Corneille wrote El Cid, a fanciful version of the life of 11th-century Spanish hero Rodrigo Diaz de Bivar, aka &quot;El Cid&quot;, an attempt was made to honor the &quot;classic unities&quot; and to compress the whole story into a single day! Be assured that the 1961 film version of El Cid is more faithful to the actual chronology. Charlton Heston adds one more character to his gallery of historical portrayals as El Cid, the disgraced Spanish knight who rids his country of its Moorish conquerors. The triumphs of El Cid's military life are not matched by his private affairs; he is betrayed by his bride Chimene (Sophia Loren) and is made a political pawn by the avaricious Spanish landowners. El Cid has a climax unique in the annals of movie epics: the final assault against the landgrabbers is led by a dead hero. El Cid established the short but generally profitable reign of producer Samuel Bronston as the King of the Epics; his imprint on the film is much stronger than that of director Anthony Mann.\r\n\r\n\r\n\r\n\r\nSTARS.........: Charlton Heston, Sophia Loren, Raf Vallone\r\nDIRECTOR......: Anthony Mann\r\nWRITERS.......: Fredric M. Frank (story), Philip Yordan (screenplay)\r\nGENRE.........: Adventure | Biography | Drama\r\nRATING........: 7.3/10   9,499 votes\r\nIMDB link.....: http://www.imdb.com/title/tt0054847\r\nRUNTIME.......: 3h 08mn\r\nSIZE..........: 5.89 GiB\r\nVIDEO CODEC...: x264 (  )\r\nRESOLUTION....: 1920x816\r\nASPECT RATIO..: 2.35:1\r\nBITRATE.......: 3500 Kbps (3 Pass)\r\nFRAMERATE.....: 23.976 fps\r\nAUDIO1........: English DTS 5.1 768 Kbps\r\nAUDIO2........: Commentary by Samuel Bronston biographer Neal M. Rosendorf and son Bill Bronston\r\nSOURCE........: Blu Ray Remux\r\nSUBTITLES.....: ARA, DAN, ENG, FRE, GRE, PER, SPA\r\nCHAPTERS......: Yes\r\nENCODED BY....: Sartre\r\nENCODE DATE...: 2016-04-12\r\n\r\n\r\n\r\n\r\nScreenshots\r\n \nhttp://postimg.org/gallery/hx64067y/89054001/","torrent":{"xt":"urn:btih:e0d06cfd101eb8e70037cd3b258b913db8a16693","amp;dn":"El.Cid.1961.1080p.BluRay.x264.DTS-SARTRE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0d06cfd101eb8e70037cd3b258b913db8a16693","infoHashBuffer":{"type":"Buffer","data":[224,208,108,253,16,30,184,231,0,55,205,59,37,139,145,61,184,161,102,147]},"announce":[],"urlList":[]}}