{"title":"Dr. Axelrod's Atlas of Freshwater Aquarium Fishes (2004) Gooner","uid":13379968,"size":246295639,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e12060ad64264d85ae3dd0891c75e7b029d99b0c&amp;dn=Dr.+Axelrod%27s+Atlas+of+Freshwater+Aquarium+Fishes+%282004%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1454267726,"description":"Dr. Axelrod's Atlas of Freshwater Aquarium Fishes - 9th Revised Edition (2004).pdf Gooner\r\n\r\nScanned: Perfectly Readable/Viewed\r\nPublisher: TFH Publications; 9th Revised Edition (October 2004)\r\nLanguage: English\r\nISBN-10: 0793800331\r\nISBN-13: 978-0793800339\r\n\r\nWhether you are a dedicated tropical fish hobbyist, researcher, dealer, or wildlife agent, Dr. Axelrod's Atlas of Freshwater Aquarium Fishes offers a reliable zoogeographical method of listing species for a unique and simplified approach to fish identification. With hundreds of taxonomic changes since the previous edition, the Atlas incorporates a common name index as well as a scientific name index to the species identified within. It also provides full-color photos for more than 7,000 species of freshwater fishes from around the world, with emphasis on the most popular groups. New and improved photos of key species increase the informational value of the book over the previous edition.\r\n\r\nSpecies added to this 9th revised edition of the Atlas include several rare livebearing species, along with a wide assortment of new-to-the-book fishes from the popular Neotropical cichlids group, South American killifish species, South American loricariid catfish group, and relatives of the popular Siamese Fighting Fish, Betta splendens. Added species very recently appearing on the aquarium scene also include the Vietnamese White Cloud, Endler's Livebearer, the Goo-Obo Gudgeon, Denison's Red Lined Barb, and the Dwarf Blue Rainbowfish among others.\r\n\r\nFeaturing newly added species, superior photography, and more informative content than ever before, the revised 9th edition of Dr. Axelrod's Atlas of Freshwater Aquarium Fishes is an essential ichthyological reference book that provides quick but accurate identifications to a wide selection of the hobby's most notable aquarium fishes","torrent":{"xt":"urn:btih:e12060ad64264d85ae3dd0891c75e7b029d99b0c","amp;dn":"Dr.+Axelrod%27s+Atlas+of+Freshwater+Aquarium+Fishes+%282004%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e12060ad64264d85ae3dd0891c75e7b029d99b0c","infoHashBuffer":{"type":"Buffer","data":[225,32,96,173,100,38,77,133,174,61,208,137,28,117,231,176,41,217,155,12]},"announce":[],"urlList":[]}}