{"title":"Cassandra Clare - (The Infernal Devices 02) - Clockwork Prince ,","uid":6870880,"size":1336491,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1260cfcab869360882efe9476e4313783c30de4&amp;dn=Cassandra+Clare+-+%28The+Infernal+Devices+02%29+-+Clockwork+Prince+%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"karaokeking123","files":-1,"time":1323271128,"description":"Cassandra Clare - (The Infernal Devices 02) - Clockwork Prince ,epub,mobi,KK\n\nIn the magical underworld of Victorian London, Tessa Gray has at last found safety with the Shadowhunters. But that safety proves fleeting when rogue forces in the Clave plot to see her protector, Charlotte, replaced as head of the Institute. If Charlotte loses her position, Tessa will be out on the street and easy prey for the mysterious Magister, who wants to use Tessa's powers for his own dark ends.\n\nWith the help of the handsome, self-destructive Will and the fiercely devoted Jem, Tessa discovers that the Magister's war on the Shadowhunters is deeply personal. He blames them for a long-ago tragedy that shattered his life. To unravel the secrets of the past, the trio journeys from mist-shrouded Yorkshire to a manor house that holds untold horrors, from the slums of London to an enchanted ballroom where Tessa discovers that the truth of her parentage is more sinister than she had imagined. When they encounter a clockwork demon bearing a warning for Will, they realize that the Magister himself knows their every move and that one of their own has betrayed them.\n\nTessa finds her heart drawn more and more to Jem, though her longing for Will, despite his dark moods, continues to unsettle her. But something is changing in Will; the wall he has built around himself is crumbling. Could finding the Magister free Will from his secrets and give Tessa the answers about who she is and what she was born to do?\n\nAs their dangerous search for the Magister and the truth leads the friends into peril, Tessa learns that when love and lies are mixed, they can corrupt even the purest heart.\n\nEnjoy!","torrent":{"xt":"urn:btih:e1260cfcab869360882efe9476e4313783c30de4","amp;dn":"Cassandra+Clare+-+%28The+Infernal+Devices+02%29+-+Clockwork+Prince+%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1260cfcab869360882efe9476e4313783c30de4","infoHashBuffer":{"type":"Buffer","data":[225,38,12,252,171,134,147,96,136,46,254,148,118,228,49,55,131,195,13,228]},"announce":[],"urlList":[]}}