{"title":"G3 Joe Satriani Steve Vai Yngwie Malmsteen - Live in Denver 2003","uid":6188286,"size":734365696,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e148dd614d0bc4b3d4ec2a0fc8e322a5bc67642a&amp;dn=G3+Joe+Satriani+Steve+Vai+Yngwie+Malmsteen+-+Live+in+Denver+2003&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"l.diliberto","files":1,"time":1298196426,"description":"G3 Joe Satriani Steve Vai Yngwie Malmsteen - Live in Denver 2003 [DVDrip Mp3] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=52625&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=52625&lt;/a&gt;\n\nThe Live In Denver concert was recorded from a stop on what is now the fifth G3 tour and was recorded at The Fillmore Auditorium, Denver, Colorado, on October 20, 2003. It is hard to believe that G3 has already completed five tours since its inception in 1996. I thought it was going to be a one-time thing, allowing tour mastermind Joe Satriani to tour together with his friend and fellow guitar wizard Steve Vai, but the tours were such a success, and the reception was so overwhelming, they have decided to make it an almost-annual event. To keep from getting stale, Satriani and Vai invite a different world-class guitarist to join them on each of the tours. For the this particular tour, the guest was non other than the legendary Yngwie Malmsteen.\n\nThe DVD begins with a selection of five songs from Joe Satriani's set. The first thing you notice is the atrocious looking stage show, which is overwhelmed by a hideous looking, silver, reflective curtain that serves as a backdrop for the entire stage. This was annoyingly distracting throughout the entire concert, as the lights reflected off the bright surface and into the cameras, which made it very difficult to see, and took the focus away from the performers. This was just a terrible design choice. Satriani opened his set with his signature song &quot;Satch Boogie&quot;.\n\nThe first thing you notice is that the guitar mix is loud and in your face. The rear surround speakers were used very aggressively to project the guitar almost as loudly as the main speakers. Satriani's guitar sounded a little thin and trebly during his set. Matt Bissonette received a very complimentary bass mix here, and he sounded thunderous. The drums were heard mainly through the center channel and were not quite as crisp sounding as on the first G3 DVD.\n\nSatriani was on the top of his game, as usual. After tearing through a smoking version of &quot;Satch Boogie&quot;, he delved straight into the ultra-heavy rocker &quot;The Extremist&quot;, where Joe also showed off his harmonica skills. He slowed things down a little bit next with a melodic, bluesy performance of &quot;Starry Night&quot;, which is from his latest album. After giving a virtual two-hand tapping clinic on the echo-drenched &quot;Midnight&quot;, he ended his set with a scorching version of &quot;The Mystical Potato Head Groove Thing&quot;. Satriani's performance was good overall, he could do this in his sleep, but it just wasn't overly inspiring. He gave much better performances on the first G3 DVD, and on his own Live In San Francisco DVD.\n\nNext up was Steve Vai. He had with him the same all star band that appeared on his Live At The Astoria DVD, with the exception of Jeremy Colson on the drums replacing Virgil Donati. This great band features legendary bassist Billy Sheehan, and shred guitar semi-legend Tony Macalpine. I am impressed with the fact that Vai always brings other exceptional guitarist with him on tour, in order to properly reproduce his complex arrangements live. He has also used the incredible Mike Keneally in the past, including the first G3 tour.\n\nVai begins his set sitting in a chair with a fantastic three-neck electric guitar sitting in his lap. He begins by playing nice melodies on the top, twelve-string neck, and eventually uses every inch of the entire guitar in demonstrating virtually every technique, speed, and style he is capable of playing. This amazing performance leads into the song &quot;I Know You're Here&quot;, which Steve also sings. He and Satriani have very similar vocal styles - no range, and nothing you want to hear used too often. His second song was a straight ahead rocker called &quot;Juice&quot;, which sounded a lot like a Satriani tune. This one wasn't that impressive.\n\nVai closed his set with &quot;I'm The Hell Outta Here&quot;, another fairly lackluster rocker that was only saved by a monster jam session at the end, which featuring a duel between all three guitarists. At one point, Vai, Macalpine, and Weiner are all side by side, fretting each others guitars as they each rip through solos that would put the average guitarist to shame. I thought Vai picked some week songs for his set, and was disappointed that only three of his songs were included on the DVD.\n\nLast up was the Swedish speedmeister himself Yngwie Malmsteen. I was never much of a fan of Malmsteen, as I found his playing rather repetitive and without any soul. His performance here only helped to drive that opinion home. For those fans of Yngwie, I will certainly give the man credit where credit is due. He definitely would get no objection from me for claiming to be the fastest gun in the west. For sheer speed and precision alone, he is still the man. Probably only John Petrucci, or Vai and Satriani themselves can touch him.\n\nThat is all fine if you enjoy listening to someone fire off a million notes a minute, without any sense of melody or rhythm. The guy just can't seem to help himself. Obviously, during the performance of his own songs he is going to flaunt his signature style of Paganini and Bach inspired, hyper-speed, metal riffs, but even during the G3 Jam he just could not hold back and play to fit the song, like Vai and Satch did. The most impressive part of Malmsteen's set was his acoustic guitar solo, which sounded like Al DiMiola on steroids.\n\nHe closed the show with his classic &quot;Far Beyond The Sun&quot; from his first album Rising Force. Yngwie definitely gives an energetic and entertaining performance. His trademark moves of spinning his guitar completely around his body and kicking his legs out in sync with a riff-ending drum beat were out in full force this night. That guitar spin move gets really annoying after about the second time though.\n\nVai, Satriani, and Malmsteen returned to the stage to perform the traditional G3 Jam. This night would feature Neil Young's &quot;Rockin' In The Free World&quot; and Jimi Hendrix's &quot;Little Wing&quot; and &quot;Voodoo Child (Slight Return)&quot;. Satriani took the lead vocals on &quot;Rockin In The Free World&quot;. Holy Christ did he look stoned during this encore. His eyes looked like little red slits behind those weird tinted glasses, and he had this big goofy grin on his face the entire time. Must be nice to be that fucked up and still play flawlessly.\n\nThis was a great jam but the ending seemed to go on forever as they traded what seemed like about 50 solos back and forth before concluding. Yngwie annoyed the hell out of me and he nearly ruined the song with his inappropriate and incessant super-sonic speed runs throughout the song. He is so one dimensional. Vai took the lead vocals on &quot;Little Wing&quot; and played some amazingly melodic and soulful guitar throughout.\n\nThe version on Vai's Astoria DVD is much better than this one, because it doesn't have all of the showing off. It was Yngwie's turn to sing &quot;Voodoo Child&quot;, and his &quot;singing&quot; made Vai and Satch's vocals sound like friggin' Robert Plant. Holy shit is he a horrendous singer. I promise I will never put down his guitar playing again - I take that back, he played this song terribly. It was generally just not a good version, as all three guitarists were just trying to one-up each other throughout the entire song.\n\nThe production quality of this DVD is comparable to the first G3 DVD. The picture was reasonably clear and sharp, but the reflective stage backdrop created a lot of glare and color problems. The camera work was performed well. Most of the good guitar solos were presented as close-ups to show the guitarists fretwork, which is a must for this type of concert. The audio quality was excellent. Each of the guitarists sets varied slightly in sound mix quality, but they all provided for some decent instrument separation and an authentic live feel.\n\nI only wish they would have released the 2001 G3 tour, with John Petrucci, on DVD instead of this one. Actually it would be nice if they released every tour on DVD, so long as the guest guitarist rocks, and the set lists are fresh and new.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://pixhost.info/avaxhome/f9/c0/0010c0f9_medium.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pixhost.info/avaxhome/f9/c0/0010c0f9_medium.jpeg&lt;/a&gt;\n\n.: TrackList :.\n\n\nJOE SATRIANI:\n1. Search Boogie\n2. The Extremist\n3. Starry Night\n4. Midnight\n5. The Mystical Potato Head Groove Thing\n\nSTEVE VAI:\n6. I Know You're Here\n7. Juice\n8. I'm The Hell Outta Here\n\nYNGWIE MALMSTEEN:\n9. Evil Eye\n10. Baroque And Roll\n12. Adagio\n13. Far Beyond The Sun\n\nTHE G3 JAM:\n14. Rockin' In The Free World\n15. Little wing\n16. Voodoo Child (Slight Return)","torrent":{"xt":"urn:btih:e148dd614d0bc4b3d4ec2a0fc8e322a5bc67642a","amp;dn":"G3+Joe+Satriani+Steve+Vai+Yngwie+Malmsteen+-+Live+in+Denver+2003","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e148dd614d0bc4b3d4ec2a0fc8e322a5bc67642a","infoHashBuffer":{"type":"Buffer","data":[225,72,221,97,77,11,196,179,212,236,42,15,200,227,34,165,188,103,100,42]},"announce":[],"urlList":[]}}