{"title":"Dream On - All Seasons","uid":5189913,"size":23906974007,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e196fb09cdc5dc6613de84312962ce0920379db5&amp;dn=Dream+On+-+All+Seasons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":6,"uploader":"eroticaxp","files":-1,"time":1259636621,"description":"I proudly give you the full collection of Dream On, a TV series from the late 90's. It was scattered all over TPB. I just placed all eps in one torrent. All eps are ripped at a fair quality. Source is unknown due to lack of NFOs on the original torrents. I have randomly tested various eps and all seem to be fine. The language is ENGLISH and there are NO SUBTITLES. Have fun, GOD INTERNET SPEED and keep seeding.\n\n\nPersonal note to first leechers: For as long as i will be the only seeder around here there might be some downtime due to my computer and my relocation FOR SHORT PERIODS of time, no more than 24 hours. Do not worry because &quot;i'll be back&quot;, so dont crank out and abort the download.\n\n\nAbout Dream On:\n\nCult adult comedy about dreamer Martin Tupper, whose life is full of colourful characters. Divorced and living with his growing teenage son, still friends with his ex-wife, and constantly looking for dates, but without a clue how to relate to women. Working as a book editor, with a ditsy, headstrong secretary, who cramps his style as often as helping him. The series is crammed full of hundreds of clips from all manner of old films, used as metaphors for Martin's reactions (hence the title); and it is renowned for its use of sexual references, plus, in its early seasons, occasional swearing and numerous scenes of nudity.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0098780/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0098780/&lt;/a&gt;","torrent":{"xt":"urn:btih:e196fb09cdc5dc6613de84312962ce0920379db5","amp;dn":"Dream+On+-+All+Seasons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e196fb09cdc5dc6613de84312962ce0920379db5","infoHashBuffer":{"type":"Buffer","data":[225,150,251,9,205,197,220,102,19,222,132,49,41,98,206,9,32,55,157,181]},"announce":[],"urlList":[]}}