{"title":"Surface Area and Porosity Determinations by Physisorption","uid":16018892,"size":3059177,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1ac5fd9640a667ab05a2a35815b30f0deaa47ba&amp;dn=Surface+Area+and+Porosity+Determinations+by+Physisorption&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"clouderone","files":1,"time":1476321428,"description":"Surface Area and Porosity Determinations by Physisorption - James B. Condon (Elsevier, 2006).pdf\r\n\r\nSurface Area and Porosity Determinations by Physisorption is a practical guide for industry or academics to the measurement of surface area and pore size using the tool of physical adsorption. Starting with a brief description of what physical adsorption is and the raw data that is obtained. The instrumentation for measuring this isotherm is described in some details. Recommendations are presented as to what instrumentation would be most appropriate for a particular application. An appendix of current commercial instruments is included. \r\n\r\nThe mathematics required for the simple analysis of the obtained isotherm is presented with step-wise instructions for the analysis of the more useful analysis methods. Subsequent chapters describe the analyses and the theories behind the analyses in more detail. \r\n\r\n* Includes over 150 figures and tables which illustrate the equipment and examples data acquired \r\n* Provides a practical guide for measuring and interpreting physical adsorption \r\n* Up-to-date aspects of the more subtle physical adsorption theories such as density functional theory and the quantum mechanical chi theory are presented","torrent":{"xt":"urn:btih:e1ac5fd9640a667ab05a2a35815b30f0deaa47ba","amp;dn":"Surface+Area+and+Porosity+Determinations+by+Physisorption","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1ac5fd9640a667ab05a2a35815b30f0deaa47ba","infoHashBuffer":{"type":"Buffer","data":[225,172,95,217,100,10,102,122,176,90,42,53,129,91,48,240,222,170,71,186]},"announce":[],"urlList":[]}}