{"title":"Great Bulgarian Folk Music with Bagpipes","uid":3629732,"size":37579961,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e217b7462c0cca3937bd2a4d83cdffbff42e8202&amp;dn=Great+Bulgarian+Folk+Music+with+Bagpipes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"cornel_tree","files":8,"time":1172781610,"description":"RHODOPI\n\nGreat Bulgarian Folk Music with Bagpipes\n\n\nThat short collection with eight songs represents the unique beauty of the Bulgarian folklor. The songs are from the mystic Rhodopi mountains - the place where was born the legendary Tracian musician Orpheus.\nThe Rhodopean folk music has very impressive and cosmic sounds.\n\n1. 100 kaba gaidi - Bela sam, bela, yunache (I&amp;#039;m white, lad) [Instrumental]\n2. 100 kaba gaidi - Da znaesh, maicho, da znaesh (If you know, mama)\n3. 100 kaba gaidi - Rodopska kitka (Rhodopean Medley) [Instrumental]\n4. Fanka Koinarova - Glyodai ma, glyodai (Look at me)\n5. Georgi Chilingirov - Roufinka bolna legnala (Roufinka lied sick)\n6. Rumen Rodopski Trio - Ovencho vakul (Black ram)\n7. Rumen Rodopski Trio - Tornal e Todyu (Todyu is going)\n8. Valya Balkanska - Izlel e Delio haidutin (Delio became a rebel)\n\nThe first three pieces are presented by the famous orchestra called &quot;100 kaba gaidi&quot; (100 low bagpipes). These 100 players are between 7 and 70 years old.\nThe fourth song (presented by the young singer Fanka Koiarova) is about flirt between boy and girl.\nThe fifth song (sung by the great singer Georgi Chilingirov) is very epical - it tells aboput a young woman whi is sick and probably is dying...\nThe sisth song is dedicated to a black raw (for the rhodopean shepherds their animal are not just property, but friends)\nThe seventh song is faster and playful, it brings a good humour and a good mood.\nThe eighth song (presented by the famous female singer Valya Balkanska) is again epical story about brave man who became a rebel to protect his people from the terror of the Turkish conquerors. NASA included that song in a special golden disk which flies in the space with a main goal to meet other life forms.\n\nTaste these eight pearls of the Bulgarian foklore!","torrent":{"xt":"urn:btih:e217b7462c0cca3937bd2a4d83cdffbff42e8202","amp;dn":"Great+Bulgarian+Folk+Music+with+Bagpipes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e217b7462c0cca3937bd2a4d83cdffbff42e8202","infoHashBuffer":{"type":"Buffer","data":[226,23,183,70,44,12,202,57,55,189,42,77,131,205,255,191,244,46,130,2]},"announce":[],"urlList":[]}}