{"title":"Tony Hawk's Underground 2 [PS2] [NTSC]","uid":3657498,"size":3364946555,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:e296c3e0b1ed2a95abfb4f5451dc34fa08914fc0&amp;dn=Tony+Hawk%5C%27s+Underground+2+%5BPS2%5D+%5BNTSC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"Keiichi_M","files":5,"time":1175904470,"description":"Two Teams. Hardcore Skating. Wild Stunts. World Destruction.\nYou&amp;#039;ve been chosen by Tony Hawk to take on Bam Margera as your teams go globetrotting on an insane road trip: the World Destruction Tour. THUG?2 grinds in with a hilarious story mode, an unprecendented level of customization, and more moves than the Skate Gods could dream of.\n\nMake the world your own skate park, as you spray your custom tag, slap stickers, and even create new skate lines as you wreak havoc. Now you can play as yourself, your teammates, or over 20 special guest skaters. When you&amp;#039;re ready to go old school, check out Classic Mode with all-time favorite goals like S-K-A-T-E, Secret Tape, and High Score against a 2-minute timer. Grab your board, an arsenal of spray-paint... jump into the tour van and get ready to wreak havoc across the globe.\n\n    * World Destruction Tour?: Hawk recruits YOU onto his team for a no rules, no limits world tour versus Bam Margera. You invade international cities and wreak havoc, proving yourself to the pros as you live the ultimate skateboard adventure.\n\n\t \t\n\n# All New Team Play: Team Hawk versus Team Bam. Play as yourself or switch to play one of your teammates or a special guest skater ? over 20 unique characters.\n# Unparalleled Customization: Create your own logo for use in graffiti tags, with the all new &quot;Create-A-Graphic&quot; feature. Familiar Hawk customization continues with &quot;Create-A-Goal&quot;, &quot;Create-A-Park&quot; and the revolutionary &quot;Face In The Game&quot; feature.\n# More Player Control Than Ever Before: Tear it up with sticker slaps, projectiles, crazy vehicles, hilarious tantrums, and slow-motion Focus Control.\n# 2 Games In 1: Team up and wreak havoc in Story Mode or switch and play 15 levels in Classic Mode. Complete your all-time favorite goals like S-K-A-T-E, Secret Tape, and High Score against a 2-minute timer.\n","torrent":{"xt":"urn:btih:e296c3e0b1ed2a95abfb4f5451dc34fa08914fc0","amp;dn":"Tony+Hawk%5C%27s+Underground+2+%5BPS2%5D+%5BNTSC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e296c3e0b1ed2a95abfb4f5451dc34fa08914fc0","infoHashBuffer":{"type":"Buffer","data":[226,150,195,224,177,237,42,149,171,251,79,84,81,220,52,250,8,145,79,192]},"announce":[],"urlList":[]}}