{"title":"Make Your Own Vocoded Ultrasonic Subliminals with Audacity ","uid":11750772,"size":305191901,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e2f85d6fd34775fb2dc911457ad440418b3ebb16&amp;dn=Make+Your+Own+Vocoded+Ultrasonic+Subliminals+with+Audacity+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":null,"files":105,"time":1426200638,"description":"Make Your Own Vocoded Ultrasonic Subliminals with Audacity (2015)\n\nPlatform: This should be working on Mac OS X, Windows and Linux - wherever Audacity will run\n\nSubliminal Audio - What Are Subliminals?\n\nSubliminal sounds are sounds that are hidden, either just below or above hearing range, at a very low volume behind louder sounds, or masked in some other way. If you want to make subliminal binaural beats or isochronic tones, a good way is to simply use audio frequencies for your tones that are just above or below our hearing range but still within the range of audio equipment. Very low sub bass isochronic tones have a very nice effect.\n\nWhat Is a Vocoder?\n\nTo put it simple: whenever you speak, your voice consists of two components. The first component is your basic voice type, produced by your vocal chords. It varies in pitch but remains nearly constant in type and is quite unique. That's why you can distinguish between persons when you hear their voices. The second component is how you modulate the basic voice. Modulation means that you dynamically amplify and attenuate frequencies. This is done by the mouth and tongue when you speak. Example: Say a long &quot;ohh&quot;. To accomplish this task, you nearly close your mouth. Next, say a long &quot;ahh&quot;. This time, you opened your mouth. Your vocal chords produced the same sound for both, ohh and ahh but the modulation made it sound different. The modulation signal is called formant, because it forms and shapes the basic voice, which is called carrier due to the fact that it carries the formant signal. The formant signal carries the information and has a much lower frequency than the carrier, a circumstance that can be used to reduce bandwidth consumption for telephone services. This was also the original intention of a vocoder.\n\nWhat Does a Vocoder Do?\n\nA vocoder aims to replace the carrier of your voice with another carrier from another source. Thus, it changes the sound of the voice but not the message when you speak. It takes formant and carrier from external sources and splits them up in bands (a band is a region of frequencies, same thing an equalizer does). Then, the envelope (the modulation) is extracted from each formant band. This part is done by an envelope follower, an extreme low pass filter. Next, formant bands are modulated onto the carrier bands and the resulting bands are mixed together to the output signal.\n\nWhat Is Ultrasound?\n\nUltrasound is an oscillating sound pressure wave with a frequency greater than the upper limit of the human hearing range. Ultrasound is thus not separated from 'normal' (audible) sound by differences in physical properties, only by the fact that humans cannot hear it. Although this limit varies from person to person, it is approximately 18 kilohertz (18,000 hertz) in healthy, young adults. Ultrasound devices operate with frequencies from 16 kHz up to several gigahertz.\n\nFiles:\n\n1.) Quick Start\n\nAudacity NYQUIST plug-ins (.ny)\n\nsubliminal.ny\nvocoder.ny\n\nAudacity Video Manuals\n\nHow to Create Ultrasonic Subliminals with Audacity (Nyquist plug-in subliminal.ny)\nHow to Create Vocoded Subliminals with Audacity (Nyquist plug-in vocoder.ny)\n\nBrainwave Entrainment Techniques\n\n12 Tone Sound - Derrick Scott van Heerden - Mathemagical Music Production, 2013.pdf\nBrainwave Entrainment Techniques - Derrick Scott van Heerden - Mathemagical Music Production, 2013.pdf\n\nHow Vocoders Work\n\nWhat is a vocoder\nPAiA Corporation - How Vocoders Work by Craig Anderton\nSynth Secrets, Part 15 An Introduction To ESPS &amp; Vocoders\nVocoder, wikipedia.pdf\n\n2.) Deeper Knowledge\n\nAudacity\n\nAM Modulation\nAudacity Forum\nAudacity NYQUIST plug-ins (.ny)\nAudacity NYQUIST prompt - scripts\nNyquist Functions\n\nHistory of the Vocoder (videos)\n\nThe Secret History of the Vocoder.mp4\nThe Voder - Homer Dudley (Bell Labs) 1939.mp4\nVODER (1939) - Early Speech Synthesizer.mp4\n\nLowery Patent\n\nUS Patent 5159703 Lowery Silent subliminal presentation.pdf\n\nMatt Davis, Cognition and Brain Sciences Unit\n\npubs\nsine-wave-speech (why some people can hear subliminals)\nvocode\n\nVocoders - Scientific Research, papers","torrent":{"xt":"urn:btih:e2f85d6fd34775fb2dc911457ad440418b3ebb16","amp;dn":"Make+Your+Own+Vocoded+Ultrasonic+Subliminals+with+Audacity+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2f85d6fd34775fb2dc911457ad440418b3ebb16","infoHashBuffer":{"type":"Buffer","data":[226,248,93,111,211,71,117,251,45,201,17,69,122,212,64,65,139,62,187,22]},"announce":[],"urlList":[]}}