{"title":"The Art of Not Having it All - Melissa Kite","uid":15617774,"size":1135862,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3530b82cce6c6e76cd4767de6cec6b839026957&amp;dn=The+Art+of+Not+Having+it+All+-+Melissa+Kite&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mr_mando","files":2,"time":1471848913,"description":"\nMelissa Kite's hilarious and honest memoir draws readers in to her exploits in not having it all in the world of leaning in—complete with dating misadventures, heroic plumbers, and clinically obese fish.\r\n\r\nDoes a great weekend for you mean scrubbing all the grouting in your bathroom with a toothbrush? Do you fantasize about the handyman who in three days brought you more happiness than your useless ex-boyfriend did in three years? Do you write to-do lists that need paginating, and include items such as &quot;re-mortgage house, get pregnant, climb Kilimanjaro&quot;?\r\n\r\nWelcome to Melissa Kite's life and her uproarious, no-holds-barred memoir, The Art of Not Having it All, about the adventures of not having it all as a single lady in your prime. For a long time, Melissa had no idea there was anyone else out there remotely like her. Nearly every other woman she knew seemed to be valiantly juggling work and family life. By contrast, Melissa felt as though, in the fluttering mass of yellow Post-it notes on her fridge there was one that read, &quot;Don't forget to get married and have kids,&quot; which had got covered in shopping lists, dry-cleaner receipts and trash collection schedules.\r\n\r\nIf not having it all (the white picket fence, the kid, the job, the Mr. Right who helps you free your chubby angelfish who has wedged himself into a plastic log) means having just enough for you, then get ready to fall in love with your new best friend","torrent":{"xt":"urn:btih:e3530b82cce6c6e76cd4767de6cec6b839026957","amp;dn":"The+Art+of+Not+Having+it+All+-+Melissa+Kite","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3530b82cce6c6e76cd4767de6cec6b839026957","infoHashBuffer":{"type":"Buffer","data":[227,83,11,130,204,230,198,231,108,212,118,125,230,206,198,184,57,2,105,87]},"announce":[],"urlList":[]}}