{"title":"[Andrew_Gahan]Game Art Complete All-in-One Learn Maya, 3ds Max, ","uid":11291701,"size":66269574,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3711cc6eeea944f647f0650b589cb4c0d92d612&amp;dn=%5BAndrew_Gahan%5DGame+Art+Complete+All-in-One+Learn+Maya%2C+3ds+Max%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"zombie_rox","files":1,"time":1414337714,"description":"A compilation of key chapters from the top Focal game art books available today - in the areas of Max, Maya, Photoshop, and ZBrush. The chapters provide the CG Artist with an excellent sampling of essential techniques that every 3D artist needs to create stunning game art.\n\nGame artists will be able to master the modeling, rendering, rigging, and texturing techniques they need - with advice from Focal's best and brightest authors. Artists can learn hundreds of tips, tricks and shortcuts in Max, Maya, Photoshop, ZBrush - all within the covers of one complete, inspiring reference.\n\nAbout the Author\nAndrew Gahan is a leading industry expert in next generation consoles and digital gaming. His roles have included Senior Artist, Lead Artist, Art Manager, Art Director, Art Outsource Manager, and Producer. Andrew is an expert in all gaming tools for commercial game development, including: 3ds Max, Maya, Photoshop, XSI, Gen Head, Z Brush, Mud Box, and Poly-boost (as well as other 3ds max plug-ins). During this time Andrew has worked on 14 standalone published games as well as sequential spin-off products; as well as developing a number of military training systems for the Warrior - Armoured Fighting Vehicle, Harrier and Tornado aircraft. In the last decade Andrew has been involved in recruitment and development of artists, including theoretical and practical training. Andrew has been a freelance consultant helping companies to develop and improve tools and applications that are used by artists in the digital gaming industry. Andrew is currently a visiting speaker and advisor at Liverpool John Moore University for the MA digital games course; and is an external advisor at the University of Bolton, supporting the development of their forthcoming 3D related courses. Andrew has judged the Independent Games Festival for the past 2 years. He has been a visiting speaker at Liverpool John Moore University since 2005, and will also be a speaker at the University of Bolton for the forthcoming 3D Games Modeling course. Andrew Gahan has given numerous media interviews, of which a recent selection is given below: 15 December 2007. Interview with Gamasutra magazine Media consumption: MotorStorm's Andy Gahan. Television interview for 1-up.com with Pete Smith (Executive External Producer, SCEE (Sony)) in San Francisco, during GDC (Game Developer Conference) in the Sony Store for the launch of MotorStorm. Television interview for GamerTV with Pete Smith (Executive External Producer, SCEE (Sony)) in San Francisco, during GDC (Game Developer Conference) \n\nPublisher: Focal Press (17 November 2008)\nLanguage: English\nISBN-10: 024081147X\nISBN-13: 978-0240811475","torrent":{"xt":"urn:btih:e3711cc6eeea944f647f0650b589cb4c0d92d612","amp;dn":"%5BAndrew_Gahan%5DGame+Art+Complete+All-in-One+Learn+Maya%2C+3ds+Max%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3711cc6eeea944f647f0650b589cb4c0d92d612","infoHashBuffer":{"type":"Buffer","data":[227,113,28,198,238,234,148,79,100,127,6,80,181,137,203,76,13,146,214,18]},"announce":[],"urlList":[]}}