{"title":"1,129 Firearm Manuals","uid":4473818,"size":2917683295,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3c14201d0569b3a8c72b2a72509b56bb060451e&amp;dn=1%2C129+Firearm+Manuals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"x_DontTreadOnMe_x","files":1130,"time":1225257910,"description":"This was taken from several torrents and some of my own sources.\n\nIncludes models from Anschutz, Arcus, Armalite, Armscor, Astra, Autood, Ballester, Barrett, Benelli, Beretta, Bersa, Blaser, Bluegrass, Breda, Brno, Browning, Bushmaster, Caldwell, Century, CETME, Charles Daly, Charter, Clayco, CMP, Cobra, Cobray, Colt, Coonan, CVA, CZ, Daewoo, Dan Wesson, DPMS, Dragun, EAA, Ed Brown, Enfield, Enterprise, Fabarm, Firestorm, FN, Franchi, Freedom Arms, Glock, Heckler &amp; Koch, H&amp;R, Hi-Standard, Iai, Intratec, Ithaca, Iver Johnson, JC Higgins, Jennings, Kahr, KBI, Keltec, Keystone, Khan, Kimber, Llama, Magnum Research, Mannlicher, Marlin, Mas, Merkel, Mitchell, Mossberg, Nef, Norinco, North American Arms, Olympic, Para, Parker, Phoenix, Plainfield, Polytech, Radocy, Ramline, Remington, Robinson, Rossi, Ruger, Smith &amp; Wesson, Sabatti, Safari, Sako, Sauer, Savage, Sig, Sphinx, Springfield Armory, Star, Sterling, Steyr, STI, Stoeger, Taurus, Thompson, Tikka, Valmet, Vector,  Vostok, Walther, Wildey, and Winchester....\n\n(catches breath)\n\nAgain, probably the largest torrent of its kind out there. :)\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!\n","torrent":{"xt":"urn:btih:e3c14201d0569b3a8c72b2a72509b56bb060451e","amp;dn":"1%2C129+Firearm+Manuals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3c14201d0569b3a8c72b2a72509b56bb060451e","infoHashBuffer":{"type":"Buffer","data":[227,193,66,1,208,86,155,58,140,114,178,167,37,9,181,107,176,96,69,30]},"announce":[],"urlList":[]}}