{"title":"Mastering Autodesk Navisworks 2013 [Epub] Ehhhh","uid":8776192,"size":49322430,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e40f88bbaba8c84e0fb53595765d4208db0f77aa&amp;dn=Mastering+Autodesk+Navisworks+2013+%5BEpub%5D+Ehhhh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Ehhhhtozebec","files":-1,"time":1375560899,"description":"\nOverview\n\nThe only book on Autodesk's popular and powerful architectural project collaboration software\n\nThis Autodesk Official Training Guide is the perfect detailed reference and tutorial for the powerful Navisworks software. You'll quickly learn how to use Navisworks to design, review, and collaborate while saving time, meeting budgets, and working efficiently. Covering the entire project design workflow, this book is crammed with detailed how-to instruction; real-world examples; and tips, tricks, and expertise gleaned from the expert author team.\n\nDiscover how to work with more than 60 file formats, create a single 3D model, navigate and edit it, find design problems with Clash Detection, visualize schedules, and much more in this jam-packed guide.\n\nCovers all the Navisworks features in Simulate, Manage, and Freedom\nExplains Navisworks file types and all of the 60+ other supported file types\nShows you how to navigate around a 3D model and enable snap shots and animation\nAddresses using Clash Detection to test and find problems, optimizing and visualizing schedules using the TimeLiner 4D simulation tool, and more\nHelps you create impressive visualizations and walkthroughs with lighting, effects, and textures\nIncludes coverage of advanced tools and customizing Navisworks with scripts\n\nWith an expert author team, Mastering Autodesk Navisworks 2013 is your essential guide to getting the very most out of the powerful Navisworks collaboration and design review software.\n\n\n\nProduct Details\n\nISBN-13: 9781118281710\nPublisher: Wiley, John &amp; Sons, Incorporated\nPublication date: 8/14/2012\nEdition number: 1\nPages: 576\n\n\nMeet the Author\n\nJason Dodds is an Autodesk Construction Solutions Engineer who has been actively involved in all facets of design and building processes for over 15 years and has been using Navisworks since the software's inception. Scott Johnson is an Autodesk Sr. Technical Account Manager and an early adopter of Navisworks who has over 15 years of experience in design, construction, digital prototyping, and manufacturing. Both authors consult internationally and speak regularly at Autodesk University (AU) and other industry events.","torrent":{"xt":"urn:btih:e40f88bbaba8c84e0fb53595765d4208db0f77aa","amp;dn":"Mastering+Autodesk+Navisworks+2013+%5BEpub%5D+Ehhhh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e40f88bbaba8c84e0fb53595765d4208db0f77aa","infoHashBuffer":{"type":"Buffer","data":[228,15,136,187,171,168,200,78,15,181,53,149,118,93,66,8,219,15,119,170]},"announce":[],"urlList":[]}}