{"title":"Moral Questions, An Introduction to Ethics (Nutall) [PDF] [Storm","uid":10042906,"size":12976194,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e445ccb3dcd924a7fee675a590fff60bf7ba71c5&amp;dn=Moral+Questions%2C+An+Introduction+to+Ethics+%28Nutall%29+%5BPDF%5D+%5BStorm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"0xmovva","files":-1,"time":1398488065,"description":"Author: Jon Nuttall\nPaperback: 228 pages\nPublisher: Polity; 1 edition (April 8, 1993)\nLanguage: English\nISBN-10: 0745610404\nISBN-13: 978-0745610405\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.  Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\nThis new introduction to ethics is written for students who are approaching philosophy for the first time. Nuttall focuses on a range of practical and topical questions, using these as a way of drawing the reader into the distinctive methods of philosophical analysis.\nThe book starts with a discussion of values and judgements and this is developed in later chapters on moral and religious education and punishment. Nuttall then looks at sexual morality, with related chapters on pornography, abortion, foetal research and children. Finally, he examines moral issues surrounding death: suicide, war and euthanasia. Here questions relating to the value and purpose of life are confronted. The issue of animal rights is used as an opportunity to explore the question of rights in general, and the book concludes with a chapter on moral theories.\n\nClearly written, lively and accessible, Moral Questions is an ideal textbook.","torrent":{"xt":"urn:btih:e445ccb3dcd924a7fee675a590fff60bf7ba71c5","amp;dn":"Moral+Questions%2C+An+Introduction+to+Ethics+%28Nutall%29+%5BPDF%5D+%5BStorm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e445ccb3dcd924a7fee675a590fff60bf7ba71c5","infoHashBuffer":{"type":"Buffer","data":[228,69,204,179,220,217,36,167,254,230,117,165,144,255,246,11,247,186,113,197]},"announce":[],"urlList":[]}}