{"title":"15 Novels by Minette Walters","uid":9247260,"size":13665098,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e46e56235d8f863f05e283dc1ae28eb3c44c524a&amp;dn=15+Novels+by+Minette+Walters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"420weedman","files":63,"time":1385396468,"description":"Acid Row : Acid Row is a crime-infested housing project that exists by its own laws. When news comes that a child has been kidnapped, the frustration and anger that has been seething on the streets of Acid Row is ignited. And no one will be safe.\n\nThe Breaker : When Kate Sumner's corpse is discovered naked, bruised, prone and violated on the rocks of a sleepy South Coast town by two curious young boys and her tiny, traumatised daughter is found wandering alone several miles away, police are instinctively drawn to two suspects. William Sumner, Kate's husband, and Steven Harding, a handsome would-be actor, find themselves at the centre of the investigation and as police suspicions grow, their fatally flawed personalities are gradually disembowelled in the search for the truth.\n\nThe Chameleon's Shadow : In this electrifying new novel from the bestselling author of The Devil's Feather, British lieutenant Charles Acland returns home from Iraq, but his serious head injuries are only the outward manifestation of a profound inner change.\n\nThe Devil's Feather : In 2002, five women are discovered barbarously murdered in Sierra Leone. Reuters Africa correspondent Connie Burns suspects a British mercenary: a man who seems to turn up in every war-torn corner of Africa, whose reputation for violence and brutality is well-founded and widely known. Connie's suspicions that he's using the chaos of war to act out sadistic, misogynistic fantasies, fall on deaf ears - but she's determined to expose him and his secret. \n\nDisordered Minds : When a local councillor and an anthropologist re-investigate the controversial murder conviction of a mentally retarded 20-year-old, they're unprepared for the disturbing facts that come to light--and the personal demons with which they must come to terms.\n\nThe Echo : A homeless man who called himself Billy Blake is found dead of starvation in the garage of an expensive home near London's Thames, and it looks as though he might be a merchant banker who disappeared in 1988 with 10 million pounds. A magazine journalist named Michael Deacon is intrigued by the case and by the missing banker's wife and soon finds that there are much darker overtones to both.\n\nThe Ice House : The three women living in seclusion at an elegant Hampshire country house have long been fodder for village gossip...even whispers of a witches' coven. So when a faceless corpse of uncertain vintage is found in the Streech Grange ice house, Chief Inspector Walsh can't wait to make a case of it.\n\nThe Shape of Snakes : It was the winter of discontent in Britain, and as the dead lay unburied and foul-smelling garbage collected in the streets, the death of a black woman known to her neighbors as &quot;Mad Annie&quot; was causing unprecedented commotion. The uproar was spearheaded by a woman named Mrs. Ranelagh, who had the misfortune of discovering Annie's body in the gutter. She claimed that Annie had died without speaking. She said that she'd never seen Annie before. Yet she was sure that Annie had been murdered. So why, some 20 long years later, is Mrs. Ranelagh still seeking the truth about a mad woman's murder -- unless her reasons are personal?\n\nThe Tinder Box : Irish labourer Patrick ORiordan has been arrested for the brutal murder of elderly Lavinia Fanshaw and her live-in nurse, Dorothy Jenkins. As shock turns to fury, the village residents form a united front against Patricks parents and cousin, who report incidents of vicious threats and violence. But friend and neighbour Siobhan Lavenham remains convinced that Patrick has fallen victim to a prejudiced investigation and, putting her own position within the bigoted community in serious jeopardy, stands firmly by his family in defence of the ORiordan name.\n\nThe Scold's Bridle : An old woman is found dead in her bath, her wrists slashed: an apparent suicide. But she is wearing a scold's bridle on her head, adorned with a crown of nettles. What could have driven her to such a desperate act? Then rumours start to spread that her death wasn't suicide but murder.\n\nThe Dark Room : A tale of lost love, murder and amnesia, this story centres on a young female fashion reporter, Jane Kingsley. After being unceremoniously jilted by her fiance, she goes into a coma, only to wake from it to hear allegations that she attempted to commit suicide and that she faces a murder charge.\n\nFox Evil : When elderly Ailsa Lockyer-Fox is found dead in her garden, dressed only in night clothes and with blood stains on the ground near her body, the finger of suspicion points at her wealthy, landowning husband, Colonel James Lockyer-Fox. A coroner's inquest gives a verdict of 'natural causes' but the gossip surrounding him refuses to go away. Why? Because he's guilty? Or because resentful women in the isolated Dorset village where he lives rule the roost? Shenstead is a place of too few people and too many secrets. Why have James and Ailsa cut their children out of their wills? What happened in the past to create such animosity within the family? And why is James so desperate to find his illegitimate grandchild? \n\nChicken Feed : A body is found in a chicken run . . . Based on the true story of the 'chicken farm murder' which took place in Blackness, Crowborough, East Sussex in December, 1924. Norman Thorne was found guilty of the murder of Elsie Cameron, but even at the time of his execution there were doubts about his guilt. Still swearing his innocence, Norman Thorne was hanged on 22 April 1925.\n\nChicken Feed : A WOMAN IMPRISONED FOR HIDEOUS SLAUGHTER. A WRITER TRAPPED IN A TRAGIC PAST. ONE HIDES THE TRUTH THE OTHER NEEDS. In prison, they call her the Sculptress for the strange figurines she carves - symbols of the day she hacked her mother and sister to pieces and reassembled them in a blood-drenched jigsaw. Sullen, menacing, grotesquely fat, Olive Martin is burned-out journalist Rosalind Leigh's only hope of getting a new book published. But as she interviews Olive, in her cell, Roz finds flaws in the Sculptress's confession. Is she really guilty as she insists? Drawn into Olive's world of obsessional lies and love, nothing can stop Roz's pursuit of the chilling, convoluted truth. \n","torrent":{"xt":"urn:btih:e46e56235d8f863f05e283dc1ae28eb3c44c524a","amp;dn":"15+Novels+by+Minette+Walters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e46e56235d8f863f05e283dc1ae28eb3c44c524a","infoHashBuffer":{"type":"Buffer","data":[228,110,86,35,93,143,134,63,5,226,131,220,26,226,142,179,196,76,82,74]},"announce":[],"urlList":[]}}