{"title":"Nephrology in 30 Days 2nd Ed (LANGE) [PDF][tahir99] VRG.pdf","uid":10558956,"size":9738663,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e49c44819bf212aa0fa3baf6686ce869027207f4&amp;dn=Nephrology+in+30+Days+2nd+Ed+%28LANGE%29+%5BPDF%5D%5Btahir99%5D+VRG.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"tahir99","files":-1,"time":1405432664,"description":"Nephrology in 30 Days (In Thirty Days Series)\n\nRobert Reilly (Author), Mark Perazella (Author)\n\nTRUE PDF, BOOKMARKED and INDEXED\n\n\nPublication Date: September 6, 2013 | ISBN-10: 0071788409 | ISBN-13: 978-0071788403 | Edition: 2\n\nA fast, innovative way to learn the core principles and clinical entities associated with nephrology at the point of care\n\nNephrology in 30 Days enables you to quickly and easily attain a complete understanding of the basics of nephrology, allowing you to successfully diagnose and manage kidney disease and its associated complications. Designed to impart this knowledge in just thirty days, this unique self-instructional tool is perfect for medical students, physician assistants, medical residents, and nephrology fellows rotating on the clinical nephrology service elective. Now in full color, Nephrology in 30 Days is the most effective way to gain a solid understanding of acute and chronic kidney diseases, disturbances of fluid and electrolyte balance, and disorders of acid-base and mineral metabolism homeostasis--in the least amount of time possible.\n\nUpdated to include the latest research and advances, including:\n\nNew formulas for estimating glomerular filtration rate\nThe role of WNK kinases in distal tubular sodium and potassium handling\nRevised hyponatremia guidelines\nThe use of vaptans for clinical use\nNewly reported forms of metabolic acidosis\nThe role FGF-23 and Klotho play in phosphorus homeostasis\nConcerns about the use of erythropoietic stimulating agents\nApproaches to and classification of both chronic kidney disease and acute kidney injury\nDiscussion of urinalysis and urine microscopy in the evaluation of kidney disease\nNew forms of tubulointerstitial disease such as immunoglobulin G4 (IgG4)-related disease\nThe pathological classification of systemic lupus nephritis and other glomerular diseases\nThe mechanisms and causes of essential and secondary forms of hypertension ","torrent":{"xt":"urn:btih:e49c44819bf212aa0fa3baf6686ce869027207f4","amp;dn":"Nephrology+in+30+Days+2nd+Ed+%28LANGE%29+%5BPDF%5D%5Btahir99%5D+VRG.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e49c44819bf212aa0fa3baf6686ce869027207f4","infoHashBuffer":{"type":"Buffer","data":[228,156,68,129,155,242,18,170,15,163,186,246,104,108,232,105,2,114,7,244]},"announce":[],"urlList":[]}}