{"title":"The Glass Castle - Jeannette Walls","uid":7192861,"size":1058804,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4ebdc1f196fed5b9a5e6425d1022e2aa9adb748&amp;dn=The+Glass+Castle+-+Jeannette+Walls&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"fr09n","files":-1,"time":1334691630,"description":"Book Description\n__________________________________\n\n\nJeannette Walls grew up with parents whose ideals and stubborn nonconformity were both their curse and their salvation. Rex and Rose Mary Walls had four children. In the beginning, they lived like nomads, moving among Southwest desert towns, camping in the mountains. Rex was a charismatic, brilliant man who, when sober, captured his children's imagination, teaching them physics, geology, and above all, how to embrace life fearlessly. Rose Mary, who painted and wrote and couldn't stand the responsibility of providing for her family, called herself an &quot;excitement addict.&quot; Cooking a meal that would be consumed in fifteen minutes had no appeal when she could make a painting that might last forever.\nLater, when the money ran out, or the romance of the wandering life faded, the Walls retreated to the dismal West Virginia mining town -- and the family -- Rex Walls had done everything he could to escape. He drank. He stole the grocery money and disappeared for days. As the dysfunction of the family escalated, Jeannette and her brother and sisters had to fend for themselves, supporting one another as they weathered their parents' betrayals and, finally, found the resources and will to leave home.\n\nWhat is so astonishing about Jeannette Walls is not just that she had the guts and tenacity and intelligence to get out, but that she describes her parents with such deep affection and generosity. Hers is a story of triumph against all odds, but also a tender, moving tale of unconditional love in a family that despite its profound flaws gave her the fiery determination to carve out a successful life on her own terms.\n\nFor two decades, Jeannette Walls hid her roots. Now she tells her own story. A regular contributor to MSNBC.com, she lives in New York and Long Island and is married to the writer John Taylor.\n\n______________________________________________________\nProduct Details\n\nEbook\nLanguage: English\n\n\n\n\nPlease seed as long as possible.\nComment and Rate.\n\nFeel free to make requests\n\nThank You - fr09n\n\n","torrent":{"xt":"urn:btih:e4ebdc1f196fed5b9a5e6425d1022e2aa9adb748","amp;dn":"The+Glass+Castle+-+Jeannette+Walls","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4ebdc1f196fed5b9a5e6425d1022e2aa9adb748","infoHashBuffer":{"type":"Buffer","data":[228,235,220,31,25,111,237,91,154,94,100,37,209,2,46,42,169,173,183,72]},"announce":[],"urlList":[]}}