{"title":"Wooden Wand - Farmer's Corner [2014] [WEB/FLAC]","uid":10348021,"size":251537508,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e53e1928ff0ca5aa9fdc8a4c5ddf34cfff4cfac3&amp;dn=Wooden+Wand+-+Farmer%27s+Corner+%5B2014%5D+%5BWEB%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"dickspic","files":-1,"time":1402633501,"description":"FLAC / Lossless \nLabel/Cat#: Fire Records #FIRECD 334\nCountry: USA\nYear: May 6, 2014\nGenre: Americana\nFormat: CD,Album\n\n[b]\n01. Alpha Dawn (3:13)\n02. Uneasy Peace (4:45)\n03. When the Trail Goes Cold (6:50)\n04. Adie (3:54)\n05. Dambuilding (5:39)\n06. Sinking Feelings (5:02)\n07. Home Horizon (6:10)\n08. Port of Call (8:19)\n09. Gone to Stay (5:40)\n\n\n\nAs Wooden Wand, monumentally prolific songwriter James Jackson Toth has managed to record and release music at a perpetual clip, hitting an especially strong streak of albums with the rootsy tones of Blood Oaths of the New Blues and the fiery rock of Wooden Wand &amp; the World War IV (both released in 2013), and then with 2014's more subdued, lingering Farmer's Corner. Over the course of a lengthy discography, the project has wandered through various styles, often recording albums in the same offhanded manner as jazz musicians who traditionally tracked their work in a single session. The similarities to this improvisatory approach can be felt in the loose, pickup band feel of many albums and the distinct colors separate records have taken on, very much capturing the time and place in which they were created. Farmer's Corner mixes up this approach somewhat, as Toth recorded the album over the course of six different sessions, traveling to four different studios in three different states, employing familiar players on some tracks and enlisting local session players on others. The threat of inconsistency and jarring shifts in sound that could come from this recording method are smoothed out by a unified production, handled on every song by Toth himself. The nine tunes here flow together nicely, calling up both mellow barn rock of classic alt-country forebears like Neil Young and the Band and hints of breezy mid-'70s soft rock AM radio fare. &quot;When the Trail Goes Cold&quot; sounds languid and bleary-eyed like Neil Young's shambling On the Beach dirges, but touched with gently jazzy chords and lilting guitar leads that echo both the expansive exploration of Jerry Garcia in a live setting and the softness of Jackson Browne or even a more country take on yacht rock. This same unhurried feeling shows up on the muted acoustics of &quot;Dambuilding&quot; and the lengthy unfolding of percussion-free jam &quot;Port of Call,&quot; a song that stretches past the eight-minute mark with a surefooted groove supporting wild guitar soloing and Toth's patient country drawl. The album manages to rock out in a restrained, acoustic way as well, with riffing tunes like &quot;Adie&quot; twisting stoner metal guitar tones over decidedly unheavy acoustic instrumentation. In the end Farmer's Corner sounds like a long-forgotten private-press album of loner folk and Deadhead love songs lost in the alleys of time. Toth's gift for songwriting gives emotional resonance to the album's softly lit, somewhat dazed ambience, and the result is one of the more interesting chapters of Wooden Wand's always twisting oeuvre.","torrent":{"xt":"urn:btih:e53e1928ff0ca5aa9fdc8a4c5ddf34cfff4cfac3","amp;dn":"Wooden+Wand+-+Farmer%27s+Corner+%5B2014%5D+%5BWEB%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e53e1928ff0ca5aa9fdc8a4c5ddf34cfff4cfac3","infoHashBuffer":{"type":"Buffer","data":[229,62,25,40,255,12,165,170,159,220,138,76,93,223,52,207,255,76,250,195]},"announce":[],"urlList":[]}}