{"title":"CreativeLive - Getting Published. Shooting an Editorial Wedding","uid":8016455,"size":9997486427,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e56b07fffd06c6d0e4b759da6f5ab1a253f8c9dc&amp;dn=CreativeLive+-+Getting+Published.+Shooting+an+Editorial+Wedding+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"photog89","files":41,"time":1358112197,"description":"This is the FULL HD class. Every CreativeLIVE class that I upload will not be the screen recorded ones that you find online. Everyone of them including this one will be the files that you download directly off of the Creativelive website.\nThis is the full 720p class downloaded directly off of the creative live website\n\n\n\n\nGetting Published. Shooting an Editorial Wedding\n\nThis three-day event will be packed with how-to and tips for wedding photographers who are ready to shake up their business. In addition to lighting, posing, and technique, Jasmine will photograph a bride and groom, and a gorgeous wedding set up that'll facilitate a live demonstration how to photograph wedding details, elements, and moments with an editorial flair.\n\nThe course will also address how Jasmine successfully submits her work for national publication and include discussions with editors on how photographers can approach a wedding day to maximize their publication opportunities.\n\nIf you like taking risks, untraditional posing, and finding dynamic light in any situation, this course is for you. Be prepared for a smashing good time as Jasmine dissects her photography, online marketing, and teaches you how to create a fabulous experience before the first click of the shutter. ","torrent":{"xt":"urn:btih:e56b07fffd06c6d0e4b759da6f5ab1a253f8c9dc","amp;dn":"CreativeLive+-+Getting+Published.+Shooting+an+Editorial+Wedding+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e56b07fffd06c6d0e4b759da6f5ab1a253f8c9dc","infoHashBuffer":{"type":"Buffer","data":[229,107,7,255,253,6,198,208,228,183,89,218,111,90,177,162,83,248,201,220]},"announce":[],"urlList":[]}}