{"title":"Beethoven - Violin Concerto, Op. 61 (Itzhak Perlman) [192kbps]","uid":3559150,"size":63355431,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e67d0c69bbb474b7a90819de3fbfffcc0fea7b85&amp;dn=Beethoven+-+Violin+Concerto%2C+Op.+61+%28Itzhak+Perlman%29+%5B192kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"naxosking","files":3,"time":1163753538,"description":"Concerto for Violin in D major, Op. 61 by Ludwig van Beethoven \n \nPerformer:  Itzhak Perlman (Violin) \nConductor:  Carlo Maria Giulini \nOrchestra/Ensemble:  Philharmonia Orchestra \nPeriod: Classical \nWritten: 1806; Vienna, Austria \nDate of Recording: 11/1980 \nVenue:  EMI Abbey Road Studio no 1, London \nLength: 44 Minutes 0 Secs.\nMP3 Audio quality: 192 kbps\n\nDESCRIPTION: One can imagine few more dynamic pairings for the Violin Concerto Op.61 of Beethoven than Carlo Maria Giulini and Itzhak Perlman. A piece that had difficulty in receiving public acceptance, it took world-class violinists championing it to find its place in the repertory. Indeed, one hears greater weaving of the solo part with the orchestra than was the tradition in Mozart\\&amp;#039;s concerts. Perlman rises through the octaves to the opening theme stated in the highest register of the instrument with technical command and a sultry rich sound, obeying the balance between orchestra and violin demanded by the music. His passagework is controlled and expressive but never lacking for fire. His answers to the horn statements in the pulsating second movement are lyrically and harmonically reminiscent of the later \\&amp;#039;Emperor\\&amp;#039; Concerto for piano.\nGiulini is known for his maverick tempos in Beethoven, and here his even-tempered, thoughtful approach is no different. The result is fresh and resounding, and Beethoven\\&amp;#039;s fantastic architecture is allowed to do its work. The cadenzas by violinist Fritz Kreisler from 1804 (Beethoven left the cadenzas to the soloists in this piece) are a complementary choice to the talents of Perlman and Giulini in this somewhat enigmatic concerto.  \n\n\nThis is a legendary recording and one of the best out there (and there are hundreds) of Beethoven\\&amp;#039;s masterpiece for the violin. Please seed when done downloading!","torrent":{"xt":"urn:btih:e67d0c69bbb474b7a90819de3fbfffcc0fea7b85","amp;dn":"Beethoven+-+Violin+Concerto%2C+Op.+61+%28Itzhak+Perlman%29+%5B192kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e67d0c69bbb474b7a90819de3fbfffcc0fea7b85","infoHashBuffer":{"type":"Buffer","data":[230,125,12,105,187,180,116,183,169,8,25,222,63,191,255,204,15,234,123,133]},"announce":[],"urlList":[]}}