{"title":"IMAGE COMICS Mega pack A-F - Over 4300 issues - My 900th torrent","uid":8698349,"size":18101261439,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e732aaa119c083abfb91d172bdb9be80bada00e0&amp;dn=IMAGE+COMICS+Mega+pack+A-F+-+Over+4300+issues+-+My+900th+torrent&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":4,"uploader":"STFmaryville","files":-1,"time":1374006167,"description":"I did not put together this torrent. Someone else did. But it's great, and it needs to be here on TPB! I'm not sure but this collection may be the work of Nerone. To whoever worked on it, if you're reading these words... Wow! You're insane... awesome... insawesome!\n\nThis collection, which TPB is forcing me to split into 4 parts, has over 4,300 Image comics (over 900 titles) from 1992-2008.\n\nI don't think it includes anything from the past several years, and it doesn't include the Wildstorm comics after that part of Image was sold to DC (1999). There may be other things missing, but I've looked through it all and it's a really great collection. Obviously some of the older scans are low-res compared to today, or just aren't great quality. But it does include so much material that I'd forgotten about, that I'd never read (or even heard of), and quite a few classics that should be in your collection!\n\nThis is (obviously) a huge torrent. It may take you several days if you want to download the whole thing. (It took me over a week!) I am going to seed it for *months*. But if you download, PLEASE seed and share!  --STF\n","torrent":{"xt":"urn:btih:e732aaa119c083abfb91d172bdb9be80bada00e0","amp;dn":"IMAGE+COMICS+Mega+pack+A-F+-+Over+4300+issues+-+My+900th+torrent","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e732aaa119c083abfb91d172bdb9be80bada00e0","infoHashBuffer":{"type":"Buffer","data":[231,50,170,161,25,192,131,171,251,145,209,114,189,185,190,128,186,218,0,224]},"announce":[],"urlList":[]}}