{"title":"The State of the Art in Intrusion Prevention and Detection, 2014","uid":9520765,"size":57027165,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e75db9791e7dc693b5b2dc49eeb83f61fcd631d2&amp;dn=The+State+of+the+Art+in+Intrusion+Prevention+and+Detection%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"steelballz","files":-1,"time":1390627310,"description":"The State of the Art in Intrusion Prevention and Detection\nAuthor:   Al-Sakib Khan Pathan\nPublished:  Jan. 31 2014\nPublisher: Auerbach Publications ()\nISBN:  1482203510\nFormat: Retail PDF\nReader Required:[/b] Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple \nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n\nBook Description\nPublication Date: Jan. 31 2014\nIn Detail\n\nThe State of the Art in Intrusion Prevention and Detection analyzes the latest trends and issues surrounding intrusion detection systems in computer networks, especially in communications networks. Its broad scope of coverage includes wired, wireless, and mobile networks; next-generation converged networks; and intrusion in social networks.\n\nPresenting cutting-edge research, the book presents novel schemes for intrusion detection and prevention. It discusses tracing back mobile attackers, secure routing with intrusion prevention, anomaly detection, and AI-based techniques. It also includes information on physical intrusion in wired and wireless networks and agent-based intrusion surveillance, detection, and prevention. The book contains 19 chapters written by experts from 12 different countries that provide a truly global perspective.\n\nThe text begins by examining traffic analysis and management for intrusion detection systems. It explores honeypots, honeynets, network traffic analysis, and the basics of outlier detection. It talks about different kinds of IDSs for different infrastructures and considers new and emerging technologies such as smart grids, cyber physical systems, cloud computing, and hardware techniques for high performance intrusion detection.\n\nThe book covers artificial intelligence-related intrusion detection techniques and explores intrusion tackling mechanisms for various wireless systems and networks, including wireless sensor networks, WiFi, and wireless automation systems. Containing some chapters written in a tutorial style, this book is an ideal reference for graduate students, professionals, and researchers working in the field of computer and network security. \n\n\n\nScientia est potentia\n\n\n","torrent":{"xt":"urn:btih:e75db9791e7dc693b5b2dc49eeb83f61fcd631d2","amp;dn":"The+State+of+the+Art+in+Intrusion+Prevention+and+Detection%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e75db9791e7dc693b5b2dc49eeb83f61fcd631d2","infoHashBuffer":{"type":"Buffer","data":[231,93,185,121,30,125,198,147,181,178,220,73,238,184,63,97,252,214,49,210]},"announce":[],"urlList":[]}}