{"title":"The Art of Intuition: Cultivating Your Inner Wisdom","uid":8248242,"size":340223,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e794642d7b7e2cc07ab72482380462bd42ac9b87&amp;dn=The+Art+of+Intuition%3A+Cultivating+Your+Inner+Wisdom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1363107774,"description":"Sophy Burnham, &quot;The Art of Intuition: Cultivating Your Inner Wisdom&quot;\nISBN: 1585428493 | 2011 | EPUB\n\nFrom the New York Times bestselling author of A Book of Angels, a wise and inspiring guide to strengthening one's intuitive abilities.\n\nAre you intuitive? Do you trust your intuitions? In The Art of Intuition, Sophy Burnham contends that we all have hunches and sudden insights and that we need only awaken to our inborn abilities in order to develop our inner wisdom.\n\nIn this fascinating book, Burnham tells the stories of individuals who have &quot;seen without seeing&quot; to illustrate the workings of what she calls our &quot;intuitive hearts.&quot; Exploring such topics as how loved ones are able to communicate with one another telepathically to skeptics who deny their power to see into the future, this book represents an important spiritual thinker's take on a subject that is vital to us all. According to Burnham, intuition is always right, and when you receive messages from Spirit-be it in the form of a subtle impression or a thunderous bolt from the blue-you must always, always follow the call.\n","torrent":{"xt":"urn:btih:e794642d7b7e2cc07ab72482380462bd42ac9b87","amp;dn":"The+Art+of+Intuition%3A+Cultivating+Your+Inner+Wisdom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e794642d7b7e2cc07ab72482380462bd42ac9b87","infoHashBuffer":{"type":"Buffer","data":[231,148,100,45,123,126,44,192,122,183,36,130,56,4,98,189,66,172,155,135]},"announce":[],"urlList":[]}}