{"title":"Jim Butcher - [Dresden Files 13] - Ghost Story","uid":6565144,"size":1667447,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e7d1865d5084b2c717d9eb22ab6648ab10f83a95&amp;dn=Jim+Butcher+-+%5BDresden+Files+13%5D+-+Ghost+Story&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"kash79","files":-1,"time":1311649672,"description":"Ghost Story (The Dresden Files #13)\nby Jim Butcher \n\n\nEbook formats - EPUB,MOBI,LIT\n\n\nThe eagerly awaited new novel in the #1 New York Times bestselling Dresden Files series.\n\nWhen we last left the mighty wizard detective Harry Dresden, he wasn't doing well. In fact, he had been murdered by an unknown assassin.\n\nBut being dead doesn't stop him when his friends are in danger. Except now he has nobody, and no magic to help him. And there are also several dark spirits roaming the Chicago shadows who owe Harry some payback of their own.\n\nTo save his friends-and his own soul-Harry will have to pull off the ultimate trick without any magic... \n\n\n\nMeet Harry Dresden, Chicago's first (and only) Wizard PI. Turns out the 'everyday' world is full of strange and magical things - and most of them don't play well with humans. That's where Harry comes in. But he's forgotten his own golden rule: magic - it can get a guy killed. Which didn't help when he clashed with unknown assailants with his murder in mind. And though Harry's continued existence is now in some doubt, this doesn't mean he can rest in peace. Trapped in a realm that's not quite here, yet not quite anywhere else, Harry learns that three of his loved ones are in danger. Only by discovering his assailant's identity can he save his friends, bring criminal elements to justice, and move on himself. It would just be easier if he knew who was at risk. And had a (working) crystal ball. And access to magic. Instead, he is unable to interact with the physical world - invisible to all but a select magical few. He's also not the only silent presence roaming Chicago's alleys. Hell, he put some there himself. Now, they're looking for payback.","torrent":{"xt":"urn:btih:e7d1865d5084b2c717d9eb22ab6648ab10f83a95","amp;dn":"Jim+Butcher+-+%5BDresden+Files+13%5D+-+Ghost+Story","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7d1865d5084b2c717d9eb22ab6648ab10f83a95","infoHashBuffer":{"type":"Buffer","data":[231,209,134,93,80,132,178,199,23,217,235,34,171,102,72,171,16,248,58,149]},"announce":[],"urlList":[]}}