{"title":"Murs-The End Of The Beginning-2003-FTD","uid":3259988,"size":100726388,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e806ebb570145f7fa33f450593d4e9de811aa7b8&amp;dn=Murs-The+End+Of+The+Beginning-2003-FTD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"erikapa","files":21,"time":1101589150,"description":"Definitive Jux proudly presents the first &amp;quot;proper&amp;quot; label release of the mighty, mighty MURS. This west coast legend has already put in a career's worth of work, traversing the globe with his crew, The Living Legends, slangin' tapes from Compton to Shibuya, New York to Copenhagen. MURS has built a super-solid underground fan base, as well as working friendships with some of the illest cats in the hip hop game. Enter El-P. This artistic and commercial venture has been in the back of the DJX CEO's mind since '97, and now with the success of the label, El-P finally has the opportunity to put out one of his favorite MC's in the world. Fans around the country are already talking about this match-up, and once you hear the record you'll know exactly why. MURS is the west coast manifestation of the Definitive Jux spirit, and its only right that we're getting down together to bring his name and his music to the widest audience possible. Backed by heat-seeking production from some of the top names in indie hip hop, plus a priceless appearance by hip hop luminary Shock G (Digital Underground) and his alter ego, Humpty Hump, this album is more than a must have. Having set the table this fall with a 73 city N. American tour (w/ Atmosphere), MURS is ready to unleash his finest work to date and take his place at the top of the list. Prepare yourself for a groundbreaking album that fits nicely into the Def Jux tradition, and helps MURS put an end to the beginning and a beginning to the future.","torrent":{"xt":"urn:btih:e806ebb570145f7fa33f450593d4e9de811aa7b8","amp;dn":"Murs-The+End+Of+The+Beginning-2003-FTD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e806ebb570145f7fa33f450593d4e9de811aa7b8","infoHashBuffer":{"type":"Buffer","data":[232,6,235,181,112,20,95,127,163,63,69,5,147,212,233,222,129,26,167,184]},"announce":[],"urlList":[]}}