{"title":"Multiphase Polymer Systems - Micro- to Nanostructural Evolution","uid":15977875,"size":12773133,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e83acc6eeb49fb2309ed7cdee5ee8f5b60934bd7&amp;dn=Multiphase+Polymer+Systems+-+Micro-+to+Nanostructural+Evolution+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"clouderone","files":1,"time":1475863738,"description":"Multiphase Polymer Systems - Micro- to Nanostructural Evolution in Advanced Technologies - Andreea Irina Barzic, Silvia Ioan (CRC, 2017).pdf\r\n\r\nPhase morphology in multicomponent polymer-based systems represents the main physical characteristic that allows for control of the material design and implicitly the development of new plastics. Emphasizing properties of these promising new materials in both solution and solid phase, this book describes the preparation, processing, properties, and practical implications of advanced multiphase systems from macro to nanoscales. It covers a wide range of systems including copolymers, polymer blends, polymer composites, gels, interpenetrating polymers, and layered polymer/metal structures, describing aspects of polymer science, engineering, and technology. The book analyzes experimental and theoretical aspects regarding the thermal and electrical transport phenomena and magnetic properties of crucial importance in advanced technologies. It reviews the most recent advances concerning morphological, rheological, interfacial, physical, fire-resistant, thermophysical, and biomedical properties of multiphase polymer systems. Concomitantly the book deals with basic investigation techniques that are sensitive in elucidating the features of each phase. It also discusses the latest research trends that offer new solutions for advanced bio- and nanotechnologies.\r\n\r\nIntroduces an overview of recent studies in the area of multiphase polymer systems, their micro- and nanostructural evolutions in advanced technologies, and provides future outlooks, new challenges and opportunities.\r\nDiscusses multicomponent structures that offer enhanced physical, mechanical, thermal, electrical, magnetic, and optical properties adapted to current requirements of modern technologies.\r\nCovers a wide range of materials, such as composites, blends, alloys, gels and interpenetrating polymer networks.\r\nPresents new strategies for controlling the micro- and nanomorphology and the mechanical properties of multiphase polymeric materials.\r\nDescribes different applications of multiphase polymeric materials in various fields, including automotive, aeronautics and space industry, displays, and medicine","torrent":{"xt":"urn:btih:e83acc6eeb49fb2309ed7cdee5ee8f5b60934bd7","amp;dn":"Multiphase+Polymer+Systems+-+Micro-+to+Nanostructural+Evolution+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e83acc6eeb49fb2309ed7cdee5ee8f5b60934bd7","infoHashBuffer":{"type":"Buffer","data":[232,58,204,110,235,73,251,35,9,237,124,222,229,238,143,91,96,147,75,215]},"announce":[],"urlList":[]}}