{"title":"The Beatles discography 1963 - 1970 (P.a.I.D.)","uid":11371076,"size":1176816786,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e8e85733f495331531e4ef370b661e5969af6a12&amp;dn=The+Beatles+discography+1963+-+1970+%28P.a.I.D.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"therealrawofbaycity","files":-1,"time":1415082150,"description":"The Beatles discography 1963 - 1970\n\n1963 Please Please Me\n1963 With the Beatles \n1964 A Hard Day's Night\n1964 Beatles for Sale \n1965 Help! \n1965 Rubber Soul\n1966 Revolver \n1967 Sgt. Pepper's Lonely Hearts Club Band\n1968 The Beatles (The White Album)\n1969 Yellow Submarine\n1969 Abbey Road \n1970 Let It Be\n\n\nThe Beatles were an English rock band that formed in Liverpool, in 1960. With John Lennon, Paul McCartney, George Harrison and Ringo Starr, they became widely regarded as the greatest and most influential act of the rock era.[1] Rooted in skiffle, beat and 1950s rock and roll, the Beatles later experimented with several genres, ranging from pop ballads to psychedelic and hard rock, often incorporating classical elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication they came to be perceived as an embodiment of the ideals shared by the era's sociocultural revolutions.\n\nThe Beatles built their reputation playing clubs in Liverpool and Hamburg over a three-year period from 1960. Manager Brian Epstein moulded them into a professional act and producer George Martin enhanced their musical potential. They gained popularity in the United Kingdom after their first hit, &quot;Love Me Do&quot;, in late 1962. They acquired the nickname &quot;the Fab Four&quot; as Beatlemania grew in Britain over the following year, and by early 1964 they had become international stars, leading the &quot;British Invasion&quot; of the United States pop market. From 1965 onwards, the Beatles produced what many critics consider their finest material, including the innovative and widely influential albums Rubber Soul (1965), Revolver (1966), Sgt. Pepper's Lonely Hearts Club Band (1967), The Beatles (commonly known as the White Album, 1968) and Abbey Road (1969). After their break-up in 1970, they each enjoyed successful musical careers. Lennon was shot and killed in December 1980, and Harrison died of lung cancer in November 2001. McCartney and Starr, the surviving members, remain musically active.\n\nAccording to the RIAA, the Beatles are the best-selling music artists in the United States, with 178 million certified units. They have had more number-one albums on the British charts and sold more singles in the UK than any other act. In 2008, the group topped Billboard magazine's list of the all-time most successful &quot;Hot 100&quot; artists; as of 2014, they hold the record for most number-one hits on the Hot 100 chart with twenty. They have received ten Grammy Awards, an Academy Award for Best Original Score and fifteen Ivor Novello Awards. Collectively included in Time magazine's compilation of the twentieth century's 100 most influential people, they are the best-selling band in history, with estimated sales of over 600 million records worldwide","torrent":{"xt":"urn:btih:e8e85733f495331531e4ef370b661e5969af6a12","amp;dn":"The+Beatles+discography+1963+-+1970+%28P.a.I.D.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8e85733f495331531e4ef370b661e5969af6a12","infoHashBuffer":{"type":"Buffer","data":[232,232,87,51,244,149,51,21,49,228,239,55,11,102,30,89,105,175,106,18]},"announce":[],"urlList":[]}}