{"title":"War! What Is It Good For?: The role of conflict in civilisation ","uid":10438706,"size":3604144,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e939dcba7cf825fa83f8818a008ca25a971cde69&amp;dn=War%21+What+Is+It+Good+For%3F%3A+The+role+of+conflict+in+civilisation+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bookzilla","files":1,"time":1403869254,"description":"War! What Is It Good For?: The role of conflict in civilisation, from primates to robots (Conflict and the Progress of Civilization from Primates to Robots)\n\n\nWar is one of the greatest human evils. It has ruined livelihoods, provoked unspeakable atrocities and left countless millions dead. It has caused economic chaos and widespread deprivation. And the misery it causes poisons foreign policy for future generations.\n\n But, argues bestselling historian Ian Morris, in the very long term, war has in fact been a good thing. In his trademark style combining inter-disciplinary insights, scientific methods and fascinating stories, Morris shows that, paradoxically, war is the only human invention that has allowed us to construct peaceful societies. Without war, we would never have built the huge nation-states which now keep us relatively safe from random acts of violence, and which have given us previously unimaginable wealth. It is thanks to war that we live longer and more comfortable lives than ever before.\n\n And yet, if we continue waging war with ever-more deadly weaponry, we will destroy everything we have achieved; so our struggles to manage warfare make the coming decades the most decisive in the history of our civilisation. In War: What Is It Good For? Morris brilliantly dissects humanity's history of warfare to draw startling conclusions about our future.\n\nepub","torrent":{"xt":"urn:btih:e939dcba7cf825fa83f8818a008ca25a971cde69","amp;dn":"War%21+What+Is+It+Good+For%3F%3A+The+role+of+conflict+in+civilisation+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e939dcba7cf825fa83f8818a008ca25a971cde69","infoHashBuffer":{"type":"Buffer","data":[233,57,220,186,124,248,37,250,131,248,129,138,0,140,162,90,151,28,222,105]},"announce":[],"urlList":[]}}