{"title":"Mastering Adobe Captivate 2012","uid":7644620,"size":7805057,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e95643a6438f8b6b77cbd48e34f33c3e3477bb8c&amp;dn=Mastering+Adobe+Captivate+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"renatosistema","files":-1,"time":1347871035,"description":"book Description:\n\nAdobe Captivate is the industry-leading solution for authoring E-learning content. With adobe Captivate one can capture the on-screen action, enhance e-Learning projects, insert SCORM and AICC-compliant quizzes and then, publish your work in various formats for easy deployment on virtually any desktop and mobile device.\n\nMastering Adobe Captivate 6 is a comprehensive guide to creating SCORM-compliant demonstrations, simulations and quizzes withAdobe Captivate. The sample projects demonstrate each and every feature of Adobe Captivate giving you the expertise you need to create and deploy your own professionalquality e-learning courses.\n\nMastering Adobe Captivate 6 will guide you through the creation of three e-learning projects including a demonstration, a simulation and a SCORM-compliant quiz. The first part of the book will drive you through the main three steps of the Captivate production process. In the first step, we will use the powerful capture engine of Captivate to generate the needed slides and screenshots. In the second step, we will enhance our slides and screenshots using the objects provided by Captivate. These objects include animations, interactions, videos and more. In the third step, we will make our project available to the outside world by publishing it in various formats including Adobe Flash PDF, video, and even HTML 5. The second part of the book will focus on the advanced tools of Captivate. These tools include the questions slides that make up a quiz, SCORM and AICC compliance, localization of your e-Learning content and widgets among others. In the last chapter, you we will unleash the true power of Captivate by using the variables and the advanced actions to create a unique e-Learning experience.\n\nWhat you will learn from this book\n\n    Capture animated screenshots\n    Use the panning feature and the automatic recording modes of Captivate\n    Convert existing Power Point presentation to Captivate\n    Add interactivity to your demonstrations and simulations\n    Add sound and closed captions to your demonstrations and simulations\n    Generate narration with the text-to-speech engine of Captivate\n    Create random interactive quizzes with the question slides and the question pools\n    Publish your projects to Flash, PDF, YouTube, HTML5 and more enabling virtually any mobile and desktop users to view your e-learning content\n    Deploy your simulations, demonstrations and quizzes in any SCORM or AICC-Compliant LMS\n    Use the templates and the master slides to implement consistent formatting and rapid development\n    Use Captivate with other applications including Adobe Photoshop, Adobe Audition, Adobe Flash, MicrosoftPower Point and Microsoft Word\n    Unleash the true power of Captivate by using widgets variables and advanced actions\n","torrent":{"xt":"urn:btih:e95643a6438f8b6b77cbd48e34f33c3e3477bb8c","amp;dn":"Mastering+Adobe+Captivate+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e95643a6438f8b6b77cbd48e34f33c3e3477bb8c","infoHashBuffer":{"type":"Buffer","data":[233,86,67,166,67,143,139,107,119,203,212,142,52,243,60,62,52,119,187,140]},"announce":[],"urlList":[]}}