{"title":"Plastic Surgery Emergencies (Thieme) [PDF] [StormRG]","uid":11375994,"size":11606901,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9d7bc48f02a6d84652b6aa4f56d3256c5c38fed&amp;dn=Plastic+Surgery+Emergencies+%28Thieme%29+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"0xmovva","files":2,"time":1415146761,"description":"TITLE/EDITION Plastic Surgery Emergencies: Principles and Techniques \nAuthor: Jamal M. Bullocks (Author), Patrick W. Hsu (Author), Shayan A. Izaddoost (Author), Larry H. Hollier (Author), Samuel Stal (Author)\nPaperback: 312 pages\nPublisher: Thieme; 1st edition edition (June 2, 2008)\nLanguage: English\nISBN-10: 1588906701\nISBN-13: 978-1588906700\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nPlastic Surgery Emergencies presents a concise guide to the principles and procedures for rapidly evaluating and treating acute care problems in the emergency room setting or during on-call consultations. Using succinct descriptions and easily accessible bullet-points, the book instructs the reader in the protocols for a range of common and uncommon problems, from simple suture repair of lacerations to managing facial trauma to treating compartment syndrome of the upper extremity.\n\nFeatures:\n\nEasy-to-follow diagrams demonstrating key procedures\nFull-color photographs for rapid diagnosis\nComprehensive discussion of common pharmacotherapy\nConcise review of specific anatomy to aid rapid identification of injuries\nDescriptions of the various types and uses of different sutures and the techniques for suturing complex wounds\nInstructions for performing regional blocks of the face and hand\nGuidelines for the assessment and treatment of simple burn wounds, severely burned patients, and patients with bites and stings\nRecommendations for managing postoperative and free flap complications\nExtensive discussion of how to address soft tissue and traumatic hand injuries, with detailed descriptions of upper extremity splinting techniques\nThis handy, pocket manual is an indispensable resource for clinicians, residents, and trainees in plastic surgery. It is also ideal for all emergency room personnel, including ER physicians, physicians' assistants, and nurse practitioners, as well as family practice physicians","torrent":{"xt":"urn:btih:e9d7bc48f02a6d84652b6aa4f56d3256c5c38fed","amp;dn":"Plastic+Surgery+Emergencies+%28Thieme%29+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9d7bc48f02a6d84652b6aa4f56d3256c5c38fed","infoHashBuffer":{"type":"Buffer","data":[233,215,188,72,240,42,109,132,101,43,106,164,245,109,50,86,197,195,143,237]},"announce":[],"urlList":[]}}