{"title":"Alan Barnard - Social Anthropology and Human Origins [2011][A]","uid":10440300,"size":1396855,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9e10861cb3077e297ec7b06a5d746a74355a12f&amp;dn=Alan+Barnard+-+Social+Anthropology+and+Human+Origins+%5B2011%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Anette14","files":-1,"time":1403880166,"description":"Description\nProduct Details\nBook Title: Social Anthropology and Human Origins\t\nBook Author: Alan Barnard (Author)\nPaperback: 196 pages\nPublisher: Cambridge University Press (April 29, 2011)\nLanguage: English\nISBN-10: 0521749298\nISBN-13: 978-0521749299\n\n===================================================================================\nBook Description\nPublication Date: April 29, 2011\nThe study of human origins is one of the most fascinating branches of anthropology. Yet it has rarely been considered by social or cultural anthropologists, who represent the largest subfield of the discipline. In this powerful study Alan Barnard aims to bridge this gap. Barnard argues that social anthropological theory has much to contribute to our understanding of human evolution, including changes in technology, subsistence and exchange, family and kinship, as well as to the study of language, art, ritual and belief. This book places social anthropology in the context of a widely-conceived constellation of anthropological sciences. It incorporates recent findings in many fields, including primate studies, archaeology, linguistics and human genetics. In clear, accessible style Barnard addresses the fundamental questions surrounding the evolution of human society and the prehistory of culture, suggesting a new direction for social anthropology that will open up debate across the discipline as a whole.\n\n===================================================================================\nReviews\n'This is a seminal attempt to bring social and evolutionary anthropology back into the same frame, to allow social anthropology once again to make a serious contribution to accounts of human origins.' Robin Dunbar, University of Oxford\n\n'Barnard's Social Anthropology and Human Origins is a timely, welcome call for the introduction of socio-cultural anthropology to the study of human evolution.' Benjamin Grant Purzycki, Anthropos\n\n'... a well-informed and considered treatment of the social issues of concern ... This is a stimulating book, and it should be read and taken seriously by anyone who works on human origins ... Barnard provides good justification that social anthropology could be very powerful in understanding human evolution at its grandest scale.' Journal of African Archaeology\n\n===================================================================================\nAbout the Author\nAlan Barnard is Professor of the Anthropology of Southern Africa at the University of Edinburgh, where he has taught since 1978. He has undertaken a wide range of ethnographic fieldwork and archaeological research in Botswana, Namibia and South Africa, is a participant in the British Academy Centenary Research project 'From Lucy to Language: The Archaeology of the Social Brain' and serves as Honorary Consul of the Republic of Namibia in Scotland. His numerous publications include History and Theory in Anthropology (2000) and Anthropology and the Bushman (2007).\n===================================================================================","torrent":{"xt":"urn:btih:e9e10861cb3077e297ec7b06a5d746a74355a12f","amp;dn":"Alan+Barnard+-+Social+Anthropology+and+Human+Origins+%5B2011%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9e10861cb3077e297ec7b06a5d746a74355a12f","infoHashBuffer":{"type":"Buffer","data":[233,225,8,97,203,48,119,226,151,236,123,6,165,215,70,167,67,85,161,47]},"announce":[],"urlList":[]}}