{"title":"Gary Burton - Astor Piazzola Reunion- A Tango Excursion TQMP","uid":4994789,"size":319384929,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e9eea984a00e6e7b1d2c6fcda770535174639e7a&amp;dn=Gary+Burton+-+Astor+Piazzola+Reunion-+A+Tango+Excursion+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"zootallure","files":18,"time":1247227132,"description":"Gary Burton (b. January 23, 1943, Anderson, Indiana) is an American jazz vibraphonist.\n\nA true original on the vibraphone, Burton developed a pianistic style of four-mallet technique as an alternative to the usual two-mallets. This approach caused Burton to be heralded as an innovator and his sound and technique are widely imitated. He is also known for pioneering fusion jazz and popularizing the duet format in jazz, as well as being a major figure in jazz education.\nBurton is notable as one of very few openly gay musicians in jazz history, and has stated that his coming out in his 40s had no adverse consequences for his career.\n\nWorking with members of Piazzolla's crack ensembles, Burton reverently addresses the romantic temperament that infused all the work of the great composer and bandoneon virtuoso.\nThe track &quot;Mi Refugio,&quot; features Gary Burton overdubbed on a rare solo performance by Astor Piazzolla.\nPersonnel: Gary Burton (vibraphone); Daniel Binelli, Marcelo Nisinman, Astor Piazzolla (bandoneon); Fernando Suarez-Paz (violin); Pablo Ziegler, Makoto Ozone, Nicolas Ledesma (piano); Horacio Malvicino (guitar); Hector Console (bass).\nRecorded at El Pie Recording Studios, Buenos Aires, Argentina from December 2-5, 1996. Includes liner notes by Horacio Ferrer, Laura Escalada Piazzolla and Fernando Gonzalez.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:e9eea984a00e6e7b1d2c6fcda770535174639e7a","amp;dn":"Gary+Burton+-+Astor+Piazzola+Reunion-+A+Tango+Excursion+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9eea984a00e6e7b1d2c6fcda770535174639e7a","infoHashBuffer":{"type":"Buffer","data":[233,238,169,132,160,14,110,123,29,44,111,205,167,112,83,81,116,99,158,122]},"announce":[],"urlList":[]}}