{"title":"Battlefield 2  ISO","uid":7264855,"size":2055544832,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e9f293d2d012b8cf8c0301a5aad656d409c36e09&amp;dn=Battlefield+2++ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"rangzoom","files":1,"time":1336850887,"description":"Battlefield 2  ISO\n\nThe award-winning Battlefield franchise invades the high tech frontlines of modern warfare in the new sequel, Battlefield 2?. The game brings the intensity and excitement of Battlefield 1942? into the modern era with enhanced team play and the latest, most technologically advanced vehicles and weapons systems available to man.\n\n\n\n\nKEY FEATURES\n* Online multiplayer action with up to 64 players on the PC.\n* All-new gameplay engine brings the immense locations to life complete with realistic physics and dynamic lighting.\n* Maps scale to the number of players engaging in battle for a unique and intense experience every time.\n* Take control of over 30 land, sea, and air vehicles, including tanks, helicopters, hovercraft, fast attack vehicles, and fighter jets.\n* Choose to battle as U.S., Chinese, or Middle East Coalition troops, each with their own unique arsenals.\n* A variety of soldier classes including Assault, Sniper, Special Ops, Combat Engineer, Medic, Heavy Weapons, and Anti-Tank units.\n* New state-of-the-art weapon systems, including wire-guided missiles and laser designated bombs.\n* Material penetration feature makes sure players know the difference between cover and concealment.\n* Character Persistence and Growth. With in-game success, players increase their rank from recruit all the way to General and unlock new weapons, medals, and more.\n* Join a squad or select the new Commander Mode to assume the strategic role of battlefield commander directing his forces.\n* Voice over IP supported with headset.\n\nSYSTEM REQUIREMENTS\n\n* Windows XP (32-bit) with Admin rights\n* 1.7 GHz Intel Celeron D / Pentium 4 or AMD Athlon XP/ Sempron or greater\n* 512 MB of RAM or more\n* 8x or faster CD/DVD drive\n* 2.3 GB free hard drive space or more\n* Video: DirectX 9.0c compatible (see video) \n* Sound: DirectX 9.0c compatible (Sound Blaster X-Fi series recommended )\nVIDEO\nVideo card must have 128 MB or more memory and one of the following chipsets:\n\n * NVIDIA GeForce FX 5700 or greater\n * ATI Radeon 8500 or greater\n\nMULTIPLAYER\nMultiplayer requires 1 set of discs per PC and a broadband (Cable, DSL, or a faster) connection.Internet or Network (2-64 players). \n\nHave Fun with this game\nISO File\n\n\t\t","torrent":{"xt":"urn:btih:e9f293d2d012b8cf8c0301a5aad656d409c36e09","amp;dn":"Battlefield+2++ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9f293d2d012b8cf8c0301a5aad656d409c36e09","infoHashBuffer":{"type":"Buffer","data":[233,242,147,210,208,18,184,207,140,3,1,165,170,214,86,212,9,195,110,9]},"announce":[],"urlList":[]}}