{"title":"The Doctor (NEW 2014 Brazzers) [DVDRip]","uid":11225931,"size":1126435978,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ea30786e5d9226f509d6182b5c8ef727fbffc2ae&amp;dn=The+Doctor+%28NEW+2014+Brazzers%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":4,"uploader":"chkm8te","files":1,"time":1413438442,"description":"The Doctor (NEW 2014 Brazzers) [DVDRip]\n\nFranceska Jaimes, Lou Lou, Georgie Lyall, Victoria Summers.\n\nToday on The Doctor, everyone's favorite Timelord makes a daring rescue attempt as Lisa (played by busty babe Franceska Jaimes) is captured by the dreaded zombie space girls. When our hero takes some fire, he has to regenerate a new body, and desperately needs an adrenalin rush to save it! The Doctor can feel the process working, so he fucks the busty babe in both of her tight little holes. She cums on his dick as he pounds her tight little pussy and juicy ass, and then he gives her a nice facial cumshot.\nWhen Timelord faces off against inter-dimensional slut Gaija Thorax (aka LouLou), who's been terrorizing some poor peaceful English villagers. The poor superstitious country folk think they're being haunted, but fortunately, the good Doctor is there to set them all straight. After a brief examination, Doctor Screw discovers that what they thought was a monster was actually just a busty blonde babe trying looking for some inter-dimensional dick! As soon as he manages to pull her into our plane of existence, she shows her gratitude by sucking the good Doctor's dick and then wrapping it up in her big fake tits.\nIn the thrilling conclusion to The Doctor, we find our hero in the midst of an erotic interlude with a sexy mutant (AKA Victoria Summers). She's got big tits and an incredible body, so The Doctor goes to town, fucking her hard and blowing a load all over her face. But when Big Blue brings them to a 26th century prison planet, it's The Doctor and his lovely assistant Victoria (AKA Georgie Lyall) in an exciting team-up with The Doctor's old nemesis, Mistress Leigh Darby! The trio has an amazing threesome, with Leigh and Georgie taking turns licking each other's tight pussies and fucking The Doctor's huge cock.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=78wva9n6eyj9y3ddvs3q.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=78wva9n6eyj9y3ddvs3q.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=4hdlf8m736izjo6zobiq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=4hdlf8m736izjo6zobiq.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ea30786e5d9226f509d6182b5c8ef727fbffc2ae","amp;dn":"The+Doctor+%28NEW+2014+Brazzers%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea30786e5d9226f509d6182b5c8ef727fbffc2ae","infoHashBuffer":{"type":"Buffer","data":[234,48,120,110,93,146,38,245,9,214,24,43,92,142,247,39,251,255,194,174]},"announce":[],"urlList":[]}}