{"title":"Long Pigs 2007","uid":6573464,"size":772157278,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ea84c8264962958fbb6f0f8083ec414423d70b93&amp;dn=Long+Pigs+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"myrkez","files":2,"time":1312076256,"description":"-----\nLONG PIGS\n2007\n-----\n\nUploaded by Akon Myrkez\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0971204/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0971204/&lt;/a&gt;\n\n\n\n\\&quot;A documentary by two desperate young filmmakers who stumble upon the ultimate subject, a 33 year old cannibalistic serial killer named Anthony McAllister, who has agreed to let them document every aspect of his horrifically violent life-style. Initially terrified, the filmmakers get to know Anthony as a person. They even begin to identify with his ecological and philosophical justifications for his cannibalistic lifestyle. It\\'s only when they investigate further that the filmmakers begin to doubt Anthony\\'s accounts of his past. Tensions noticeably rise as the filmmakers continue to confront Anthony on his conflicting stories and ever-changing philosophies. During an awkward interview, the filmmakers interview Merle, the father of a young girl who was abducted and never found. This abduction was Anthony\\'s first child victim. Merle welcomes them into his home and gives them a heart-felt experience that even Anthony is touched by. As the documentary reaches its conclusion Anthony begins to become uncomfortably aware of the how much of his life he has revealed to these filmmakers. In a final interview with Anthony a deadly confrontation erupts and all that remains is a broken camera and this footage. This film will challenge the audience to view a horrific side of humanity and will deliver a social commentary that leaves the audience thinking about the world they live in and the power and effect of all media.\\&quot;\n\n------\n\nHope you enjoy the movie.\n\nPlease visit my friend\\'s project at\n","torrent":{"xt":"urn:btih:ea84c8264962958fbb6f0f8083ec414423d70b93","amp;dn":"Long+Pigs+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea84c8264962958fbb6f0f8083ec414423d70b93","infoHashBuffer":{"type":"Buffer","data":[234,132,200,38,73,98,149,143,187,111,15,128,131,236,65,68,35,215,11,147]},"announce":[],"urlList":[]}}