{"title":"Martin Pistorius - När jag var osynlig - Svensk","uid":15278818,"size":561264995,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ea8f394391e35398b37991a9e8ef1414a845776b&amp;dn=Martin+Pistorius+-+N%26auml%3Br+jag+var+osynlig+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"totomas1","files":85,"time":1468327260,"description":"Martin Pistorius - När jag var osynlig\r\n\r\nI januari 1988 blev Martin Pistorius, då 12 år gammal, plötsligt sjuk. Han slutade äta, han sov hela tiden och drog sig undan all mänsklig kontakt. Läkarna förstod inte vad det var för fel, men inom loppet av ett och ett halvt år blev han förlamad, stum och okontaktbar.\r\nMartins föräldrar fick förklaringen att han drabbats av en okänd sjukdom som gradvis bröt ner hans kropp och att han antagligen bara hade några år kvar att leva.\r\n\r\nTio år senare tyckte en av Martins terapeuter att hon fick kontakt med honom på ett sätt som man inte tidigare lyckats med. Det visade sig att Martin varit fullt medveten trots att han inte kunnat ge omvärlden några signaler om detta. Han hade tillbringat nästan ett decennium inlåst i en icke fungerande kropp.\r\nIngen hade trott att han förstod någonting av vad som hände honom, och behandlat honom därefter.\r\n\r\nUnder de följande åren lyckades Martin med hjälp av olika hjälpmedel bygga upp ett nytt liv. Trots att han fortfarande var totalförlamad lärde han sig kommunicera med omvärlden och blev en framstående specialist på datorteknologi. Idag har han funnit kärleken och gift sig.\r\n\r\nNär jag var osynlig är en drabbande berättelse om tillfrisknande och kärlekens kraft. Martins kamp för att bryta sig loss ur det mörker han vistats i under så lång tid är ett unikt vittnesmål och ett bevis för människans förmåga att åstadkomma det omöjliga.\r\nDet är också en berättelse som manar oss alla att ta till vara det vi har och att inte ta något för givet.\r\n\r\n\r\nMp3-CD\r\nUppläsare: Mikael Edfeldt","torrent":{"xt":"urn:btih:ea8f394391e35398b37991a9e8ef1414a845776b","amp;dn":"Martin+Pistorius+-+N%26auml%3Br+jag+var+osynlig+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea8f394391e35398b37991a9e8ef1414a845776b","infoHashBuffer":{"type":"Buffer","data":[234,143,57,67,145,227,83,152,179,121,145,169,232,239,20,20,168,69,119,107]},"announce":[],"urlList":[]}}