{"title":"WinAbility USBCrypt v16.6.1","uid":15520302,"size":5426077,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:eab1b34178ef43ef6e0f9e9d4f2b800ed27c0679&amp;dn=WinAbility+USBCrypt+v16.6.1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"LxByte","files":1,"time":1470741505,"description":"WinAbility USBCrypt v16.6.1\r\n\r\nUSBCrypt™ is a powerful software encryption utility for Windows 10, 8, 7, XP that protects your sensitive information from unauthorized access. It locks the bad guys out, and protects your personal, business, and financial data.\r\n\r\nUse USBCrypt to encrypt your USB and other removable and fixed drives with strong encryption. USBCrypt uses the industry standard AES encryption algorithm to protect your files, the strongest protection available.\r\n\r\nUSBCrypt encrypts your files\r\nScreenshot (click to enlarge)\r\nUnlike other encryption programs, USBCrypt is closely integrated with the Windows shell. This makes working with encrypted drives easy and intuitive. The drives encrypted with USBCrypt can be used with other Windows computers, even if they don't have USBCrypt software installed on them.\r\n\r\nYou can use USBCrypt to protect your files if you use a removable disk to move the files between your office and home. This is especially important if your work files contain confidential company information, or private information about your clients: losing such data without encrypting them could spell disaster for your business or career! USBCrypt can help you protect the privacy of your data.\r\n\r\nIf you use a removable drive to keep the backup of your files, you don't want it to get into the wrong hands. With USBCrypt, you can create a Virtual Encrypted Disk backup your files directly to the encrypted storage area. If someone gets hold of your external drive, s/he won't be able to extract your backup without the password.\r\n\r\nUSBCrypt can keep your personal files secure, too. What if you lose the flash drive with your vacation photos somewhere away from home? If you have encrypted it with USBCrypt, you can sleep well knowing your private files won't appear on some shady web site.\r\n\r\nOfficial Website: http://www.winability.com/","torrent":{"xt":"urn:btih:eab1b34178ef43ef6e0f9e9d4f2b800ed27c0679","amp;dn":"WinAbility+USBCrypt+v16.6.1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eab1b34178ef43ef6e0f9e9d4f2b800ed27c0679","infoHashBuffer":{"type":"Buffer","data":[234,177,179,65,120,239,67,239,110,15,158,157,79,43,128,14,210,124,6,121]},"announce":[],"urlList":[]}}