{"title":"Sean Paul Discography","uid":5739558,"size":2049332779,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:eadba60155a9e33464afa95b9c65b7368183f0cc&amp;dn=Sean+Paul+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"ddawg","files":-1,"time":1280951236,"description":"\nSean Paul Discography - 2000 through 2009\nGenre: Raggae\nFormat: flac\n\n\n2000 Stage One\n2002 Dutty Rock\n2003 Scanty World Reggae Non-Stop  (Missing Requested)   \n2005 The Trinity\n2006 Reggae Tribute to Sean Paul (Missing Unsure what this is)\n2009 Imperial Blaze \n\n\nAllmusic Biography:\nDancehall superstar Sean Paul began scoring hit singles in Jamaica starting in 1996 and thereafter steadily began attracting international attention, eventual breaking into the pop mainstream in 2002 with Dutty Rock. Born Sean Paul Henriques on January 8, 1973, the multi-ethnic Paul (his parents had Portuguese, Chinese, and Jamaican blood) grew up comfortably in St. Andrew, Jamaica, his mother a renowned painter. He was a skilled athlete, excelling in swimming and especially water polo, playing for the Jamaican national team in the latter. Although his education was enough to land a prosperous career, dancehall music remained Paul's first love, particularly crafting rhythm tracks. He became a DJ after he began writing his own songs, patterning his style largely after Super Cat and finding a mentor in Don Yute; he also found contacts in several members of the reggae-pop band Third World in 1993, which helped open up business connections. \n\nPaul released his debut single, &quot;Baby Girl,&quot; with producer Jeremy Harding in 1996; it proved a significant success, leading to further Jamaican hits like &quot;Nah Get No Bly (One More Try),&quot; &quot;Deport Them,&quot; &quot;Excite Me,&quot; &quot;Infiltrate,&quot; and &quot;Hackle Mi.&quot; In 1999, Sean Paul started to make inroads to American audiences; he was first commissioned to collaborate with fellow dancehall hitmaker Mr. Vegas on a production for rapper DMX; titled &quot;Here Comes the Boom,&quot; the song was included in director Hype Williams' film Belly. Also that year, Paul scored a Top Ten hit on the Billboard rap charts with &quot;Hot Gal Today.&quot; Unfortunately, Paul had a very public falling out with Mr. Vegas over the packaging of the latter's remix of &quot;Hot Gal Today&quot;; still, it didn't slow Paul's career momentum, as he played the Summer Jam 2000 in New York City, the center of his American popularity. That fall, Paul released his first album on VP Records; the sprawling Stage One collected many of Paul's previous hit singles and compilation cuts, plus a few brand-new tracks. 2002's Dutty Rock and 2005's The Trinity were extremely successful. Both albums peaked in the Top Ten of the album chart and featured a handful of mainstream smashes. \n \n","torrent":{"xt":"urn:btih:eadba60155a9e33464afa95b9c65b7368183f0cc","amp;dn":"Sean+Paul+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eadba60155a9e33464afa95b9c65b7368183f0cc","infoHashBuffer":{"type":"Buffer","data":[234,219,166,1,85,169,227,52,100,175,169,91,156,101,183,54,129,131,240,204]},"announce":[],"urlList":[]}}