{"title":"Rachel P. Maines - The Technology of Orgasm. Hysteria, the Vibra","uid":10529367,"size":16904786,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eadecc241de2714ed3afa29e4073f9710931a8f9&amp;dn=Rachel+P.+Maines+-+The+Technology+of+Orgasm.+Hysteria%2C+the+Vibra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Anette14","files":-1,"time":1405087807,"description":"Description\nProduct Details\nBook Title: The Technology of Orgasm: &quot;Hysteria,&quot; the Vibrator, and Women's Sexual Satisfaction (Johns Hopkins Studies in the History of Technology)\nBook Author: Rachel P. Maines (Author)\nSeries: Johns Hopkins Studies in the History of Technology (Book 24)\nPaperback: 208 pages\nPublisher: Johns Hopkins University Press; 1 edition (March 1, 2001)\nLanguage: English\nISBN-10: 0801866464\nISBN-13: 978-0801866463\n\n===================================================================================\nBook Description\nPublication Date: March 1, 2001 | ISBN-10: 0801866464 | ISBN-13: 978-0801866463 | Edition: 1\nFrom the time of Hippocrates until the 1920s, massaging female patients to orgasm was a staple of medical practice among Western physicians in the treatment of &quot;hysteria,&quot; an ailment once considered both common and chronic in women. Doctors loathed this time-consuming procedure and for centuries relied on midwives. Later, they substituted the efficiency of mechanical devices, including the electric vibrator, invented in the 1880s. In The Technology of Orgasm, Rachel Maines offers readers a stimulating, surprising, and often humorous account of hysteria and its treatment throughout the ages, focusing on the development, use, and fall into disrepute of the vibrator as a legitimate medical device.\n\n===================================================================================\nEditorial Reviews\nReview\nFor centuries, women diagnosed with &quot;hysteria&quot;--a &quot;disease paradigm,&quot; in Rachel P. Maines's felicitous phrase, thought to result from a lack of sexual intercourse or gratification--were treated by massaging their genitals in order to induce &quot;paroxysm.&quot; Male physicians, however, considered the practice drudgery, and sought various ways of avoiding the task, often foisting it off on midwives or, starting in the late 19th century, employing mechanical devices. Eventually, these devices became available for purchase and home use; one such &quot;portable vibrator&quot; is advertised in the 1918 Sears, Roebuck catalog as an &quot;aid that every woman appreciates.&quot; The Technology of Orgasm is an impeccably researched history that combines a discussion of hysteria in the Western medical tradition with a detailed examination (including several illustrations) of the devices used to &quot;treat&quot; the &quot;condition.&quot; (Maines is somewhat dismissive of the contemporary, phallus-shaped models, which she describes as &quot;underpowered battery-operated toys,&quot; insisting that &quot;it is the AC-powered vibrator with at least one working surface at a right angle to the handle that is best designed for application to the clitoral area.&quot;) Don't expect any cheap thrills, though; the titillation Maines offers is strictly intellectual. --Ron Hogan\n\nFrom Publishers Weekly\nIt will surprise most readers to learn that the vibrator was invented in the late 1880s as a time-saving device for physicians, who had been treating women's &quot;hysteria&quot; for years with clitoral massage. Denying the sexual nature of the treatments, doctors instead saw the technique as a burdensome chore and welcomed electric devices that would shorten patients' visits. Maines, an independent scholar in the history of technology, presents a straightforward account of the mechanism from its beginning through the 1920s, when it came into disrepute as a medical instrument. Going far beyond a mere summary of therapeutic advances, however, she wryly chronicles the attitude toward women's sexuality in the medical and psychological professions and shows, with searing insight, how some ancient biases are still prevalent in our society. Maines's writing is lively and entertaining, and her research is exhaustive, drawing on texts from Hippocrates to the present day. Proving her point about how women's sexuality is still perceived as an unapproachable subject in some quarters, Maines describes her travails in vibrator historiography, including the loss of her teaching position at Clarkson University. A pioneering and important book, this window into social and technological history also provides a marvelously clear view of contemporary ideas about women's sexuality.\n\nFrom Library Journal\nA researcher and archivist with a doctorate in the history of technology, Maines has produced an exhaustive and deliciously savage history of the vibrator-as-sex-aid. Massage of women's genitalia by physicians for relief of &quot;hysteria&quot; dates to Hippocrates. Yet procuring women's orgasms?whether identified as sex or as merely &quot;paroxysm&quot;?was &quot;the job that nobody wanted,&quot; and physicians were happy to delegate the chore to mechanical devices in the 1880s. This fascinating and exquisitely referenced true story reads like twisted science fiction and will intrigue historians of technology and/or medicine, culture-watchers, feminists, and lay readers. Maines's work is noted briefly in Joani Blank's Good Vibrations (Down There, 1989), a concise and helpful popular introduction to vibrators and how to use them. Hoag Levins's journalistic American Sex Machines (Adams Media, 1996) bypasses vibrator evolution and history completely. Maines's dry wit and writing skill lend appeal and readability. Highly recommended for academic and public libraries.Martha Cornog, Philadelphia\n\n===================================================================================\nReviews\nThorough, original, and surprising.(Sarah Boxer New York Times Book Review)\n\nFull of wonderful descriptions of the 'job nobody wanted,' including photographs of early vibrators and vaginal electrodes.(Jeanette Winterson Times (London))\n\nFeminist scholarship exactly as it should be: a work that not only illuminates an astonishing bit of herstory, but does so with a neat balance of anger, wit and humor... A wonderful book.(Carol Lynn Mithers L.A. Weekly)\n\nExhaustively researched... decidedly offbeat.(Natalie Angier New York Times)\n\nHere's a provocative history with a chip on its shoulder and a buzz under its skirt... Exhumes startling facts from the underground sexual history of the early twentieth century.(Will Blythe Mirabella)\n\nMaines has produced an exhaustive and deliciously savage history of the vibrator-as-sex-aid... This fascinating and exquisitely referenced true story reads like twisted science fiction.(Library Journal)\n\nA titillating and often hilarious account of the rise and fall (as it were) of the vibrator as a medical tool for the treatment of hysteria... A book that can delight as well as enlighten.(Journal of the American Medical Association)\n\nRachel Maines offers readers a stimulating, surprising, and often humorous account of hysteria and its treatment throughout the ages.(Birdbooker Report)\n\n===================================================================================\nAbout the Author\nRachel P. Maines is an independent scholar and a technical processing assistant at Cornell University's Hotel School Library. She is also the author of numerous articles in scholarly and popular publications.\n===================================================================================","torrent":{"xt":"urn:btih:eadecc241de2714ed3afa29e4073f9710931a8f9","amp;dn":"Rachel+P.+Maines+-+The+Technology+of+Orgasm.+Hysteria%2C+the+Vibra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eadecc241de2714ed3afa29e4073f9710931a8f9","infoHashBuffer":{"type":"Buffer","data":[234,222,204,36,29,226,113,78,211,175,162,158,64,115,249,113,9,49,168,249]},"announce":[],"urlList":[]}}