{"title":"Hydrogen Fuel Cells For Road Vehicles [BBS]","uid":6613650,"size":6408434,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eca1cdb7a4615dfccfc92c5a8dbff4031c915209&amp;dn=Hydrogen+Fuel+Cells+For+Road+Vehicles+%5BBBS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1313691398,"description":"Hydrogen Fuel Cells for Road Vehicles addresses the main issues related to the application of hydrogen fuel cell technology in the road transportation sector. A preliminary treatment is given on fuel resources and atmospheric pollution concerns which are closely related to the current technology (internal combustion engine) used for moving people and goods. The authors deal, in particular, with the problems that can hinder a widespread hydrogen market (production, storage and distribution), as well as giving an analysis of fuel cell technologies available for utilization of this energy carrier in the automotive field. Hydrogen Fuel Cells for Road Vehicles also examines the concerns faced during the design and realization of a PEM fuel cell system with optimal size and efficiency, evidencing the impact of the individual auxiliary components on energy losses and dynamic stack performance. The book ends with the analysis of two practical case studies on fuel cell propulsion systems. Hydrogen Fuel Cells for Road Vehicles is a useful text for researchers, professionals and advanced students in the fields of automotive and environmental engineering.\nFrom the Back Cover\n\nHydrogen Fuel Cells for Road Vehicles addresses the main issues related to the application of hydrogen fuel cell technology in the road transportation sector. A preliminary treatment is given on fuel resources and atmospheric pollution concerns which are closely related to the current technology (internal combustion engine) used for moving people and goods.\n\nThe authors deal, in particular, with the problems that can hinder a widespread hydrogen market (production, storage and distribution), as well as giving an analysis of fuel cell technologies available for utilization of this energy carrier in the automotive field. Hydrogen Fuel Cells for Road Vehicles also examines the concerns faced during the design and realization of a PEM fuel cell system with optimal size and efficiency, evidencing the impact of the individual auxiliary components on energy losses and dynamic stack performance. The book ends with the analysis of two practical case studies on fuel cell propulsion systems.\n\nHydrogen Fuel Cells for Road Vehicles is a useful text for researchers, professionals and advanced students in the fields of automotive and environmental engineering.\n\n\n\n\n# Hardcover: 254 pages\n# Publisher: Springer; 1st Edition. edition (January 31, 2011)\n# Language: English\n# ISBN-10: 0857291351\n# ISBN-13: 978-0857291356","torrent":{"xt":"urn:btih:eca1cdb7a4615dfccfc92c5a8dbff4031c915209","amp;dn":"Hydrogen+Fuel+Cells+For+Road+Vehicles+%5BBBS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eca1cdb7a4615dfccfc92c5a8dbff4031c915209","infoHashBuffer":{"type":"Buffer","data":[236,161,205,183,164,97,93,252,207,201,44,90,141,191,244,3,28,145,82,9]},"announce":[],"urlList":[]}}