{"title":"Slutty.Girls.Love.Rocco.6.XXX.DVDRiP.x264-PORNOLATiON","uid":8818265,"size":2239137350,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ecc2766ded47b43a9098a94cf415b09c87b1d7ef&amp;dn=Slutty.Girls.Love.Rocco.6.XXX.DVDRiP.x264-PORNOLATiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"chkm8te","files":2,"time":1376632176,"description":"Slutty.Girls.Love.Rocco.6.XXX.DVDRiP.x264-PORNOLATiON\n\nCAST\nAlice Romaine, Angel Wicky, Ann Marie La Sante, David Perry, Ian Scott, Mike Angelo, Nadia Bella, Omar Galanti, Rocco Siffredi, Wendy Moon\n\nSlutty Girls Love Rocco 6: Award-winning pornographer and legendary performer Rocco Siffredi is a man whose reputation precedes him. Consequently, certain ladies find themselves irresistibly drawn to the Italian stud`s most famous piece of equipment. In Slutty Girls Love Rocco #6 Rocco and his well-endowed buddies entertaineight stunning Euro-models, the kind of total sluts who`ll do just about anything for a fat dick.Nave, young Russian beauty Taniella doesn`t speak English but understands the international language of cock. As Rocco invades her tender asshole, sexy pal Nadia Bella helps out, slurping the director`s enormous shaft straight from her girlfriend`s gaping anus.Horny brute Omar Galanti chains up sexy Alice Romain, the lover of gorgeous Michelle. Soon he has both girls gagging on his veiny shaft, followed by wild butt fucking, sphincter stretching and ass-to-mouth cocksucking. Michelle gets a cum facial and Alice laps up the leftover goo.Petite, bespectacled twenty-one-year-old Wendy Moon struggles to accommodate Ian Scotts immense cock. Thick, voluptuous blonde Angel Wicky joins them for a lewd rectal rampage with plenty of ass-to-mouth fun - and a sloppy cum shot on the big blondes giant tits.Lastly, athletic blonde Bernice and slender brunette beauty Ann Marie La Sante enjoy a four-way session of hard fucking. Bernice gets sodomized and takes a ruthless double-penetration. The hot bitches share a spermy kiss.The crazy threesome and foursome action runs almost three hours, with nineteen minutes of extra POV-style teasing and pleasing. Check out Slutty Girls Love Rocco 6 because slutty girls need love, too.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=lksflb3vphyhbs3y9ohk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=lksflb3vphyhbs3y9ohk.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=vhk8jg4eeimahkyedr8t.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=vhk8jg4eeimahkyedr8t.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ecc2766ded47b43a9098a94cf415b09c87b1d7ef","amp;dn":"Slutty.Girls.Love.Rocco.6.XXX.DVDRiP.x264-PORNOLATiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecc2766ded47b43a9098a94cf415b09c87b1d7ef","infoHashBuffer":{"type":"Buffer","data":[236,194,118,109,237,71,180,58,144,152,169,76,244,21,176,156,135,177,215,239]},"announce":[],"urlList":[]}}