{"title":"Little Green Cars - Absolute Zero (2013) [FLAC]","uid":8327976,"size":309032736,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ed4f0dfeb079d66ab170ef6f4fa18559ea54c9a0&amp;dn=Little+Green+Cars+-+Absolute+Zero+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"politux","files":-1,"time":1364829761,"description":"\n  Little Green Cars - Absolute Zero (2013) [FLAC]\n\n  Released: 2013\n  Duration: 47:36\n  Genre: Pop/Rock\n  Style: Indie Folk\n  Source: Advance CD-R (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Harper Lee\n  02 Angel Owl\n  03 My Love Took Me Down to the River to Silence Me\n  04 The Consequences of Not Sleeping\n  05 Big Red Dragon\n  06 Red and Blue\n  07 The Kitchen Floor\n  08 The John Wayne\n  09 Please\n  10 Them\n  11 Goodbye Blue Monday\n\n  &quot;Harper Lee,&quot; the alternately bloody and bucolic leadoff cut on Irish indie folk collective Little Green Cars' Glassnote debut, may not deal directly with the To Kill a Mockingbird author from whom it derives its name, but its fevered protagonist, who repeatedly intones &quot;There's a gun in the attic/Let me go grab it/I'd blow holes in my soul just so you could look past it,&quot; echoes the loss of innocence at the heart of the Pulitzer Prize-winning story. It's a theme that obviously resonates with the group, whose members are barely in their twenties, but for each pounding of fists against the injustices of adulthood, there's a roar of pure, youthful joy, albeit tempered with the resigned bleat of heartache. The past is still too raw and relatively close to devolve completely into nostalgia, but co-lead vocalist Steven Appleby's throaty, emotive croon sounds as sentimental as it does world-weary, and it casts a wistful patina over otherwise stadium-ready songs like the aforementioned &quot;Lee&quot; and &quot;Big Red Dragon,&quot; the latter of which benefits greatly from Arcade Fire/Coldplay/Mumford &amp; Sons producer Markus Drav's expansive knob twiddling. \n\n  Absolute Zero switches gears when guitarist/vocalist Faye O'Rourke takes the helm, especially on the evocative, gospel-tinged &quot;My Love Took Me Down to the River to Silence Me,&quot; shifting from earthy, Frightened Rabbit/Band of Horses-inspired introspection to soulful, full-on Florence + the Machine/Anna Calvi-infused bombast, but Appleby and O'Rourke manage to complement each other more times than not, resulting in a kind of Tango in the Night-era Fleetwood Mac-meets Lady Antebellum style of gender juggling, Americana-kissed indie pop that seems ripe for the radio. In fact, the only real misstep on the extremely likable Absolute Zero is the forgettable &quot;Red and Blue,&quot; a perfectly good song that's ruined by an oppressive (and dated) amount of Auto-Tune, a gimmick that should never be wasted on people who can actually sing.","torrent":{"xt":"urn:btih:ed4f0dfeb079d66ab170ef6f4fa18559ea54c9a0","amp;dn":"Little+Green+Cars+-+Absolute+Zero+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed4f0dfeb079d66ab170ef6f4fa18559ea54c9a0","infoHashBuffer":{"type":"Buffer","data":[237,79,13,254,176,121,214,106,177,112,239,111,79,161,133,89,234,84,201,160]},"announce":[],"urlList":[]}}