{"title":"The Next Species: Evolution in the Aftermath of Man (2015)epub","uid":11775613,"size":515924,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:edb15552286bcda84fad5e905bbb5e935bdd7621&amp;dn=The+Next+Species%3A+Evolution+in+the+Aftermath+of+Man+%282015%29epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bookzilla","files":1,"time":1427280376,"description":"The Next Species: The Future of Evolution in the Aftermath of Man\n\nA growing number of scientists agree we are headed toward a mass extinction, perhaps in as little as 300 years. Already there have been five mass extinctions in the last 600 million years, including the Cretaceous Extinction, during which an asteroid knocked out the dinosaurs. Though these events were initially destructive, they were also prime movers of evolutionary change in nature. And we can see some of the warning signs of another extinction event coming, as our oceans lose both fish and oxygen. In The Next Species, Michael Tennesen questions what life might be like after it happens.\n\n Tennesen discusses the future of nature and whether humans will make it through the bottleneck of extinction. Without man, could the seas regenerate to what they were before fishing vessels? Could life suddenly get very big as it did before the arrival of humans? And what if man survives the coming catastrophes, but in reduced populations? Would those groups be isolated enough to become distinct species? Could the conquest of Mars lead to another form of human? Could we upload our minds into a computer and live in a virtual reality? Or could genetic engineering create a more intelligent and long-lived creature that might shun the rest of us? And how would we recognize the next humans? Are they with us now?\n\n Tennesen delves into the history of the planet and travels to rainforests, canyons, craters, and caves all over the world to explore the potential winners and losers of the next era of evolution. His predictions, based on reports and interviews with top scientists, have vital implications for life on earth today","torrent":{"xt":"urn:btih:edb15552286bcda84fad5e905bbb5e935bdd7621","amp;dn":"The+Next+Species%3A+Evolution+in+the+Aftermath+of+Man+%282015%29epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edb15552286bcda84fad5e905bbb5e935bdd7621","infoHashBuffer":{"type":"Buffer","data":[237,177,85,82,40,107,205,168,79,173,94,144,91,187,94,147,91,221,118,33]},"announce":[],"urlList":[]}}