{"title":"Genius/GZA - Liquid Swords: The Chess Box (2xCD) [FLAC]","uid":7837537,"size":648115204,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ee2784981ec033092bf1e9028f6af17e1816e647&amp;dn=Genius%2FGZA+-+Liquid+Swords%3A+The+Chess+Box+%282xCD%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"rudown78","files":54,"time":1353198320,"description":"Genius/GZA - Liquid Swords: The Chess Box [2xCD: Original Album + Instrumentals]\n\n\nIn the early to mid nineties and at the peak of his powers as a producer, Wu-Tang Clan mastermind RZA crafted a distinctive soundtrack at his basement studio in Staten Island. Whether or not he knew it at the time this haunting landscape of dusty samples, sharp snares and menacing urban gloom, would soon become a pillar of hip hop history. These instrumentals, peppered in with frequent interludes of dialogue from the classic samurai flick Shogun Assassin, became the core of the GZA's 1995 sophomore LP Liquid Swords and would eventually be considered by many as each individual s finest work. Cerebral, strategic and precise with his words, GZA crystallizes a range of influences - from chess to kung-fu films to mob flicks and Eastern philosophy - into sharply delivered rhymes. Many would argue there is no greater MC to compliment the RZA's production as well as GZA did on Liquid Swords. The album featured appearances by the entire Wu-Tang Clan, and included the auspicious debut of Killah Priest on &quot;B.I.B.L.E.&quot; Acknowledged as one of the &quot;100 Best Rap Albums&quot; (The Source) and &quot;Top 100 Records of the 1990s&quot; (Pitchfork.com). Under development for months, Get On Down has finally unveiled the latest, painstakingly crafted volume in it's Wu-Tang reissue series, one which we hope will stand as a testament to this iconic and legendary piece of Wu-Tang history. We are proud to present GZA/Genius Liquid Swords in a two disc deluxe &quot;Chess Box&quot; edition. Housed in a sturdy wrapped hard board two piece box, this edition of Liquid Swords spans across 2 discs. Disc one contains the official album version while disc two contains the full RZA produced instrumentals, available for the first time ever as an official release. Both discs have been completely restored with remastered audio from the original source tapes and have truly never sounded better. As always with any deluxe Get On Down release, we have packaged this album with an array of extras, including; researched, in depth, full color liner notes with contributions from GZA himself, spanning across 20 pages, inner jackets and dust sleeves with memorable vintage artwork from the original release, and even a full wooden minature chess set, which can be played on the chess board printed and contained directly on the inner lining of the box. This is the Liquid Swords that both first time listeners and long-standing fans deserve.\n\n\nDisc 1: Original Full-Length Album\n\nLiquid Swords\nDuel of the Iron Mic\nLiving In The World Today\nGold\nCold World\nLabels\n4th Chamber\nShadowboxin'\nHell's Wind Staff\nKillah Hills 10304\nInvestigative Reports\nSwordsman\nI Gotcha Back\nBasic Instructions Before Leaving Earth\n\n\nDisc 2: Full-Length Intsrumentals\n\nLiquid Swords (Instrumental)\nDuel of the Iron Mic (Instrumental)\nLiving in the World Today (Instrumental)\nGold (Instrumental)\nCold World (Instrumental)\nLabels (Instrumental)\n4th Chamber (Instrumental)\nShadowboxin' (Instrumental)\nKillah Hills 10304 (Instrumental)\nInvestigative Reports (Instrumental)\nI Gotcha Back (Instrumental)\t\n\n\nAll of the album artwork is included as well. Enjoy! \t","torrent":{"xt":"urn:btih:ee2784981ec033092bf1e9028f6af17e1816e647","amp;dn":"Genius%2FGZA+-+Liquid+Swords%3A+The+Chess+Box+%282xCD%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee2784981ec033092bf1e9028f6af17e1816e647","infoHashBuffer":{"type":"Buffer","data":[238,39,132,152,30,192,51,9,43,241,233,2,143,106,241,126,24,22,230,71]},"announce":[],"urlList":[]}}