{"title":"Louis Theroux Weird Weekends - Thai Brides","uid":3640611,"size":418359343,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ee2d0ca5904544e59c9ccd6d7ad18041fb5c8e01&amp;dn=Louis+Theroux+Weird+Weekends+-+Thai+Brides&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"etxkgh","files":2,"time":1174145442,"description":"Advantages Highly watchable.\nDisadvantages Should be scheduled at peak-time Saturday night, and not on a Monday evening!\n Louis struck gold yet again in his brilliant series with Monday evening\\\\\\&amp;#039;s episode which featured the \\\\\\&amp;#039;Introduction Services\\\\\\&amp;#039; available in Thailand to men from overseas seeking Thai women for marriage. \n\nLouis Theroux manages to convey in his interviewing style what every viewer must be feeling. Yet, he does this in a wonderfully subtle way that allows many of his thick-skinned subjects continue to show themselves for the bigots they are. \n\nThis was perfectly demonstrated by his interview with the owner of an agency who criticised Western women for their \\\\\\&amp;#039;over-emancipation\\\\\\&amp;#039;, and suggested that Thai women are preferable because\\\\\\&amp;#039; \\\\\\&quot;They don\\\\\\&amp;#039;t have a headache, even when they have a headache.\\\\\\&quot; \n\nThe programme continued to show this same \\\\\\&amp;#039;gentleman\\\\\\&amp;#039; who introduced his soon-to-be-bride that he had met only hours earlier to Louis. This 21 year old girl was to be his fourth wife, and had come to the agency only to be \\\\\\&amp;#039;snapped up\\\\\\&amp;#039; by the lecherous owner himself, who smarmed all over her, whilst boasting of his conquest. Mr Theroux remained incredulous. \n\nAlthough presented in a fairly light-hearted format, this particular episode was very thought-provoking. Of course, to most of us the notion of these agencies is abhorrent to say the least. However, largely due to the style of presentation, it was quite revealing to listen to the viewpoints of the \\\\\\&amp;#039;clients\\\\\\&amp;#039; and owners, who seemed to feel comfortable expressing their views. I feel Louis Theroux\\\\\\&amp;#039; style, which does not at first appear overly challenging, allows a truer insight into a person\\\\\\&amp;#039;s behaviour and makes him/her less defensive and consequently more candid. \n\n\\\\\\&amp;#039;Weird Weekends\\\\\\&amp;#039; is proving once again to be a brilliant series, and is highly recommended.","torrent":{"xt":"urn:btih:ee2d0ca5904544e59c9ccd6d7ad18041fb5c8e01","amp;dn":"Louis+Theroux+Weird+Weekends+-+Thai+Brides","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee2d0ca5904544e59c9ccd6d7ad18041fb5c8e01","infoHashBuffer":{"type":"Buffer","data":[238,45,12,165,144,69,68,229,156,156,205,109,122,209,128,65,251,92,142,1]},"announce":[],"urlList":[]}}