{"title":"Tapestries nature sounds collection (NO MUSIC) - 3 albums record","uid":5440030,"size":445329663,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ee823b0bb31ff705d5a05c9437b8cc68d6d12e6f&amp;dn=Tapestries+nature+sounds+collection+%28NO+MUSIC%29+-+3+albums+record&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Piraterealm","files":-1,"time":1268846122,"description":"Tapestries nature sounds collection - 3 albums\n\nI've always been searching for sounds of nature without music, just great quality sounds.\n\nSo in 2001, I stumbled upon this unique and astonishing collection at the music store. It was exactly what I was searching for: great quality sounds, no music.\n\nIt consist of 3 compact disc, sold separately. Each of them have it's own theme:\n\n1. A Day in the Wilderness : It's like being in a forest, sometimes near a river. All the way long sounds change from day to night, so you can enjoy a wild range of ambiances.\n\n2. Songbirds in a Country Garden : The title say it all. It's like an afternoon relaxing outside in the garden, the sounds here mainly focused on birdsongs.\n\n3. Thunder &amp; Rain Storms : It's like being outside near a lake, a storm approaching; you can actually hear it gradually come until you are in the center of a great storm, until it gradually go away. A great experience!\n\nUnfortunately, this collection is long out of print. Even worst, nothing can be found on the internet about them; this being very rare, this collection seems to be a rare gem. So I will share it so other nature sounds lovers can enjoy it as much I as do.\n\nI did the best mp3 I could directly from my original CDs: constant bitrate 320kbps, stereo, high quality encoding (an option from my ripper that rip slower but makes better quality).\n\nI include scans of the covers and back of the CDs (only Songbirds in a Country Garden cover is missing, but picture of it are shown on the covers of the other CDs)\n\nSo I hope you will enjoy!\n\nRemember, there is absolutely NO MUSIC in these releases: JUST SOUNDS!","torrent":{"xt":"urn:btih:ee823b0bb31ff705d5a05c9437b8cc68d6d12e6f","amp;dn":"Tapestries+nature+sounds+collection+%28NO+MUSIC%29+-+3+albums+record","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee823b0bb31ff705d5a05c9437b8cc68d6d12e6f","infoHashBuffer":{"type":"Buffer","data":[238,130,59,11,179,31,247,5,213,160,92,148,55,184,204,104,214,209,46,111]},"announce":[],"urlList":[]}}