{"title":"Jaakko Eino Kalevi - Modern Life","uid":10363593,"size":107732764,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eeaf25b4f43134961d251a0c3f6dccda371c1000&amp;dn=Jaakko+Eino+Kalevi+-+Modern+Life&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Milan0vic","files":13,"time":1402845982,"description":"Source: theguardian.com\n\n-------------------------------------------------------------------------------------\n\nHometown: Tiituspohja, Finland.\n\nThe lineup: Jaakko Eino Kalevi (music, vocals, production).\n\nThe background: Jaakko Eino Kalevi is the most impressive &quot;rock'n'roll&quot; artist with an alternate simultaneous &quot;proper&quot; job that we've heard of since Vic Godard the postpunk postman. The Finnish 29-year-old is, or at least has been for most of the time he has been releasing records back home, a tram driver in Helsinki. He can't have been doing much driving. There is a lot of his material on Spotify, including several EPs and an album called Modern Life, the latter being an intriguing collection of linear cold wave synth melodies with something approaching catchy choruses. His latest EP, Dreamzone, marks an even more pleasing drift towards pop for the experimental musician, although we're talking pop from that phantom zone where Ariel Pink is a massive No 1 worldwide success. &quot;Drift&quot; is the word: the four tracks on the EP have a similar muffled, murky quality to Pink's work, one that suggests you're listening to classic '80s chart hits through a wall of cotton wool, in a dozy sleep-wake state.\n\nKalevi has already had a close encounter with Ariel Pink, actually: he supported him when he played live in Helsinki, and after the show, as you do, Pink slept in his bed. How do we know? Kalevi said so. He has a matter-of-fact way of explaining things that is distinctly childlike. He chose the title Dreamzone because it kept haunting him. &quot;It's a nice word,&quot; he told a journalist at Radar Magazine, &quot;and I think it talks with the songs.&quot; Turns out Dreamzone is also the name of a Finnish online dream forum where people write their dreams and interpret them. &quot;I sometimes go there and steal some of their dreams for my songs,&quot; he confessed, although let's not rule out the possibility that Kalevi's an arch scamster and he's playing up the &quot;savant&quot; schtick. When asked what his ideal &quot;dreamzone&quot; would comprise, he replied: &quot;I enjoy drawing, which I never do, and my dream is to sit in a good posture naturally.&quot; Where did he, the interviewer wondered, see himself in five years? &quot;Touring somewhere, having all my meals at gas stations.&quot; Apparently, the songs on Dreamzone include one inspired by an episode of Ren &amp; Stimpy and another whose melody came from a dream he had as a child.\n\nIf Kalevi is unusually nostalgic and concerned with memory, it works to inform his songs. The sax (which he taught himself to play) wafting through No End, from the new EP, is well Spandau while Memories opens with a keyboard motif that recalls Wham's Last Christmas. When You Walk Through Them All sounds like something from 1984 by Hall and Oates, or a nightmare you might have once had soundtracked by Phil Bailey and Phil Collins's Easy Lover. Uu uu uu does indeed have a childlike melody. But these are recollections with a faint patina of the disturbing about them: dreams less sweet. Let's hope he resolves all his issues before we get in his tram. \n \nThe buzz: &quot;An engagingly florid collection of day-glo pop&quot; - Grazia.\n\nThe truth: Weird-dream pop from Finland. \n\nMost likely to: Dream in colour (especially pink).\n\nLeast likely to: Go for that (no can do).\n\nWhat to buy: The Dreamzone EP is out now on Weird World / Domino.\n\nFile next to: Ariel Pink, Gary War, John Maus, James Ferraro.\n\nLinks:\n\n-----------------------------------------------------------------------------------\n\nEnjoy!","torrent":{"xt":"urn:btih:eeaf25b4f43134961d251a0c3f6dccda371c1000","amp;dn":"Jaakko+Eino+Kalevi+-+Modern+Life","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eeaf25b4f43134961d251a0c3f6dccda371c1000","infoHashBuffer":{"type":"Buffer","data":[238,175,37,180,244,49,52,150,29,37,26,12,63,109,204,218,55,28,16,0]},"announce":[],"urlList":[]}}