{"title":"Halestorm - The Strange Case Of 2012 [FLAC] - Kitlope","uid":7877692,"size":315134832,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ef3291eedefef641c3bd6ff23f5bf999e87bb034&amp;dn=Halestorm+-+The+Strange+Case+Of+2012+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Kitlope","files":16,"time":1354389058,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: EF3291EEDEFEF641C3BD6FF23F5BF999E87BB034\nFile Size: 300.53 MB\nYear: 2012\nLabel: Atlantic\nCatalog #: 528052-2\n\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\nHalestorm is an American rock band from Red Lion, Pennsylvania.[1] The group's self-titled debut album was released on April 28, 2009 through Atlantic Records. Their second album The Strange Case Of... was released on April 10, 2012.\n\nSiblings Arejay and Elizabeth &quot;Lzzy&quot; Hale have been actively writing and performing original music since 1997 when they were 10 and 13 years old, respectively. Both brother and sister started learning piano at the age of 5; Lzzy later progressed to a keytar and Arejay to the drums. Lzzy took guitar lessons at 16. The teen siblings released an EP titled Don't Mess With the Time Man in 1999. In Halestorm's earliest incarnation, Lzzy and Arejay's father Roger Hale played bass before Josh Smith joined the group in 2004. Guitarist Joe Hottinger joined in 2003.\n\nThe group signed a recording contract with Atlantic Records on June 28, 2005 and released a live EP titled One and Done. The EP, now out of print, featured an early live version of &quot;It's Not You.&quot; Their self-titled debut album was released on April 28, 2009. The song &quot;I Get Off&quot; served as the album's lead single and has gained heavy radio play. Both the song and video for their second single, &quot;It's Not You&quot;, were released in late November 2009. Singles and videos for &quot;Love/Hate Heartbreak&quot; and &quot;Familiar Taste of Poison&quot; were released in 2010.[2]\n\nHalestorm is well known for their near non-stop touring, often performing as many as 250 shows a year.[3][4] Since 2006 they have toured with many hard rock and heavy metal acts including Chevelle, Seether, Staind, Papa Roach, Trapt, Three Days Grace, Theory of a Deadman, Buckcherry, Disturbed, Shinedown, Avenged Sevenfold, Stone Sour, Hellyeah, Heaven &amp; Hell, and most recently Evanescence as part of the Carnival of Madness Tour. Halestorm appeared on the first annual Rockstar Energy Drink Uproar Festival,[5], and in October 2010 the band traveled to Japan to participate in the Loud Park Festival.[6] Halestorm also appeared on the 2010 Taste of Chaos tour.\n\nOn November 16, 2010 Halestorm released a live CD/DVD entitled Live in Philly 2010, which was recorded at The TLA in Philadelphia in early 2010.[7] On March 22, 2011, Halestorm released an EP called ReAnimate containing covers of songs of different genres, including &quot;Out Ta Get Me&quot; by Guns N' Roses, &quot;Bad Romance&quot; by Lady Gaga, and the first single &quot;Slave to the Grind&quot; by Skid Row.\n\nOn January 24, 2012, Halestorm released the EP Hello, It's Mz. Hyde, a sneak preview of four songs from their upcoming studio album. Their second full length album, The Strange Case Of... was released on April 10, 2012 in the US,[8] April 9 in the UK, and April 17 in Italy. In May 2012, Halestorm made history by becoming the first female-fronted band to top the active rock airplay chart with their song &quot;Love Bites...(So Do I).&quot; In the same month, Gibson Guitars created a signature series guitar for Lzzy Hale. On 29th October 2012 they were announced as the support for Bullet For My Valentine on their UK tour in March 2013. \n\n\nThe Strange Case Of... 2012\n\n\nThe Strange Case Of... is the second full-length studio album from the hard rock band Halestorm, released on April 10, 2012. The album was produced by Howard Benson, who also produced the band's self-titled debut album. The song &quot;Love Bites (So Do I)&quot; is the first single and video from the album. The song &quot;Here's To Us&quot; was performed on the US television show, Glee, with clean lyrics. Four of the album's songs were previously released on the sneak-preview EP Hello, It's Mz. Hyde. A deluxe edition of the album was also released containing three bonus tracks.\n\nIn interviews about the album, Arejay Hale noted that the album was heavier than their previous album, but was significantly closer to the sound of them live.\n\n\nTracks: \n\n\n1.\t&quot;Love Bites (So Do I)&quot; \n2.\t&quot;Mz. Hyde&quot; \n3.\t&quot;I Miss the Misery&quot; \n4.\t&quot;Freak Like Me&quot; \n5.\t&quot;Beautiful with You&quot; \n6.\t&quot;In Your Room&quot; \n7.\t&quot;Break In&quot; \n8.\t&quot;Rock Show&quot; \n9.\t&quot;Daughters of Darkness&quot; \n10.\t&quot;You Call Me a Bitch Like It's a Bad Thing&quot; \n11.\t&quot;American Boys&quot; \n12.\t&quot;Here's to Us&quot; \n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:ef3291eedefef641c3bd6ff23f5bf999e87bb034","amp;dn":"Halestorm+-+The+Strange+Case+Of+2012+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef3291eedefef641c3bd6ff23f5bf999e87bb034","infoHashBuffer":{"type":"Buffer","data":[239,50,145,238,222,254,246,65,195,189,111,242,63,91,249,153,232,123,176,52]},"announce":[],"urlList":[]}}