{"title":"A. G. Long - Conversation and Self-Sufficiency in Plato [2013][A","uid":11211204,"size":1241790,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:efb435df2c20e302834c24d335f46a6f1c1bfbae&amp;dn=A.+G.+Long+-+Conversation+and+Self-Sufficiency+in+Plato+%5B2013%5D%5BA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Anette14","files":-1,"time":1413280542,"description":"Description\nProduct Details\nBook Title: Conversation and Self-Sufficiency in Plato\t\nBook Author: A. G. Long (Author)\nHardcover: 192 pages\nPublisher: Oxford University Press (May 19, 2013)\nLanguage: English\nISBN-10: 0199695350\nISBN-13: 978-0199695355\n\nBook Description\nPlato's dialogues were part of a body of fourth-century literature in which Socrates questioned (and usually got the better of) friends, associates, and supposed experts. A. G. Long considers how Plato explained the conversational character of Socratic philosophy, and how Plato came to credit first Socrates and then, more generally, the philosopher with an alternative to conversation--internal dialogue or self-questioning. Conversation and self-sufficiency in Plato begins with a study of the Platonic dialogues where conversation and its advantages are discussed, and the aim of this study is to spell out precisely why, and for what purposes, Plato treats conversation as necessary or preferable. The book then traces the emergence of internal dialogue as an alternative to conversation. After his introduction of internal dialogue Plato uses dialogue form not only to explore the attractions of conversation but also to show what is possible without conversation, and in particular to show how a theory can be subjected to a proper critique without the direct involvement of its proponent. Throughout the book Long explores Platonic discussions of conversation or unaccompanied thought in relation to the dialogical exchanges in which they are found.\n\nReview\nThis is a thought provoking study, with much attention to detail and careful textual analysis, that will be of use to anyone interested in dialogue form, philosophical method, and intellectual self-sufficiency in Plato. Frisbee Sheffield, Notre Dame Philosophical Reviews\n\nAbout the Author\nA. G. Long is Lecturer in Classics at the University of St Andrews. He studied at King's College, Cambridge and was a Junior Research Fellow at St Catharine's College, Cambridge","torrent":{"xt":"urn:btih:efb435df2c20e302834c24d335f46a6f1c1bfbae","amp;dn":"A.+G.+Long+-+Conversation+and+Self-Sufficiency+in+Plato+%5B2013%5D%5BA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efb435df2c20e302834c24d335f46a6f1c1bfbae","infoHashBuffer":{"type":"Buffer","data":[239,180,53,223,44,32,227,2,131,76,36,211,53,244,106,111,28,27,251,174]},"announce":[],"urlList":[]}}