{"title":"[SoM]Il silenzio degli innocenti[DvdRip-DivX5-Ita-Mp3]","uid":4475797,"size":734271488,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:efcef6578f148f561c29905cf4ef072a1c89602d&amp;dn=%5BSoM%5DIl+silenzio+degli+innocenti%5BDvdRip-DivX5-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"mitimex","files":1,"time":1225332355,"description":"Uno psicopatico assassino ÃƒÂ¨ il terrore di giovani donne formose che aggredisce e scuoia. Il mostro - cui ÃƒÂ¨ stato dato il nome di Buffalo Bill - ÃƒÂ¨ l&amp;#039;incubo dell&amp;#039;agente dell&amp;#039;Fbi Jack Crawford il quale nella insufficienza dei metodi abituali, pensa che solo la consulenza dello psichiatra criminale Hannibal Lecter puÃƒÂ² contribuire a risolvere il caso. Lecter ÃƒÂ¨ detenuto in cella di isolamento in un manicomio criminale, poichÃƒÂ¨, dopo una attivitÃƒÂ  professionale di alto livello, ÃƒÂ¨ diventato uno psicopatico cannibale. Una giovane aspirante agente dell&amp;#039;Fbi, prima ancora di completare il suo addestramento - Clarice Starling - viene incaricata da Crawford di contattare lo psichiatra, per averne lumi intesi ad individuare e fermare il mostro. Superata l&amp;#039;aperta ostilitÃƒÂ  del dottor Chilton, direttore del manicomio, Clarice ha vari colloqui con Lecter, la cui personalitÃƒÂ  l&amp;#039;affascina (egli riesce anche a far parlare di se stessa la ragazza, la quale, orfana di uno sceriffo ucciso nel corso di una missione, ha avuto notevoli problemi infantili, che invano ha tentato di rimuovere). In azione, Clarice scopre in un magazzino l&amp;#039;esistenza di un lepidottero - una farfalla importata dall&amp;#039;Oriente, che sulle ali ha macchie nerastre dette &quot;testa di morto&quot; - un esemplare della quale ÃƒÂ¨ inserita nella gola delle vittime dell&amp;#039;assassino. A giudizio di Lecter, la cosa ÃƒÂ¨ importante: egli vi vede un simbolo del fortissimo desiderio di costui di trasformarsi in donna, mentre il recupero della epidermide delle ragazze uccise e scuoiate - epidermide che egli poi cuce su manichini per confezionarsi un corpo da donna - rientra nel quadro della stessa follia. Frattanto, viene rapita da Buffalo Bill Catherine Martin, figlia di una Senatrice. Clarice, d&amp;#039;intesa con i propri superiori, fa un patto con Lecter: se collaborerÃƒÂ  ad un piano per individuare il colpevole e salvare la donna, verrÃƒÂ  trasferito dalla cella del manicomio. Lecter accetta. Ha identificato l&amp;#039;assassino: un certo Jamie Gamb, ma prima di farne il nome a Clarice, mentre viene trasferito nella nuova sede, compie una fulminea ed ingegnosa evasione. Clarice perÃƒÂ² non demorde. Ormai sulle piste di Gamb e ricapitolando consigli e deduzioni, penetra in casa di lui, lo uccide perchÃƒÂ¨ assalita e salva Catherine Martin. Il giorno del suo ingresso ufficiale nell&amp;#039;FBI riceve una telefonata: da lontano il dottor Lecter le parla e la saluta, mentre si prepara ad uccidere il direttore del manicomio criminale dov&amp;#039;era detenuto.","torrent":{"xt":"urn:btih:efcef6578f148f561c29905cf4ef072a1c89602d","amp;dn":"%5BSoM%5DIl+silenzio+degli+innocenti%5BDvdRip-DivX5-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efcef6578f148f561c29905cf4ef072a1c89602d","infoHashBuffer":{"type":"Buffer","data":[239,206,246,87,143,20,143,86,28,41,144,92,244,239,7,42,28,137,96,45]},"announce":[],"urlList":[]}}