{"title":"Using Wireshark to Solve Real-World Network Problems","uid":6544553,"size":29628016,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:efd5366db3315775bad1746b26f0cfe2642ffd8e&amp;dn=Using+Wireshark+to+Solve+Real-World+Network+Problems&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"TheBookie","files":-1,"time":1310806840,"description":"\t\nPractical Packet Analysis: Using Wireshark to Solve Real-World Network Problems\n\n\nWireshark is the world's most popular &quot;packet sniffer,&quot; allowing its users to uncover valuable information about computer networks by analyzing the TCP packets that travel through them. This significantly revised and expanded second edition of Practical Packet Analysis shows you how to use Wireshark to capture raw network traffic, filter and analyze packets, and diagnose common network problems. Author Chris Sanders begins by discussing how networks work and gives you a solid understanding of how packets travel along the wire. He then explains how Wireshark can be used to monitor and troubleshoot networks. Numerous case studies help you apply your newfound knowledge to your networks. This revision offers more detailed explanations of key networking protocols; expanded discussions of wireless protocol analysis and an examination of network security at the packet level; expanded discussion of the meaning of packets and how they can offer insight into network structure; and new scenarios and examples. Whether fighting a virus infestation or a confounding connectivity problem, Practical Packet Analysis, 2nd Edition will help you find the problem and fix it. ","torrent":{"xt":"urn:btih:efd5366db3315775bad1746b26f0cfe2642ffd8e","amp;dn":"Using+Wireshark+to+Solve+Real-World+Network+Problems","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efd5366db3315775bad1746b26f0cfe2642ffd8e","infoHashBuffer":{"type":"Buffer","data":[239,213,54,109,179,49,87,117,186,209,116,107,38,240,207,226,100,47,253,142]},"announce":[],"urlList":[]}}