{"title":"The Psychology of Art and the Evolution of the Conscious Brain (","uid":9392636,"size":7312808,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:efe02ef7ab321eefcf3a097d0f21e92910a5395f&amp;dn=The+Psychology+of+Art+and+the+Evolution+of+the+Conscious+Brain+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"STBGD","files":-1,"time":1387913672,"description":"Robert L. Solso, Â«The Psychology of Art and the Evolution of the Conscious BrainÂ»\nThe MIT Press | ISBN: 0262693321 | September 1, 2005 | 294 pages | PDF | 7 Mb\n\nHow did the human brain evolve so that consciousness of art could develop? In The Psychology of Art and the Evolution of the Conscious Brain, Robert Solso describes how a consciousness that evolved for other purposes perceives and creates art. Drawing on his earlier book Cognition and the Visual Arts and ten years of new findings in cognitive research (as well as new ideas in anthropology and art history), Solso shows that consciousness developed gradually, with distinct components that evolved over time. One of these components is an adaptive consciousness that includes the ability to imagine objects that are not present--an ability that allows us to create (and perceive) visual art. Solso describes the neurological, perceptual, and cognitive sequence that occurs when we view art, and the often inexpressible effect that a work of art has on us. He shows that there are two aspects to viewing art: nativistic perception--the synchronicity of eye and brain that transforms electromagnetic energy into neuro-chemical codes--which is &quot;hard-wired&quot; into the sensory-cognitive system; and directed perception, which incorporates personal history and knowledge--the entire set of our expectations and past experiences.","torrent":{"xt":"urn:btih:efe02ef7ab321eefcf3a097d0f21e92910a5395f","amp;dn":"The+Psychology+of+Art+and+the+Evolution+of+the+Conscious+Brain+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efe02ef7ab321eefcf3a097d0f21e92910a5395f","infoHashBuffer":{"type":"Buffer","data":[239,224,46,247,171,50,30,239,207,58,9,125,15,33,233,41,16,165,57,95]},"announce":[],"urlList":[]}}