{"title":"Spinervals - On The Road - 2.0 Lake Placid Training Ride","uid":9160359,"size":1812499082,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f004189da4f6399b7e6b7cadbd386303abcb37e6&amp;dn=Spinervals+-+On+The+Road+-+2.0+Lake+Placid+Training+Ride&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"snowman177","files":1,"time":1383863987,"description":"A 56 Mile Virtual Training Ride previewing the Triathlon Course in Lake Placid, NY.\n\nRide with Coach Troy Jacobson in a virtual 56 mile cycling tour over majestic hills in the Adirondack region of picturesque Lake Placid, New York!\n\n\nDifficulty Rating: 9.0\nDuration: 56 Miles (About 2 hours, 50 minutes)\nDVD Format / All Regions\n\nDescription:\nEnjoy incredible scenery as you ride on Troy's wheel as he coaches you on proper technique, gear selection and intensity during this high aerobic endurance training ride of about three hours in duration. As this ride covers much of the race course for the famous Iron distance event in Lake Placid, you'll hear tips and suggestions on race day nutrition, pacing strategy and more!\n\nStarting in Lake Placid, the ride takes you down the hill to the town of Keene then over rolling hills to the sleepy town of Jay. The climbing really starts on the way to Wilmington, with an out and back section on Haselton Road that shocks the legs. Once back in Wilmington, the last leg of the ride includes a 14 mile uphill jaunt back to Lake Placid with the incredible White Face Mountain and the Au Sable River on your right side. Overall, this is a cycling workout for the record books and a fantastic training workout!","torrent":{"xt":"urn:btih:f004189da4f6399b7e6b7cadbd386303abcb37e6","amp;dn":"Spinervals+-+On+The+Road+-+2.0+Lake+Placid+Training+Ride","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f004189da4f6399b7e6b7cadbd386303abcb37e6","infoHashBuffer":{"type":"Buffer","data":[240,4,24,157,164,246,57,155,126,107,124,173,189,56,99,3,171,203,55,230]},"announce":[],"urlList":[]}}