{"title":"Ragnar's Urban Survival- Ragnar Benson","uid":4440928,"size":31006477,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f029026f68e2ef8e54f14521a333200c38ba17af&amp;dn=Ragnar%5C%27s+Urban+Survival-+Ragnar+Benson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":2,"time":1223771029,"description":"Ragnar's Urban Survival: A Hard-Times Guide to Staying Alive in the City\n\nThe tap's run dry, the supermarkets have been ransacked, the power is off and the low rumble of tanks can be heard in the distance. The unprepared who refused to believe that such a thing could happen here will live as wretched refugees-if they live at all. But for the prepared-for the city survivors-life will go on. America's leading survival author debunks the myth that the only way to survive is to stock a retreat in the mountains. He tells urban dwellers how to find water; trap and butcher game; preserve food; position a retreat for maximum safety; avoid troops; and barter with other survivors. You'll learn which weapons are absolute necessities and which aren't worth having, and confront the all-important topic of survival nursing care. Ragnar gives you the solid information you will need to make it if the worst-case scenario becomes a reality.\n\nAbout the Author\nRagnar Benson is America's most-esteemed survival expert. He has written more than 20 books for Paladin throughout the years on a variety of topics covering everything from weapons to politics to survival medicine.\n\nDTOM's Opinion:  While I wouldn't call the firearms chapter BAD, I do recommend to anyone serious enough to do defend yourself to do much more research on the subject.  A *GREAT* book on this subject is Boston's Gun Bible, which you can get for only ~$25 or so.  I have a copy myself, and will try to put it online eventually.  Anyways, I thought the rest of the chapters did a good job covering anything.  But I'll stress again, there is much more literature to be read on the subject, this book is only a good overview!\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!\n","torrent":{"xt":"urn:btih:f029026f68e2ef8e54f14521a333200c38ba17af","amp;dn":"Ragnar%5C%27s+Urban+Survival-+Ragnar+Benson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f029026f68e2ef8e54f14521a333200c38ba17af","infoHashBuffer":{"type":"Buffer","data":[240,41,2,111,104,226,239,142,84,241,69,33,163,51,32,12,56,186,23,175]},"announce":[],"urlList":[]}}