{"title":"The Jesuits:A History from Ignati the Present [MyeBookShelf]","uid":11476347,"size":3485592,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f03e47cd3c61c5cc278deb3efadb545ed0c61325&amp;dn=The+Jesuits%3AA+History+from+Ignati+the+Present+%5BMyeBookShelf%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"MyeBookShelf","files":-1,"time":1416155712,"description":"The Jesuits:A History from Ignatius to the Present [MyeBookShelf]\n\nEnglish | ISBN: 144223475X | 2014 | 160 pages | PDF | 3 MB\n\nAs Pope Francis continues to make his mark on the church, there is increased interest in his Jesuit background-what is the Society of Jesus, how is it different from other religious orders, and how has it shaped the world? In The Jesuits, acclaimed historian John W. O'Malley, SJ, provides essential historical background from the founder Ignatius of Loyola through the present. The book tells the story of the Jesuits' great successes as missionaries, educators, scientists, cartographers, polemicists, theologians, poets, patrons of the arts, and confessors to kings. It tells the story of their failures and of the calamity that struck them in 1773 when Pope Clement XIV suppressed them worldwide. It tells how a subsequent pope restored them to life and how they have fared to this day in virtually every country in the world. Along the way it introduces readers to key figures in Jesuit history, such as Matteo Ricci and Pedro Arrupe, and important Jesuit writings, such as the Spiritual Exercises. Concise and compelling, The Jesuits is an accessible introduction for anyone interested in world or church history. In addition to the narrative, the book provides a timeline, a list of significant figures, photos of important figures and locations, recommendations for additional reading, and more","torrent":{"xt":"urn:btih:f03e47cd3c61c5cc278deb3efadb545ed0c61325","amp;dn":"The+Jesuits%3AA+History+from+Ignati+the+Present+%5BMyeBookShelf%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f03e47cd3c61c5cc278deb3efadb545ed0c61325","infoHashBuffer":{"type":"Buffer","data":[240,62,71,205,60,97,197,204,39,141,235,62,250,219,84,94,208,198,19,37]},"announce":[],"urlList":[]}}