{"title":"Yes Please - Amy Poehler","uid":11678090,"size":12592565,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f315270adaed64a0ab996c3343d46c6179608414&amp;dn=Yes+Please+-+Amy+Poehler&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1422961213,"description":"Do you want to get to know the woman we first came to love on Comedy Central's Upright Citizens Brigade? Do you want to spend some time with the lady who made you howl with laughter on Saturday Night Live, and in movies like Baby Mama, Blades of Glory, and They Came Together? Do you find yourself daydreaming about hanging out with the actor behind the brilliant Leslie Knope on Parks and Recreation? Did you wish you were in the audience at the last two Golden Globes ceremonies, so you could bask in the hilarity of Amy's one-liners?\n\nIf your answer to these questions is &quot;Yes Please!&quot; then you are in luck. In her first book, one of our most beloved funny folk delivers a smart, pointed, and ultimately inspirational read. Full of the comedic skill that makes us all love Amy, Yes Please is a rich and varied collection of stories, lists, poetry (Plastic Surgery Haiku, to be specific), photographs, mantras and advice. With chapters like &quot;Treat Your Career Like a Bad Boyfriend,&quot; &quot;Plain Girl Versus the Demon&quot; and &quot;The Robots Will Kill Us All&quot; Yes Please will make you think as much as it will make you laugh. Honest, personal, real, and righteous, Yes Please is full of words to live by","torrent":{"xt":"urn:btih:f315270adaed64a0ab996c3343d46c6179608414","amp;dn":"Yes+Please+-+Amy+Poehler","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f315270adaed64a0ab996c3343d46c6179608414","infoHashBuffer":{"type":"Buffer","data":[243,21,39,10,218,237,100,160,171,153,108,51,67,212,108,97,121,96,132,20]},"announce":[],"urlList":[]}}