{"title":"Scare Tactics - Season 1","uid":3810554,"size":4002893824,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f33f484a416317f0b10e3682fb8be5bfb5bb1287&amp;dn=Scare+Tactics+-+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"timberlax","files":22,"time":1190104960,"description":"The complete first season of Scare Tactics which originally aired on the Sci-Fi Channel. \n\nI decided that putting them all into one torrent would extend the seeding life, so please seed!\n\nEpisode List:\n\nSeason One\n\n* 101 - UFO Abduction, Firing Range, Buried Alive, Camp Kill\n* 102 - Bigfoot Attacks, Where&amp;#039;s Shannen?, Flatline, Psycho Hitchhiker\n* 103 - Limo in Area 51, Monster in the Closet, Organ Harvest, Disappearing Stripper\n* 104 - Clone Attack, Repo Man, Orgy from Hell, Monkey Trouble\n* 105 - Meteor Man, Barbershop of Blood, Date with the Devil, Taxi Cab Carnage\n* 106 - Lab Spill, Haunted Babysitter, Serial Killer, Hellride\n* 107 - Tanning Salon Terror, Cable Killers, Little Girl Psychic, Runaway Corpse\n* 108 - Ghost Train, Body in Trunk, Dominatrix for a Day, Desert Monster\n* 109 - UFO Trailer Attack, The Cannibal Family, SÃƒÂ©ance from Hell, Driving the Dead\n* 110 - Harsh Reality, Dr. Werewolf, Boy in a Bubble, Virgin Sacrifice\n* 111 - Chupacabra Attack, Deadly Secret, Lights Out, Black Magic\n* 112 - Hazmat Hell, Surgery Nightmare, Death Lunch, Bad Seed\n* 113 - Laboratory Meltdown, Eye Witness, Unborn Clones, Silo Scare\n* 114 - Deadly Feast, Fear in the Box, Fear Antics: Psycho, Maniac Cop\n* 115 - Killer Clown, Lethal Conversation, Caught on Camera, Demonic Duel\n* 116 - Chainsaw Attack, Beastly Breakout, Deadly Hicks, Alien Returns\n* 117 - Dangerous Obsession, Web of Evil, Laboratory of Blood, Repo from Hell\n* 118 - Security Breach, Taste for Blood, Zombie Grandma, Killer Car\n* 119 - Bad Medicine, Killer Queen, Dead Alive, Alien Hunters\n* 120 - Massacre Under the House, Unholy Ground, Video Victim, Mask of Death\n* 121 - Lethal Touch, Showgirl&amp;#039;s Revenge, Terror Next Door, Bigfoot Returns\n* 122 - Home Invasion, Demonic Possession, Fatal Beauty, The Hunted\n\nMy personal favorite: Big foot attacks (#102)\n\n\n****If anyone has season 2, please upload it!!!****","torrent":{"xt":"urn:btih:f33f484a416317f0b10e3682fb8be5bfb5bb1287","amp;dn":"Scare+Tactics+-+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f33f484a416317f0b10e3682fb8be5bfb5bb1287","infoHashBuffer":{"type":"Buffer","data":[243,63,72,74,65,99,23,240,177,14,54,130,251,139,229,191,181,187,18,135]},"announce":[],"urlList":[]}}