{"title":"Atlas of Advanced Operative Surgery [PDF][tahir99] VRG.pdf","uid":10553980,"size":215040470,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f37c70ceae31672cb5e425ae23dd485b2dca09dc&amp;dn=Atlas+of+Advanced+Operative+Surgery+%5BPDF%5D%5Btahir99%5D+VRG.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"tahir99","files":-1,"time":1405370703,"description":"Atlas of Advanced Operative Surgery: Expert Consult - Online and Print, 1e\n\nVijay P. Khatri MD FACS (Author)\n\nTRUE PDF, BOOKMARKED and INDEXED\n\nPublication Date: November 19, 2012 | ISBN-10: 1416041095 | ISBN-13: 978-1416041092 | Edition: 1 Har/Psc\n\nAdvance your surgical expertise with Atlas of Advanced Operative Surgery! This new resource picks up where other surgical references leave off, providing highly visual, step-by-step guidance on more than 100 advanced and complex procedures in both general and subspecialty areas.\n\nVisualize every procedure thanks to more than 1,000 illustrations, most in full color - including intraoperative photos, beautifully illustrated color drawings that highlight the relevant anatomy and techniques in specific surgeries, and radiologic images that help you identify variations in anatomy prior to surgery.\nGrasp each procedure and review key steps quickly with a consistent, highly focused, bulleted format.\nSee the advantages and disadvantages of variations in technique with a Pro/Con section written by expert surgeons.\nFocus on the advanced practice skills that are of particular value to those poised to begin practice, as well as surgeons who are already in practice.\nBenefit from the masterful guidance of Dr. Vijay Khatri, a respected expert and experienced mentor of trainees, junior faculty, and community surgeons.\nLearn new procedures or refresh your memory on operative details prior to surgery with an easy-to-follow, step-by-step format: pre-operative preparation, operative technique, position, incision, main dissection, closure, alternative technical approaches (with pros/cons), and post-operative care. ","torrent":{"xt":"urn:btih:f37c70ceae31672cb5e425ae23dd485b2dca09dc","amp;dn":"Atlas+of+Advanced+Operative+Surgery+%5BPDF%5D%5Btahir99%5D+VRG.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f37c70ceae31672cb5e425ae23dd485b2dca09dc","infoHashBuffer":{"type":"Buffer","data":[243,124,112,206,174,49,103,44,181,228,37,174,35,221,72,91,45,202,9,220]},"announce":[],"urlList":[]}}