{"title":"flashtool-0.9.10.1-windows.exe","uid":8004172,"size":112690704,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f3f0ee0a5c6d08976c357d278a2c0823f3a1371a&amp;dn=flashtool-0.9.10.1-windows.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"jesper71","files":1,"time":1357848371,"description":"Windows Edition - v0.9.10.1 (MD5 : F5F14804F28009E76F0A3F7B841FDCE8)\n\nFlashtool Release Notes:\n\n* 0.9.10.1\n- Resolved a serious bug leading to a softbrick (reported on LT26 devices)\n- Added a more complete german translation (thanks papayayoghurt)\n\n* 0.9.10\n- Updated SuperSU to 0.99\n- Updated translation system to almost all application frames (from there, people who want to contribute to\n  translation will be able to.\n- Reworked menus to be more clear (too much things into Tools menu)\n- Update java to jre7u10 for both windows and linux\n- Device editor can now deal with loaders for setool unlocked / modded phones (unlocked loader)\n- When flashing, better loader detection that will prevent flashing of modded phones to fail with a verification header\n  failure. For such phones, unlocked loader must be included in the device settings. One is included for R800 devices\n  and is probably the same for all 2011 devices (tested only with R800 device ... thanks nickholtus and alejandrissimo)\n- No more application hang when flashing with debug mode on. Better debug output (more helpfull)\n- Reworked a little sin parser to better detect sin header size\n- Flashing session is now closer to what SEUS or PCCompanion do.\n- Mac release now bundled as an App inside a dmg\n- Application look and feel is back to System look and feel. So reworked UI composition to look fine on all platforms.\n  Did that to have Flashtool menu appearing in the shared menubar on MacOS\n- Resolved issues with 0.9.9 libusbx stuff under linux and tools not working (rooting for example) under windows.\n  Everything should be fine now.\n\n\n\nIntroduction to Flashtool:\nFlashtool is a flashing software that can be used to :\n\n    Flash original Images (Android 1.6, 2.1, 2.3 Images)\n    Root your phone\n    Install Recovery, Busybox, custom kernels\n    Clean your Rom (remove /system/apps apps of your choice) (Be careful, unless you really know what you do, do not modify the default list. This can make your phone stuck at the SE Logo)\n    Clear dalvik cache\n    Optimize (install of JIT v2) (Disabled in 0.4, will readd it as a plugin for 2.1 phones only)\n    Customize (installs apps found in the custom/apps folder of the flashtool)\n    Clean uninstalled (remove any references to system apps removed in the Clean (root needed) step)\n    Edit any text file on the device\n    Rebrand your device\n\n\nMore information at http://androxyde.github.com/\t\t\n\n","torrent":{"xt":"urn:btih:f3f0ee0a5c6d08976c357d278a2c0823f3a1371a","amp;dn":"flashtool-0.9.10.1-windows.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3f0ee0a5c6d08976c357d278a2c0823f3a1371a","infoHashBuffer":{"type":"Buffer","data":[243,240,238,10,92,109,8,151,108,53,125,39,138,44,8,35,243,161,55,26]},"announce":[],"urlList":[]}}