{"title":"S.H. Jucha - Haraken (Silver Ships #4)","uid":15470659,"size":163588742,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f49cf1230bff70a1309eabaf6d3b582feeb26e11&amp;dn=S.H.+Jucha+-+Haraken+%28Silver+Ships+%234%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Laverna","files":1,"time":1470134099,"description":"Nine years of tranquility came to an abrupt end when a Méridien starship entered the Hellébore system, sounding a dire warning for Alex Racine, the Haraken president. Unwanted visitors had arrived again. But this time, they're not alien; they're human.\r\n\r\nClaiming to have followed the course of a colony ship launched a millennium ago when Earth wrestled with resource wars and climate change, the mission commander, Antonio García, requests a meeting with the planet's leaders. The Earthers profess a kinship with all humans, and their great desire is to have Méridien join their United Earth (UE).\r\n\r\nAlex Racine journeys to Méridien to investigate and uncover the Earthers' intentions. In the Haraken world, SADEs (self-aware digital entities) have been freed from their boxes aboard the Méridien-built starships. The mobile SADEs are powerful players in Alex's strategies, inventing ingenious methods to investigate the Earthers and their ship.\r\n\r\nComplicating matters, the Méridien leadership is in turmoil. The Council Leader insists her people ignore the Earthers, but this path has costs. As tensions escalate, García sends a request for support to his superiors back on Earth, lest his discovery of the rich, Méridien worlds, boasting unbelievable advanced technology, slip through his grasp. A UE battleshiop heeds the call, escalating the pressure for action.\r\n\r\nJoin the journey as the Harakens and Méridiens work together to protect their planets, and their way of life, from the newest invaders. \r\n\r\n\r\n\r\n\r\n\r\nNarrated by: Grover Gardner\r\nLength: 10 hrs and 56 mins \r\nUnabridged Audiobook\r\nRelease Date:07-18-16","torrent":{"xt":"urn:btih:f49cf1230bff70a1309eabaf6d3b582feeb26e11","amp;dn":"S.H.+Jucha+-+Haraken+%28Silver+Ships+%234%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f49cf1230bff70a1309eabaf6d3b582feeb26e11","infoHashBuffer":{"type":"Buffer","data":[244,156,241,35,11,255,112,161,48,158,171,175,109,59,88,47,238,178,110,17]},"announce":[],"urlList":[]}}