{"title":"Lisa Lisa and Cult Jam - Discography 1985 - 1991 [FLAC] Kitlope","uid":6627201,"size":1369839584,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f4ba873ecfc16949574eb5294dc94c6faeedbf0f&amp;dn=Lisa+Lisa+and+Cult+Jam+-+Discography+1985+-+1991+%5BFLAC%5D+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":3,"uploader":"Kitlope","files":62,"time":1314192924,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Plextor PX-716SA / Samsung SH-S223L\nOptical Drive Firmware: 1.11 / SB04\nCd Software: Exact Audio Copy V1.0 Beta 1 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: F4BA873ECFC16949574EB5294DC94C6FAEEDBF0F\nFile Size: 1.27 GB\nLabel: Columbia\n\n\nAlbums, Years &amp; Catalog # in This Torrent:\n\n\nLisa Lisa &amp; Cult Jam with Full Force 1985 (not my rip)\nSpanish Fly 1987 CK 40477 * (ripped with Plextor PX-716SA)\nStraight To The Sky 1989 CK 44378 *\nStraight Outta Hell's Kitchen 1991 CK 46035 *\n\n\n* Denotes My Rip\n\n\nI would like to thank the original uploader for &quot;Lisa Lisa &amp; Cult Jam with Full Force&quot; but since the torrent has disappeared off the network I don't know who upped it but a big thanks! Audiochecker log included for the rip that isn't mine. Some tracks come up as mpeg but since some are CDDA I gather these are false positives. As I have said in the past - Audiochecker works from an algorithm that is far from 100%. If all tracks had come up as mpeg then I would be concerned (and even then I have seen a few entire studio albums that I have ripped come up as mpeg when it was clear it should have been CDDA\n\n\nKit \n\n\n\nPlease help seed these FLACs! \n\n\n\n\n\n\nFrom Wiki:\n\n\nLisa Lisa (born Lisa Velez, January 15, 1966)[1] and her band Cult Jam were an urban contemporary band and one of first freestyle music groups to emerge from New York City in the 1980s. Cult Jam consisted of guitarist/bassist Alex &quot;Spanador&quot; Moseley, and drummer/keyboardist Mike Hughes. They were assembled and produced by Full Force.\n\nVelez is of Puerto Rican descent and grew up in New York City but attended high school at North Miami Senior High School in North Miami Beach, Fl, where she was raised by her step mother and her father Will Garcia. The group released their debut album Lisa Lisa &amp; Cult Jam with Full Force in 1985. She was signed by Columbia Records and the label leased their single &quot;I Wonder If I Take You Home&quot; to the European division of CBS Records for the compilation album Breakdancing. Stateside club DJs began playing the single from the import LP, and thus the U.S. division of CBS, Columbia Records, released the record. It quickly became a chart-topper on Billboard's Hot Dance/Disco chart. It then crossed over to the R&amp;B chart where it peaked at #6, and then to the pop chart, peaking at #34 in summer 1985. The single eventually went gold.\n\n&quot;I Wonder If I Take You Home&quot; was followed by another club hit, &quot;Can You Feel the Beat&quot;, which also went to #40 on the R&amp;B chart in late 1985. A sampling of the lyrics of this song would later be used by Nina Sky for their hit single &quot;Move Ya Body&quot; in 2004. Their third single, the ballad &quot;All Cried Out&quot;, also went gold, going to number #3 R&amp;B and #8 pop in summer 1986. &quot;All Cried Out&quot; was later covered by Allure in 1997 and was a hit in 1998. Lisa Lisa &amp; Cult Jam with Full Force went platinum.[2]\n\nTheir second album, Spanish Fly, was a huge success in 1987. It spawned two #1 pop hits, &quot;Head to Toe&quot; and &quot;Lost in Emotion&quot;, both of which went gold and both of which sported a retro Motown flavor mixed with the Freestyle sound they were known for. &quot;Head to Toe&quot; also parked at #1 R&amp;B for two weeks, and with its strong Mary Wells influence, &quot;Lost in Emotion&quot; did as well. Spanish Fly went platinum, peaking at #7 on the album chart. Other singles from the album were the ballad &quot;Someone to Love Me for Me&quot; b/w &quot;Spanish Fly&quot; (#7 R&amp;B), &quot;Everything Will B-Fine&quot; (#9 R&amp;B).[2]\n\nIn between albums they released &quot;Go For Yours,&quot; which was featured in the movie Caddyshack II and is found on its soundtrack exclusively.\n\n1989's Straight to the Sky was a moderate hit that included the Top 30 pop/#3 R&amp;B single, &quot;Little Jackie Wants to Be a Star&quot;, as well as the club hit &quot;Just Git It Together&quot;. Two decades later, their hit song would inspire the name of the group Little Jackie.\n\nTheir fourth and final album, Straight Outta Hell's Kitchen, was less of a commercial success, though it did include a hit with &quot;Let the Beat Hit 'Em&quot;, which reached the pop Top 40 and was a #1 hit on both the R&amp;B and club charts. The group disbanded in 1991. Velez pursued both solo and acting careers, and Moseley and Hughes went on to do other projects.\n\nLisa Lisa released a solo album called LL77 in 1994, which included the moderate club hit &quot;When I Fell In Love&quot; and the notable single &quot;Skip To My Lu&quot;, which hit #38 on the R&amp;B chart. She resurfaced circa 2001 on the Nickelodeon series Taina, in which she played the title character's mother.\n\nLisa Lisa is set to release her second solo album on Mass Appeal Entertainment, just before the summer of 2009. On June 24, Lisa Lisa was at the 2008 BET Awards presenting an award for the show.\n\n\n\n\n\n\n\n\nLisa Lisa &amp; Cult Jam with Full Force 1985\n\n\nLisa Lisa &amp; Cult Jam with Full Force is a 1985 album by Lisa Lisa and Cult Jam in collaboration with the band/production team Full Force. It is best known for the lead tracks &quot;I Wonder If I Take You Home&quot;, &quot;Can You Feel the Beat,&quot; and &quot;All Cried Out.&quot; The third of these hits also features Full Force's Paul Anthony and Bowlegged Lou on vocals.\n\nTracks: \n\n1.\t&quot;I Wonder If I Take You Home&quot; 6:45\n2.\t&quot;You'll Never Change&quot; 5:26\n3.\t&quot;All Cried Out&quot; 4:49\n4.\t&quot;This Is Cult Jam&quot; (Full Force, Lisa Lisa, Howie Tee) 4:38\n5.\t&quot;Can You Feel the Beat&quot; 6:50\n6.\t&quot;Behind My Eyes&quot; 5:53\n7.\t&quot;Private Property&quot; (Full Force, Kangol Kid) 5:38\n8.\t&quot;Take Me Home&quot; [Rap] 2:09\n\n\n\n\n\n\n\n\nSpanish Fly 1987\n\n\nSpanish Fly is a 1987 album by Lisa Lisa and Cult Jam. It is best known for the singles &quot;Head to Toe&quot; and &quot;Lost in Emotion&quot;. The album was a commercial success, going Platinum and producing two #1 hits in the USA.\n\n\nTracks: \n\n\n1.\t&quot;Everything Will B-Fine&quot;  \n2.\t&quot;Head to Toe&quot;  \n3.\t&quot;Face in the Crowd&quot;  \n4.\t&quot;Someone to Love Me for Me&quot;  \n5.\t&quot;Talking Nonsense&quot;  \n6.\t&quot;I Promise You&quot;  \n7.\t&quot;A Fool Is Born Everyday&quot;  \n8.\t&quot;Lost in Emotion&quot;  \n9.\t&quot;Playing With Fire&quot;\n\n\n\n\n\n\n\nStraight To The Sky 1989\n\n\nStraight to the Sky is a 1989 album by Lisa Lisa and Cult Jam. It is best known for the lead track &quot;Little Jackie Wants to Be a Star&quot;. Follow up singles were &quot;Just Git It Together&quot; and &quot;Kiss Your Tears Away&quot;.\n\n\nTracks: \n\n1.\tJust Git It Together 6:04\n2.\tLittle Jackie Wants to Be a Star 4:50\n3.\tGive Me Some of Your Time 6:01\n4.\tU Never Nu How Good U Had It (with Full Force) 4:45\n5.\tKiss Your Tears Away 4:41\n6.\tDance Forever 4:27\n7.\tStraight to the Sky 4:59\n8.\tGotta Find Somebody New 5:24\n9.\tI Can't Take No More 6:13\n10.\tI Love What You Do To Me 4:36\n11.\tTalking Nonsense (part 2) 0:23\n12.\tStar (The Jackie mix) 5:05\n\n\n\n\n\n\n\n\nStraight Outta Hell's Kitchen 1991\n\n\nStraight Outta Hell's Kitchen is a 1991 album by Lisa Lisa and Cult Jam. It is best known for the lead track &quot;Let the Beat Hit 'Em&quot; which hit #1 on the Billboard R&amp;B and Dance charts. The only other single released was the ballad &quot;Where Were You When I Needed You&quot;. It is named for the Manhattan neighborhood in which lead vocalist Lisa Velez grew up and lived until the mid-2000s. The first half of the album was produced by C+C Music Factory's David Cole and Robert ClivillÃƒÂ©s, and the second half was produced, as always, by Full Force.\n\n\nTracks: \n\n\n1.\tIntroduction [Interlude #1]/Something 'bout Love\n2.\tLet the Music Play\n3.\tLet the Beat Hit 'Em\n4.\tYou + Me = Love\n5.\tRainstorm Interlude/Don't Say Goodbye\n6.\tForever\n7.\tLet It Go\n8.\tI Like It, I Like It\n9.\tLove Will Get Us By\n10.\tWhere Were You When I Needed You\n11.\tDo It Like That\n12.\tSensuality\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:f4ba873ecfc16949574eb5294dc94c6faeedbf0f","amp;dn":"Lisa+Lisa+and+Cult+Jam+-+Discography+1985+-+1991+%5BFLAC%5D+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4ba873ecfc16949574eb5294dc94c6faeedbf0f","infoHashBuffer":{"type":"Buffer","data":[244,186,135,62,207,193,105,73,87,78,181,41,77,201,76,111,174,237,191,15]},"announce":[],"urlList":[]}}