{"title":"Gastrointestinal Imaging, A Teaching File [PDF][StormRG]","uid":11890326,"size":9862907,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f4d7f94a4ac4bcc174161e0123c586b0af2aacb4&amp;dn=Gastrointestinal+Imaging%2C+A+Teaching+File+%5BPDF%5D%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":2,"time":1430978359,"description":"TITLE/EDITION Gastrointestinal Imaging: A Teaching File\nBy: Courtney Coursey Moreno MD (Author), Pardeep Kumar Mittal MD (Author)\nSeries: LWW Teaching File Series\nPaperback: 208 pages\nPublisher: LWW; 1 Pap/Psc edition (July 14, 2014)\nLanguage: English\nISBN-10: 1451173377\nISBN-13: 978-1451173376\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nA brand new resource in The Teaching Files series, Gastrointestinal Imaging: A Teaching File is an exceptional resource for radiology trainees and practicing radiologists who are interested in reviewing the basics of gastrointestinal imaging, including fluoroscopy, CT, and MR. Those studying for board and certifying examinations will also find this volume to be an excellent reference in helping them to review and prepare for these tests.\n\nMore than 300 cases, 100 in print and all 300 in an interactive ebook that is included with the print purchase, are portrayed through CT, MR, fluoroscopic, and ultrasound images. This text also covers a wide variety of GI system disorders, including those that affect the solid abdominal organs, intestines, and peritoneal cavity. Each case includes images, along with descriptions of clinical history, findings, differential diagnosis and diagnosis, discussion, relevant questions with appropriate answers, key issues for the report, and important information for the clinician.\n\nFeatures:\nMore than 300 gastrointestinal, including 100 in print and all 300 in the interactive ebook help you make accurate and informed diagnoses.\nFluoroscopy, CT, and MR images are featured.\nCase information includes images along with management discussion\nCases are grouped into chapters based on modality to help trainees during modality-based rotations","torrent":{"xt":"urn:btih:f4d7f94a4ac4bcc174161e0123c586b0af2aacb4","amp;dn":"Gastrointestinal+Imaging%2C+A+Teaching+File+%5BPDF%5D%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4d7f94a4ac4bcc174161e0123c586b0af2aacb4","infoHashBuffer":{"type":"Buffer","data":[244,215,249,74,74,196,188,193,116,22,30,1,35,197,134,176,175,42,172,180]},"announce":[],"urlList":[]}}