{"title":"Alibre Design Expert 2011 v13.0.0.13059  Full","uid":6216604,"size":121940079,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f53269fa5ee04cfb18dba9d9c04ea38c2712791f&amp;dn=Alibre+Design+Expert+2011+v13.0.0.13059++Full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Mno74","files":8,"time":1299179455,"description":"product description\n===================\nAlibre Design is an industrial-strength, affordable parametric solid modeling system. Create precise 3D mechanical designs and automatically generate and detail associative 2D drawings that update when the 3D model changes.\n\nAlibre Design 2011 now makes 3D designing easier and more robust with major enhancements, including a complete top to bottom code re-write, native 64-bit version, powerful sheet metal conversion tools, and a myriad of time saving tools and customization features.\n\n\nFeature comes in Alibre Design Expert\n=====================================\n\nCore Functionality - Model Creation and Documentation\n-----------------------------------------------------\n* 3D Model Creation\nGet the idea to working prototype fast. Alibre Design offers a rich set of 3D modeling tools for the fast creation of complex geometry. Bottom-up and top-down design allows you to work efficiently. Everything you make is instantly editable, allowing for fast iterations.\n\n* Surfacing Tools\nAlibre Design Expert comes with Moment of Inspiration (MoI). Incredibly powerful and easy to use, MoI offers surfacing and rapid concept development capabilities so you can create more ergonomic, consumer friendly products.\n\n* Sheet Metal Modeling\nIf your design calls for sheet metal Alibre Design offers advanced modeling tools that make it easy. Flanges, closed corners, complex lofts, dimples, and many other tools combined with instant flat patterns get accurate and fast results.\n\n* Advanced Sheet Metal Modeling\nAdvanced sheet metal tools include: Conversion of normal or imported parts into unfoldable sheet metal parts, lofted flange creation, and contour flange creation. These tools fundamentally change sheet metal workflows, providing superior speed to the design process.\n\n* 2D Documentation Creation\nTurn any 3D model into a 2D drawing instantly. Comprehensive detailing tools make efficient work of fully conveying your intent. When you update your 3D model, all associated drawings update, including annontations, views, section views, etc.\n\n* Design Configurations\nIf you work with parts that have variations on the same basic design then you need design configurations. Create variations of parts or assemblies and keep them in a single file. Simply choose which configuration you want to use at any point.\n\n* Direct Editing Toolset\nA toolset dedicated to working with geometry when feature history is not available. Easily change the sizes of holes, or move entire parts of the model around without editing a single feature. Perfect for working with imported parts or making last minute changes.\n\nExtended Features for Workflow Improvements and Downstream Applications\n-----------------------------------------------------------------------\n* 2 Standard Part Libraries\nDon't waste time modeling common components or waste money building things you can get off-the-shelf. Two part libraries offer millions of standard and manufacturer-specific components for every industry, all just a download away.\n\n* Photorealistic Rendering\nShow clients what they're getting before it's made and use it to win bids. Create compelling brochures to drive sales or create a beautiful virtual product line on a website. Rendering so easy you will be productive inside of 30 minutes with no previous experience, guaranteed.\n\n* Document Management\nThe Alibre Vault provides complete document, process, and contact management. Supports every file type from Excel to PDF to 3D models. Easy to use with fast search and completely customizable to fit your business. Use it as a single user or deploy it across your organization.\n\n* Alibre CAM\nFully integrated into Alibre Design, Alibre CAM offers machinists a fully loaded, completely parametric, auto-updating toolpath generating powerhouse. There are multiple levels of Alibre CAM. The basic version comes with Alibre Design Expert.\n\n* Alibre Motion\nFully integrated into Alibre Design, Alibre Motion offers advanced motion analysis capabilities. Easily set up motion elements by reusing relationships you've already set up in the assembly. Graph things like a part's velocity, position, and many other things. You can also export movies.\n\nImport and Export Formats\n-------------------------\n* CAD Neutral Formats\n- 3D Import: STEP, IGES, SAT, 3DM (Rhino)\n- 3D Export: STEP, IGES, SAT, STL\n- 2D Import: DWG/DXF\n- 2D Export: DWG/DXF\n\n* Extended Import/Export\n- 3D Import: Inventor, Pro/E, SolidEdge, Catia, Parasolid, SolidWorks\n- 3D Export: SolidWorks, Parasolid\n\nsystem requirements\n===================\nRecommended Operating Systems\n-----------------------------\n* Windows XP Professional or Home Edition\n* Windows Vista Basic, Business, Home, or Ultimate\n* Windows 7 Basic, Business, Home, or Ultimate\n32-bit and 64-bit systems supported\n\nSoftware Requirements\n---------------------\n* Internet Explorer 6.0 or later\n* .NET 2.0 Framework\n* J# Redistributable\n* Microsoft DirectX 9.0c\n\nHardware Recommendations\n------------------------\n* Intel Pentium or equivalent processor: 2 GHz or faster\n* RAM: 2 GB minimum\n* 1024x768 minimum screen resolution\n(1280x1024 or greater recommended)\n* 64 MB or higher video card with DirectX 9.0c (128 MB minimum for Vista)\n* 500 MB available hard disk space\n* Mouse or pointing device\n* Mouse or pointing device\n\nWhen working with more than 500 parts, It is recommended to make the following changes:\n* Intel Pentium or equivalent processor: 3 GHz or faster\n* RAM: 2 GB or more\n* Virtual Memory: 2 GB\n\nFor Windows Vista, It is recommended to make the following changes:\n* Intel Pentium or equivalent processor: 3 GHz or faster\n* RAM: 2 GB or more\n* Video Card: 128 MB RAM or higher\n* Color: 32-bit","torrent":{"xt":"urn:btih:f53269fa5ee04cfb18dba9d9c04ea38c2712791f","amp;dn":"Alibre+Design+Expert+2011+v13.0.0.13059++Full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f53269fa5ee04cfb18dba9d9c04ea38c2712791f","infoHashBuffer":{"type":"Buffer","data":[245,50,105,250,94,224,76,251,24,219,169,217,192,78,163,140,39,18,121,31]},"announce":[],"urlList":[]}}