{"title":"Michael C. Carroll - Lab 257 - The Disturbing Story of the Gover","uid":15947511,"size":1693103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f58d18aa32805f17ded6254fc5dc20e19993b166&amp;dn=Michael+C.+Carroll+-+Lab+257+-+The+Disturbing+Story+of+the+Gover&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"roflcopter2110","files":2,"time":1475528326,"description":"https://cdn.pximg.xyz/538bbc3c4facf38e563895ed67bba141.png\r\n \nhttp://boltimg.com/images/foAYn.jpg\r\n\r\nMichael C. Carroll - Lab 257 - The Disturbing Story of the Governments Secret Germ Laboratory - pdf [TKRG]\r\n\r\nNestled near the Hamptons, the fashionable summer playground of America's rich and famous, and in the shadow of New York City, lies an unimposing 840-acre island unidentified on most maps. On the few on which it can be found, Plum Island is marked red or yellow, and stamped U.S. government—restricted or dangerous animal diseases. Though many people live the good life within a scant mile or two from its shores, few know the name of this pork chop–shaped island. Even fewer can say whether it is inhabited, or why it doesn't exist on the map. That's all about to change.\r\n\r\nLab 257: The Disturbing Story of the Government's Secret Plum Island Germ Laboratory blows the lid off the stunning true nature and checkered history of Plum Island. It shows that the seemingly bucolic island on the edge of the largest population center in the United States is a ticking biological time bomb that none of us can safely ignore.\r\n\r\nBased on innumerable declassified government documents, scores of in-depth interviews, and access to Plum Island itself, this is an eye-opening, suspenseful account of a federal government germ laboratory gone terribly wrong. For the first time, Lab 257 takes you deep inside this secret world and presents startling revelations including virus outbreaks, biological meltdowns, infected workers who were denied assistance in diagnosis by Plum Island brass, the periodic flushing of contaminated raw sewage into area waters, and the insidious connections between Plum Island, Lyme disease, and the deadly 1999 West Nile virus outbreak","torrent":{"xt":"urn:btih:f58d18aa32805f17ded6254fc5dc20e19993b166","amp;dn":"Michael+C.+Carroll+-+Lab+257+-+The+Disturbing+Story+of+the+Gover","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f58d18aa32805f17ded6254fc5dc20e19993b166","infoHashBuffer":{"type":"Buffer","data":[245,141,24,170,50,128,95,23,222,214,37,79,197,220,32,225,153,147,177,102]},"announce":[],"urlList":[]}}