{"title":"Sexually Broken--Bonnie Rotten made to squirt, drool, gag, cum. ","uid":8697631,"size":971292764,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:f622b28e08a3074df03b6c47b2673a8f07ec1b3e&amp;dn=Sexually+Broken--Bonnie+Rotten+made+to+squirt%2C+drool%2C+gag%2C+cum.+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"merzedes","files":-1,"time":1373996646,"description":"Bonnie Rotten, is Orgasmed to near unconscious. Made to squirt, drool, gag, &amp; cum. Orgasm overload! | Bonnie Rotten\n\nJuly 15, 2013 \n\n\nMP4 only. \n    \n \nBonnie Rotten is firmly bound in the wall. Her ass and pussy hang out on one side, her tits and throat on the other. Today Bonnie finds out what really being helpless means.\n\nBonnie is tall, thin, lean. flexible and strong, her naturally tan tone body is ripped from dancing and working out daily. Her legs are spread and bound, her pussy and ass totally open and exposed. Her head is falling off the edge of a the platform at perfect face fucking height. Bonnie is about to get sexually destroyed and has no idea how hard she is going to squirt, cum and scream in the next 15 minutes. \n\nWe have the world most powerful vibrator locked on to her pussy. We turn the sybian on low to tease and move the hard cock into Bonnie's hot wet mouth. We start slow and easy, letting Bonnie's throat stretch as the cock fucks it deeper and deeper. The sybian get turned to full power and Bonnie is immediately blasted into sub space. The cock is giving her a skull fucking of epic proportions as orgasms get repeatedly ripped out of her pussy by the vibrator. Over and over Bonnie cums until we can't stand the screaming anymore. We remove the sybian and replace it with cock. We fuck Bonnie hard and deep and we then move around and fuck her face. Over and over, back and forth, Bonnie can't even remember what not cumming means anymore. We make Bonnie cum and squirt too many times to even count. In the end Bonnie is a blathering cum drunk slut, coated in her own bodily liquids, completely void of ration thought... \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/07_15brotten2/SexuallyBroken-Bonnie-Rotten-Bonnie-Rotten-is-Orgasmed-to-near-unconscious--Made-to-squirt-drool-gag--cum-Orgasm-overload.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/07_15brotten2/SexuallyBroken-Bonnie-Rotten-Bonnie-Rotten-is-Orgasmed-to-near-unconscious--Made-to-squirt-drool-gag--cum-Orgasm-overload.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:f622b28e08a3074df03b6c47b2673a8f07ec1b3e","amp;dn":"Sexually+Broken--Bonnie+Rotten+made+to+squirt%2C+drool%2C+gag%2C+cum.+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f622b28e08a3074df03b6c47b2673a8f07ec1b3e","infoHashBuffer":{"type":"Buffer","data":[246,34,178,142,8,163,7,77,240,59,108,71,178,103,58,143,7,236,27,62]},"announce":[],"urlList":[]}}