{"title":"It Began With Babbage - The Genesis Of Computer Science (2013) B","uid":9590083,"size":14518144,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f62c9f1a05a9e31d1c7363c52b0bca25104b05af&amp;dn=It+Began+With+Babbage+-+The+Genesis+Of+Computer+Science+%282013%29+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1391889199,"description":"Format: mobi/epub/azw3\nLength: 344 pages\nGenre: Non-Fiction/History/Computer Science\nDate: 12 December 2013\n\nIn It Began with Babbage, computer scientist and writer Subrata Dasgupta examines the distinct history of computer science in terms of its creative innovations, reaching back to Charles Babbage in 1819. \n\nSince all artifacts of computer science are conceived with a use in mind, the computer scientist is not concerned with the natural laws that govern disciplines like physics or chemistry; instead, the field is more concerned with the concept of purpose. This requirement lends itself to a type of creative thinking that, as Dasgupta shows us, has exhibited itself throughout the history of computer science. More than any other, computer science is the science of the artificial, and has a unique history to accompany its unique focus.\n\nThe book traces a path from Babbage's Difference Engine in the early 19th century to the end of the 1960s by when a new academic discipline named &quot;computer science&quot; had come into being. Along the way we meet characters like Babbage and Ada Lovelace, Turing and von Neumann, Shannon and Chomsky, and a host of other people from a variety of backgrounds who collectively created this new science of the artificial. And in the end, we see how and why computer science acquired a nature and history all of its own.\n\nAuthor:\n\nSubrata Dasgupta is a scholar, teacher, and author. He holds the Computer Science Trust Fund Eminent Scholar Chair in the School of Computing &amp; Informatics, University of Louisiana at Lafayette. For the past thirty years he has studied and written on the historical and cognitive nature of creativity in various fields including computer science, design theory, cultural and intellectual movements, science, technology, and art. He is the author of thirteen previous books, including Technology and Creativity and Jagadis Chandra Bose and the Indian Response to Western Science.","torrent":{"xt":"urn:btih:f62c9f1a05a9e31d1c7363c52b0bca25104b05af","amp;dn":"It+Began+With+Babbage+-+The+Genesis+Of+Computer+Science+%282013%29+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f62c9f1a05a9e31d1c7363c52b0bca25104b05af","infoHashBuffer":{"type":"Buffer","data":[246,44,159,26,5,169,227,29,28,115,99,197,43,11,202,37,16,75,5,175]},"announce":[],"urlList":[]}}