{"title":"Manic-Depressive Illness: Disorders, Depression, 2nd Ed. [PDF]","uid":8298100,"size":13600549,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6463d64454e549489bc41fbf0e0ea8b3a64ebe7&amp;dn=Manic-Depressive+Illness%3A+Disorders%2C+Depression%2C+2nd+Ed.+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"theBooks","files":-1,"time":1364197588,"description":"Manic-Depressive Illness: Bipolar Disorders and Recurrent Depression, 2nd Edition\nAuthor(s): Frederick K. Goodwin, Kay Redfield Jamison\nPublisher: Oxford University Press\nDate: 2007\nPages: 1289\nFormat: PDF\nLanguage: English\nISBN-10: 0195135792\nISBN-13: 978-0195135794\nSize: 13.28 MB\n\n--------------------------------------------------------------------------------\n--------------------------------------------------------------------------------\n\nDescription:\n\n--------------------------------------------------------------------------------\n--------------------------------------------------------------------------------\n\nThe revolution in psychiatry that began in earnest in the 1960s led to dramatic advances in the understanding and treatment of manic-depressive illness. Hailed as the most outstanding book in the biomedical sciences when it was originally published in 1990, Manic-Depressive Illness was the first to survey this massive body of evidence comprehensively and to assess its meaning for both clinician and scientist.\n\nIt also vividly portrayed the experience of manic-depressive illness from the perspective of patients, their doctors, and researchers. Encompassing an understanding about the illness as Kraeplin conceived of it- about its cyclical course and about the essential unity of its bipolar and recurrent unipolar forms- the book has become the definitive work on the topic, revered by both specialists and nonspecialists alike. \n\nNow, in this magnificent second edition, Drs. Frederick Goodwin and Kay Redfield Jamison bring their unique contribution to mental health science into the 21st century. In collaboration with a team of other leading scientists, a collaboration designed to preserve the unified voice of the two authors, they exhaustively review the biological and genetic literature that has dominated the field in recent years and incorporate cutting-edge research conducted since publication of the first edition. They also update their surveys of psychological and epidemiological evidence, as well as that pertaining to diagnostic issues, course, and outcome, and they offer practical guidelines for differential diagnosis and clinical management.\n\nThe medical treatment of manic and depressive episodes is described, strategies for preventing future episodes are given in detail, and psychotherapeutic issues common in this illness are considered. Special emphasis is given to fostering compliance with medication regimens and treating patients who abuse drugs and alcohol or who pose a risk of suicide.\n\nThis book, unique in the way that it retains the distinct perspective of its authors while assuring the maximum in-depth coverage of a vastly expanded base of scientific knowledge, will be a valuable and necessary addition to the libraries of psychiatrists and other physicians, psychologists, clinical social workers, neuroscientists, pharmacologists, and the patients and families who live with manic-depressive illness.\n\n--------------------------------------------------------------------------------\n--------------------------------------------------------------------------------\n\nReviews:\n\n--------------------------------------------------------------------------------\n--------------------------------------------------------------------------------\n\n&quot;Manic-Depressive Illness stands above other selections in the field because of its organization and the clarity of presentation, in addition to the way it reveals the most cutting-edge thinking in the field. In sum, these attributes, when stitched together, render this book the authority in its field.&quot;\n--The Electric Review\n\n&quot;This is the Bible of manic-depressive illness and recurrent depression. It is the secure basis for all kinds of scientific and clinical expeditions. It unifies an immense past knowledge with the standards of the present and creates the roadmap for the future. In this book, no field and no aspect of mood and mood-related disorders remain uncovered.&quot;\n--Prof. Dr. med. Dr. h. c. Andreas Marneros, Psychiatric University Clinic, Halle-Wittenberg/Germany\n\n&quot;This definitive text on MDI/bipolar disorders documents what we have learned circa 2006, presents it clearly and logically, and should stimulate serious students of these disorders to seek and learn more.&quot;\n--Doody's, a 5 Star Review\n\n\n&quot;It is still true that there is nothing quite like this textbook. Anyone with a clinical, personal, research, or academic interest in mood disorders should obtain a copy.&quot;\n--Journal of Clinical Psychiatry\n\n--------------------------------------------------------------------------------\n--------------------------------------------------------------------------------\n\nAbout the Author:\n\n--------------------------------------------------------------------------------\n--------------------------------------------------------------------------------\n\nFrederick King Goodwin is an American psychiatrist and Clinical Professor of Psychiatry at the George Washington University Medical Center, where he is also director of the Center on Neuroscience, Medical Progress, and Society. He is a specialist in bipolar disorder (also known as manic-depressive illness) and recurrent depression.\n\nKay Redfield Jamison is an American clinical psychologist and writer whose work has centered on bipolar disorder which she has suffered from since her early adulthood. She is Professor of Psychiatry at the Johns Hopkins University School of Medicine and is an Honorary Professor of English at the University of St Andrews.\n\n--------------------------------------------------------------------------------\n--------------------------------------------------------------------------------\n\nAmazon Customer Ratings (28 Reviews):\n\n--------------------------------------------------------------------------------\n--------------------------------------------------------------------------------\n\n5 star: (24)\n4 star: (4)\n3 star: (0)\n2 star: (0)\n1 star: (0)\n\n--------------------------------------------------------------------------------\n--------------------------------------------------------------------------------\n\nNo Password or Surveys. Guaranteed!!!\n\nPlease seed the torrent if you want to Help :)\n &lt;a href=&quot;\nhttp://www.plentyofebooks.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.plentyofebooks.net/&lt;/a&gt;\n\n--------------------------------------------------------------------------------\n--------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:f6463d64454e549489bc41fbf0e0ea8b3a64ebe7","amp;dn":"Manic-Depressive+Illness%3A+Disorders%2C+Depression%2C+2nd+Ed.+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6463d64454e549489bc41fbf0e0ea8b3a64ebe7","infoHashBuffer":{"type":"Buffer","data":[246,70,61,100,69,78,84,148,137,188,65,251,240,224,234,139,58,100,235,231]},"announce":[],"urlList":[]}}