{"title":"Jeremy.Clarkson.Duel.2009.DVDrip.XviD.avi","uid":5145221,"size":742858752,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f66d062554edd04c9dc689dad693ba2e5263b857&amp;dn=Jeremy.Clarkson.Duel.2009.DVDrip.XviD.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":".BONE.","files":-1,"time":1257225001,"description":"Welcome to my new DVD, Duel - it's all about challenges and some big questions. Which car makes the most smoke while going sideways - a Lamborghini Murcielago SuperVeloce or a Vauxhall VXR8 Bathurst S? What is best at drifting? - the Jaguar XKR, the Lotus Evora, Audi's R8 V10 or BMW's M3? To find out, I globe-trot from sun-drenched Spain to Silverstone via Oxfordshire and Swindon. \n\nThere is serious science too. Can The Stig drift a car while wearing wellies? Can I corner in flippers? Can Formula One ace Anthony Davidson slide a car - in ice skates? Who is the best at off road driving? - Newswoman Kate Silverton, rugby's Matt Dawson, singer Ronan Keating - or me? Which is fastest - a car or a man? Find out as the Aston Martin v12 Vantage sprints against flying rugby winger Tom Varndell in a 100 metre drag race.\n\nAnd at last, The Stig goes head to helmet against The Tiff. The white-suited racing driver and I join forces against Vicki Butler-Henderson and Tiff Needell. There's carnage in an auto-test and I push the 190mph Aston Martin DBS Volante to the limit against Vicki in a Ã‚Â£150,000 Ferrari California. I also pick a Ford Focus RS for a road race against his'Stigness in a Lamborghini Gallardo Spyder. Who will win? \n\nThere's more. What will hit the ground first from 150 feet up a penny or a Ford Scorpio? Can the Stig ride a bicycle? And can a man with a rubbish car get it home using no fuel at all. just a catapult. Meanwhile, there's a terrible accident with a Morris Marina and a piano and everything else explodes including Ronan Keating. \n","torrent":{"xt":"urn:btih:f66d062554edd04c9dc689dad693ba2e5263b857","amp;dn":"Jeremy.Clarkson.Duel.2009.DVDrip.XviD.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f66d062554edd04c9dc689dad693ba2e5263b857","infoHashBuffer":{"type":"Buffer","data":[246,109,6,37,84,237,208,76,157,198,137,218,214,147,186,46,82,99,184,87]},"announce":[],"urlList":[]}}