{"title":"The Verve Pipe - Villains 320cbr (Big Papi) 1997 American Altern","uid":9404803,"size":129727068,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f7534ecec3d8bf5910e59d356c4bcc2fa8d8c3e2&amp;dn=The+Verve+Pipe+-+Villains+320cbr+%28Big+Papi%29+1997+American+Altern&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":2,"uploader":"Big-Papi","files":-1,"time":1388137436,"description":"Source: 1997 CD\n\n\nBy Jonah\nThis is my second review of the CD Villains. After reading some of the other reviews of the CD, I felt I should add on to my last one. For those who gave this CD 2 stars or less, I guess it's not your kind of music. The Verve Pipe doesn't scream and swear at the top of their lungs while playing ear throbbing metal rock. These guys play amazing rock/alternative, with strong chorus', superb lyrics, and amazing vocals and instrumentals. They are probably the most telented band I know of. I rank them musically with Dave Mathews Band. This CD is terrific. It gets better with each listen. The more it plays in your head, the more impressed you get. I play this CD al the way through and never have to skip a track. It is amazing, you dont find too many CD's like this. Barely, Drive You Mild, Villains,Reverand Girl, Cup of Tea, Myself, The Freshman, Ominous Man, and Real all rank 5 stars for me, and the last 3 are still pretty darn good, entering a slower sound. To give this CD under 3 stars is an injustice, especially when the review ends with remarks such as, &quot;These guys are really bad.&quot; These guys are amazing. They may not be you cup of tea, but no matter what angel you look at from, they are fantastic musicians and masters of their craft. Brian Vander Ark has one of the greatest voices ever, and the guitars and drums and bass are awesome. These guys are way more than 3 stars.","torrent":{"xt":"urn:btih:f7534ecec3d8bf5910e59d356c4bcc2fa8d8c3e2","amp;dn":"The+Verve+Pipe+-+Villains+320cbr+%28Big+Papi%29+1997+American+Altern","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7534ecec3d8bf5910e59d356c4bcc2fa8d8c3e2","infoHashBuffer":{"type":"Buffer","data":[247,83,78,206,195,216,191,89,16,229,157,53,108,75,204,47,168,216,195,226]},"announce":[],"urlList":[]}}