{"title":"Insight Guides Pocket - Madrid (2016).epub Gooner","uid":15293000,"size":27935346,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f7f3bb865346b076aba6f9b01bdc9140356b3d4b&amp;dn=Insight+Guides+Pocket+-+Madrid+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1468437772,"description":"Insight Guides Pocket - Madrid (2016).epub Gooner\r\n\r\nPublisher: Insight (18 April 2016)\r\nLanguage: English\r\nISBN-10: 1780052758\r\nISBN-13: 978-1780052755\r\n\r\nSpain's capital is a city that never sleeps, known for its gracious architecture, charming old quarters, and superb art collections, all under blue skies and exquisite sierra light. Be inspired to visit by the brand new Insight Pocket Guide Madrid, a concise, full-color guide to this elegant city that combines lively text with vivid photography to highlight the best that Madrid has to offer.\r\n\r\nInside Insight Pocket Guide Madrid: \r\n\r\n- Where To Go details all the key sights in the city, from the bustling cafés of Plaza Mayor to the world-famous art collection of the Prado museum, while handy maps on the cover flaps help you find your way around, and are cross-referenced to the text.\r\n- Top 10 Attractions gives a run-down of the best sights to take in on your trip, including the royal palaces of El Escorial and Palacio Real, and the green space of Parque del Buen Retiro.\r\n- Perfect Day provides an itinerary for one day in the city.\r\n- What To Do is a snapshot of ways to spend your spare time, including arts, shopping, and the best tapas and flamenco bars in town.\r\n- Essential information on Madrid's culture, including a brief history of the city.\r\n- Eating Out covers the city's best cuisine.\r\n- Curated listings of the best hotels and restaurants.\r\n- A-Z of all the practical information you'll need.\r\n\r\nAbout Insight Guides: \r\n\r\nInsight Guides has over 40 years' experience of publishing high-quality, visual travel guides. We produce around 400 full-colour print guide books and maps as well as picture-packed eBooks to meet different traveller's needs. Insight Guides' unique combination of beautiful travel photography and focus on history and culture together create a unique visual reference and planning tool to inspire your next adventure","torrent":{"xt":"urn:btih:f7f3bb865346b076aba6f9b01bdc9140356b3d4b","amp;dn":"Insight+Guides+Pocket+-+Madrid+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7f3bb865346b076aba6f9b01bdc9140356b3d4b","infoHashBuffer":{"type":"Buffer","data":[247,243,187,134,83,70,176,118,171,166,249,176,27,220,145,64,53,107,61,75]},"announce":[],"urlList":[]}}