{"title":"Louis Ginzberg - The Legends of the Jews (2 vols.)","uid":10495397,"size":10290311,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f7f7d35be7ad35a741c14c0e33db414e939234c3&amp;dn=Louis+Ginzberg+-+The+Legends+of+the+Jews+%282+vols.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"workerbee","files":-1,"time":1404607717,"description":"\nLouis Ginzberg - The Legends of the Jews (Jewish Publication Society, 2003).  2 volumes.  Translated by Henrietta Szold and Paul Radin.\n\nISBN: 9780827607095 | 1650 pages | PDF\n\n\nOriginally published in seven volumes between 1909 and 1938, including notes and indexes, THE LEGENDS OF THE JEWS is the scholarly masterwork of  Rabbi Louis Ginzberg (1873-1953) and an indispensable classic of modern Jewish literature.\n\nCombining hundreds of legends and parables from a lifetime of midrash research, it is an original synthesis of a vast amount of aggadah (legends, parables, and narratives) from all of classical rabbinic literature, as well as apocryphal, pseudopigraphical and even early Christian literature, with legends ranging from the creation of the world and the fall of Adam, through a huge collection of legends on Moses, and ending with the story of Esther and the Jews in Persia.  The result is a single, comprehensive collection of legends that follows the biblical narrative, accompanied by detailed notes that reveal a complex subtext of often intersecting and multi-layered levels of influence, borrowed notions, and interpretive commentaries.\n\nThis JPS reissue is reset in two volumes with four new indexes, and a new introduction by David Stern, Director of the Jewish Studies Program at the University of Pennsylvania.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                       &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:f7f7d35be7ad35a741c14c0e33db414e939234c3","amp;dn":"Louis+Ginzberg+-+The+Legends+of+the+Jews+%282+vols.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7f7d35be7ad35a741c14c0e33db414e939234c3","infoHashBuffer":{"type":"Buffer","data":[247,247,211,91,231,173,53,167,65,193,76,14,51,219,65,78,147,146,52,195]},"announce":[],"urlList":[]}}