{"title":"Marijuana Cooking - Good Medicine Made Easy.pdf Gooner","uid":8675379,"size":10971765,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f827f03a1a4ddc10fb1afc3471a45ebbdc4b4a1e&amp;dn=Marijuana+Cooking+-+Good+Medicine+Made+Easy.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1373578508,"description":"Format: pdf\nGenre: Alternative Medicine\nPrint Length: 76 pages\nRelease Date: 2005\n\nDescription:\n\nIn Marijuana Cooking: Good Medicine Made Easy, authors Bliss Cameron and Veronica Green guide would-be chefs through the process of making their own tasty and healthy home-remedies using marijuana. Step-by-step instructions and photographs carefully document the cooking techniques described, making this the most user-friendly marijuana cookbook available.\n\nIncreasing awareness of the therapeutic properties of marijuana--to ease tension in the body, relieve pain and pressure, promote appetite, and induce overall relaxation--has generated widespread interest in its use as a medicine. Without doubt, the best and safest medicinal application of marijuana is ingestion.\n\nWhat makes this book truly unique is the careful attention paid to the individual needs of those who rely on the therapeutic properties of marijuana. The authors offer five ways to prepare marijuana for use in the kitchen, advice on personalizing dosage, and tips on substituting ingredients to account for different tastes and medical conditions.\n\nCameron and Green understand that marijuana is good medicine for both the body and spirit. They have long been involved in providing healthy marijuana treats to individuals suffering from ailments such as arthritis, asthma, insomnia, appetite loss, and glaucoma, and others who rely on the soothing and therapeutic benefits of marijuana.\n\nAuthor:\n\nBliss Cameron and Veronica Green understand that marijuana is good medicine for both the body and spirit. They have long been involved in providing healthy marijuana treats to individuals suffering from ailments such as arthritis, asthma, insomnia, appetite loss, and glaucoma, and others rely on the soothing and therapeutic benefits of marijuana. They both live in California.","torrent":{"xt":"urn:btih:f827f03a1a4ddc10fb1afc3471a45ebbdc4b4a1e","amp;dn":"Marijuana+Cooking+-+Good+Medicine+Made+Easy.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f827f03a1a4ddc10fb1afc3471a45ebbdc4b4a1e","infoHashBuffer":{"type":"Buffer","data":[248,39,240,58,26,77,220,16,251,26,252,52,113,164,94,187,220,75,74,30]},"announce":[],"urlList":[]}}