{"title":"A Writer's Guide to Persistence - Jordan Rosenfeld","uid":14474739,"size":1011036,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8975c9ed32206ccd0f3605e087a4888b6316a62&amp;dn=A+Writer%27s+Guide+to+Persistence+-+Jordan+Rosenfeld&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ZamKhan","files":1,"time":1461927663,"description":"\n\r\nPractice. Polish. Persist.\r\n\r\nYour writing journey can take you many places: hiking through steep mountains, traversing unknown territory, hurdling both roadblocks and rejections. Even the siren song of fame and fortune can distract you from your true purpose: to express yourself in an authentic and meaningful way, and to share your words with others.\r\n\r\nA Writer's Guide to Persistence is your road map through the rugged terrain of the writer's path. You'll discover advice and techniques for cultivating a fruitful, deeply meaningful writing life by practicing your craft, polishing your work, and persisting through even the toughest challenges.\r\n\r\nInside you'll find:\r\n\r\nPractical ways to balance writing with the rest of your life: taming your busy schedule, increasing your productivity, and committing to a writing practice\r\nAdvice for developing authentic work: finding your voice, writing bravely, and breaking the blocks to creative flow\r\nMethods for stretching your skills through craft and revision\r\nThoughts on pushing through rejection and doubt, submitting strong, nourishing yourself to avoid burnout, and keeping your mind and body fit\r\nFilled with journaling exercises and much-needed motivation, as well as insights from best-selling writers in a variety of genres, A Writer's Guide to Persistence will help you find the joy and purpose inherent in a writer's life. Your journey to publication and success may take a lifetime, but you can sow the rewards of writing with every step.\r\n&quot;A compassionate and intelligent guide for any writer who's just starting out or one who needs the understanding and encouragement of a great writing coach. Rosenfeld offers practical solutions for every concern, from how to find the time to write to getting through writer's block.&quot; --Patricia V. Davis, best-selling author","torrent":{"xt":"urn:btih:f8975c9ed32206ccd0f3605e087a4888b6316a62","amp;dn":"A+Writer%27s+Guide+to+Persistence+-+Jordan+Rosenfeld","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8975c9ed32206ccd0f3605e087a4888b6316a62","infoHashBuffer":{"type":"Buffer","data":[248,151,92,158,211,34,6,204,208,243,96,94,8,122,72,136,182,49,106,98]},"announce":[],"urlList":[]}}