{"title":"Senses Fail-Still Searching [Advance]","uid":3529392,"size":78212079,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f98b1bb80aadaa94def8cf59b47afb0af12f1997&amp;dn=Senses+Fail-Still+Searching+%5BAdvance%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"misled1","files":16,"time":1159224642,"description":"ARTIST: Senses Fail\nTITLE: Still Searching\nLABEL: Vagrant\nGENRE: Rock\nBITRATE: 249kbps avg\nPLAYTIME: 0h 40m total\nRELEASE DATE: 2006-10-10\nRIP DATE: 2006-09-25\n\nTrack List\n----------\n1.  The Rapture                      1:57\n2.  Bonecrusher                      2:33\n3.  Sick or Sane (Fifty For a        2:45\n    Twenty)\n4.  Can&amp;#039;t Be Saved                   3:07\n5.  Calling All Cars                 3:23\n6.  Shark Attack                     2:53\n7.  Still Searching                  4:18\n8.  To All The Crowded Rooms         3:05\n9.  Lost and Found                   3:50\n10. Every Day is a Struggle          3:04\n11. All The Best Cowboys Have Daddy  4:05\n    Issues\n12. Negative Space                   1:22\n13. The Priest and the Matador       4:21\n\nRelease Notes:\n\nNot many musicians influenced by punk, hardcore and metal are also well versed\nin poetry, literature and comparative religion. Then again, not many musicians\nare in Senses Fail.\nWhile dozens of their peers continue to create soul-rendering music about the\ngirls who shattered their hearts and ruined their lives, the Bergen County, New\nJersey five piece takes a more intellectual approach to sonic catharsis. Even\nthe name Senses Fail comes from frontman Buddy Nilelsen?s interest in\nspirituality.\n?In Hinduism, they believe that being alive is hell, and the only way to reach\nNirvana is to ultimately have no attachments to anything,? he explains. ?So,\npeople go out and live in the middle of the woods and they don?t eat and don?t\ndrink. They just meditate because they?ve reached such a high level where\nthey?re not attached to love, relationships or anything. And if you want to\nreach the highest level of being and see God, you have to have all your senses\nfail.?\nThe band?s full-length debut, Let It Enfold You, is a melodic and an emotionally\nrevealing slugfest that dives into unusual and refreshing subject matter. The\ntitle track is named after a poem by nihilistic author and poet Charles\nBukowski, ?The Irony of Dying on Your Birthday? draws from the work of\nmythologist Joseph Campbell and the lyrics of ?Slow Dance? are comprised of\nlines from Dao De Jing.\n?I was really into Daoism for a while and I really to write a song explaining\nwhat it was about?the ideaof living a pacifist path. You let things come and you\nlet things go. You don?t get overexcited or overly upset. I?m a very emotional\nguy. I?m either really upset or really happy. There?s no in between. So I?m\nalways tryin to find that middle ground where I can be happy.?\nFourtunately, Senses Fail?s brains are matched by their brawn. Let It Enfold You\nis a powerful, inviting and triumphant manifesto of youthful energy and turmoil.\nFrom the tumbling rhythms and piercing guitar fill of the storming ?Tie Her\nDown? to the tuneful vocal harmonies and blood-chilling screams of ?You?re Cute\nWhen You Scream? to the surging, stop-start rhythms and pointed vocals of ?Bite\nTo Break Skin? the band delivers with the consistency and power of veterans, not\nan outfit that has only been around since 2002.\nA year before Senses Fail where officially born, Nielsen posted an ad for band\nmembers on a musician?s Web board. Guitarist and background vocalist Garrett\nZablocki responded, and the two started jamming with guys Zablocki knew from a\nprevious band he had been in. Guitarist and background singer Dave Miller and\ndrummer Dan Trapp joined when their other group broke up, and after going\nthrough a couple bassists who didn?t work out, Senses Fail nabbed ex-Tokyo Rose\nmember Mike Glita. The band wrote and practiced a bunch of originals, and lined\nup gigs at VFW halls and small clubs throughout New Jersey.\nThen Senses Fail entered the studio in 2002 with producer John Naclerio,\nrecording two three-song demos. The material turned into an EP called, From The\nDepths of Dreams. The response to the disc was so strong that just a couple\nweeks after its release, the band was being courted by larger labels. The\ncollection sold well, and the band supported it with numerous well-recieved\ntours, including Finch, Millencolin, and the Starting Line. From The Depths of\nDreams would later be re-issued with two bonus tracks.\nAfter they finished touring, Senses Fail returned to the studio with Saves The\nDay producer Steve Evetts to record Let It Enfold You, their most challenging\nand rewarding experience to date. ?We killed ourselves over and over trying to\nsay what we wanted, and make the record the best it could be,? Nielsen says. ?I\njust feel like we got lucky to be where we are now, and now we have to prove\nourselves and really earn it.?\nSenses Fail preceded the release of the album with a prominent spot on the\nWarped Tour and will tour exhaustively through 2004.","torrent":{"xt":"urn:btih:f98b1bb80aadaa94def8cf59b47afb0af12f1997","amp;dn":"Senses+Fail-Still+Searching+%5BAdvance%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f98b1bb80aadaa94def8cf59b47afb0af12f1997","infoHashBuffer":{"type":"Buffer","data":[249,139,27,184,10,173,170,148,222,248,207,89,180,122,251,10,241,47,25,151]},"announce":[],"urlList":[]}}