{"title":"Algae: Anatomy, Biochemistry, and Biotechnology","uid":5904601,"size":14635969,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9902cf0b3c530d5425d7418a086bfca54a72e88&amp;dn=Algae%3A+Anatomy%2C+Biochemistry%2C+and+Biotechnology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Theta91","files":-1,"time":1287812136,"description":"An exhaustive review on all things algae would require a multi-volume encyclopedic work. Even then, such a tome would prove to be of limited value, as in addition to being quite complex, it would soon be outdated, as the field of phycology is full of continual revelations and new discoveries.\n\nAlgae: Anatomy, Biochemistry, and Biotechnology offers students and researchers in phycology a more practical and useful approach. Instead of trying to offer a little bit of everything, the authors concentrate on highlighting especially interesting and illuminating topics, with the idea of inciting the sort of wonder and curiosity in undergraduate and post-graduate students that will encourage further outstanding work. \n\nThe chapters can be read in progression to provide structure to a semester, or each can be read on its own as a self-contained essay to supplement other work.\n\nWritten and designed for those with a general scientific background, the book covers freshwater, marine, and terrestrial forms. Its early chapters present an overview of the classification of the algae; these chapters are followed by reviews of life cycles, reproductions, and phylogeny, providing a conceptual framework that promotes a deeper understanding of more complex topics. Levels of organization are examined from the subcellular, cellular, and morphological standpoints, leading to discussions involving physiology, biochemistry, culture methods, and finally, the role of algae in human society. New findings are provided to demonstrate that the world of algae is still ripe with discovery for those students who keep their eyes and their minds active and open. \n\nAlgae: Anatomy, Biochemistry, and Biotechnology stands as a hybrid, offering something of a cross between a typical review and a descriptive monograph. The work makes it possible for students to visualize and compare algal structure. It also supplies carefully selected literature references that direct researchers to an abundance of precise details from original sources.\n\n- crcpress.com","torrent":{"xt":"urn:btih:f9902cf0b3c530d5425d7418a086bfca54a72e88","amp;dn":"Algae%3A+Anatomy%2C+Biochemistry%2C+and+Biotechnology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9902cf0b3c530d5425d7418a086bfca54a72e88","infoHashBuffer":{"type":"Buffer","data":[249,144,44,240,179,197,48,213,66,93,116,24,160,134,191,202,84,167,46,136]},"announce":[],"urlList":[]}}