{"title":"Red_Dead_Redemption-Game_of_The_Year_Edition-PAL_RF-XBOX360-RRoD","uid":6781096,"size":15677394300,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:fa322e56f512ac5b973594e0676d774f151b5d6c&amp;dn=Red_Dead_Redemption-Game_of_The_Year_Edition-PAL_RF-XBOX360-RRoD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":9,"uploader":"Sunblock.","files":8,"time":1319903318,"description":"Red Dead Redemption-Game of The Year Edition-PAL RF-XBOX360-RRoD \n\nRed Dead Redemption: Game of the Year Edition  the definitive, complete Red Dead Redemption experience that includes all the free and paid downloadable content packs released to date.\n\nRed Dead Redemption: Game of the Year Edition features the full, original Red Dead Redemption game  winner of over 160 Game of the Year honors  with a brand-new Hardcore single-player difficulty option, plus the wildly popular Undead Nightmare single and multiplayer offerings, as well as all the additional downloadable content, including all the DLC originally released as pre-order content as well as the Solomons Folly single player gang hideout and challenges (available for the first time on Xbox 360).\n\n\n\nFeatures:\n\nExpansive open-world gameplay set in the final years of the American Wild West.\nMassive play area made up 3 unique regions composed of towns and outposts filled with characters with varying looks, accents, etc.\nMorality system based on honor and fame generated by the players actions throughout the game.\nLoads of unique non-player characters to interact with.\nWestern themed mini-games including showdowns, gambling, hunting bounties, cattle herding and five finger fillet.\nAn assortment of period specific weapons including a cattleman revolver, a mauser pistol, a repeater rifle, a sawed-off shotgun, a throwing knife, lasso and more.\nThe Dead Eye targeting mechanic, allowing the player to slow down time for shot accuracy.\nRidable horses and more than 40 kinds of animals that you can hunt or be hunted by.\n\n\nsharedump.org","torrent":{"xt":"urn:btih:fa322e56f512ac5b973594e0676d774f151b5d6c","amp;dn":"Red_Dead_Redemption-Game_of_The_Year_Edition-PAL_RF-XBOX360-RRoD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa322e56f512ac5b973594e0676d774f151b5d6c","infoHashBuffer":{"type":"Buffer","data":[250,50,46,86,245,18,172,91,151,53,148,224,103,109,119,79,21,27,93,108]},"announce":[],"urlList":[]}}