{"title":"The Witcher 3: Wild Hunt (Patch 1.11) (GOG)","uid":12617346,"size":476787063,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fa74a3269b732ab936cb79e8bb19d79210eff78d&amp;dn=The+Witcher+3%3A+Wild+Hunt+%28Patch+1.11%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"mercs215","files":2,"time":1445537637,"description":"Install instructions:\r\nNote: Requires patch 1.10 installed.\r\n- Run &quot;patch_witcher3_1.10-1.11_2.0.0.41.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nChange log:\r\nPatch 1.11 (22 October 2015)\r\nHearts of Stone­\r\nACHIEVEMENTS\r\nFixes issue whereby items needed for Achievement titled I Wore Ofieri Before It was Cool could not be acquired from Ofieri merchant.\r\nGAMEPLAY\r\nFixes issue whereby glyphs added within Hearts of Stone expansion would disappear from slots subsequent to game being saved and loaded.\r\nAlters difficulty balance of arachnomorphs in quest titled Open Sesame! forming part of Hearts of Stone expansion.\r\nFixes issue whereby cellar could be looted without fighting archgriffin in quest titled A Surprise Inheritance forming part of Hearts of Stone expansion.\r\nFixes issue whereby Roach could appear to change into a black mare with Hearts of Stone expansion installed.\r\nFixes issue whereby some players could not sell anything to Countess Mignole.\r\nAlters difficulty balance of bosses in Hearts of Stone expansion, adding distinct statistics for individual difficulty levels.\r\nRenders selection of items from Hearts of Stone expansion transferable to New Game+ mode.\r\nFixes issue whereby master blacksmiths could craft Venomous Viper set. Said set now craftable only by grandmaster blacksmiths.\r\nAdds resistance to knockdown by Aard Sign to Ofieri Mage in Hearts of Stone expansion.\r\nFixes issue whereby Enchant effect was removed from armor when armor was transferred into New Game + mode.\r\nFixes issue whereby arachnomorphs were immune to effects of Dancing Star bomb.\r\nAdds entries for Enchanting feature to Glossary and Tutorials.\r\nIntroduces a number of changes to difficulty balance in New Game + mode.\r\nFixes issue whereby combat could prevent players from unequipping censer item.\r\nPERFORMANCE\r\nImproves performance in Oxenfurt sewers location.\r\nQUEST\r\nFixes issue whereby players had to buy Ofieri set from merchant to start quest titled From Ofier's Distant Shores.\r\nFixes rare issue whereby objective remained incorrectly marked as incomplete under certain scenarios in quest titled Dead Man's Party in Hearts of Stone expansion.\r\nFixes issue whereby minor quest titled Tinker, Hunter, Soldier, Spy was not tracked in Treasure Hunts tab in Journal.\r\nFixes issue whereby minor quest titled The Sword, Famine and Perfidy was not tracked in Treasure Hunts tab in Journal.\r\nFixes issue whereby Vlodimir claimed to have rescued fire­eater even if said character was killed during quest titled Dead Man's Party.\r\nVISUAL\r\nFixes issue whereby highlights indicating memories in quest titled Scenes From a Marriage in Hearts of Stone expansion were adversely affected with Color­blind mode activated.\r\nImproves depiction of rivers and waterfalls in multiple locations throughout Hearts of Stone expansion.\r\nFixes issue whereby rain could be seen falling in Oxenfurt sewers during Hearts of Stone expansion.\r\nFixes issue whereby rain was visible inside lighthouse located north west of Temple Isle.\r\nFixes issue whereby rainfall could occur inside Temple of Lilvani in Hearts of Stone expansion.\r\nAlters shadow drawing processes in Oxenfurt in Hearts of Stone expansion.\r\nFixes issue whereby number of insects appearing was excessive when players equipped Roach with item called Caparison of Lament.\r\nDLCs­\r\nGENERAL\r\nAdds missing download image for Skellige Armor content.\r\nFixes issue in DLC quests whereby occasionally human foes could have empty Health bars and could not be killed.\r\nAdds missing interaction to chest in quest titled Scavenger Hunt Wolf School Gear.\r\nFixes issue whereby Nilfgaardian gauntlets could cause unsightly red box to appear beneath Geralt's feet.\r\nQUEST\r\nFixes incorrect appearance of notice starting quest titled Where the Cat and Wolf Play... on notice board in Oreton.\r\nFixes issue occasionally preventing players from completing quest titled Skellige’s Most Wanted.\r\nFixes issue preventing players from starting quest titled Scavenger Hunt Wolf School Gear.\r\nFixes issue preventing players from examining pigs during quest titled Fool's Gold.\r\nFixes rare instances of pig spawning incorrectly during quest titled Fool's Gold.\r\nFixes duplication of werewolf corpse after quest titled Contract Skellige's Most Wanted has been completed.\r\nFixes issue whereby declining quest titled Contract Skellige's Most Wanted resulted in display of incorrect objective.\r\nVISUAL\r\nFixes visual issue, occurring in certain scenes, with necklace included in Triss' alternative look.\r\nMain Game­\r\n.... and more, read the README","torrent":{"xt":"urn:btih:fa74a3269b732ab936cb79e8bb19d79210eff78d","amp;dn":"The+Witcher+3%3A+Wild+Hunt+%28Patch+1.11%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa74a3269b732ab936cb79e8bb19d79210eff78d","infoHashBuffer":{"type":"Buffer","data":[250,116,163,38,155,115,42,185,54,203,121,232,187,25,215,146,16,239,247,141]},"announce":[],"urlList":[]}}