{"title":"Spellbreaker (Spellwright #3) by Blake Charlton (retail epub) {d","uid":15681456,"size":1594909,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa782aa6dacc1e7fa0bf03417a3cb13db6cb18a4&amp;dn=Spellbreaker+%28Spellwright+%233%29+by+Blake+Charlton+%28retail+epub%29+%7Bd&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"gratefuldawg77","files":1,"time":1472324245,"description":"480 pages\r\nPublished August 23rd 2016 by Tor Books\r\nISBN 0765356600 (ISBN13: 9780765356604)\r\nLeandra Weal has a bad habit of getting herself in dangerous situations.\r\n\r\nWhile hunting neodemons in her role as Warden of Ixos, Leandra obtains a prophetic spell that provides a glimpse one day into her future. She discovers that she is doomed to murder someone she loves, soon, but not who. That’s a pretty big problem for a woman who has a shark god for a lover, a hostile empress for an aunt, a rogue misspelling wizard for a father, and a mother who--especially when arguing with her daughter--can be a real dragon.\r\n\r\nLeandra’s quest to unravel the mystery of the murder-she-will-commit becomes more urgent when her chronic disease flares up and the Ixonian Archipelago is plagued by natural disasters, demon worshiping cults, and fierce political infighting. Everywhere she turns, Leandra finds herself amid intrigue and conflict. It seems her bad habit for getting into dangerous situations is turning into a full blown addiction.\r\n\r\nAs chaos spreads across Ixos, Leandra and her troubled family must race to uncover the shocking truth about a prophesied demonic invasion, human language, and their own identities--if they don't kill each other first.\r\n\r\nSpellbreaker is the long awaited sequel to Spellbound, which was listed by Kirkus Reviews among the Best Science Fiction and Fantasy of 2011. This final installment of the Spellwright Trilogy stands alone as a complete story; however, fans of the series will find in it answers to the questions raised by the previous books about Leandra’s parents, Nicodemus Weal and Francesca DeVega","torrent":{"xt":"urn:btih:fa782aa6dacc1e7fa0bf03417a3cb13db6cb18a4","amp;dn":"Spellbreaker+%28Spellwright+%233%29+by+Blake+Charlton+%28retail+epub%29+%7Bd","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa782aa6dacc1e7fa0bf03417a3cb13db6cb18a4","infoHashBuffer":{"type":"Buffer","data":[250,120,42,166,218,204,30,127,160,191,3,65,122,60,177,61,182,203,24,164]},"announce":[],"urlList":[]}}