{"title":"Garmin unlock v1.5","uid":4421093,"size":561739,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:fab9288d1a5031034d2fbf760afe00778ebc36db&amp;dn=Garmin+unlock+v1.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"joy_k","files":2,"time":1222787459,"description":"Garmin Unlock Generator v1.5\n\nThis keygen will generate software unlock codes both for GMXT and GMPC and for all locked maps using Garmin format.\n\n\nInstructions to generate software unlock code for GMXT:\n------------------------------------------------------\n\n1.  Download and install Garmin Mobile XT.\n\nLink to the installer: http://www8.garmin.com/software/GarminMobileXTforWindowsMobile_42030w.exe\n\n2.  Extract the archive to your storage card.\n \n3.  Insert your storage card into your PPC, when prompted, install the application.\n\n4.  Launch GMXT, got to Settings -&gt; About.\n\n5.  Make note of your &quot;Card ID&quot;\n\n6.  Launch the keygen, and type in your &quot;Card ID&quot; into the &quot;Unit ID&quot; field.\n\n7.  Select &quot;Garmin Mobile XT&quot; in the Sotware Product drop-down box and hit Generate button.\n\n8.  Copy (CTRL+C) your generated device unlock key to the clipboard.\n\n9.  Now open the Notepad and paste (CTRL+V) the key and save the file as SW.UNL\n\n10. Put your newly created file to your SD CardGarmin directory and restart GMXT.\n\n\n\nInstructions to generate software unlock code for GMPC:\n------------------------------------------------------\n\n1.  Download and install Garmin Mobile PC.\n\nLink to the installer:\n\n2.  Launch GMPC, when asked &quot;Did this purchase of Garmin Mobile PC include a Garmin GPS Receiver?&quot; click &quot;Yes&quot;.\n\n3.  When asked to Connect or power on your Garmin GPS receiver, click &quot;Done&quot;.\n\n4.  Click &quot;Skip&quot; while scanning for GPS receiver and confirm &quot;Yes&quot; on &quot;Are you sure...&quot; message box.\n\n5.  Go to Settings -&gt; About and make a note of your &quot;Device ID&quot;.\n\n6.  Launch the keygen and type in your &quot;Device ID&quot; into the &quot;Unit ID&quot; field.\n\n7.  Select &quot;Garmin Mobile PC&quot; in Software Product drop-down box and hit Generate button.\n\n8.  Copy (CTRL+C) your generated device unlock key to the clipboard.\n\n9.  Now open the Notepad and paste (CTRL+V) the key and save the file as SW.UNL\n\n10. Put your newly created file to your GMPC installation directory (C:GarminMobilePC by default) and restart GMPC.\n\nNOTE: If you managed to start this software in Trial Mode, you won&amp;#039;t see any &quot;Device ID&quot; in your Settings -&gt; About page.\n      You will find a kind of &quot;Software Unit ID&quot; instead and you CANNOT GENERATE an unlock code for it!!!\n      If this is your case, close down GMPC, then go to C:Documents and Settings\\Application DataGarminGarminMobilePC \n      and delete its content. The proceed from Step 2.\n      \n\n\nInstructions to generate map unlock code for Garmin device:\n----------------------------------------------------------\n\n1. Launch the keygen and enter your 10# GPS Unit ID (GMXT Card ID, Unlock ESN or GMPC Device ID).\n\n2. Select desired Map product and hit the corresponding Generate button to generate Map unlock key.\n\nNOTE: If your map is not included in the Map product list, select , enter the corresponding MapID and hit OK.\n      If you are not sure about your MapID, install it first into the MapSource, open regedit and browse for \n      one of the following keys:\n\n      [HKEY_LOCAL_MACHINESOFTWAREGarminMapsourceFamilies]\n\n      or\n   \n      [HKEY_LOCAL_MACHINESOFTWAREGarminMapsourceProduct]\n      \n      and check the &quot;ID&quot; REG_BINARY. That is your MapID (in HEX). You have to convert it \n      from HEX to decimal (do not forget to reverse the byte order when coverting)\n\n3. Hit Generate button to generate map unlock key.\n\n4. Copy (CTRL+C) your generated map unlock key to the clipboard.\n\n5. Open the Notepad again and paste (CTRL+V) the key and save the file as GMAPSUPP.UNL\n\n6. Put your newly created file to your SD CardGarmin directory and restart GMXT.\n\nThis keygen is also compatible with Garmin MapSource application. You can use it to generate map unlock keys \nfor any Garmin GPS device and any map using Garmin IMG format.\n\n\n!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\nDISCLAIMER: This keygen was created strictly for education and testing purposes. I have no (and never had)\n            intention to harm Garmin business in any way by leaking this keygen to public. Please do not\n            distribute it! If you like Garmin mapping products, I strongly encourage you to buy the\n            original map license directly from Garmin or one of its affiliates.\n!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nSpecial thanks goes to starix and Lord Yuz, who helped me with translation and reversing.\n\nJetMouse\n","torrent":{"xt":"urn:btih:fab9288d1a5031034d2fbf760afe00778ebc36db","amp;dn":"Garmin+unlock+v1.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fab9288d1a5031034d2fbf760afe00778ebc36db","infoHashBuffer":{"type":"Buffer","data":[250,185,40,141,26,80,49,3,77,47,191,118,10,254,0,119,142,188,54,219]},"announce":[],"urlList":[]}}