{"title":"Encyclopedia of Heavy Metal Music (2009)","uid":5498534,"size":2823573,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fabb6e4d0bd545acaa4ae1eb35082fdc2d1a4e3a&amp;dn=Encyclopedia+of+Heavy+Metal+Music+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"artpepper","files":-1,"time":1271414245,"description":"Encyclopedia of Heavy Metal Music\n\nWilliam Phillips, Brian A. Cogan \n\nGreenwood | 2009 | ISBN: 0313348006 | 285 pages | PDF | 2,6 MB\n\n\n\n\n\n\n\n\n\n\nIt has been reviled, dismissed, attacked, and occasionally been the subject of Congressional hearings, but still, the genre of music known as heavy metal maintains not only its market share in the recording and downloading industry, but also as a cultural force that has united millions of young and old fans across the globe. \n\n\nCharacterized by blaring distorted guitars, drum solos, and dramatic vibrato, the heavy metal movement headbanged its way to the popular culture landscape with bands like Led Zeppelin and Black Sabbath the 1970s. Motley Crue and Metallica made metal a music phenomenon in the 1980s. Heavy metal continues to evolve today with bands like Mastodon and Lamb of God.\n\nProviding an extensive overview of the music, fashion, films, and philosophies behind the movement, this inclusive encyclopedia chronicles the history and development of heavy metal, including sub-movements such as death metal, speed metal, grindcore, and hair metal.\n\nEssential and highly entertaining reading, the Encyclopedia of Heavy Metal Music and Culture offers a guide to the ultimate underground music, exploring its rich cultural diversity, resilience, and adaptability. Entries for musicians include a discography for those wanting to start or develop their music collections. \n\n\n\n\n","torrent":{"xt":"urn:btih:fabb6e4d0bd545acaa4ae1eb35082fdc2d1a4e3a","amp;dn":"Encyclopedia+of+Heavy+Metal+Music+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fabb6e4d0bd545acaa4ae1eb35082fdc2d1a4e3a","infoHashBuffer":{"type":"Buffer","data":[250,187,110,77,11,213,69,172,170,74,225,235,53,8,47,220,45,26,78,58]},"announce":[],"urlList":[]}}