{"title":"Walt Disney's Classic Cartoon Favorites - Volume 03 [DVDRip.Xvi","uid":5712106,"size":734145635,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fb1790582b089cd6e14a5bb37aaa189d88313304&amp;dn=Walt+Disney%5C%27s+Classic+Cartoon+Favorites+-+Volume+03+%5BDVDRip.Xvi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"FatFreddy44","files":2,"time":1279940438,"description":"An hour-long collection of Disney cartoons. The Art of Skiing, 1941, Goofy demonstrates &quot;how to ski,&quot; to off-stage narration. He does all jumps, turns, etc. backward. How To Fish, 1942, Goofy demonstrates &quot;how to fish,&quot; to off-stage narration. He has trouble casting and fly fishing; finally he loses the motor and the boat drags him to shore. How To Swim, 1942, Goofy demonstrates &quot;how to swim,&quot; to off-stage narration. He has trouble undressing in small locker room; shows diving and swimming techniques - underwater gags. Baggage Buster, 1941, Baggageman Goofy has trouble with a magician's trunk. Gags with palm tree and skeleton. Top hat spills pigeons and rabbits; cloth waved brings bull, kangaroo, lion, elephant. Goofy gets them all back in trunk; puts it on train, but finds them still at station. How to Dance, 1953, A short history of the dance, followed by Goof trying to learn to dance. He tries first with a dummy, then attends a real dancing school. He gets kicked out, but goes to a nearby casino where he tries jazz - winds up dancing on his head. We go back to primitive man to observe the progress made in the art of dancing. Lion Down, 1951, Goofy in his penthouse yard decides to rest in hammock, and hooks one end to a tree. Upon finding nothing to fasten the other end to, he goes to the forest, gets a tree and brings it back to his apartment, not realizing he has dislodged a lion from the tree. The lion follows Goofy to the apartment and decides he wants the hammock. Gags with Goofy, lion and hammock follow; Goofy ultimately wins out. The Big Wash, 1948, At circus grounds Goofy tries to give Dolores the elephant a bath. Dolores outwits Goofy by disguising as a clown, and turns water on Goof. Soap causes her to sneeze, force blowing Goofy into mud puddle. Hold That Pose, 1950, Goofy buys photo equipment for his hobby. He approaches a bear to take its picture, but there's a delayed explosion of flash powder. Chase follows, ending with bear in Goof's apartment admiring the proofs. Father's Day Off, 1953, Goofy takes over the household chores while his wife goes out. He gets completely confuse and by the time Mrs. Goof returns the house is in shambles. His last mistake has been to leave the iron on, so the firemen arrive at the same time as the wife.","torrent":{"xt":"urn:btih:fb1790582b089cd6e14a5bb37aaa189d88313304","amp;dn":"Walt+Disney%5C%27s+Classic+Cartoon+Favorites+-+Volume+03+%5BDVDRip.Xvi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb1790582b089cd6e14a5bb37aaa189d88313304","infoHashBuffer":{"type":"Buffer","data":[251,23,144,88,43,8,156,214,225,74,91,179,122,170,24,157,136,49,51,4]},"announce":[],"urlList":[]}}