{"title":"The Railroaders (Time-Life, The Old West Series).pdf","uid":11792444,"size":56879153,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb42aa4329c9831615dbcc81d96dabe321e2c490&amp;dn=The+Railroaders+%28Time-Life%2C+The+Old+West+Series%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"STBGD","files":1,"time":1428003829,"description":"pdf / English / 1973 Time-Life / 240 pages / 54.2 MB\n\nThis volume examines the development of rail in the West. The book begins with the statement: &quot;As late as the 1850s, the notion that a Bostonian could soon buy a railroad ticket to California and be there within a week seemed as remote as the fantasies of Jules Verne.&quot; And yet, within a short period of time, there was a transcontinental railroad that transformed the country--and the Old West.\n\nThis book, as others in the series, features many wonderful photos from the era, maps, and other features that assist the reader in &quot;getting it.&quot; The first chapter speaks to the visionaries who thought that rail could bind the country together. Such figures as Senator Thomas Hart Benson, Asa Whitney, John C. Fremont (as part of the surveying expedition to determine the best routes available), Jefferson Davis (who, surprise, favored a southern route), and so on. A nice map on page 21 lays out some of the competing proposed routes for the transcontinental railroad. The second chapter considers the &quot;barons of the Western roads.&quot; Here, we learn of the &quot;movers and shakers&quot; who sought to advance their economic interests. Among these? Thomas Durant, Leland Stanford, C. P. Huntington, and many others. The chapter provides some insight into their character and their motives.\n\nThe third chapter explores the workers, who helped build the railroad. Very hard work. Very challenging conditions. The chapter humanizes the workers. . . . The photos illustrate the heroic efforts of engineers and workers to build bridges and lay the rail line. Pages 121-127 depict the joining of rail lines between east and west. Chapter 4 discusses the travel situation created by the completed railroad, indicating what life was like on the tracks. . . .\n\nIf interested in a quick read about the development of the transcontinental railroad and if interested in an array of photos which helps bring the era to life, this volume should be reasonably satisfying.\n\nAmazon","torrent":{"xt":"urn:btih:fb42aa4329c9831615dbcc81d96dabe321e2c490","amp;dn":"The+Railroaders+%28Time-Life%2C+The+Old+West+Series%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb42aa4329c9831615dbcc81d96dabe321e2c490","infoHashBuffer":{"type":"Buffer","data":[251,66,170,67,41,201,131,22,21,219,204,129,217,109,171,227,33,226,196,144]},"announce":[],"urlList":[]}}