{"title":"The Intelligent Universe - Fred Hoyle","uid":11733573,"size":13257947,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb5d816ea36c7498b8a18e328d28fc351fc813b1&amp;dn=The+Intelligent+Universe+-+Fred+Hoyle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"starxteel","files":1,"time":1425475978,"description":"This major work by the eminent theoretical physicist and distinguished author challenges our traditional beliefs about the origins and nature of the Universe and the evolution of life on Earth. In a lucid and engaging style, Fred Hoyle builds an authoritative case against the most sacred cows of the scientific establishment.\nThe author argues persuasively that we owe our existence to another intelligence which, as part of a deliberate plan, created a structure for life that is far too complex to have risen by random processes.\n\n\nAbout the author:\nSir Fred Hoyle (1915?2001) was a famous English astronomer noted primarily for the theory of stellar nucleosynthesis and his often controversial stances on other scientific matters?in particular his rejection of the &quot;Big Bang&quot; theory, a term originally coined by him on BBC radio\nAfter teaching and research at Cambridge, Sir Fred Hoyle became Plumian Professor of Astronomy and Experimental Philosophy in 1958, and founded the Cambridge Institute of Theoretical Astronomy in 1967. He was made a Fellow of the Royal Society in 1957, an Honorary Member of the American Academy of Arts and Sciences in 1964, and in 1969 he was elected an associate member of the American National Academy of Sciences - the highest U.S. honor for non-American scientists. He was knighted in 1972, and in 1974 was awarded a Royal Medal by the Queen in recognition of his contribution to theoretical physics and cosmology. Hoyle resigned his Plumian professor position in 1972 and his directorship of the institute in 1973, with this move effectively cutting him off from most of his establishment power-base, connections, and steady salary","torrent":{"xt":"urn:btih:fb5d816ea36c7498b8a18e328d28fc351fc813b1","amp;dn":"The+Intelligent+Universe+-+Fred+Hoyle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb5d816ea36c7498b8a18e328d28fc351fc813b1","infoHashBuffer":{"type":"Buffer","data":[251,93,129,110,163,108,116,152,184,161,142,50,141,40,252,53,31,200,19,177]},"announce":[],"urlList":[]}}