{"title":"The Religion War--Scott Adams AZW3, EPUB, MOBI","uid":14892836,"size":783371,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb7943960814b0f9ead9e908d99bc1ec4dc712a9&amp;dn=The+Religion+War--Scott+Adams+AZW3%2C+EPUB%2C+MOBI&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"FreddyFroggy1","files":5,"time":1465769429,"description":"The Religion War--Scott Adams. Formats: AZW3, EPUB, MOBI. Published in 2004. \r\nFiction with a dollop of non-fiction. Tags: Christianity, God, Islam, Philosophy, Physics, Religion\r\nisbn:9781449459864\r\n\r\nIf you haven't already done so, I suggest first read the prequel, God's Debris, available here: ../14819801/God_s_Debris__a_Thought_Experiment-Scott_Adams_AZW3__EPUB__MOBI\r\n\r\nIn this frenetically paced sequel to Adams' best-selling &quot;thought experiment,&quot; God's Debris, the smartest man in the world is on a mission to stop a cataclysmic war between Christian and Muslim forces and save civilization. The brilliantly crafted, thought-provoking fable raises questions about the nature of reality and just where our delusions are taking us.\r\n\r\nWith publication of The Religion War, millions of long-time fans of Scott Adams' Dilbert cartoons and business bestsellers will have to admit that the literary world is a better place with Adams on the loose spreading new ideas and philosophical conundrums.\r\n\r\nUnlike God's Debris, which was principally a dialogue between its two main characters, The Religion War is set several decades in the future when the smartest man in the world steps between international leaders to prevent a catastrophic confrontation between Christianity and Islam. The parallels between where we are today and where we could be in the near future are clear.\r\n\r\nAccording to Adams, The Religion War targets &quot;bright readers with short attention spans-everyone from lazy students to busy book clubs.&quot; But while the book may be a three-hour read, it's packed with concepts that will be discussed long after, including a list of &quot;Questions to Ponder in the Shower&quot; that reinforce the story's purpose of highlighting the most important-yet most ignored-questions in the world.\r\n\r\nAbout the Author\r\n================\r\nWhat started as a doodle has turned Scott Adams into a superstar of the cartoon world. Dilbert debuted on the comics page in 1989, while Adams was in the tech department at Pacific Bell. Adams continued to work at Pacific Bell until he was voluntarily downsized in 1995. He has lived in the San Francisco Bay Area since 1979","torrent":{"xt":"urn:btih:fb7943960814b0f9ead9e908d99bc1ec4dc712a9","amp;dn":"The+Religion+War--Scott+Adams+AZW3%2C+EPUB%2C+MOBI","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb7943960814b0f9ead9e908d99bc1ec4dc712a9","infoHashBuffer":{"type":"Buffer","data":[251,121,67,150,8,20,176,249,234,217,233,8,217,155,193,236,77,199,18,169]},"announce":[],"urlList":[]}}