{"title":"Naomi Novik - Uprooted","uid":12324730,"size":514307778,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fb9e8232235a09351db0fbcd4c95f51592b4ebfa&amp;dn=Naomi+Novik+-+Uprooted&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Cybotage","files":18,"time":1441102995,"description":"Naomi Novik, author of the New York Times best-selling and critically acclaimed Temeraire novels, introduces a bold new world rooted in folk stories and legends, as elemental as a Grimm fairy tale.\n\n&quot;Our Dragon doesn't eat the girls he takes, no matter what stories they tell outside our valley. We hear them sometimes, from travelers passing through. They talk as though we were doing human sacrifice, and he were a real dragon. Of course that's not true: he may be a wizard and immortal, but he's still a man, and our fathers would band together and kill him if he wanted to eat one of us every 10 years. He protects us against the Wood, and we're grateful, but not that grateful.&quot;\n\nAgnieszka loves her valley home, her quiet village, the forests and the bright shining river. But the corrupted Wood stands on the border, full of malevolent power, and its shadow lies over her life.\n\nHer people rely on the cold, driven wizard known only as the Dragon to keep its powers at bay. But he demands a terrible price for his help: one young woman handed over to serve him for 10 years, a fate almost as terrible as falling to the Wood.\n\nThe next choosing is fast approaching, and Agnieszka is afraid. She knows - everyone knows - that the Dragon will take Kasia: beautiful, graceful, brave Kasia - all the things Agnieszka isn't, and her dearest friend in the world. And there is no way to save her.\n\nBut Agnieszka fears the wrong things. For when the Dragon comes, it is not Kasia he will choose.\n\n\nRead by Julia Emelin\nFormat: MP3\nBitrate: 64 Kbps\nUnabridged\n\nLength: 17 hrs and 43 mins\nUnabridged Audiobook\nRelease Date:05-19-15","torrent":{"xt":"urn:btih:fb9e8232235a09351db0fbcd4c95f51592b4ebfa","amp;dn":"Naomi+Novik+-+Uprooted","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb9e8232235a09351db0fbcd4c95f51592b4ebfa","infoHashBuffer":{"type":"Buffer","data":[251,158,130,50,35,90,9,53,29,176,251,205,76,149,245,21,146,180,235,250]},"announce":[],"urlList":[]}}