{"title":"FRANK OCEAN channel ORANGE FLAC","uid":7497362,"size":358445010,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fbc1c8d1afab1df546d697629276463a85a8c422&amp;dn=FRANK+OCEAN+channel+ORANGE+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"rjordan21","files":-1,"time":1343914786,"description":"Ocean titled the album as a reference to the neurological phenomenon grapheme color synesthesia and the color he perceived during the summer he first fell in love.\n\nAn R&amp;B and neo soul album, Channel Orange has an idiosyncratic musical style, unconventional stylistic elements, film inspired segue tracks, and influences from electro funk, pop soul, jazz funk, and psychedelic music. Its music is typified by unconventional melodies, spatial arrangements, mid tempo beats, and instruments such as electronic keyboards, muted percussion, and shifting synthesizers. The albums songs explore themes such as unrequited love, spirituality, desire, and decadence, and Oceans songwriting incorporates empathic lyrics, surrealistic imagery, references to Southern California, and descriptive narratives with dark characters. Oceans baritone singing on the album is characterized by subtle vocals, free form flow, and alternating falsetto and tenor registers.\n\nNot my rip but verified with Audiochecker V1.2.  All tracks CDDA with probability 100%. Artwork included.","torrent":{"xt":"urn:btih:fbc1c8d1afab1df546d697629276463a85a8c422","amp;dn":"FRANK+OCEAN+channel+ORANGE+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbc1c8d1afab1df546d697629276463a85a8c422","infoHashBuffer":{"type":"Buffer","data":[251,193,200,209,175,171,29,245,70,214,151,98,146,118,70,58,133,168,196,34]},"announce":[],"urlList":[]}}