{"title":"[SoM]Billy Elliot[DvdRip-DivX3-Ita-Mp3]","uid":4449645,"size":734175232,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fbf7d7465a331e959190c24d30c5d929642ced67&amp;dn=%5BSoM%5DBilly+Elliot%5BDvdRip-DivX3-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mitimex","files":1,"time":1224200000,"description":"illy a undici anni incappa per caso in una lezione di ballo che si svolge nel circolo ricreativo dove si allena alla boxe. Siamo nel 1984 nell&amp;#039;Inghilterra del Nord. Suo padre e suo fratello scioperano insieme agli altri minatori e quando si accorgono che Billy ha sostituito la boxe con la danza classica, considerata poco maschile, gli proibiscono entrambe e lo confinano a badare all&amp;#039;anziana nonna. Ma la signora Wilkinson, la sua maestra di ballo che ha intuito le sue grandi potenzialitÃƒÂ , lo prepara di nascosto all&amp;#039;audizione per la Royal Ballet School di Londra. Ma quando arriva quel giorno il fratello Tony viene picchiato e arrestato, Billy cerca con il padre di fargli avere la libertÃƒÂ  provvisoria e manca l&amp;#039;appuntamento. La signora Wilkinson litiga con il padre e lo accusa di non volere per il figlio una vita migliore. Billy, molto infelice, si sfoga mostrando al suo amico Michael il pezzo che aveva preparato per l&amp;#039;audizione. Il padre assiste per caso e per la prima volta si rende conto del talento del figlio per cui decide di tornare al lavoro per procurarsi i soldi per pagargli il viaggio a Londra. Saranno i suoi compagni che picchettano insieme al fratello Tony a organizzare un concerto per quello scopo senza trasformarlo in crumiro. Quindici anni dopo in un teatro del West End londinese, Billy ÃƒÂ¨ pronto a entrare in scena. In platea il padre, il fratello e Michael sono presenti.","torrent":{"xt":"urn:btih:fbf7d7465a331e959190c24d30c5d929642ced67","amp;dn":"%5BSoM%5DBilly+Elliot%5BDvdRip-DivX3-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbf7d7465a331e959190c24d30c5d929642ced67","infoHashBuffer":{"type":"Buffer","data":[251,247,215,70,90,51,30,149,145,144,194,77,48,197,217,41,100,44,237,103]},"announce":[],"urlList":[]}}