{"title":"Cass (2008) - DvDrip (English)","uid":4671012,"size":683563790,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fbfef437c5bf2c6f5fedd4e2d492f1e0ecf6bf3d&amp;dn=Cass+%282008%29+-+DvDrip+%28English%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"ashmat","files":-1,"time":1232733744,"description":"Cass (2008)\n\nDirector: Jon S. Baird\n\nWriter: Jon S. Baird, based on the autobiography of Cass Pennant\n\nCast: Nonso Anozie, Nathalie Press, Leo Gregory, Gavin Brocker, Daniel Kaluuya, Verelle Roberts, Linda Bassett, Peter Wright\n\nRuntime: 108 minutes\n\nCertificate: 18 - age restricted\n\nCountry: UK\n\n*************************************************************************************\n\n\t\n\nCass is the story of Cass Pennant, a black kid fostered by a white family in London, a football hooligan who became an author and family man. It's part biopic, part coming-of-age, and, as it tells its audience again and again, it's based on a true story.\n\nBorn Carol, Cass is bullied as a child. Adopted by Doll (Linda Bassett) and Cecil (Peter Wight), he's the only black child in a London neighbourhood, and from very early on it's clear he'll have trouble fitting in. Verelle Roberts and Daniel Kaluuya are both able as the younger Cass. Kaluuya, a veteran of Channel 4 teen drama Skins is no stranger to screen bullying and adolescent mischief, and he's well used here.\n\nAt 14, Cass gets himself involved in football hooliganism, becoming part of West Ham's notorious Inter City Firm, a band of terrace terrorists who've been committed to film before. Both The Firm and Green Street drew heavily from the ICF's history, even if some of the names were changed. As it's &quot;based on a true story&quot;, Cass doesn't try as hard.\n\nIt's as the eventual leader of the ICF that Cass really starts to come into his own. As an adult he's played by Nonso Anozie, and his sheer size and physicality gives us a good sense of Cass as a person. He's a perennial outsider, only truly comfortable with his friends and adoptive family, a smart chap struggling in a difficult situation.\n\nHis friends Prentice and Freeman (TV veteran Gavin Brocker and Green Street cast-member Leo Gregory) are well observed, some of the few who are colour blind, genuinely close to Cass. There are younger actors in the same roles too, and they convince at each stage, most so in the days of the Inter City Firm as Cass' loyal lieutanants.\n\nOf course, it's the ICF that gets Cass into trouble, not once but twice. A confrontation with another firm and the cycle of tit-for-tat violence is almost enough to unmake him, but it's also his claim to fame. As part of Thatcher's crackdown on &quot;the English Disease&quot; he's the first to get a harsher sentence for participation in football hooliganism; a pre-match raid on another set of thugs with weapons and extensive property damage earns him four years in prison. That's possibly the part of Cass that's the most difficult to believe, but it's true what they say: the past is a foreign country.\n\nIn addition to the football violence, there's Cass coming to terms with his heritage in prison, trying to escape his past as a hooligan, and even a love interest. Nathalie Press is Cass' future wife Elaine, and while she does well enough she's the only one who gives the sense she's acting. In a film almost entirely made up of relaxed, naturalistic performances, she's a little forced, a little too much after school special, and that's part of the film's undoing.\n\nCass is lumbered with a leaden voiceover, a narrative no doubt intended to shepherd the audience through the film as it moves in time, a little forward here, a little backward there. As it's mostly chronological, and well framed otherwise, it's not really necessary, and at times it starts to grate. It's telling, rather than showing. That earnestness crops up again and again. It may be part of Cass' authorial voice (the film is loosely based on his autobiography), but it feels like an imposition.\n\nUltimately, Cass is an affirming story of an escape from violence, of a young man finding an adoptive family in hooliganism and then trying to move on from it. It's well made, clearly well supported with a good cast (including a cameo from Frank Bruno), and it's got a decent soundtrack too.\n\nAll in all, a great British football hooligan movie in the same mould as Football Factory, Green Street and Rise Of The Footsoldier, enjoy and please seed, thanks!\n","torrent":{"xt":"urn:btih:fbfef437c5bf2c6f5fedd4e2d492f1e0ecf6bf3d","amp;dn":"Cass+%282008%29+-+DvDrip+%28English%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbfef437c5bf2c6f5fedd4e2d492f1e0ecf6bf3d","infoHashBuffer":{"type":"Buffer","data":[251,254,244,55,197,191,44,111,95,237,212,226,212,146,241,224,236,246,191,61]},"announce":[],"urlList":[]}}