{"title":"Brushstroke Handbook: The Ultimate Guide to Decorative Painting ","uid":9086496,"size":15053426,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc12469c0a13a0c718917d87c6f169723df9cfae&amp;dn=Brushstroke+Handbook%3A+The+Ultimate+Guide+to+Decorative+Painting+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"MANTESH","files":3,"time":1382499938,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51HiCc%2BJlLL._SX258_PJlook-inside-v2,TopRight,1,0_SH20_BO1,204,203,200_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51HiCc%2BJlLL._SX258_PJlook-inside-v2,TopRight,1,0_SH20_BO1,204,203,200_.jpg&lt;/a&gt;\n\n\nBrushstroke Handbook: The Ultimate Guide to Decorative Painting Brushstrokes\n\nPublisher: North Light Books \nMaureen McNaughton \n2006\nEnglish\nISBN-10: 1581807821\nASIN: B0024FAOXC\nPDF \n144 pages \n14.3 MB\n\nBeautiful brushstrokes step by step!\n\nThis is the one! The Brushstroke Handbook is your complete reference for mastering more than 50 fabulous strokes. Inside you'll find visual, step-by-step instruction divided into two sections that detail techniques for working with both round and flat brushes in acrylics. The lay-flat spiral binding makes it easy to quickly flip through and find the stroke you want, featuring a range of comma strokes, pressure strokes, fan strokes, teardrop strokes, scroll strokes and much more.\n From the very basics of supplies and techniques to more in-depth guidance for creating unique compositions, this guide offers everything you need to build confidence, have fun and paint successfully - whether you're a beginner or a more experienced decorative painter. This comprehensive guide includes:\n Quick-reference photos for finding the right stroke, fast\n Step-by-step stroke instructions that actually build a little painting with every lesson\n Easy-to-follow worksheets for combining strokes to make complete flowers, birds, butterflies, lace, ribbons and more\n 20 fresh and pretty borders painted with round and flat brushes\n Two sections highlighting common mistakes and how to fix them\n Plus, this guide offers a bonus section that shows you how to create six gorgeous compositions that feature today's most popular colors and stroke styles. It's all here! The Brushstroke Handbook gives you everything you need to master every stroke and explore a range of decorative painting possibilities. It's the one reference you'll want to have handy for virtually every project.\n\n\n\n","torrent":{"xt":"urn:btih:fc12469c0a13a0c718917d87c6f169723df9cfae","amp;dn":"Brushstroke+Handbook%3A+The+Ultimate+Guide+to+Decorative+Painting+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc12469c0a13a0c718917d87c6f169723df9cfae","infoHashBuffer":{"type":"Buffer","data":[252,18,70,156,10,19,160,199,24,145,125,135,198,241,105,114,61,249,207,174]},"announce":[],"urlList":[]}}