{"title":"Billie Joe Armstrong + Norah Jones - Foreverly (2013) 24bit/96kh","uid":9614013,"size":957167036,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fc69328b1a031b01aae596eeb1e122dbf4f3a516&amp;dn=Billie+Joe+Armstrong+%2B+Norah+Jones+-+Foreverly+%282013%29+24bit%2F96kh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"sidmal","files":-1,"time":1392385763,"description":"\nBillie Joe Armstrong and Norah Jones - Foreverly (2013)\n FLAC (tracks) 24 bit/96 kHz | Time - 45:41 minutes | 959 MB\n\n Foreverly is an unforgettable collection inspired by Songs Our Daddy Taught Us, an album of traditional Americana songs reinterpreted, recorded and released by The Everly Brothers in 1958. The album captures the beauty of the Everly's stunning close harmonies to create a moving and powerful testament to these traditional ballads. The collaboration between Green Day front man and Grammy Award winning artist Billie Joe Armstrong and Grammy Award winning singer and songwriter Norah Jones began ten years ago when they both performed with Stevie Wonder and his band at the Grammys.\n\n\n Entering a long line of artists who've drawn inspiration from the Everly Brothers, Billie Joe Armstrong and Norah Jones serve up a unique tribute with Foreverly. Unlike many others -- including Will Oldham and Dawn McCarthy, who released a trippy Everlys covers album earlier in 2013 -- the duo doesn't dig deep into the brothers' catalog but rather concentrates on a single LP, the 1958 Cadence classic Songs Our Daddy Taught Us. Just a year into their career, the Everlys took the unusual step of abandoning rock &amp; roll for traditional folk and country tunes they learned from their guitarist father Ike. Songs Our Daddy Taught Us was one of rock's first roots albums -- the Everlys returned to the concept and use &quot;Roots&quot; as a title a decade later -- and it's a bit of an anomaly in their catalog, a spare, sweet showcase for their close harmonies where the brothers are backed by nothing more than their own guitars. Foreverly, an album that contains all 12 of the songs from Songs Our Daddy Taught Us but not precisely in the same sequence, may recall Jones' country cabaret act the Little Willies yet it's something of a departure for Green Day lead singer Armstrong, who has often shown a love for rock &amp; roll's past (most notably on the '60s garage rock raver Foxboro Hot Tubs) but has never quite spent much time in the '50s, not even with the Stray Cat strut of &quot;Hitchin' a Ride.&quot; Even though the songs here date from much earlier, Foreverly is grounded in that decade, with Armstrong and Jones not only patterning their two-part harmonies after the Everly Brothers but fleshing out the arrangements by incorporating other sounds from the '50s: &quot;Long Time Gone&quot; and &quot;Silver Haired Daddy of Mine&quot; swing to subdued Johnny Cash rhythms, &quot;Oh So Many Years&quot; gets a slight Sun rockabilly makeover, &quot;Kentucky&quot; recalls the swaying slow dance specialties of Patsy Cline. Such variations from the text emphasize that Armstrong and Jones aren't re-creating Songs Our Daddy Taught Us; they're singing its songs, paying respect without being overly faithful. Their approach is not dissimilar to that of Don and Phil in 1958; the brothers didn't scrupulously re-create the sound of the past, they sang the songs in a way that was true to them, which is precisely what Billie Joe and Norah do here. They're a good match. Jones' suppleness sands down Armstrong's ragged voice, he gives her grit while she lends him grace, and these qualities are evident throughout this lovely little gem of an album.  \n\n\nTracklist:\n\n 01 - Roving Gambler\n 02 - Long Time Gone\n 03 - Lightning Express\n 04 - Silver Haired Daddy Of Mine\n 05 - Down In The Willow Garden\n 06 - Who's Gonna Shoe Your Pretty Little Feet?\n 07 - Oh So Many Years\n 08 - Barbara Allen\n 09 - Rockin' Alone (In An Old Rockin' Chair)\n 10 - I'm Here To Get My Baby Out Of Jail\n 11 - Kentucky\n 12 - Put My Little Shoes Away\n\n Engineer: Chris Dugan.\n Mastering: Greg Calbi.\n\nMusicians:\n Billie Joe Armstrong - Vocals, Electric &amp; Acoustic Guitar, Pump organ\n Norah Jones - Vocals, Electric &amp; Acoustic guitar, Pump organ, Piano\n Dan Rieser - Drums &amp; Percussion\n Tim Luntz - Bass\n Charlie Burnham - Violin, Mandolin, Harmonica\n Jonny Lam - Pedal steel guitar\n","torrent":{"xt":"urn:btih:fc69328b1a031b01aae596eeb1e122dbf4f3a516","amp;dn":"Billie+Joe+Armstrong+%2B+Norah+Jones+-+Foreverly+%282013%29+24bit%2F96kh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc69328b1a031b01aae596eeb1e122dbf4f3a516","infoHashBuffer":{"type":"Buffer","data":[252,105,50,139,26,3,27,1,170,229,150,238,177,225,34,219,244,243,165,22]},"announce":[],"urlList":[]}}