{"title":"Seventeen Contradictions and the End of Capitalism (2014) pdf","uid":10483737,"size":8204112,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd1de4b0821ec8f82402e8ceeb3035c4d8de7631&amp;dn=Seventeen+Contradictions+and+the+End+of+Capitalism+%282014%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"bookzilla","files":1,"time":1404432255,"description":"&quot;What I am seeking here is a better understanding of the contradictions of capital, not of capitalism. I want to know how the economic engine of capitalism works the way it does, and why it might stutter and stall and sometimes appear to be on the verge of collapse. I also want to show why this economic engine should be replaced, and with what.&quot; --from the Introduction\n\n To modern Western society, capitalism is the air we breathe, and most people rarely think to question it, for good or for ill. But knowing what makes capitalism work--and what makes it fail--is crucial to understanding its long-term health, and the vast implications for the global economy that go along with it.\n\n In Seventeen Contradictions and the End of Capitalism, the eminent scholar David Harvey, author of A Brief History of Neoliberalism, examines the internal contradictions within the flow of capital that have precipitated recent crises. He contends that while the contradictions have made capitalism flexible and resilient, they also contain the seeds of systemic catastrophe. Many of the contradictions are manageable, but some are fatal: the stress on endless compound growth, the necessity to exploit nature to its limits, and tendency toward universal alienation. Capitalism has always managed to extend the outer limits through &quot;spatial fixes,&quot; expanding the geography of the system to cover nations and people formerly outside of its range. Whether it can continue to expand is an open question, but Harvey thinks it unlikely in the medium term future: the limits cannot extend much further, and the recent financial crisis is a harbinger of this. \n\n David Harvey has long been recognized as one of the world's most acute critical analysts of the global capitalist system and the injustices that flow from it. In this book, he returns to the foundations of all of his work, dissecting and interrogating the fundamental illogic of our economic system, as well as giving us a look at how human societies are likely to evolve in a post-capitalist world. ","torrent":{"xt":"urn:btih:fd1de4b0821ec8f82402e8ceeb3035c4d8de7631","amp;dn":"Seventeen+Contradictions+and+the+End+of+Capitalism+%282014%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd1de4b0821ec8f82402e8ceeb3035c4d8de7631","infoHashBuffer":{"type":"Buffer","data":[253,29,228,176,130,30,200,248,36,2,232,206,235,48,53,196,216,222,118,49]},"announce":[],"urlList":[]}}