{"title":"Beta Monkey Drum Loops Pack","uid":7453139,"size":5282592757,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fd8c5f7a7188b0ba0dad959866a2fa61b88254be&amp;dn=Beta+Monkey+Drum+Loops+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"willymmx","files":1,"time":1342582380,"description":"Beta Monkey Drum Loops\n\nFormat: WAV (Acidized)\n\nGenres: Rock, Hard Rock, Funk, Blues, Pop, Punk, Heavy Metal.\n\nDrum Werks drum loop libraries represent the essence of Beta Monkey's special approach to this material- no frills, just great content, all at very affordable prices. These four volumes, the latest in the series, are referred to as the L.A. Rock Essentials Sessions, and represent a variety of loops and grooves all recorded in a single session with a single kit, so you can mix and match grooves and samples without having to worry about mismatched sounds due to miking shifts or other variables.\n\nEach library is sold as 16-bit WAV, 24-bit WAV, or 16-bit AIFF; the WAV files are Acidized with tempo information for quick import to Sony ACID and other DAWs that read such metadata, and the AIFF loops are in Apple Loop format for easy integration with GarageBand and Logic. Loops are generally four to eight bars long; I like having these longer chunks to work with, as they make for more interesting and less &quot;loopy&quot; tracks. Intros, fills, grooves and variations, are all neatly and consistently labeled. When you buy any of the first three volumes, you're given access to a download of 354 individual single-hit samples of the kit used to create them.\n\nEnjoy!","torrent":{"xt":"urn:btih:fd8c5f7a7188b0ba0dad959866a2fa61b88254be","amp;dn":"Beta+Monkey+Drum+Loops+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd8c5f7a7188b0ba0dad959866a2fa61b88254be","infoHashBuffer":{"type":"Buffer","data":[253,140,95,122,113,136,176,186,13,173,149,152,102,162,250,97,184,130,84,190]},"announce":[],"urlList":[]}}