{"title":"Stephen Baxter - Proxima","uid":11467228,"size":257611293,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fdf0a5e0c6fb1f5d3d4bee1dce980d737c4469e7&amp;dn=Stephen+Baxter+-+Proxima&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"Cybotage","files":2,"time":1416045792,"description":"Written by Stephen Baxter\nFormat: MP3\nBitrate: 32 Kbps\nUnabridged\n\nThe very far future: The Galaxy is a drifting wreck of black holes, neutron stars, chill white dwarfs. The age of star formation is long past. Yet there is life here, feeding off the energies of the stellar remnants, and there is mind, a tremendous Galaxy-spanning intelligence each of whose thoughts lasts a hundred thousand years. And this mind cradles memories of a long-gone age when a more compact universe was full of light...The 27th century: Proxima Centauri, an undistinguished red dwarf star, is the nearest star to our sun - and (in this fiction), the nearest to host a world, Proxima IV, habitable by humans. But Proxima IV is unlike Earth in many ways. Huddling close to the warmth, orbiting in weeks, it keeps one face to its parent star at all times. The 'substellar point', with the star forever overhead, is a blasted desert, and the 'antistellar point' on the far side is under an ice cap in perpetual darkness. How would it be to live on such a world? Needle ships fall from Proxima IV's sky. Yuri Jones, with 1000 others, is about to find out...PROXIMA tells the amazing tale of how we colonise a harsh new eden, and the secret we find there that will change our role in the Universe for ever","torrent":{"xt":"urn:btih:fdf0a5e0c6fb1f5d3d4bee1dce980d737c4469e7","amp;dn":"Stephen+Baxter+-+Proxima","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdf0a5e0c6fb1f5d3d4bee1dce980d737c4469e7","infoHashBuffer":{"type":"Buffer","data":[253,240,165,224,198,251,31,93,61,75,238,29,206,152,13,115,124,68,105,231]},"announce":[],"urlList":[]}}