{"title":"mIRC v7.46","uid":15464503,"size":2871228,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fe1e60cb796da7ea94f4ff5d0a13d196e9b98b74&amp;dn=mIRC+v7.46&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"LxByte","files":1,"time":1470083211,"description":"mIRC v7.46\r\n\r\n01/08/2016 - mIRC v7.46\r\n\r\nChanges:\r\n1.Updated to OpenSSL 1.0.2h library.\r\n2.Fixed /timer -h high resolution timer which was being limited to the\r\n  same rate as the -m millisecond timer.\r\n3.Added $samepath(path1,path2) identifier that returns $true/$false\r\n  if paths refer to the same file/dir. It resolves relative paths and\r\n  converts long/short filenames.\r\n4.Added /copy -f switch to flush copy to disk immediately.\r\n5.Added /rename -f switch to flush rename to disk immediately and -o\r\n  switch to allow overwrite of an existing file.\r\n6.Extended $calc() and other identifiers to return up to 12 decimal\r\n  digits in floating point calculations.\r\n7.Added $tempfn identifier that returns temporary filename located in\r\n  mIRC folder using same method that mIRC uses internally.\r\n8.Fixed Clear History bug that incorrectly cleared channels list\r\n  settings while status window was connected to a server.\r\n9.Extended /mkdir to create the full path to the target folder.\r\n10.Changed the way files are replaced during updates to decrease the\r\n  potential for file loss eg. lost mirc.ini files in situations such\r\n  as crashes, BSODs, and power failures.\r\n11.Changed URL catcher to extract URLs using the same method used by\r\n   hotlink feature.\r\n12.Extended URL hotlink/extract feature to handle IPv6 addresses.\r\n13.Fixed $base() bug with floating point precision.\r\n14.Fixed /hadd not reporting error if UTF-8 conversion results in a\r\n   string that is too long.\r\n15.Fixed script error not showing line number for single-line event\r\n   definitions.\r\n16.Added /list -n switch to minimize channels list window.\r\n17.Added resize grip to bottom right of resizable dialogs: channel\r\n   central, channel folder, play central, and scripts editor.\r\n18.Fixed regex bug when K is used in some regex patterns, such as\r\n   $regsubex(abcd, /.K/g, &lt;&gt;).\r\n19.Fixed /drawline -p bug when measuring clipping width for text that\r\n   contains tab characters.\r\n20.Updated to PCRE 8.39 library.\r\n21.Added display of CAP state on connecting to a server and when CAP\r\n   commands are issued later.\r\n22.Fixed first server &quot;command not supported&quot; error message not being\r\n   displayed.\r\n\r\n\r\nmIRC is a full featured Internet Relay Chat client for Windows that can be used to communicate, share, play or work with others on IRC networks around the world, either in multi-user group conferences or in one-to-one private discussions.\r\n\r\nIt has a clean, practical interface that is highly configurable and supports features such as buddy lists, file transfers, multi-server connections, IPv6, SSL encryption, proxy support, UTF-8 display, UPnP, customizable sounds, spoken messages, tray notifications, message logging, and more.\r\n\r\nmIRC also has a powerful scripting language that can be used both to automate mIRC and to create applications that perform a wide range of functions from network communications to playing games.\r\n\r\nmIRC has been in development for over two decades and is constantly being improved and updated with new technologies. The most recent changes can be found on the latest news page\r\n\r\nOfficial Website: http://www.mirc.com/","torrent":{"xt":"urn:btih:fe1e60cb796da7ea94f4ff5d0a13d196e9b98b74","amp;dn":"mIRC+v7.46","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe1e60cb796da7ea94f4ff5d0a13d196e9b98b74","infoHashBuffer":{"type":"Buffer","data":[254,30,96,203,121,109,167,234,148,244,255,93,10,19,209,150,233,185,139,116]},"announce":[],"urlList":[]}}