{"title":"Oral Microbiology at a Glance [PDF] [StormRG]","uid":10939436,"size":2702364,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe6c763c20147f81849a47aa4c1e20f5505c4347&amp;dn=Oral+Microbiology+at+a+Glance+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"0xmovva","files":2,"time":1409485378,"description":"Author: Richard J. Lamont (Author), Howard F. Jenkinson (Author)\nPaperback: 96 pages\nPublisher: Wiley-Blackwell; 1 edition (March 23, 2010)\nLanguage: English\nISBN-10: 0813828929\nISBN-13: 978-0813828923\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nOral Microbiology At A Glance is a title in the highly popular at a Glance series. It provides a concise and accessible introduction and revision aid. Following the familiar, easy-to-use at a Glance format, each topic is presented as a double-page spread with key facts accompanied by clear diagrams encapsulating essential information.\nSystematically organized and succinctly delivered, Oral Microbiology At A Glance covers:\n\nOral microbial origins of health or disease\nVarious infections ranging from dental caries, periodontal and endodontic infections to oral mucosal, bone, and systemic infections\nLocal and systemic extensions of oral infections\nSterilization, disinfection, infection control methods, and bioterrorism\nOral Microbiology At A Glance is the ideal companion for students of microbiology, all students of dentistry, and early career clinicians. In addition the text will provide valuable insight for general dental practitioners wanting to update their knowledge of oral microbiology and immunology, as well as dental hygienists, therapists and technicians.","torrent":{"xt":"urn:btih:fe6c763c20147f81849a47aa4c1e20f5505c4347","amp;dn":"Oral+Microbiology+at+a+Glance+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe6c763c20147f81849a47aa4c1e20f5505c4347","infoHashBuffer":{"type":"Buffer","data":[254,108,118,60,32,20,127,129,132,154,71,170,76,30,32,245,80,92,67,71]},"announce":[],"urlList":[]}}