{"title":"Alex.Polizzi.Chefs.On.Trial.S01E01.480p.HDTV.x264-mSD.mkv","uid":11836099,"size":315162890,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ff3650a7bbf4a520517ebd4e74b0cd6f240d5282&amp;dn=Alex.Polizzi.Chefs.On.Trial.S01E01.480p.HDTV.x264-mSD.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"TlanImass","files":1,"time":1429741407,"description":"Alex Polizzi takes on the difficult challenge of finding head chefs for restaurants that have a desperate need to fill a vacancy.\n\n\n\n\nAlex Polizzi: Chefs on Trial - Series 1, Episode 1\n\n\n\nGilpin Heat 1\n\nAlex tackles the Gilpin, a fine-dining hotel in the Lake District. This much-loved family-run business is desperate to find a new executive head chef. After months of fruitless searching, the Cunliffe family have failed to find the right person who will care as much about their business as they do. They've now turned to Alex for help and are offering up to a six-figure salary for the right candidate.\n\nOver a week, Alex will offer up nine candidates to be put through a rigorous interview process. As well as testing their technical cooking skills, all candidates will have a face-to-face interview and a chance to cook a signature dish that shows off their best dish. But at the end of the week, only one can get the job.\n\nIn this episode, the first three candidates are put through a gruelling hands-on interview process. Their first hurdle is the highly skilled task of filleting a halibut. The pressure is then on for them to create a Michelin-standard signature dish, but before then it's time for a face-to-face interview with Alex and the Cunliffe family. Will family man Simon impress with his enthusiasm, or will globe-trotting Frenchman Nicolas impress with his international CV? At the end of the day, one chef will be selected to go through to a final interview at the end of the week.\n\n\n\n\nOriginal Air Date: 20-Apr-2015","torrent":{"xt":"urn:btih:ff3650a7bbf4a520517ebd4e74b0cd6f240d5282","amp;dn":"Alex.Polizzi.Chefs.On.Trial.S01E01.480p.HDTV.x264-mSD.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff3650a7bbf4a520517ebd4e74b0cd6f240d5282","infoHashBuffer":{"type":"Buffer","data":[255,54,80,167,187,244,165,32,81,126,189,78,116,176,205,111,36,13,82,130]},"announce":[],"urlList":[]}}