{"title":"Grand Theft Auto IV Complete [Multi6] Repack","uid":7795121,"size":13626810368,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ff4ecf8ba60cd40b8f86dd4863a95206c16532d2&amp;dn=Grand+Theft+Auto+IV+Complete+%5BMulti6%5D+Repack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":1,"uploader":"Taker009","files":3,"time":1352124900,"description":"Grand Theft Auto IV Complete [Multi6] Repack\n\nGeneral\n  \nYear: 2010 \nGenre: Action (Shooter) / Racing (Cars / Motorcycles) / 3D / 3rd Person \nDeveloper: Rockstar North \nPublisher: Rockstar Games \nPublisher in Russia: 1C-SoftKlab \nPlatform: PC \nLanguage: (English), (French), (Italian), (German), (Spanish), (Russian) \nSound language: English \nPublication Type: RepacK  \n\nSystem requirements\n\nSystem: Windows XP (SP3) / Vista / Windows 7 \nProcessor: Intel Core 2 Duo 1,8 GHz / AMD Athlon X2 64 2.4 GHz \nRAM: 2 GB (Windows XP) 2.5 GB (Windows Vista / 7) \nVideo Card: 512MB NVIDIA 8600 / 512MB ATI 3870 \nSound Card: Sound device compatible with DirectX 9.0 \nHard drive: 32 GB \n\nIn the Grand Theft Auto IV. The full edition &quot;includes action Grand Theft Auto IV, as well as the addition Grand Theft Auto: Episodes From Liberty City, consisting of episodes of The Lost and Damned and The Ballad of Gay Tony, the story lines that complement each other and reveal completely the opposite faces of the criminal world. In the Russian edition of these games are presented in the original sound system with Russian subtitles. \nNiko Bellic, Johnny Klebitts and Luis Lopez live in the worst city in America - Liberty City. It is a paradise for those in power with a stuffed wallet and a nightmare for those who are deprived of these benefits. Nico desperate to find his place in the &quot;city of infinite possibilities.&quot; Johnny biker gang from &quot;Lost&quot; is trying to survive the brutal feuds between street gangs. Louis, the right-hand man and bodyguard nightclub owner Tony Prince, nicknamed Blue, Tony, is torn between family and friends, trying not to lose the confidence of those, or others, which is extremely difficult in a world where everyone has a price. In general, these guys are trying to survive in a city of violence and corruption. \nSooner or later, their paths cross, and the consequences will be catastrophic. \n\n\nFeatures RePack\n\nJust as in life! Series has matured. More serious and thorough approach is visible throughout. For example, to steal a car, you must first break the glass and break the locks, firing even one police officer can lead to death. Used in the game, new graphics technologies provide even greater realism. \n\nWelcome to New York! Liberty City - a copy of the largest U.S. cities. Only some names and places have been changed to comply with political correctness. \n\nA city without limits. Liberty City is truly enormous. To get from one of its suburbs to the other, need a hour of real time. Players can not only admire the dozens of skyscrapers, but also to go inside many buildings, use public transport - such freedom of movement in the GTA was not yet! \n\nPlexus fate. Stories Niko Bellic from the original game, as well as Johnny Klebittsa and Luis Lopez, will appear in new episodes, unique and at the same time connected with each other. Just before the end of his way each character, you can get a complete picture of criminal intrigues, enveloped in Liberty City. \n\nMaximum potential. In Â«Grand Theft Auto IV: Complete Edition&quot; is a full arsenal of weapons, as well as the entire fleet of the fourth part of the famous series, which includes motorcycles, luxury cars, helicopter gunships and even armored vehicles. \n\nWho is stronger, he is right. The Lost and Damned and The Ballad of Gay Tony added in GTA IV new types of multiplayer games. \n\n\nDo not cut \nTV is compressed by 50% / 20fps \nVersion GTA4: 1060 (EFIGS) / 1051 (RU) / 1004 \nVersion EFLC: 1110 (EFIGS) / 1101 (RU) \nInstallation time GTA4: 1:00 \nInstallation time EFLC: 1.5 hour (if GTA4 - 1 hour)\nRepacked By: z10yded\n\n","torrent":{"xt":"urn:btih:ff4ecf8ba60cd40b8f86dd4863a95206c16532d2","amp;dn":"Grand+Theft+Auto+IV+Complete+%5BMulti6%5D+Repack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff4ecf8ba60cd40b8f86dd4863a95206c16532d2","infoHashBuffer":{"type":"Buffer","data":[255,78,207,139,166,12,212,11,143,134,221,72,99,169,82,6,193,101,50,210]},"announce":[],"urlList":[]}}