{"title":"The Philosophy of Sherlock Holmes","uid":8294778,"size":399349,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff9927dbe45af9de2460dfb40f096914dbfa92de&amp;dn=The+Philosophy+of+Sherlock+Holmes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1364084495,"description":"David Baggett, Philip Tallon, &quot;The Philosophy of Sherlock Holmes (The Philosophy of Popular Culture)&quot;\nISBN: 0813136717 | 2012 | EPUB/MOBI | 214 pages | 390 KB/572 KB\n\nArguably the most famous and recognized detective in history, Sherlock Holmes is considered by many to be the first pop icon of the modern age. Sir Arthur Conan Doyle's fictional detective has stood as a unique figure for more than a century with his reliance on logical rigor, his analytic precision, and his disregard of social mores. A true classic, the Sherlock Holmes character continues to entertain twenty-first-century audiences on the page, stage, and screen.\n\nIn The Philosophy of Sherlock Holmes, a team of leading scholars use the beloved character as a window into the quandaries of existence, from questions of reality to the search for knowledge. The essays explore the sleuth's role in revealing some of the world's most fundamental philosophical issues, discussing subjects such as the nature of deception, the lessons enemies can teach us, Holmes's own potential for criminality, and the detective's unique but effective style of inductive reasoning. Emphasizing the philosophical debates raised by generations of devoted fans, this intriguing volume will be of interest to philosophers and Holmes enthusiasts alike.","torrent":{"xt":"urn:btih:ff9927dbe45af9de2460dfb40f096914dbfa92de","amp;dn":"The+Philosophy+of+Sherlock+Holmes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff9927dbe45af9de2460dfb40f096914dbfa92de","infoHashBuffer":{"type":"Buffer","data":[255,153,39,219,228,90,249,222,36,96,223,180,15,9,105,20,219,250,146,222]},"announce":[],"urlList":[]}}