{"title":"Complete Marvel Amazing Spider-Man Comics DVD part 1","uid":4237568,"size":2140484579,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ffc12f4a2ed8ebad6dbe3f986dc36a5a4e7e6171&amp;dn=Complete+Marvel+Amazing+Spider-Man+Comics+DVD+part+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"citaltras","files":142,"time":1213373054,"description":"\n\nTHE COMPLETE MARVEL AMAZING\nSPIDER-MAN\nCOMICS DVD\n\n\n\n\n\nPart 1:\n\nAmazing Fantasy 15\nAmazing Spider-Man 1-100\nAmazing Spider-Man Annuals\n\n\n\n\n\n\nHere is the Complete Amazing Spider-Man DVD nicely converted to the\npopular .cbz format. Now you can read these high quality commercial\nscans with your favorite comic book viewer software.\n\nThese are all complete scans, cover-to-cover, including letters pages,\nbullpen bulletins, and all advertisements. All files have been expertly\nconverted from .pdf to .cbz format with single-page images! No more\ndouble-page images to navigate! And all are crisp, sharp scans! If\nyou have used the commercial DVD, you are sure to appreciate this\nimproved, user-friendly collection.\n\n\n\nNew with this collection\n\n\nFor the first time, this collection includes a Covers Preview file which\nshowcases the classic covers of the first 100 issues both before and\nafter our meticulous restorations. An updated readme file discusses\nthe covers preview file and explains the cover enhancements. Users\ncan choose to retain either the original or enhanced covers, or both.\n\n__________________________________________________________________\nThis torrent contains: Amazing Fantasy 15, Amazing Spider-Man 1-100\nand all 34 Amazing Spider-Man Annuals.\n\nPlease download parts 1, 2, 3, 4, and 5 to get the entire Spider-Man\nCollection which consists of more than 560 issues!\n__________________________________________________________________\n\n\n\nHow are these .cbz files better than .pdf?\n\nUnlike the commercial Marvel comic book collections, these files\nemploy no use-restriction schemes. There are no passwords,\nno encryption, no water-marked images. You are free to view,\ncopy, extract, print, and manipulate the images. Also, all images\nhave been split into single pages for easier reading. A convenient\ngraphical &quot;covers index&quot; is included to help you find the issues you\nwant and an informative character bios file is also included. All\nare .cbz files.\n\nThese files will work well on any major computing platform, e.g.\nWindows, Linux/Unix, Mac OS-X, and many others. You can copy\nthe comics files to your hard drive, laptop, or optical disk. Because\nthese comics are in the popular .cbz format, they can now be read\nwith your favorite comics viewing software. Unlike the .pdf file\nformat, the .cbz file format is supported by a wide choice of snappy\nviewers offering a multitude of reading enhancement features. See\nthe readme file, included in the collection, to learn where to down-\nload free .cbz/.cbr comic viewer software.\n\n\n\n\n\n--------------------------------------------------------------------------------------\nIf you like this converted comics DVD, be sure to download other titles in our series:\n\nThe Complete Marvel Captain America Comics DVD (in 4 parts w/ approx. 500 issues)\nThe Complete Marvel Incredible Hulk Comics DVD (in 4 parts)\nThe Complete Marvel Avengers Comics DVD (in 5 parts)\nThe Complete Marvel X-Men Comics DVD (in 4 parts)\nThe Complete Marvel Ultimate X-Men CD\nThe Complete Marvel Fantastic Four Comics DVD (in 5 parts)\nThe Complete Marvel Iron Man Comics DVD (in 4 parts)\nThe Complete Marvel Amazing Spider-Man Comics DVD (in 5 parts)\nThe Complete Marvel Ghost Rider Comics DVD ( coming in June 2008 )\nThe Complete Marvel Silver Surfer Comics on DVD ( coming in June 2008 )\n\n---------------------------------------------------------------------------------------\n\n\n","torrent":{"xt":"urn:btih:ffc12f4a2ed8ebad6dbe3f986dc36a5a4e7e6171","amp;dn":"Complete+Marvel+Amazing+Spider-Man+Comics+DVD+part+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffc12f4a2ed8ebad6dbe3f986dc36a5a4e7e6171","infoHashBuffer":{"type":"Buffer","data":[255,193,47,74,46,216,235,173,109,190,63,152,109,195,106,90,78,126,97,113]},"announce":[],"urlList":[]}}