{"title":"TI and Tiny The Family Hustle S03E13-18","uid":9866743,"size":1231630107,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ffc79afc33ed96025ffbec1a264b60d210eb5c06&amp;dn=TI+and+Tiny+The+Family+Hustle+S03E13-18&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":6,"leechers":0,"uploader":"RKSTR","files":7,"time":1396361759,"description":"These seem to be the episodes that weren't uploaded last year. I cannot find episode 11 ANYWHERE! If I do I will upload it.\n The season was divided up into 2 parts - Vol 1 and Vol 2. hence the dual episode numbers.\n\nEpisode 12/Ep 5\n White for a Day\n Released Sep 02, 2013\n Fed up with Shekinah always saying she wants to be white, Tameka suggests they spend the day doing things white people do. But will Shekinah see that the grass isn't always greener?\n\nEpisode 13/Ep 6\n Who's the Better Driver?\n Released Sep 09, 2013\n After attending their first NASCAR event, Tip and Tameka argue over who's the better driver. With each of their personal cars on the line, the whole family joins in on the competition\n\nEpisode 14/Ep 7\n Ringmasters\n Released Sep 16, 2013\n King, Major, and Precious are hired for their first paid gig at the circus. Under pressure, will the kids step up to the challenge and put on a great performance?\n\nEpisode 15/Ep8\n The Workout Video\n Released Sep 23, 2013\n Tameka and Shekinah decide to make a unique workout video for people who don't like to work out. But with both women having different ideas, can they get it together in time? Meanwhile, Tip takes the boys to LA for some business and pleasure.\n\nEpisode 16/Ep 9\n Education First\n Released Sep 30, 2013\n When Domani and King come home with less than stellar report cards, Tip takes matters into his own hands and hires them a tutor. Meanwhile, Tameka prepares her new girl group French Kiss for their first paid gig.\n\nEpisode 17/Ep 10\n Back On Tour\n Released Oct 07, 2013\n As Tip heads out for the first leg of his two-month long nationwide tour with Lil' Wayne, the kids aren't ready for him to go and convince him to let them come.\n\nEpisode 18/Ep 11\n Family Fun Time\n Released Oct 14, 2013\n In the third season finale, Tip decides to take the family to Puerto Rico for a much needed getaway. Meanwhile, Tameka meets up with Niq Niq and the OMG Girlz as they embark on their newest tour.","torrent":{"xt":"urn:btih:ffc79afc33ed96025ffbec1a264b60d210eb5c06","amp;dn":"TI+and+Tiny+The+Family+Hustle+S03E13-18","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffc79afc33ed96025ffbec1a264b60d210eb5c06","infoHashBuffer":{"type":"Buffer","data":[255,199,154,252,51,237,150,2,95,251,236,26,38,75,96,210,16,235,92,6]},"announce":[],"urlList":[]}}